[
  {
    "id": "UghTnJPn-A3OqngCoAEC",
    "author": "@josephjenkinsjr.2507",
    "author_channel_id": "UCxXO4IokuAjKRht3pUFoxfQ",
    "text": "It is said that the book about Dragonglass that Sam has contains the cure for Sir Jorah's condition, it seems that he may have to consume some Dragonglass to get cured.",
    "like_count": 0,
    "published_at": "2017-07-19T11:28:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugi75iapKCfxIXgCoAEC",
    "author": "@Whoo_Whoop",
    "author_channel_id": "UCvuKlf4MCT1WvzaAYJzQQ6Q",
    "text": "I hadn't really thought about the red woman traveling to cure Jorah. It would be interesting if he was required to kill or make a sacrifice to cure himself. He seems hellbent on doing anything for Daenerys.",
    "like_count": 0,
    "published_at": "2017-07-19T13:17:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgiHfpKX2Go3sngCoAEC",
    "author": "@lyssakate",
    "author_channel_id": "UC1n7DPnwRZUfFZ9Gpe7TjGQ",
    "text": "Arya is a fucking BEAST! I was SO stoked to see her slaughter the Freys. Now she just needs to find Nymeria! She's still out there somewhere I know.\n\nHave you read the books?",
    "like_count": 1,
    "published_at": "2017-07-19T05:47:12Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgiHfpKX2Go3sngCoAEC.8VBOSXAe2nB8VBOseA1lNK",
        "author": "@ActualJusticeWarrior",
        "text": "+Lyssa Tomlin I'm not 100 percent sure but after I recorded & edited this I checked the promo & the wolf I thought was Jon's was probably hers. So next episode she might. & I don't think it recognizes her/might be initially angry. \n\nI haven't read the books.",
        "like_count": 0,
        "published_at": "2017-07-19T05:50:54Z",
        "is_reply": true
      },
      {
        "id": "UgiHfpKX2Go3sngCoAEC.8VBOSXAe2nB8VE-VGKAxBO",
        "author": "@lyssakate",
        "text": "Actual Justice Warrior Shit, I hope she gets her wolf back eventually though even if it doesn't like her at first. I'll have to rewatch the trailer for that clip.\n\nI've read the books and in it there's this artifact that is like a horn or something that when blown would break the magic of the wall and shatter it, so I am wondering if that's gonna come up soon as far as the Night King goes.\n\nWeirdly enough there's another horn type artifact that Euron finds that supposedly can control dragons when used, so I think that's what Euron's present to Cersei is going to be.\n\nSorry for the novel, I'm just so fucking into this show and excited to tell someone about my theories that hasn't read the books!! Thanks for replying :)",
        "like_count": 0,
        "published_at": "2017-07-20T06:06:50Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgitUmz6gaIHungCoAEC",
    "author": "@thaddeuswalker2728",
    "author_channel_id": "UCw9-ACJ6WrmHA-F09ONZkSA",
    "text": "Actual Justice Warrior what do you think of the accusation of institutional racism by the documentary What the Health? Is this a proper use of the term?",
    "like_count": 0,
    "published_at": "2017-07-22T01:58:00Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgitUmz6gaIHungCoAEC.8VIhbOIpyg78VIt5CFxJT1",
        "author": "@ActualJusticeWarrior",
        "text": "Haven't seen it",
        "like_count": 0,
        "published_at": "2017-07-22T03:38:19Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UghIcJvGlDCA0ngCoAEC",
    "author": "@Whoo_Whoop",
    "author_channel_id": "UCvuKlf4MCT1WvzaAYJzQQ6Q",
    "text": "Democrats - \"If me make everyone poor enough to not be able to afford gas, then we stop all car fatalities..!\"",
    "like_count": 0,
    "published_at": "2017-07-19T13:10:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyeFsUVR2XWNn91ObB4AaABAg",
    "author": "@HarryBalzak",
    "author_channel_id": "UCkKRW5Jvbctle00GFXcUakw",
    "text": "You don't see a problem with Arya impersonating Lord Frey for 2 weeks? How is that even possible? She is about a foot shorter than him, sounds nothing like him(maybe faceless assassins can voice morph or something, idk), and knows nothing about running his castle. How the hell could she pull that off? That is worse than when she somehow took control of his kitchen for a whole day to butcher is sons and bake them into a pie. And isn't anyone wondering where the Frey sons are? \n\nI wish they would make more references to time. I have no idea how much time has gone by from one scene to the next, let alone episodes. People seem to teleport around the continent.",
    "like_count": 0,
    "published_at": "2017-08-02T11:03:05Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgyeFsUVR2XWNn91ObB4AaABAg.8Vl-jJdv7ws8Vl2pGbf0p3",
        "author": "@ActualJusticeWarrior",
        "text": "Pretty sure it wasn't two weeks. She (while impersonating him) said something about how rare it was for them to have two feasts so close together. We talk about time in the video of the third review which will be out today. On my media channel Youtube.com/DudeMonkeyHQ",
        "like_count": 0,
        "published_at": "2017-08-02T11:30:06Z",
        "is_reply": true
      },
      {
        "id": "UgyeFsUVR2XWNn91ObB4AaABAg.8Vl-jJdv7ws8Vl3jPmOHwq",
        "author": "@HarryBalzak",
        "text": "The words she spoke were \"two feasts in a fortnight\". I'm sure you know what a fortnight is.",
        "like_count": 0,
        "published_at": "2017-08-02T11:38:02Z",
        "is_reply": true
      },
      {
        "id": "UgyeFsUVR2XWNn91ObB4AaABAg.8Vl-jJdv7ws8Vl4jfQu-2W",
        "author": "@ActualJusticeWarrior",
        "text": "Harry Balzak I didn't remember the exact quote, regardless Arya didn't kill him during the first feast, it was clearly after when he was being served food alone. So not necessarily 2 weeks apart, also not sure what her impersonating him for a long period of time would include. He's a recluse. Finally you're nitpicking the least significant time thing in the show. Veras time skipped from Dorne, to the boat right behind Daenerys in S6 ep 10 then was introduced to her this season at Dragonstone",
        "like_count": 0,
        "published_at": "2017-08-02T11:46:49Z",
        "is_reply": true
      },
      {
        "id": "UgyeFsUVR2XWNn91ObB4AaABAg.8Vl-jJdv7ws8Vl8B8JlHBr",
        "author": "@HarryBalzak",
        "text": "Its not really a nitpick, it makes no sense. If she had less than 2 weeks then you start making other problems even worse and also not nitpicks. \nHow did all the Freys get home, get a raven or message telling them about the new feast, and then travel back in less than 2 weeks? They live all over the place. Westeros takes a hell of a lot longer to traverse than 2 weeks, let alone a round trip. \nI also didn't see any young or old Freys at that feast. Are all of them 25-40 year old men? *None* of the Freys were sick, or didn't get the invitation, or didn't want to go, or were busy? There are *a lot* of Freys. It is a 600 year old house that is not shy of breeding, that hall wasn't even big enough for all of them. \nClearly she did not and could not kill every Frey they way it was presented in the show. It makes no sense on multiple levels.",
        "like_count": 0,
        "published_at": "2017-08-02T12:16:55Z",
        "is_reply": true
      }
    ]
  }
]