[
  {
    "id": "UgzDSHSUmnV4_xgESzB4AaABAg",
    "author": "@MidwesternMarx",
    "author_channel_id": "UC4j1g1gUv6jgJH49nJwEGIw",
    "text": "Enlai gets moved up to his rightful place in A in part 2.\n\nWhich is better than part 1 cuz it features the Latin American and Asian leaders who I actually know a lot about! \n\nDon’t miss it!",
    "like_count": 2,
    "published_at": "2025-07-02T17:53:53Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzDSHSUmnV4_xgESzB4AaABAg.AK4priQ23nJAOhRR--RXka",
        "author": "@EaNasir1700bc",
        "text": "I like your comedic style. This must be a comedy channel because no way you can take anything you say as serious facts.",
        "like_count": 1,
        "published_at": "2025-10-25T13:06:50Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxgYhufbfJpQuPIgF54AaABAg",
    "author": "@McHobotheBobo",
    "author_channel_id": "UCxNwX0j8uanwDb2eh5ve_Sg",
    "text": "34:20 Jong-Un may end up in S-tier, we are still quite early in his career in all likelyhood",
    "like_count": 13,
    "published_at": "2025-07-01T23:58:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyy3NdE6DSihhWDwvF4AaABAg",
    "author": "@MidwesternMarx",
    "author_channel_id": "UC4j1g1gUv6jgJH49nJwEGIw",
    "text": "Pretty sure Kautsky’s theory was actually called ultra imperialism. Super imperialism is Michael Hudson’s theory which is good and correct.",
    "like_count": 12,
    "published_at": "2025-07-02T00:58:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyomUtcLiFVOReXrf94AaABAg",
    "author": "@PlanetZeroK",
    "author_channel_id": "UC7P8G0jeGlKNV66ur5p-YwA",
    "text": "Vaush on the thumbnail 😂😂😂 too good man,  too good.",
    "like_count": 6,
    "published_at": "2025-07-02T01:54:33Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw4vJgR85-12H0yiUt4AaABAg",
    "author": "@Huy-G-Le",
    "author_channel_id": "UCZs2x6MavzfjdbKEAykF0rQ",
    "text": "Pol pot shouldn't even be on that list, since the khmer rouge represented reactionary conservaties rural petty landlords and small portions of the peasantry that owns lands, whom despites the urban petty landlords and the elite, whom since industrialization came to cambodia, the rural landlord can't compete with the rates of productions with modern methods, which the monarchy lands, and urbsnize merchant and petty landlord have access to. \nWhich is why, beside wiping out most none khmer cambodian nationals, they also target the urban bourgeoisie,  and academic interlectual.",
    "like_count": 22,
    "published_at": "2025-07-02T02:41:51Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "Ugw4vJgR85-12H0yiUt4AaABAg.AK3CUmO5YfeALjDc3pLM65",
        "author": "@xxplayer2kxx",
        "text": "Abolishing money and private property is reactionary and represents landlords and land holding peasants somehow, despite the fact that they literally collectivised agriculture and nationalised all industry...\n\nBTW, the colonial 'development' of urban centres was parasitic on the peasantry, being a cause of underdevelopment of dependency on imperialist foreign powers. The mobilisation of the people to the country side was a necessary measure for post-war construction.\n\nAnd Vietnam is a real socialist country because it restored the rule of money and private property in the country, abolished the dictatorship of the proletariat, and carried out acts of expansionism in Indochina region in collusion with forces of social-imperialism: Mai Phuc brigades of nationalists and fascists, gangs and warlords, and even CIA.\n\nHistory will vindicate the Khmer Krahom.",
        "like_count": 0,
        "published_at": "2025-08-12T16:10:27Z",
        "is_reply": true
      },
      {
        "id": "Ugw4vJgR85-12H0yiUt4AaABAg.AK3CUmO5YfeALjIEBGhwm4",
        "author": "@Huy-G-Le",
        "text": "​@ is this what khmer rouge supporter believe in? Hah, now that is interest, this is literally rural conservativeness, but at least it's a legit ideological path.",
        "like_count": 1,
        "published_at": "2025-08-12T16:50:45Z",
        "is_reply": true
      },
      {
        "id": "Ugw4vJgR85-12H0yiUt4AaABAg.AK3CUmO5YfeALjKAilOuOw",
        "author": "@Huy-G-Le",
        "text": "@ I wonder if this is out of a misunderstanding of what private property mean, because the farms lands that were removed from the urban and rural feudal lords, and given ownerships to the people who already works on them. \n\n*Those are not private property, those are personal property.*\n\nWhy? It's call personal property because the worker/farmer/peasant working on that lands use that lands to produces their owns products. \n\nWhile private property is similar but instead of the person/family/clan/whatever organization owns that lands, doesn't works on that lands to produces product, but use the labor of other people to produces products, and then give them back only a portions of what they produces, while the people doesn't produces, but the owns the lands, get the majority of the products other people produces, and essential have the right to decides how much to give to the worker because the worker don't owns the lands, but the people who owns the lands, landlord do.\n\nYour understanding of the dictatorship of the proletariat is also off by a ridiculous margin. What that just mean, is the worker government is in charges AND the powers of the working people are supreme, above the interest of business and landlord and clergy. \n\nThe Soviet simply change the dictatorship of the proletariat into dictatorship of the party, which naturally would transfer the ownerships of the mean of production from worker collective to the state.\n\nBut comparing other version elsewhere, Bulgaria for example. Rural population allow to owns reasonable portions of lands, and produce products on that lands which they works and produces and decided what to do with the product, although since market mechanism were limited, it's essentially just mean storing and the farming eating it or giving it to other.\n\nAlso during Lenin time, nationalized industries, meaning the infrastructure, fuels and manufacturing (Agricultural were mostly collective worker coop) because the Soviet need those thing up and running fast and without nationalization, there were no other ways to get it's going fast enough, although the ideal scenario would had nationalized industries then socialized them. \n\nFor example, Rojava PYD oils industry are cooperative owns. \n\nI simply found your reasoning... ridiculous, but can be consider as socialistic measure, but instead of its being the result of analysis using the marxian method or keynesian method, its use came out from anger and hatred from rural population who isolated themselves from the broader working people struggle.",
        "like_count": 0,
        "published_at": "2025-08-12T17:07:45Z",
        "is_reply": true
      },
      {
        "id": "Ugw4vJgR85-12H0yiUt4AaABAg.AK3CUmO5YfeALouccGi1F-",
        "author": "@xxplayer2kxx",
        "text": "@Huy-G-Le Firstly, they had to develop socialist agriculture and create grain surpluses before they could industrialise, Industrialisation being the material base for social revolution, but the economy was made to be poor and dependent from French colonialism and U.S. bombings. They had to lay a solid foundation if their were to be any Kampuchean revolution. \n\nSecondly, personal property is not a definite category but an abstraction which has nothing to do with political economy, given the fact that every property has personal utility regardless of its class character belonging to a definite stage in the development of the productive forces. The property relations you are referring to are feudal and semi-feudal relations which must be abolished with the modernisation and collectivisation of agriculture for socialist construction. Your support of small agriculture and forms of peasant democracy are nothing but concessions to petty bourgeois democracy.\n\nIn Kampuchea there was insecurity of food after the war and vast masses of the population had to be mobilised into great agricultural armies so that there would not be famine, and so that Khmer could trade for modern equipment and heavy machinery as the basis for industrialisation. Socialist industrialisation cannot occur in a country unless it has replaced backwards agriculture with large scale agriculture. it is necessarily the priority of construction, to consolidate the proletariat, so that there may be socialist revolution.\n\nYour understanding is muddled, firstly, by not understanding the relation of proletarian dictatorship to the peasantry, and secondly, the nature of proletarian dictatorship itself. Proletarian dictatorship is the rule of the proletarian class over the bourgeoisie, unrestricted by law.\nIn a country where the proletariat constitute a minority it is vital to meet the needs of the peasantry with that of the proletariat ad to utilise the revolutionary potential of the peasantry.\nThis is not the dictatorship of all working people, but the dictatorship of the proletariat in particular, which, though not necessarily antagonistic to the interests of working people, is the historical mission of that class which is socialist by nature, that is not true of just any class.\n\nThe party had the support of the proletariat, but was couped by technical intelligentsia, manifested in Khrushchev's 20th congress.\nWorker collective is not whole people's ownership, it is therefore only one form of socialist property, not the complete form.\nSocialism is a mode of production, not a technical apparatus of politically organising workspaces, that is called utopian democratic socialism, advanced by Owen and the English communists of the 19th century.\nScientific communism says: industry does not need to be compartmentalised or democratised, both serving the continued existence of the state (see Engels on social-democracy, Lenin on syndicalism), but must be centralised into a single economic entity according to a central plan, i.e.. society taking possession over all branches: agriculture plus agriculture plus electricity, etc.\n\nI don't care if you find Marxism ridiculous, enjoy being fundamentally wrong I guess.",
        "like_count": 0,
        "published_at": "2025-08-14T21:11:12Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx29ddzJQ7YVTuSYjd4AaABAg",
    "author": "@morningstararun6278",
    "author_channel_id": "UCWfyN4p7053pFmOIKWe9aYA",
    "text": "Eddie, I will say this honestly. You cheated. You had Pol Pot picture in the thumbnail, but you didn't rank him. Haz ranked Pol Pot above Ho Chi Minh in his rankings. I thought it was either ignorant or stupid. I was expecting that you were aware of Haz' ranking of Pol Pot, and could explain why Haz did that, or explain yourself for ranking Pol Pot. But you did neither. I am disappointed.",
    "like_count": 7,
    "published_at": "2025-07-03T12:09:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzms9BC0EaE5_FlcuF4AaABAg",
    "author": "@JCloyd-ys1fm",
    "author_channel_id": "UChqOQ9ryHFMTXYeF29H1GWQ",
    "text": "So much to learn.",
    "like_count": 0,
    "published_at": "2025-07-02T23:45:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxhcKHFGcXbHADSIT94AaABAg",
    "author": "@Lawns-Are-Fun",
    "author_channel_id": "UCWFYilkyp6oAVWpU1c7GtcA",
    "text": "Eddie, lol it’s pronounced “Ho” and then “Jah” but the J is soft kinda like in Xi. Ho-Jah. Good stuff though, thank you for the history lessons.",
    "like_count": 9,
    "published_at": "2025-07-02T01:22:44Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgxhcKHFGcXbHADSIT94AaABAg.AK33RMzWTxvAK3EzcVoPly",
        "author": "@john11235",
        "text": "The fact he doesn’t know that is sus",
        "like_count": 2,
        "published_at": "2025-07-02T03:03:40Z",
        "is_reply": true
      },
      {
        "id": "UgxhcKHFGcXbHADSIT94AaABAg.AK33RMzWTxvAK4e6jgDqGb",
        "author": "@TZMPaquette",
        "text": "I was going to say, I thought it was pronounced that way... then I was questioning my own pronunciation, lol",
        "like_count": 0,
        "published_at": "2025-07-02T16:11:13Z",
        "is_reply": true
      },
      {
        "id": "UgxhcKHFGcXbHADSIT94AaABAg.AK33RMzWTxvAK4t8ZUKK2h",
        "author": "@Lawns-Are-Fun",
        "text": "⁠@john11235No it’s not don’t be silly. I only know this because I know many people from the Balkin countries.",
        "like_count": 1,
        "published_at": "2025-07-02T18:22:32Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugzl-wBhvPazXVtYoxd4AaABAg",
    "author": "@Childdestroyer3.-_",
    "author_channel_id": "UCwJkTsoclHW9YqcEplm7uPA",
    "text": "Well I've read quite a bit about the Brezhnev era of the soviet union, if i remember correctly he did kinda re-stalinise but it was a very half-assed restalinisation, also he was really corrupt like genuinely almost kleptomania, as he also generally ignored the corruption that was taking root in the CPSU back then, i would put him at D due to him really not being as bad as Khrushchev but he's not that good.. the real USSR ended with Stalin",
    "like_count": 2,
    "published_at": "2025-07-02T15:27:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwRmelWt-HKII3fvQt4AaABAg",
    "author": "@McHobotheBobo",
    "author_channel_id": "UCxNwX0j8uanwDb2eh5ve_Sg",
    "text": "43:20 Blockade, embargo, and ultimately invasion by the US Marines under Raegan",
    "like_count": 0,
    "published_at": "2025-07-02T00:07:34Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwd5Of84SG1owDrP0J4AaABAg",
    "author": "@julianettinger-finley938",
    "author_channel_id": "UCrlTSiipH-h_jyS4_M2VPJA",
    "text": "Pol pot seemed to be an anticommunist that’s why Ho Chi Minh had to shut him down",
    "like_count": 2,
    "published_at": "2025-07-02T02:14:15Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugwd5Of84SG1owDrP0J4AaABAg.AK39KdulqlgAPdGo0xJR9w",
        "author": "@SebastianForal",
        "text": "It wasn't ho chi minh, ho chi minh died 6 years before pol pot came to power.",
        "like_count": 0,
        "published_at": "2025-11-17T18:48:26Z",
        "is_reply": true
      },
      {
        "id": "Ugwd5Of84SG1owDrP0J4AaABAg.AK39KdulqlgAQjFUpYOkJW",
        "author": "@Notled-no4ki",
        "text": "Tiktok communist final boss",
        "like_count": 0,
        "published_at": "2025-12-14T23:03:46Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx1CSe_XPrIAGcrQJR4AaABAg",
    "author": "@videowatcher3165",
    "author_channel_id": "UCDstiq8QFT8cEsJEeZvHeew",
    "text": "i really like how you aren’t afraid to say when you don’t know much about something. i wish more people did that, loved the video too overall",
    "like_count": 0,
    "published_at": "2025-11-12T20:29:01Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugx1CSe_XPrIAGcrQJR4AaABAg.APR_LJ3N-2sARcCYF94UVC",
        "author": "@rebeccariley2803",
        "text": "True. Being a contrarian c**t is all the rage these days.\nWhen most young people these days have never actually read history long than a 4 word meme.. even Stalin and Lenin are based (:\nAnd I thought Fuentes was a whack job.\nThe left has their own",
        "like_count": 0,
        "published_at": "2026-01-06T01:54:44Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzNfwidec7jbeUv5hN4AaABAg",
    "author": "@alertaaction",
    "author_channel_id": "UCWnPieOmM3RxcV3dU3YT_YA",
    "text": "Rosa’s argument with Lenin was actually pretty revealing of her belonging to the “western marxism” pyte shi that verges on not acknowledging the revolutionary potential of the peasants in the context of the national question. She wouldve said that natunality is a myth and therefore national-liberation struggles have no place in the marxist theory, something marx himself refuted in his writings on ireland and Lenin debunked in theory & practice.\nRecommend lenin 1913",
    "like_count": 4,
    "published_at": "2025-07-02T00:00:05Z",
    "is_reply": false,
    "reply_count": 5,
    "replies": [
      {
        "id": "UgzNfwidec7jbeUv5hN4AaABAg.AK2uz-isJJ_AK2wIpgc_ne",
        "author": "@Armonter",
        "text": "Sure, for that time it was true, but in our era there can be no wars of national liberation, exactly from the time when capitalism ceased to be national",
        "like_count": 1,
        "published_at": "2025-07-02T00:11:40Z",
        "is_reply": true
      },
      {
        "id": "UgzNfwidec7jbeUv5hN4AaABAg.AK2uz-isJJ_AK30xWMjMqR",
        "author": "@MidwesternMarx",
        "text": "Rosa found very weird things to nitpick Lenin and Marx for. It’s almost like she saw the Marxist tradition as a boys club & wanted to take the alpha males down a notch by finding a serious mistake in their work. But it led her to some really wacky conclusions.",
        "like_count": 4,
        "published_at": "2025-07-02T01:01:03Z",
        "is_reply": true
      },
      {
        "id": "UgzNfwidec7jbeUv5hN4AaABAg.AK2uz-isJJ_AK31TJ76hzJ",
        "author": "@Armonter",
        "text": "​​@MidwesternMarx\nRosa fell ill with the childhood disease of leftism",
        "like_count": 0,
        "published_at": "2025-07-02T01:05:32Z",
        "is_reply": true
      },
      {
        "id": "UgzNfwidec7jbeUv5hN4AaABAg.AK2uz-isJJ_AK3qMV8cc51",
        "author": "@alertaaction",
        "text": "Her Revolution or Reform was an eye opener for me. Her analysis is razor sharp",
        "like_count": 1,
        "published_at": "2025-07-02T08:38:59Z",
        "is_reply": true
      },
      {
        "id": "UgzNfwidec7jbeUv5hN4AaABAg.AK2uz-isJJ_AKB6Bx61jUO",
        "author": "@waitingformyman9317",
        "text": "​@MidwesternMarxI dunno if that's why",
        "like_count": 0,
        "published_at": "2025-07-05T04:20:46Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx9_QsuIfTHwp1sKgh4AaABAg",
    "author": "@towarzyszmruczk",
    "author_channel_id": "UCK3_rD8sJF6OcKytF5NaXRQ",
    "text": "Rosa Luxemburg was of Polish origin, grew up in a Polish-Jewish family and was involved in Polish revolutionary movement before leaving for Germany. Together with Liebknecht she formed the Communist Party of Germany (KPD) after SPD supported the war. In fact the reason she was murdered was because she was THIS terrifying to the German bourgeoisie. As Lenin put it: she was an \"eagle\" of working class with intellectual prowess and true revolutionary spirit. Easy A tier",
    "like_count": 8,
    "published_at": "2025-07-03T04:50:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgysE6y9q18Galm4p814AaABAg",
    "author": "@CayanDugencili",
    "author_channel_id": "UCWgJU2Wu_r7yL5g-46Mq_sg",
    "text": "I heard somewhere that the shining path was funded by the USA to make socialism seem bad. I think gonzalo should be in f tier",
    "like_count": 0,
    "published_at": "2025-07-11T17:05:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz_WaKk7htfeW7Hznd4AaABAg",
    "author": "@nono-cr7ej",
    "author_channel_id": "UCYDgA0NZ3X4DLSZBAuemj4Q",
    "text": "“Brezhnev, I think Brezhnev was better… I don’t know about this era of the Soviet Union” 😂omg you are an embarrassing buffoon!",
    "like_count": 2,
    "published_at": "2025-07-06T05:39:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgznuDsX68wd26NOus94AaABAg",
    "author": "@4850937",
    "author_channel_id": "UCy5eDqBqQ-xXA4zw1bJ3sjQ",
    "text": "Comrade Tr_mp is top tier. He saved workers from some DEI. But he also harmed workers financially. He gave us free speech and censorship. Make America commun1st again.",
    "like_count": 2,
    "published_at": "2025-07-02T02:22:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyy4Xy0EOYvuT9qwS54AaABAg",
    "author": "@nikolabolesnik",
    "author_channel_id": "UCThVobypXhKzyuAENXn8XnA",
    "text": "Hoxha is read as hodja the x is more like a J sound",
    "like_count": 1,
    "published_at": "2025-07-07T11:01:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyfur6PhyVrEaA3lYd4AaABAg",
    "author": "@stopmotiontm5243",
    "author_channel_id": "UC8dcMFWdNHT96pIGz89_JAA",
    "text": "Unemployed final boss",
    "like_count": 31,
    "published_at": "2025-07-02T08:18:26Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugyfur6PhyVrEaA3lYd4AaABAg.AK3o01GZi82AK4gKyuRl91",
        "author": "@tannerpost9154",
        "text": "nice projection",
        "like_count": 10,
        "published_at": "2025-07-02T16:30:38Z",
        "is_reply": true
      },
      {
        "id": "Ugyfur6PhyVrEaA3lYd4AaABAg.AK3o01GZi82AK8ajzY8iwA",
        "author": "@AvinHelseth",
        "text": "Sybau",
        "like_count": 6,
        "published_at": "2025-07-04T04:58:43Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyL0kT70PkIcP4MO9F4AaABAg",
    "author": "@Gorillamaxx-p1q",
    "author_channel_id": "UCSg6YK_9Vwh9sdAWYYbRl2w",
    "text": "Based",
    "like_count": 1,
    "published_at": "2025-07-01T22:33:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx2MzXFfHwkUPM_E0N4AaABAg",
    "author": "@timclark6439",
    "author_channel_id": "UCS_HxWTKYj0rp6nQZ2qKgag",
    "text": "Second!",
    "like_count": 2,
    "published_at": "2025-07-01T22:16:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwqa5sDURJOsTYj3p54AaABAg",
    "author": "@yosef_01",
    "author_channel_id": "UCEVglsz_upne4awjOy4FXnQ",
    "text": "Pol Pot is good 😁",
    "like_count": 2,
    "published_at": "2025-08-05T17:22:58Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugwqa5sDURJOsTYj3p54AaABAg.ALSKM3mi5ssAM_06wGi4CL",
        "author": "@CayanDugencili",
        "text": "No",
        "like_count": 1,
        "published_at": "2025-09-02T13:31:28Z",
        "is_reply": true
      },
      {
        "id": "Ugwqa5sDURJOsTYj3p54AaABAg.ALSKM3mi5ssAPdGsog0qrq",
        "author": "@SebastianForal",
        "text": "🤦‍♂️",
        "like_count": 0,
        "published_at": "2025-11-17T18:49:05Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxZbnOhk9RefIEcJe94AaABAg",
    "author": "@ulyanov17",
    "author_channel_id": "UCNAzsNIVrkHYn-Wan6-NRqA",
    "text": "Rosa was polish!",
    "like_count": 0,
    "published_at": "2025-07-02T14:23:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxkZtcDogoXXoApL6B4AaABAg",
    "author": "@AvinHelseth",
    "author_channel_id": "UCdwiEEUPMxPV--1wj3i0CVQ",
    "text": "First comment!",
    "like_count": 2,
    "published_at": "2025-07-01T22:12:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyhMYRW1Jh5ckywkCl4AaABAg",
    "author": "@memethingz6004",
    "author_channel_id": "UCdltvuzKv1ssg4yN4X_ePNQ",
    "text": "Put trigger warning before you show vaush's face",
    "like_count": 0,
    "published_at": "2025-07-02T02:03:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw06QctI_YTpjXFS-t4AaABAg",
    "author": "@Frida_22-l",
    "author_channel_id": "UCGpBpykPkxOxyRfdXUPDU8A",
    "text": "What you think about Ne win and his regime and ideology Burmas way to socialism?",
    "like_count": 0,
    "published_at": "2025-07-02T00:30:48Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "Ugw06QctI_YTpjXFS-t4AaABAg.AK2yUukVNM4AK316bH79CN",
        "author": "@MidwesternMarx",
        "text": "I’ve only read about it on Wikipedia I would need to do more research.",
        "like_count": 0,
        "published_at": "2025-07-02T01:02:26Z",
        "is_reply": true
      },
      {
        "id": "Ugw06QctI_YTpjXFS-t4AaABAg.AK2yUukVNM4AK377d3Q100",
        "author": "@Frida_22-l",
        "text": "In addition to Western, Russian and Chinese communists, you should also be interested in African and Latin American communists and socialists and socialists in general, whether they are social democrats or non-Marxists or agrarians. Socialist societies are interesting, for example Laos, DDR, China's Mao era peoples communes and other collective social experiments such as kibbutzim or the only successful free market society, the Faroe Islands. Communism is a utopia, a bit like nirvana or heaven that you can never get to.  I myself live in Finland and in my country communists and socialists are people who not only hate themselves but also humanity and live in a green-left and liberal bubble and they have gays in mind and they have abandoned workers as a reactionary relic and believe that if Finland stops its own industry and moves factories to China so that we don't feel guilty about producing emissions, stopping breathing as a way to combat climate change, giving foreign aid by borrowing and raising taxes, dismantles the welfare state and gives away decision-making power and sovereignty, then we will become the favorites of the EU Commission and others will start to do the same. In Finland some people jokingly say that Finland should exchange social democrats with Sweden because Finnish social democrats are just as destructive as right-wingers because Finland has not had economic growth for 17 years and the state will go bankrupt at some point.  The left took my country into NATO and now the left complains that defense spending is too high. Before NATO membership, there was no talk of the possibility of war. Now, as a NATO member, we hear about the possibility of conflict with Russia.",
        "like_count": 0,
        "published_at": "2025-07-02T01:55:00Z",
        "is_reply": true
      },
      {
        "id": "Ugw06QctI_YTpjXFS-t4AaABAg.AK2yUukVNM4ALyWAuFCm0j",
        "author": "@Tuomasboss",
        "text": "​@jan5456 I am Finnish myself too, and I find it ironic that the “left” in Finland, who often present themselves as the most anti-American, are, in fact, the most Americanized people in the country.\n\nTake, for example, the Sami rights movement that has gained traction among Finnish leftists over the past few decades. Its rhetoric and framing are almost a direct copy of the American Landback movement. The Finnish left is eager to moralize about how the Sami were historically oppressed and dispossessed by other Nordic peoples, portraying it as an eternal crime that must forever be at the center of political debate. Of course, injustices against the Sami did occur, I am not denying that. But the way the Finnish left emphasizes this history is a mirror image of how the American left moralizes about the colonization of the Americas.\n\nThe same pattern appears in the culture wars, for example LGBT activism. They are not rooted in Finnish reality, but are instead imported wholesale from the American left and grafted onto Finnish politics. Most of the Finnish left’s defining causes are not truly Finnish at all, they are borrowed from abroad, especially America.\n\nThis is one of the main reasons why the Finnish left has become so alienated from the working class. By replacing genuine class-based politics with imported American cultural battles, the leftists have left ordinary workers behind and pushed many of them toward right-wing populist parties.\n\nTheir supposed anti-Americanism is only superficial. It is not rooted in independence from American influence, but rather in the same grievances voiced by American leftists themselves. That is why, for example, many Finnish leftists express hostility toward the U.S. now in response to Donald Trump’s election. Their opposition to America mirrors American leftist politics. It is derivative, not authentic.\n\nThe truly anti-American stance would be to reject these imported cultural issues altogether and insist on a distinctly Finnish political identity. That would mean rejecting NATO alignment, rejecting American media narratives, rejecting copycat Landback-movements and others, and focusing instead on Finnish realities. The contemporary left will label this position “far-right,” but in truth it is exactly what a genuine left movement must do if it hopes to reconnect with the working class.",
        "like_count": 0,
        "published_at": "2025-08-18T14:41:14Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwKnxxvxubYCKi40qB4AaABAg",
    "author": "@Koko0",
    "author_channel_id": "UCeJifQnVziPREYC-i4mJQgg",
    "text": "Get ad blocker",
    "like_count": 0,
    "published_at": "2025-07-05T04:55:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwqG2hlxaJOUImWe3h4AaABAg",
    "author": "@BelfastIsRed",
    "author_channel_id": "UCGGmxULCzRnnLETQ1VsYb6w",
    "text": "Saying JFK is the best president since Lincoln is real as hepl",
    "like_count": 0,
    "published_at": "2025-07-02T10:03:00Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgwqG2hlxaJOUImWe3h4AaABAg.AK3zyqE7N9LAKB6Kml7NrR",
        "author": "@waitingformyman9317",
        "text": "It's so wrong",
        "like_count": 1,
        "published_at": "2025-07-05T04:21:59Z",
        "is_reply": true
      },
      {
        "id": "UgwqG2hlxaJOUImWe3h4AaABAg.AK3zyqE7N9LAKBB9E8zHyF",
        "author": "@DUFFAL02",
        "text": "Hell nah lmao.\n\nFDR. LBJ. Truman. TR. all better than JFK. Arguably even Nixon and Ike.\n\nKennedy was one of the biggest reasons for the Vietnam War.",
        "like_count": 0,
        "published_at": "2025-07-05T05:04:05Z",
        "is_reply": true
      },
      {
        "id": "UgwqG2hlxaJOUImWe3h4AaABAg.AK3zyqE7N9LAOnIWJHePsl",
        "author": "@CartersRemasters",
        "text": "@DUFFAL02 Kennedy was attempting to pull troops out of Vietnam, LBJ, your hero, actively sent tons and tons of troops into Vietnam, Truman, your other democratic hero, did the same but for Korea.",
        "like_count": 0,
        "published_at": "2025-10-27T19:44:22Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzKRfXTFGAE6y_5g2B4AaABAg",
    "author": "@getcomann",
    "author_channel_id": "UCWdtLdp6mpGcGZ-mErF9dEQ",
    "text": "You should put George Dimitrov on S tier. He was the leader of Bulgarian communists and the leader of the Third International. He created theory of the United Peoples fronts that later was adobted by all communist movments againts imperialism like Ho Chi Ming. He defeated the nazzi in Liebzig court process and become a legend for all communists around the world. He also created the theory for peoples democratic republics that later will become essential for all Eastern European countries and those like Vietnam and DPRK.",
    "like_count": 1,
    "published_at": "2025-07-11T15:39:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgywD5-3tZ6lO-eM1AB4AaABAg",
    "author": "@slovakianleftnat3",
    "author_channel_id": "UC29So0C9dXejvV6xW2_jyFQ",
    "text": "Hoxha was ultranationalist, he wanted to create greater albania and discriminated against non albanians",
    "like_count": 3,
    "published_at": "2025-07-02T09:43:38Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgywD5-3tZ6lO-eM1AB4AaABAg.AK3xl0mwvRVAK7hAEX0luz",
        "author": "@slovakianleftnat3",
        "text": "​@RomanII499 nothing wrong with it, but they arent like national expansionist, yk what I mean, they dont want to expand their national values to other country, they want to expand revolution",
        "like_count": 0,
        "published_at": "2025-07-03T20:35:37Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzWVg9uUDRSj11W4lV4AaABAg",
    "author": "@CayanDugencili",
    "author_channel_id": "UCWgJU2Wu_r7yL5g-46Mq_sg",
    "text": "13:25 as if George Washington and the founding fathers who did settler colonialism, genocide and owned slaves is comparable to Stalin who liberated the Russian people and defeated hitler. American patriotic socialism or MAGA communism or whatever this shit is based is so stupid",
    "like_count": 0,
    "published_at": "2025-09-02T13:31:07Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzWVg9uUDRSj11W4lV4AaABAg.AM_04LPHHNvAOnIH_7amLp",
        "author": "@CartersRemasters",
        "text": "read Georgi Dimitrov, explains all of this easily. One should not give up their history to fascistic forces, instead reclaim it.",
        "like_count": 0,
        "published_at": "2025-10-27T19:42:21Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw4yMA7rkEG7nFSAX14AaABAg",
    "author": "@dashi3l",
    "author_channel_id": "UCbjPma6AK6Po57R5U2k-uDw",
    "text": "putting stalin and mao in s-tier while calling trotsky a fascist is all you need to know about how unserious this video is and the amount of research you have done. you’re not doing marxism—you’re doing cosplay authoritarianism.\n\ntrotsky co-led the russian revolution, founded the red army, and was murdered by stalin's regime for opposing the bureaucratic degeneration of the ussr. calling him a fascist is purely a stalinist line—the same one that justified gulags, purges, and mass repression.\n\nand no, industrialising through mass famine, utilising forced labor, and siding with the ruling class doesn’t make stalin or mao “chads.” It makes them cautionary tales in the history of socialism.",
    "like_count": 2,
    "published_at": "2025-07-02T12:22:05Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "Ugw4yMA7rkEG7nFSAX14AaABAg.AK4EtX8fiL7AK4R2dHqCKI",
        "author": "@ulyanov17",
        "text": "trotsky was a menshevik who fckd over the ussr multiple times - starting with brest-litovsk negotiations.\nthinking you can avhieve commuism without authority od the dictatorship od the proletariat is all you need to know about how unserious this comment is",
        "like_count": 1,
        "published_at": "2025-07-02T14:08:19Z",
        "is_reply": true
      },
      {
        "id": "Ugw4yMA7rkEG7nFSAX14AaABAg.AK4EtX8fiL7AK5_VwGe7m-",
        "author": "@dashi3l",
        "text": "@ulyanov17 i get where you're coming from with the need for centralised authority, but trotsky’s issue with stalin wasn’t about rejecting authority or the dictatorship of the proletariat—it was about the form of authority that led to bureaucratic decay. trotsky wasn't trying to sabotage the ussr—he was trying to preserve the revolution's potential. his critique of things like brest-litovsk wasn’t about rejecting authority, it was about ensuring the long-term survival of the revolution. the gulags, purges, and repression under stalin went against everything trotsky and lenin envisioned for socialism. stalin created a state that was authoritarian and disconnected from the internationalist and democratic goals of october.",
        "like_count": 0,
        "published_at": "2025-07-03T00:50:12Z",
        "is_reply": true
      },
      {
        "id": "Ugw4yMA7rkEG7nFSAX14AaABAg.AK4EtX8fiL7APdHIXEEJhg",
        "author": "@SebastianForal",
        "text": "This video isn't meant to be serious, but trotsky was an absolute disaster, lenin himself said so. I've already told hundreds of people about why stalin and mao were better than trotsky in a million different ways but honestly I don't have the strength to continue.",
        "like_count": 0,
        "published_at": "2025-11-17T18:52:44Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwgWoPBoRiLq411B0N4AaABAg",
    "author": "@lamngocanhanh",
    "author_channel_id": "UCE8rayNtHbZZ7TDxuw0nNHA",
    "text": "Zhou enlai had betrayed Vietnamese revolution and invade a brotherly socialist nation",
    "like_count": 0,
    "published_at": "2025-07-02T08:54:41Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwgWoPBoRiLq411B0N4AaABAg.AK3s9WHiLlFAPdH1UmKn2p",
        "author": "@SebastianForal",
        "text": "Zhou enlai died in 1974, he helped vietnam",
        "like_count": 0,
        "published_at": "2025-11-17T18:50:25Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxcssfsyMS9BuiYqM14AaABAg",
    "author": "@benmorton8945",
    "author_channel_id": "UCtXkJ8QfGAV0MQQLeh78akA",
    "text": "Do you not think the prolongation of whatever backwards system of socialism prevails in north korea acts detrimental to the international movement?",
    "like_count": 0,
    "published_at": "2025-07-07T22:11:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz5fuZU5F0gsqxIA1p4AaABAg",
    "author": "@McHobotheBobo",
    "author_channel_id": "UCxNwX0j8uanwDb2eh5ve_Sg",
    "text": "I'm no Gonzaloist but the slander is real af, lots of crimes attributed to Shining Path were in fact state-perpetuated crimes. I mean, the bourgeois media is perfectly capable of inventing stories and slandering communists no matter what we do. I will say, the whole nearly overthrowing the US Peruvian puppet state from a single laptop is incredibly impressive. If they'd had some more support or time and clearer information, maybe things woulda been different. I've definitely softened on them over time, they accomplished a lot in a very late year compared to most revolutions of the last century",
    "like_count": 7,
    "published_at": "2025-07-01T22:59:38Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "Ugz5fuZU5F0gsqxIA1p4AaABAg.AK2o3D29uf6AK2qeTdhEcI",
        "author": "@MidwesternMarx",
        "text": "Well said. We have too little information about Peru at the time to make a comprehensive analysis. The low level of productive development made it so less stuff was recorded. Same with Cambodia under Pol Pot",
        "like_count": 5,
        "published_at": "2025-07-01T23:22:20Z",
        "is_reply": true
      },
      {
        "id": "Ugz5fuZU5F0gsqxIA1p4AaABAg.AK2o3D29uf6AK2ub71Yxmb",
        "author": "@Armonter",
        "text": "The overthrow of a regime without a political party of the proletariat means nothing at all, and whoever carries out the overthrow can only lead to chaos and reaction, even under a red flag. This was Che Guevara's last mistake in his life, and the Cuban Party should have stopped him",
        "like_count": 0,
        "published_at": "2025-07-01T23:56:49Z",
        "is_reply": true
      },
      {
        "id": "Ugz5fuZU5F0gsqxIA1p4AaABAg.AK2o3D29uf6AK2wDzJsvS1",
        "author": "@McHobotheBobo",
        "text": "​@MidwesternMarx Yeah from what I understand of Cambodia at the time, it is definitely fair to lay the Lion's share of deaths at the feet of American bombings, but it does seem like Pol Pot may have been a US asset, odd things like his govy being reocgnized by the USA for like two decades after its ouster. \"They'll send one of us just to say it was one of us\"",
        "like_count": 1,
        "published_at": "2025-07-02T00:11:00Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugyd2xPVR_tEj4I2Kil4AaABAg",
    "author": "@slovakianleftnat3",
    "author_channel_id": "UC29So0C9dXejvV6xW2_jyFQ",
    "text": "Hoxha A😭",
    "like_count": 0,
    "published_at": "2025-07-02T09:43:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyuhpGhaYM2emAHd154AaABAg",
    "author": "@ottokaare5925",
    "author_channel_id": "UCMTSL3m6RItKjXeKvMZVwgw",
    "text": "I didn't watch rhe full video but why are you just glossing over the genocides by Stalin",
    "like_count": 0,
    "published_at": "2025-07-10T23:10:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxltX1nDG1UVOH2ZhZ4AaABAg",
    "author": "@Hegemonicmarxism",
    "author_channel_id": "UClge3jun1mwiBvvnKPQAkUA",
    "text": "You are so delusional it's amazing.",
    "like_count": 4,
    "published_at": "2025-07-02T06:16:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxMBGmf34c1JMvRXGh4AaABAg",
    "author": "@radicalmarxist9909",
    "author_channel_id": "UCpMHwGtEmI418FfeBx97Ccg",
    "text": "I’m trying to quit swearing. Do you think you can stop swearing otherwise I can’t watch this channel anymore",
    "like_count": 0,
    "published_at": "2025-07-01T22:33:03Z",
    "is_reply": false,
    "reply_count": 7,
    "replies": [
      {
        "id": "UgxMBGmf34c1JMvRXGh4AaABAg.AK2l0Z9sNjJAK2qFTanEvp",
        "author": "@MidwesternMarx",
        "text": "Nah sorry, I believe it’s the content of words that matter not their form.",
        "like_count": 9,
        "published_at": "2025-07-01T23:18:47Z",
        "is_reply": true
      },
      {
        "id": "UgxMBGmf34c1JMvRXGh4AaABAg.AK2l0Z9sNjJAK2rt3HYyk_",
        "author": "@mechatnkiespacecambodia",
        "text": "@MidwesternMarx gigachad response",
        "like_count": 3,
        "published_at": "2025-07-01T23:33:03Z",
        "is_reply": true
      },
      {
        "id": "UgxMBGmf34c1JMvRXGh4AaABAg.AK2l0Z9sNjJAK2vTP8exlH",
        "author": "@Armonter",
        "text": "​@MidwesternMarx\nWhen you have to work with a children's audience, in order to convey your thoughts to them, you will have to control your speech",
        "like_count": 0,
        "published_at": "2025-07-02T00:04:22Z",
        "is_reply": true
      },
      {
        "id": "UgxMBGmf34c1JMvRXGh4AaABAg.AK2l0Z9sNjJAK47W_R6Vvs",
        "author": "@theredpolaris",
        "text": "@ArmonterIf there are kids in here, they should leave with all due respect lol",
        "like_count": 0,
        "published_at": "2025-07-02T11:17:38Z",
        "is_reply": true
      },
      {
        "id": "UgxMBGmf34c1JMvRXGh4AaABAg.AK2l0Z9sNjJAK4FaubkVeV",
        "author": "@Armonter",
        "text": "​@theredpolaris\nchildren don't owe you anything, it is we who must do the agitation and propaganda of our ideas at this stage",
        "like_count": 0,
        "published_at": "2025-07-02T12:28:16Z",
        "is_reply": true
      },
      {
        "id": "UgxMBGmf34c1JMvRXGh4AaABAg.AK2l0Z9sNjJAK4fumkdWf_",
        "author": "@radicalmarxist9909",
        "text": "@Armonter People who swear are usually like 13 year olds. Mature people do not and it actually takes mental strength and self control not to which is why weak man children swear so much 😊",
        "like_count": 0,
        "published_at": "2025-07-02T16:26:55Z",
        "is_reply": true
      },
      {
        "id": "UgxMBGmf34c1JMvRXGh4AaABAg.AK2l0Z9sNjJAK4h4bgcRxT",
        "author": "@Armonter",
        "text": "​@radicalmarxist9909\nThe function of swearing in language is to give a special emphasis, shorten sentences and convey emotions, if it is appropriate then you can use swear words, however in front of a children's audience I would not want to do this for the purposes of education and my own example of purity of speech",
        "like_count": 0,
        "published_at": "2025-07-02T16:37:08Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwbSZNOpypCZTw0U7J4AaABAg",
    "author": "@Ratimir101",
    "author_channel_id": "UCycuVrz1m4sDF1SBgnqi5Fw",
    "text": "I dont like Lenin from my perspective he was all talk and then failed in everything when he was in power even tried to return capitalism economics through small doors, then Stalin had to fix everything afterwards. Plus to me it seams like Lenin actually hated poor people in practice and preferred \"classy\" intellectuals",
    "like_count": 0,
    "published_at": "2025-07-01T22:52:39Z",
    "is_reply": false,
    "reply_count": 9,
    "replies": [
      {
        "id": "UgwbSZNOpypCZTw0U7J4AaABAg.AK2nG1trCzwAK2xK9kWj1n",
        "author": "@Armonter",
        "text": "Lenin, on the other hand, did not suffer any failures. Luck was not a part of Lenin's life. He had a practical mindset and the ability to predict events. He did not rely on luck.\nRead Lenin's first decrees, specifically the decrees on land and freedom\n\nAll you have to hate is your ignorance and eagerness to speak out about it",
        "like_count": 0,
        "published_at": "2025-07-02T00:20:35Z",
        "is_reply": true
      },
      {
        "id": "UgwbSZNOpypCZTw0U7J4AaABAg.AK2nG1trCzwAK2yx632H5D",
        "author": "@Ratimir101",
        "text": "@ArmonterI’m more separating what he said and what he actually did,\nand what he did to me seams as failure",
        "like_count": 0,
        "published_at": "2025-07-02T00:34:47Z",
        "is_reply": true
      },
      {
        "id": "UgwbSZNOpypCZTw0U7J4AaABAg.AK2nG1trCzwAK2z_wpFP02",
        "author": "@Armonter",
        "text": "​@Ratimir101\nYou're being too vague, can you be more specific about what you're talking about? What \"failures\" do you attribute to Lenin, and what do you think he should have done?",
        "like_count": 0,
        "published_at": "2025-07-02T00:40:21Z",
        "is_reply": true
      },
      {
        "id": "UgwbSZNOpypCZTw0U7J4AaABAg.AK2nG1trCzwAK3-0cJkX4L",
        "author": "@Armonter",
        "text": "​@Ratimir101\nRegarding the NEP policy - Lenin wrote back in 1917, not having any illusions about the fact that it is possible to jump from a feudal country to communism, it seems to me that you do not understand something about economics",
        "like_count": 0,
        "published_at": "2025-07-02T00:44:08Z",
        "is_reply": true
      },
      {
        "id": "UgwbSZNOpypCZTw0U7J4AaABAg.AK2nG1trCzwAK3AeuBR8HZ",
        "author": "@Ratimir101",
        "text": "@Armonter Well its hard to be more specific in comment on YT, I assume you will know what I mean and you well understood one of my points was NEP, and for excuse about it I would just say Stalin proved him wrong by bringing USSR up to level of top industrial powers in record time,\nand if excuse to that would be that it was very costly on people, I would say attempts under Lenin were even worse in that regard and also unsuccessful",
        "like_count": 0,
        "published_at": "2025-07-02T02:25:53Z",
        "is_reply": true
      },
      {
        "id": "UgwbSZNOpypCZTw0U7J4AaABAg.AK2nG1trCzwAK3AnNikXb_",
        "author": "@Ratimir101",
        "text": "@Armonter Though I have to add, yes its possible without him revolution wouldn't happen or succeed, he was great speaker that I don't question, but I don't think he was good leader",
        "like_count": 0,
        "published_at": "2025-07-02T02:27:03Z",
        "is_reply": true
      },
      {
        "id": "UgwbSZNOpypCZTw0U7J4AaABAg.AK2nG1trCzwAK3DGxTENk5",
        "author": "@Armonter",
        "text": "​@Ratimir101\nI don't understand what you are writing about, do you understand that socialism is a post-capitalist economy? Russia had a feudal economy, where 80% of the population were peasants, Lenin and Stalin were supporters of the dictatorship of the proletariat, as the majority of the population, under feudal conditions you cannot have more proletariat than peasants, to implement your dictatorship",
        "like_count": 0,
        "published_at": "2025-07-02T02:48:42Z",
        "is_reply": true
      },
      {
        "id": "UgwbSZNOpypCZTw0U7J4AaABAg.AK2nG1trCzwAK3DwUmVaZp",
        "author": "@Armonter",
        "text": "​@Ratimir101\nStalin was just using the results of the NEP economy, and even despite the workers' control of large enterprises under Stalin, small-scale farming artels were established, essentially private business, if you know, a collective farm is a collective private enterprise.",
        "like_count": 0,
        "published_at": "2025-07-02T02:54:30Z",
        "is_reply": true
      },
      {
        "id": "UgwbSZNOpypCZTw0U7J4AaABAg.AK2nG1trCzwAK5gbr8kqUk",
        "author": "@Armonter",
        "text": "​@RomanII499\nbanderasucker...",
        "like_count": 0,
        "published_at": "2025-07-03T01:52:19Z",
        "is_reply": true
      }
    ]
  }
]