[
  {
    "text": "*sigh* Well, here we are.",
    "start": 0.0,
    "duration": 3.14
  },
  {
    "text": "At the question that is apparently occupying the great minds of our times.",
    "start": 3.14,
    "duration": 4.12
  },
  {
    "text": "Was Adolf Hitler, the dictator of Nazi Germany, a socialist?",
    "start": 7.26,
    "duration": 5.28
  },
  {
    "text": "Although this is probably my most requested video, I didn't want to do it for quite some time.",
    "start": 12.54,
    "duration": 4.48
  },
  {
    "text": "Partially because I thought that it's a position only fringe demagogues would espouse,",
    "start": 17.52,
    "duration": 3.8
  },
  {
    "text": "but to my disappointment - but not surprise -",
    "start": 21.32,
    "duration": 2.54
  },
  {
    "text": "it seems to become a more and more mainstream opinion in American conservatism.",
    "start": 23.86,
    "duration": 3.8
  },
  {
    "text": "Even Mr. Facts-Over-Feelings himself is repeating it.",
    "start": 28.08,
    "duration": 2.86
  },
  {
    "text": "And not to forget, quite recently, the son of the President of the United States of America.",
    "start": 30.94,
    "duration": 5.3
  },
  {
    "text": "I'll talk about why I dislike engaging this discussion so much at the end, but for now",
    "start": 36.309,
    "duration": 4.13
  },
  {
    "text": "let's check out the arguments, today presented by a conservative pundit Steven Crowder and a few others.",
    "start": 40.44,
    "duration": 5.84
  },
  {
    "text": "I have to admit though that I was honestly baffled by some of the arguments here",
    "start": 46.3,
    "duration": 4.02
  },
  {
    "text": "because I think I have rarely seen this level of being highly deceptive or flat-out wrong, combined with a large dose of smugness.",
    "start": 50.32,
    "duration": 7.1
  },
  {
    "text": "And let's begin with Crowder's explanation for why it's important to categorize Hitler in that way,",
    "start": 57.74,
    "duration": 4.6
  },
  {
    "text": "which should give you an idea of Crowder's understanding of the topic.",
    "start": 62.379,
    "duration": 3.26
  },
  {
    "text": "Economic authoritarianism is still authoritarianism.",
    "start": 66.84,
    "duration": 3.26
  },
  {
    "text": "I wrote about this ...",
    "start": 70.24,
    "duration": 1.22
  },
  {
    "text": "*ding*",
    "start": 72.66,
    "duration": 1.52
  },
  {
    "text": "*ding*",
    "start": 75.62,
    "duration": 1.5
  },
  {
    "text": "... that Hitler, what do we hear about Hitler?",
    "start": 77.8,
    "duration": 2.4
  },
  {
    "text": "- He was...\n- Super right-wing.\n- Right-wing.",
    "start": 80.24,
    "duration": 2.92
  },
  {
    "text": "Nazi stands for National Socialist German Workers Party, okay?",
    "start": 83.16,
    "duration": 4.2
  },
  {
    "text": "So put that in your back pocket. Now, let me get to something people will say, I know what you're going to say:",
    "start": 87.94,
    "duration": 4.1
  },
  {
    "text": "'National socialism, not democratic socialism like Bernie Sanders!",
    "start": 92.3,
    "duration": 4.36
  },
  {
    "text": "There's a huge... one is fascism, right-wing, one is not.' They're both socialism.",
    "start": 96.68,
    "duration": 4.76
  },
  {
    "text": "Democratic socialism always becomes national, nationalistic socialism.",
    "start": 101.44,
    "duration": 5.42
  },
  {
    "text": "By definition, it has to. Why?",
    "start": 106.88,
    "duration": 2.34
  },
  {
    "text": "Okay, the United States is not a democracy.",
    "start": 109.24,
    "duration": 3.38
  },
  {
    "text": "You throw around the term 'democratic' as though it's noble. Um, no.",
    "start": 112.62,
    "duration": 4.4
  },
  {
    "text": "We're a constitutional representative republic. Why?",
    "start": 117.02,
    "duration": 2.7
  },
  {
    "text": "That's important to know, it's important to know we're not a democracy.",
    "start": 119.72,
    "duration": 2.38
  },
  {
    "text": "That's because democracy is mob rule.",
    "start": 122.1,
    "duration": 2.18
  },
  {
    "text": "The reason the United States was framed as a constitutional representative republic",
    "start": 124.28,
    "duration": 4.58
  },
  {
    "text": "is to make sure that the rights of the minority are still protected from the majority.",
    "start": 128.86,
    "duration": 6.26
  },
  {
    "text": "Otherwise the majority can just vote and screw the minority.",
    "start": 135.3,
    "duration": 3.94
  },
  {
    "text": "You're more liberal, you should be on board with that. Democracy by definition",
    "start": 139.24,
    "duration": 5.98
  },
  {
    "text": "would inherently be bad for minorities.",
    "start": 145.22,
    "duration": 2.88
  },
  {
    "text": "So, am I saying Bernie Sanders is like Hitler? No.",
    "start": 148.1,
    "duration": 2.6
  },
  {
    "text": "But the ideology is the ideology that lends itself toward authoritarianism and fascism",
    "start": 150.72,
    "duration": 5.7
  },
  {
    "text": "because of an increased expansion of the state.",
    "start": 156.42,
    "duration": 2.36
  },
  {
    "text": "~elevator music~",
    "start": 158.96,
    "duration": 6.98
  },
  {
    "text": "Now why is this so important, going back to representative government?",
    "start": 165.96,
    "duration": 4.5
  },
  {
    "text": "Well, Hitler used the idea of democracy, mob rule, to infringe on the rights of the minority.",
    "start": 170.46,
    "duration": 6.68
  },
  {
    "text": "\"How do I feel about the rich Jews, the rich lying Jews, the 1%? Let's have a vote! *bump* Kill the Judens!\"",
    "start": 177.48,
    "duration": 6.12
  },
  {
    "text": "I'm sorry, everyone. Bear with me.\nIt will be over in a second.",
    "start": 183.76,
    "duration": 3.62
  },
  {
    "text": "The majority Germans – it's democratic and it's nationalistic –",
    "start": 187.38,
    "duration": 4.6
  },
  {
    "text": "they believed Germany was for the true Germans, not for the Jews.",
    "start": 191.98,
    "duration": 3.12
  },
  {
    "text": "Democracy, nationalism, either way. Mob rule, the nationalists win. That's the whole point.",
    "start": 195.1,
    "duration": 5.62
  },
  {
    "text": "Now, claiming Hitler was a liberal socialist is already a pretty hot take since it's an oxymoron.",
    "start": 201.18,
    "duration": 5.4
  },
  {
    "text": "But Crowder tops it with saying democracy allowed Hitler to infringe on the rights of minorities,",
    "start": 206.58,
    "duration": 5.54
  },
  {
    "text": "which it's why it's important that the US is a republic and not a democracy.",
    "start": 212.12,
    "duration": 4.06
  },
  {
    "text": "You wouldn't want the US government to be able to infringe on the rights of minorities",
    "start": 216.18,
    "duration": 4.06
  },
  {
    "text": "leading up to mass enslavement and straight up genocide of, let's say, Native Americans or black people.",
    "start": 220.24,
    "duration": 5.82
  },
  {
    "text": "Truly unthinkable with a republic. Unlike the country known as the \"Weimar Republic\" – which wasn't its official name,",
    "start": 226.06,
    "duration": 7.18
  },
  {
    "text": "but it was a constitutional republic up until the 1930s, with a parliament and a president and all that jazz.",
    "start": 233.24,
    "duration": 5.7
  },
  {
    "text": "By the way, the group in this picture sitting on the far right side of the German parliament, that's the NSDAP, the Nazi Party,",
    "start": 239.28,
    "duration": 7.16
  },
  {
    "text": "opposite to the far left side of the parliament where the Communist Party was seated.",
    "start": 246.44,
    "duration": 4.7
  },
  {
    "text": "Not coincidentally, as you might have guessed.",
    "start": 251.14,
    "duration": 1.98
  },
  {
    "text": "Also, Crowder doesn't seem to know that democracy is a form of governing",
    "start": 253.22,
    "duration": 3.84
  },
  {
    "text": "while a republic is a system of government and the two are not mutually exclusive.",
    "start": 257.06,
    "duration": 4.26
  },
  {
    "text": "And while the US isn't a direct democracy, neither was Nazi Germany.",
    "start": 261.32,
    "duration": 4.62
  },
  {
    "text": "It was a dictatorship, not of the mob but of the party in power.",
    "start": 266.32,
    "duration": 3.48
  },
  {
    "text": "Hitler and his party didn't have the absolute majority of the votes when seizing power over Germany,",
    "start": 270.08,
    "duration": 4.74
  },
  {
    "text": "and Hitler wasn't voted into the position of chancellor but was appointed by President Paul von Hindenburg.",
    "start": 274.82,
    "duration": 5.0
  },
  {
    "text": "Hitler managed to become a dictator by playing his cards right",
    "start": 279.82,
    "duration": 3.12
  },
  {
    "text": "in a time of extreme crisis for the German economy and democracy",
    "start": 282.94,
    "duration": 3.08
  },
  {
    "text": "that had been going on since the financial crisis of 1929.",
    "start": 286.02,
    "duration": 3.66
  },
  {
    "text": "Funnily enough, Crowder also mentions the financial troubles that led to Hitler's rise in his article,",
    "start": 289.98,
    "duration": 4.72
  },
  {
    "text": "echoing the claims of the far right at the time that",
    "start": 294.7,
    "duration": 2.18
  },
  {
    "text": "Germany's financial words were strictly the fault of the victors; and also claims the crisis lasted for 15 years,",
    "start": 296.88,
    "duration": 6.12
  },
  {
    "text": "which is longer than the Weimar Republic even existed. This is the terrain we're traveling into folks.",
    "start": 303.0,
    "duration": 5.24
  },
  {
    "text": "So strap yourself in because it gets even wilder and, frankly, quite embarrassing.",
    "start": 308.24,
    "duration": 4.62
  },
  {
    "text": "But for now let's see Crowder's arguments for why Hitler was a socialist.",
    "start": 313.26,
    "duration": 3.24
  },
  {
    "text": "Hitler promised employment for all, of course was a self-avowed socialist.",
    "start": 316.86,
    "duration": 2.88
  },
  {
    "text": "Innovative public works schemes gave workers increased benefits.",
    "start": 319.78,
    "duration": 3.52
  },
  {
    "text": "He increased jobs by increasing the state.",
    "start": 323.3,
    "duration": 2.74
  },
  {
    "text": "Not allowing wages to rise with prices because he wanted people working for the government,",
    "start": 326.04,
    "duration": 3.16
  },
  {
    "text": "he ensured everyone had a job. Big education. Free daycare.",
    "start": 329.2,
    "duration": 3.36
  },
  {
    "text": "You had basically an entire generation who were raised by the state.",
    "start": 332.56,
    "duration": 3.68
  },
  {
    "text": "Nationalized health care. Up to an 80% tax.",
    "start": 336.24,
    "duration": 4.1
  },
  {
    "text": "Gun control. Of course implemented gun control.\nAbortion, was radically pro-abortion.",
    "start": 340.34,
    "duration": 5.44
  },
  {
    "text": "Blaming on the 1%. Back then the 1% were Jews.",
    "start": 345.94,
    "duration": 3.18
  },
  {
    "text": "So I think this is a good point to jump into Crowder's article about this topic,",
    "start": 349.38,
    "duration": 3.66
  },
  {
    "text": "since it's easier to take everything point by point instead of responding to all statements at once.",
    "start": 353.04,
    "duration": 4.92
  },
  {
    "text": "The first thing you'll see when opening Crowder's article is this quote attributed to Hitler at the top of the page:",
    "start": 358.14,
    "duration": 5.84
  },
  {
    "text": "\"We are socialists, we are enemies of today's capitalist economic system for the exploitation of the economically weak with its unfair salaries, ...\"",
    "start": 363.98,
    "duration": 8.22
  },
  {
    "text": "\"... with its unseemly evaluation of a human being according to wealth and property...\"",
    "start": 372.2,
    "duration": 4.04
  },
  {
    "text": "\"... instead of responsibility and performance. And we are determined to destroy this system under all conditions.\"",
    "start": 376.24,
    "duration": 5.82
  },
  {
    "text": "Well, that seems pretty damning. Seems like Hitler was a socialist after all, if these were actually his words, which they're not.",
    "start": 382.54,
    "duration": 6.9
  },
  {
    "text": "The actual author of this quote was Gregor Strasser, a higher-up in the National Socialist Workers Party,",
    "start": 389.44,
    "duration": 5.38
  },
  {
    "text": "who wrote a pamphlet called \"Thoughts about the tasks of the future\" in 1926.",
    "start": 394.82,
    "duration": 4.62
  },
  {
    "text": "Now who was Gregor Strasser?",
    "start": 399.74,
    "duration": 2.0
  },
  {
    "text": "He was the de facto leader of what one could call the more anti-capitalist wing of the NSDAP up until 1932.",
    "start": 402.04,
    "duration": 6.06
  },
  {
    "text": "Due to the intentionally vague language of Hitler and the Nazi platform, a bunch of people flocked with the party",
    "start": 408.36,
    "duration": 5.3
  },
  {
    "text": "who Hitler himself didn't necessarily agree with politically.",
    "start": 413.66,
    "duration": 2.92
  },
  {
    "text": "This led to a strong division inside the party and to the establishment of two different camps.",
    "start": 416.58,
    "duration": 4.04
  },
  {
    "text": "One was the group around Strasser and his brother,",
    "start": 420.76,
    "duration": 2.56
  },
  {
    "text": "who genuinely saw capitalism as a broken system that needed to be replaced,",
    "start": 423.32,
    "duration": 3.54
  },
  {
    "text": "and the völkisch nationalist wing around Hitler, who didn't see it that way,",
    "start": 427.1,
    "duration": 3.96
  },
  {
    "text": "and Hitler himself was always more interested in coming to power than in genuine policy goals of the party.",
    "start": 431.06,
    "duration": 5.06
  },
  {
    "text": "The Strasser group of the party is often described as the left wing of the party,",
    "start": 436.6,
    "duration": 4.2
  },
  {
    "text": "but in my opinion this is very misleading because if we look at some other statements by Gregor Strasser,",
    "start": 440.98,
    "duration": 4.66
  },
  {
    "text": "the differences between him and the, for instance, Social Democrats become very clear.",
    "start": 445.64,
    "duration": 4.04
  },
  {
    "text": "Taken from the same pamphlet of which Crowder got the other quote from:",
    "start": 450.02,
    "duration": 3.54
  },
  {
    "text": "Not very egalitarian there.",
    "start": 490.54,
    "duration": 2.0
  },
  {
    "text": "And remember, this guy is seen as to the left of Hitler and the völkisch nationalist wing of the party.",
    "start": 492.54,
    "duration": 4.94
  },
  {
    "text": "He also actively took part in the failed Hitler-Ludendorff coup in 1923",
    "start": 497.98,
    "duration": 4.46
  },
  {
    "text": "which sought to overthrow the democratic republic and establish a military dictatorship.",
    "start": 502.44,
    "duration": 4.4
  },
  {
    "text": "Ultimately though, Gregor Strasser lost the fight for dominance inside the party against Hitler",
    "start": 506.84,
    "duration": 4.76
  },
  {
    "text": "and resigned from all of his functions in 1932.",
    "start": 511.6,
    "duration": 2.7
  },
  {
    "text": "His brother Otto had at that point already left the party and published a pamphlet called \"The Socialists leave the NSDAP\",",
    "start": 514.78,
    "duration": 6.42
  },
  {
    "text": "in which he criticized the party leadership for putting tactics over politics and that they understood National Socialism to be an",
    "start": 521.2,
    "duration": 6.06
  },
  {
    "text": "anti-imperialist movement who doesn't seek dominion over other people and countries.",
    "start": 527.26,
    "duration": 4.82
  },
  {
    "text": "Looking back at stuff like, you know, what the Nazis actually did it's very easy to see why they didn't get along.",
    "start": 532.52,
    "duration": 5.28
  },
  {
    "text": "Gregor Strasser's resignation led to a radicalization of the völkisch nationalist wing of the party,",
    "start": 538.18,
    "duration": 4.9
  },
  {
    "text": "and two years later he was murdered in an event called the Night of the Long Knives,",
    "start": 543.08,
    "duration": 3.36
  },
  {
    "text": "in which Hitler and others in the party leadership had several people killed who they weren't very fond of.",
    "start": 546.44,
    "duration": 5.46
  },
  {
    "text": "This whole affair shows that for Hitler the quest of power was much more important than ideological convictions",
    "start": 551.9,
    "duration": 5.46
  },
  {
    "text": "or how his party colleagues interpreted the NSDAP platform.",
    "start": 557.36,
    "duration": 3.0
  },
  {
    "text": "This is nicely summed up in Theodor Abel's \"The Nazi Movement\":",
    "start": 560.7,
    "duration": 3.76
  },
  {
    "text": "We'll get into what he thought about socialism a bit later, but for now",
    "start": 624.06,
    "duration": 3.58
  },
  {
    "text": "I'd like to ask you to take a look at the amount of time of this video that has already passed.",
    "start": 627.64,
    "duration": 4.42
  },
  {
    "text": "And now consider that we're not even at the historical arguments yet.",
    "start": 632.22,
    "duration": 3.1
  },
  {
    "text": "It's just the setup that requires so much cleaning up that it could be a video on its own.",
    "start": 635.34,
    "duration": 4.4
  },
  {
    "text": "I hope you can see why I was hesitant in making this video because, honestly, all you can do is laugh.",
    "start": 640.06,
    "duration": 4.42
  },
  {
    "text": "Anyway, the article starts out with a fake quote that doesn't support his argument.",
    "start": 644.98,
    "duration": 4.02
  },
  {
    "text": "Moving on to the first historical point:",
    "start": 649.0,
    "duration": 1.96
  },
  {
    "text": "So we could simply dismiss this argument because it's not factual.",
    "start": 699.86,
    "duration": 3.54
  },
  {
    "text": "Hitler never promised employment for all, and getting unemployment down and the economy rolling again was less due to innovative public work schemes.",
    "start": 703.4,
    "duration": 7.12
  },
  {
    "text": "But I'd like to combine this with Crowder's other points regarding Nazi Germany's economy.",
    "start": 710.52,
    "duration": 4.14
  },
  {
    "text": "The innovative public work schemes that Crowder describes weren't really as innovative as you might think.",
    "start": 714.66,
    "duration": 5.02
  },
  {
    "text": "In fact, there's even a name for this called \"the Autobahn Myth\".",
    "start": 719.92,
    "duration": 3.42
  },
  {
    "text": "Because the idea of the Autobahn started circulating long before the Nazis took over and some stretches were even already built.",
    "start": 723.7,
    "duration": 6.36
  },
  {
    "text": "Of course, those were then downgraded to country roads by the Nazis because they wanted to exploit the idea of the Autobahn for propaganda.",
    "start": 730.06,
    "duration": 6.92
  },
  {
    "text": "So Hitler jumped on the bandwagon of increased mobility and wanted to build 1,000 kilometers of Autobahn every year,",
    "start": 736.98,
    "duration": 5.92
  },
  {
    "text": "which should provide 600,000 Germans with jobs. In reality though, this goal was never met,",
    "start": 742.9,
    "duration": 5.0
  },
  {
    "text": "and at the height of the construction not more than 120,000 people were given work through this program.",
    "start": 747.9,
    "duration": 5.42
  },
  {
    "text": "In addition to that, there were numerous problems during the project",
    "start": 753.32,
    "duration": 2.58
  },
  {
    "text": "and strike leaders who wanted better or safer working conditions and a fair pay were sent to concentration camps.",
    "start": 755.9,
    "duration": 5.48
  },
  {
    "text": "Of course, you didn't hear about that in the Nazi propaganda. Instead, every newly built strip of the Autobahn",
    "start": 761.7,
    "duration": 5.58
  },
  {
    "text": "was celebrated with a big inauguration and lots of camera teams to circulate the images in state-run media.",
    "start": 767.28,
    "duration": 5.22
  },
  {
    "text": "In fact, these images were still propagandized even when the work on the Autobahn had come to a complete halt.",
    "start": 772.92,
    "duration": 5.28
  },
  {
    "text": "They were successful, though, in connecting themselves to the building of the Autobahn in the mind of the public,",
    "start": 778.2,
    "duration": 4.58
  },
  {
    "text": "often to this day, as demonstrated by Crowder, while at the same time sweeping under the rug that",
    "start": 782.78,
    "duration": 5.2
  },
  {
    "text": "the Nazis actually vehemently opposed the idea of the \"car-only road,\" as they were called in Weimar Germany,",
    "start": 787.98,
    "duration": 5.0
  },
  {
    "text": "because they saw it as an instrument of Jewish capitalism.",
    "start": 792.98,
    "duration": 2.8
  },
  {
    "text": "But if the Autobahn project didn't put Germans back to work, what was it?",
    "start": 796.16,
    "duration": 3.46
  },
  {
    "text": "Well firstly, the Nazi government benefited from a general economic upswing coming out of the Great Depression",
    "start": 799.62,
    "duration": 5.24
  },
  {
    "text": "and also were able to spend money that had been saved previously due to the strong austerity programs by previous administration.",
    "start": 804.86,
    "duration": 6.24
  },
  {
    "text": "They also skewed the numbers pretty strongly by forcing women and Jews out of the workforce and giving those jobs to German men.",
    "start": 811.32,
    "duration": 5.42
  },
  {
    "text": "The biggest chunk of trimming down the unemployment though was by re-militarization and opening new jobs in the booming arms industry.",
    "start": 817.04,
    "duration": 6.08
  },
  {
    "text": "Not that innovative, if you ask me. The next thing Crowder mentions is the \"strength through joy\" program, which gave workers increased benefits.",
    "start": 823.5,
    "duration": 7.06
  },
  {
    "text": "While it's true that the program gave workers a lot of benefits they wouldn't have had otherwise",
    "start": 830.8,
    "duration": 3.8
  },
  {
    "text": "- for instance, the KdF was the biggest to operate in the country at the time -",
    "start": 834.6,
    "duration": 3.2
  },
  {
    "text": "one of its goals was specifically to get workers away from marxist or social democratic attitudes",
    "start": 837.8,
    "duration": 4.96
  },
  {
    "text": "that had also promised better working conditions in the past.",
    "start": 842.76,
    "duration": 2.7
  },
  {
    "text": "In fact, the program was intended to replace the demand for trade unions",
    "start": 845.56,
    "duration": 3.5
  },
  {
    "text": "and prevent class consciousness from developing that might have become a threat to the Nazi government.",
    "start": 849.06,
    "duration": 4.34
  },
  {
    "text": "The program didn't separate between the average workers and their bosses",
    "start": 853.68,
    "duration": 3.16
  },
  {
    "text": "in an attempt to get people behind the idea of a community based on ethnicity rather than based on class.",
    "start": 856.84,
    "duration": 5.26
  },
  {
    "text": "By the way, the trade unions I just mentioned were destroyed by the Nazis, and their leaders were sent to concentration camps.",
    "start": 862.68,
    "duration": 5.86
  },
  {
    "text": "And from that point on workers had no way of effectively negotiating better pay or working conditions –",
    "start": 868.54,
    "duration": 5.04
  },
  {
    "text": "not something socialists were usually in favor of. The last point in this section of the article is that",
    "start": 873.58,
    "duration": 4.86
  },
  {
    "text": "Hitler combatted inflation that resulted from all the spending by not allowing wages to rise with prices, which is only part of the story.",
    "start": 878.44,
    "duration": 6.94
  },
  {
    "text": "While price and wage restrictions did exist under the Nazis,",
    "start": 885.7,
    "duration": 3.14
  },
  {
    "text": "the main tool in combating inflation was the introduction of something called the \"Mefo bill\"",
    "start": 888.84,
    "duration": 4.32
  },
  {
    "text": "which was essentially a second currency issued by a bogus company set up by the Nazis.",
    "start": 893.16,
    "duration": 4.6
  },
  {
    "text": "This allowed them to spend vast amounts of money on rearmament",
    "start": 898.0,
    "duration": 3.16
  },
  {
    "text": "without their surrounding countries being able to notice when taking a look at the state budget.",
    "start": 901.16,
    "duration": 3.66
  },
  {
    "text": "Essentially it was just fraud, and when the time came to pay out the issued Mefo bills, the government printed money",
    "start": 905.08,
    "duration": 5.44
  },
  {
    "text": "and went into a world war in which they plundered the conquered countries to prop up the immense spending.",
    "start": 910.52,
    "duration": 5.16
  },
  {
    "text": "Not sure what about that is supposed to resemble left-wing policy, but ok.",
    "start": 916.16,
    "duration": 3.4
  },
  {
    "text": "Anyway, I'd like to get into a bit more detail about the economy in Nazi Germany here,",
    "start": 920.08,
    "duration": 4.02
  },
  {
    "text": "because if you would want to make the argument that Hitler was a socialist, or by extension the Nazis were left-wing,",
    "start": 924.1,
    "duration": 4.86
  },
  {
    "text": "this would show in their enacted economic policies.",
    "start": 928.96,
    "duration": 2.7
  },
  {
    "text": "Of course Crowder doesn't go that far, but unfortunately, this debate is bigger than just Steven Crowder.",
    "start": 931.66,
    "duration": 4.56
  },
  {
    "text": "The economy of Nazi Germany is a very complex issue,",
    "start": 936.8,
    "duration": 2.68
  },
  {
    "text": "and there are frequent disagreements over its role in the Nazi state, but I'll try to limit it to what is relevant for us.",
    "start": 939.48,
    "duration": 5.16
  },
  {
    "text": "If we look at the schematized version of how the Nazis organized the economy,",
    "start": 944.86,
    "duration": 3.42
  },
  {
    "text": "we can see that there was quite a lot of overhead involved.",
    "start": 948.58,
    "duration": 2.38
  },
  {
    "text": "Here is where someone from the libertarian school of economics might say that this resembles a planned economy",
    "start": 951.5,
    "duration": 4.62
  },
  {
    "text": "in the style of other self-proclaimed socialist countries of the 20th century. Important to notice here though",
    "start": 956.12,
    "duration": 5.46
  },
  {
    "text": "is that the means of production remained in private hand under Nazi rule. If you were German, that is.",
    "start": 961.58,
    "duration": 5.08
  },
  {
    "text": "In a planned economy, business decisions are made at the very top.",
    "start": 966.66,
    "duration": 3.58
  },
  {
    "text": "In Nazi Germany, the owners of the means of production were able to make their own decisions,",
    "start": 970.38,
    "duration": 3.84
  },
  {
    "text": "but were urged to act according to the interests of the Nazis.",
    "start": 974.22,
    "duration": 2.8
  },
  {
    "text": "This lasted up until 1942, when the war started to necessitate the complete mobilisation of the German economy and society.",
    "start": 977.44,
    "duration": 6.02
  },
  {
    "text": "From that point on, the economy was pretty much under complete control of the government, as it was in several other nations taking part in the war.",
    "start": 983.88,
    "duration": 6.48
  },
  {
    "text": "But keep in mind that this was done not out of ideological convictions,",
    "start": 990.68,
    "duration": 3.22
  },
  {
    "text": "but just because there was no alternative if Germany wanted to continue the war.",
    "start": 993.9,
    "duration": 3.66
  },
  {
    "text": "Economist and member of the Nazi Party Hermann Reischle described it like this in 1945:",
    "start": 998.12,
    "duration": 4.34
  },
  {
    "text": "I had a hard time finding an English translation to this though so let me know in the comments if you find a better translation than this one.",
    "start": 1020.14,
    "duration": 5.5
  },
  {
    "text": "Essentially owners could act freely within their firms but faced tight restrictions in the market.",
    "start": 1025.8,
    "duration": 4.32
  },
  {
    "text": "What this shows, though, is that the economic system of Nazi Germany didn't and wasn't supposed to resemble the one of a socialist country.",
    "start": 1030.44,
    "duration": 6.6
  },
  {
    "text": "I know in the US it's sometimes enough to deny bosses the right to personally murder their employees to be labeled as socialists,",
    "start": 1037.48,
    "duration": 5.6
  },
  {
    "text": "but outside of that these words have very concrete economic implications.",
    "start": 1043.36,
    "duration": 3.7
  },
  {
    "text": "But the system we just looked at didn't really resemble a free-market economy either.",
    "start": 1047.36,
    "duration": 3.9
  },
  {
    "text": "So why was it designed the way it was?",
    "start": 1051.26,
    "duration": 2.34
  },
  {
    "text": "Well, this is getting it why I dislike this whole debate so much. The economy of Nazi Germany can't really be compared",
    "start": 1053.6,
    "duration": 5.9
  },
  {
    "text": "to other systems that are around today without acknowledging that",
    "start": 1059.5,
    "duration": 2.8
  },
  {
    "text": "the economic system of Nazi Germany operated under a completely different paradigm than today's capitalism or socialism.",
    "start": 1062.3,
    "duration": 5.88
  },
  {
    "text": "The goals of the Nazis in regards the economy were to be self-reliant in enabling them to wage war to enact their racist \"Lebensraum\" policies.",
    "start": 1068.4,
    "duration": 7.18
  },
  {
    "text": "A comparison that leaves those out is pointless, but more on that later.",
    "start": 1075.8,
    "duration": 3.16
  },
  {
    "text": "What this look at the economy doesn't explain are the anti-capitalist sentiments",
    "start": 1079.3,
    "duration": 4.1
  },
  {
    "text": "that the Nazis espoused, for instance in their party program.",
    "start": 1083.42,
    "duration": 2.52
  },
  {
    "text": "Dinesh D'Souza frequently brings this up and claims that the party program could have been written by Bernie Sanders. More on that later.",
    "start": 1086.34,
    "duration": 5.94
  },
  {
    "text": "So what's with the anti-capitalist statements in the NSDAP program?",
    "start": 1092.64,
    "duration": 3.72
  },
  {
    "text": "To understand that we have to go back a bit and, as so often, historical context is important.",
    "start": 1096.36,
    "duration": 4.8
  },
  {
    "text": "Ever since Santa and his elf came along to give the children class consciousness,",
    "start": 1101.52,
    "duration": 3.64
  },
  {
    "text": "something called the \"social question\" had arisen in Germany.",
    "start": 1105.16,
    "duration": 3.2
  },
  {
    "text": "The question was essentially what to do about the growing inequality, unfair distribution of wealth",
    "start": 1108.36,
    "duration": 4.86
  },
  {
    "text": "and the alienation between the rich and the poor that came out of the capitalist system.",
    "start": 1113.22,
    "duration": 3.6
  },
  {
    "text": "When the Weimar Republic rolled around, this dilemma was still ever present and also amplified due to the ongoing failure of the system",
    "start": 1117.2,
    "duration": 6.7
  },
  {
    "text": "and the parties offered different solutions to this problem.",
    "start": 1123.96,
    "duration": 2.42
  },
  {
    "text": "The KPD, which was the German Communist Party, and the SPD, the Social Democrats,",
    "start": 1126.44,
    "duration": 4.48
  },
  {
    "text": "were of the opinion that capitalism was an inherently broken system that needed to be replaced by a socialist system,",
    "start": 1130.92,
    "duration": 5.84
  },
  {
    "text": "although they had very different visions on how that system should look like.",
    "start": 1136.76,
    "duration": 3.44
  },
  {
    "text": "Especially the SPD was always going back and forth between their Marxist ideals and economic realities.",
    "start": 1140.42,
    "duration": 5.48
  },
  {
    "text": "The approach offered by the NSDAP and the German right in general was that capitalism wasn't a completely broken system,",
    "start": 1146.0,
    "duration": 6.22
  },
  {
    "text": "but that there were different forms of capitalism that needed to be separated.",
    "start": 1152.22,
    "duration": 3.64
  },
  {
    "text": "One form was what they called \"Schaffendes Kapital\", what essentially translates to \"productive capital/capitalism\";",
    "start": 1156.12,
    "duration": 5.78
  },
  {
    "text": "and the other one was \"Raffendes Kapital\", which was their description of money-grubbing or greedy capital.",
    "start": 1162.12,
    "duration": 5.42
  },
  {
    "text": "And if you could just get rid of the money-grubbing aspect of capitalism, everything would be fine.",
    "start": 1167.56,
    "duration": 4.62
  },
  {
    "text": "Right from the start the German intellectual right connected the idea of 'raffendes Kapital' with outside forces sucking money from the hard-working Germans.",
    "start": 1172.52,
    "duration": 7.42
  },
  {
    "text": "And as you might have guessed already, it didn't take long for this concept to be connected to the antisemitic attitude of the German right,",
    "start": 1180.38,
    "duration": 5.86
  },
  {
    "text": "and that's how it fitted into the Nazi platform",
    "start": 1186.46,
    "duration": 2.04
  },
  {
    "text": "It wasn't as much a critique of the capitalist system, but just another manifestation of xenophobic paranoia",
    "start": 1188.92,
    "duration": 5.54
  },
  {
    "text": "and wanting to appeal to genuine woes of the population while blaming them on non-Germans.",
    "start": 1194.46,
    "duration": 4.36
  },
  {
    "text": "One thing that Steven Crowder mentions in his video but not the article is that the Nazis cracked down on businesses.",
    "start": 1199.12,
    "duration": 5.84
  },
  {
    "text": "\"Expanding the state, free school, bigger government, cracking down on businesses",
    "start": 1205.34,
    "duration": 5.1
  },
  {
    "text": "so more people go to public school, raise their kids in public daycare, work for the government,",
    "start": 1210.44,
    "duration": 4.28
  },
  {
    "text": "and you remove the power from the private sector, putting it to the government.\"",
    "start": 1214.72,
    "duration": 3.5
  },
  {
    "text": "Now I can only guess what that's supposed to mean, but a frequent argument I read when someone tries to paint the Nazis as left-wing",
    "start": 1218.62,
    "duration": 5.68
  },
  {
    "text": "is the nationalization of private businesses under Nazi rule.",
    "start": 1224.46,
    "duration": 2.58
  },
  {
    "text": "Shapiro also uses this argument when trying to explain why the Nazis were supposedly left-wing.",
    "start": 1227.74,
    "duration": 4.46
  },
  {
    "text": "Number one: The Nazis were of the left.",
    "start": 1232.66,
    "duration": 1.78
  },
  {
    "text": "The Nazis were of the left and, and ...",
    "start": 1235.28,
    "duration": 2.2
  },
  {
    "text": "~elevator music~",
    "start": 1237.5,
    "duration": 4.38
  },
  {
    "text": "The, the split between the national socialists and the communists were a split over power, not over fundamental principle.",
    "start": 1241.98,
    "duration": 5.4
  },
  {
    "text": "And the fact is that the communists were fascists. I mean, Stalin was a fascist.",
    "start": 1247.38,
    "duration": 3.2
  },
  {
    "text": "I mean, fascism was a system of government that suggested that [unclear] ought to rule every aspect of life.",
    "start": 1251.38,
    "duration": 4.78
  },
  {
    "text": "And the economic system that has been traditionally attached to that is one that involves seizure of private property and redistribution of it,",
    "start": 1256.18,
    "duration": 5.38
  },
  {
    "text": "which is something that both Hitler and Stalin did.",
    "start": 1261.56,
    "duration": 4.54
  },
  {
    "text": "And while it's true that the Nazis were very heavily involved in the economy and also confiscated a bunch of property they also privatized a lot.",
    "start": 1266.34,
    "duration": 6.38
  },
  {
    "text": "In fact, they privatized more than any other Western capitalist country in that time period.",
    "start": 1272.72,
    "duration": 5.04
  },
  {
    "text": "After the Great Depression hit, Weimar Germany along with the other Western nations started nationalizing a bunch of services and companies.",
    "start": 1277.76,
    "duration": 6.72
  },
  {
    "text": "The Nazis, after they came into power, actually reversed that trend in Germany. For example, in 1932 the German government bought more than",
    "start": 1284.48,
    "duration": 6.94
  },
  {
    "text": "120 million marks of shares of the Gelsenkirchen mining company, the strongest firm inside the United Steelworks conglomerate.",
    "start": 1291.42,
    "duration": 6.98
  },
  {
    "text": "At the time, United Steel was the second-largest joint stock company in Germany.",
    "start": 1298.4,
    "duration": 4.16
  },
  {
    "text": "After the Nazis took over, United Steel was reorganized so that the government majority stake of 52% was converted into a stake of less than 25%,",
    "start": 1302.56,
    "duration": 9.08
  },
  {
    "text": "no longer sufficient in German law to give the government any privileges in company control.",
    "start": 1311.64,
    "duration": 4.32
  },
  {
    "text": "This is only one of many examples though. In the fiscal years 1933, 1935, and 1937, 1938",
    "start": 1316.32,
    "duration": 6.54
  },
  {
    "text": "privatization proceeds represented almost 1.4% of total fiscal revenues of Nazi Germany.",
    "start": 1322.86,
    "duration": 6.22
  },
  {
    "text": "Taken from \"Against the mainstream: Nazi privatization in 1930s Germany\":",
    "start": 1329.08,
    "duration": 3.92
  },
  {
    "text": "So does this mean the Nazis were free-market capitalists, similar to how a lot of conservatives describe themselves today?",
    "start": 1363.0,
    "duration": 5.14
  },
  {
    "text": "No.",
    "start": 1368.46,
    "duration": 0.63
  },
  {
    "text": "Making that statement would be making the same mistake that the people make who desperately want to paint the Nazis as socialists.",
    "start": 1369.09,
    "duration": 5.67
  },
  {
    "text": "The Nazis didn't privatize out of ideological conviction",
    "start": 1374.76,
    "duration": 2.98
  },
  {
    "text": "but to build bridges to big industrialists and to foster more widespread support of the party.",
    "start": 1377.74,
    "duration": 4.5
  },
  {
    "text": "The economy of Nazi Germany doesn't resemble socialism nor free-market capitalism, because it's not supposed to.",
    "start": 1382.24,
    "duration": 6.32
  },
  {
    "text": "It resembles the economy of a far-right dictatorship with specific ambitions in mind, similar to Franco's Spain or the Brazilian military government of 1964 to 1985.",
    "start": 1388.86,
    "duration": 9.8
  },
  {
    "text": "Okay, so much for the German economy.",
    "start": 1398.9,
    "duration": 2.0
  },
  {
    "text": "Crowder's next argument is \"big education,\" and what he means by that is public education.",
    "start": 1401.1,
    "duration": 5.12
  },
  {
    "text": "There isn't really much to say about this one, because public education was by no means exclusive to the Nazis.",
    "start": 1406.22,
    "duration": 5.3
  },
  {
    "text": "Compulsory school attendance on a federal level was introduced in 1919, and compulsory education was introduced in 1717 under the \"Soldier King,\" Frederick William I of Prussia.",
    "start": 1411.74,
    "duration": 10.7
  },
  {
    "text": "Is educating people left-wing?\nI don't know, you tell me.",
    "start": 1422.44,
    "duration": 3.12
  },
  {
    "text": "Same goes for Crowder's next point, which is nationalized health care.",
    "start": 1425.88,
    "duration": 3.8
  },
  {
    "text": "This point of the article just features a quote by Kitty Werthmann, a woman born in Austria who witnessed Hitler's reign.",
    "start": 1429.68,
    "duration": 5.72
  },
  {
    "text": "The quote decries socialized healthcare and claims that after Hitler socialized it, everyone went to the doctor for every little woe they had. And the paragraph ends with Crowder stating:",
    "start": 1435.4,
    "duration": 8.38
  },
  {
    "text": "\"Do I really need to write commentary on this one? Really?\"",
    "start": 1443.78,
    "duration": 3.18
  },
  {
    "text": "Yes, Steven, you should have, because this anecdote provided by Kitty Werthmann is highly questionable.",
    "start": 1447.46,
    "duration": 6.68
  },
  {
    "text": "It starts out with claiming Hitler socialized health care and that from that point on doctors were paid by the government, neither of which is true.",
    "start": 1454.14,
    "duration": 7.28
  },
  {
    "text": "Socialized healthcare was introduced in Germany in 1881 by Otto von Bismarck, and in Austria it was introduced about eight years later.",
    "start": 1461.42,
    "duration": 7.4
  },
  {
    "text": "Doctors also weren't paid by the government but by insurance companies.",
    "start": 1468.82,
    "duration": 3.19
  },
  {
    "text": "So yes, some commentary about what I'm supposed to get from this would have been greatly appreciated.",
    "start": 1472.01,
    "duration": 5.43
  },
  {
    "text": "Pushing aside the fact that anecdotal evidence isn't really worth much, it is worth pointing out that Kitty Werthmann's experiences",
    "start": 1477.44,
    "duration": 5.639
  },
  {
    "text": "- which she repeats in her numerous speeches -",
    "start": 1483.08,
    "duration": 1.93
  },
  {
    "text": "seemingly always confirm Republican ideas about healthcare, gun control, women's rights, religious symbols in schools, etc.",
    "start": 1485.01,
    "duration": 6.63
  },
  {
    "text": "So take that as you will.",
    "start": 1491.64,
    "duration": 1.58
  },
  {
    "text": "Next point: gun control. Please forgive me for not going through this at length again.",
    "start": 1493.22,
    "duration": 4.22
  },
  {
    "text": "I did a whole video on it which you can check out if you interested.",
    "start": 1497.45,
    "duration": 3.33
  },
  {
    "text": "In short, Hitler did not enact stricter gun laws for the majority of the German population, but only Jewish citizens and political dissidents.",
    "start": 1500.78,
    "duration": 7.22
  },
  {
    "text": "And the claim that Jews in Nazi Germany could have defended themselves on a grand scale against a well-armed police state supported by the majority of the population stands on historically very shaky grounds.",
    "start": 1508.0,
    "duration": 9.32
  },
  {
    "text": "One thing in this paragraph is worth talking about, though, because it's yet another example of Crowder quoting Hitler to attempt to support his argument, and failing.",
    "start": 1517.38,
    "duration": 8.08
  },
  {
    "text": "The quote goes as follows:",
    "start": 1525.46,
    "duration": 1.78
  },
  {
    "text": "\"The most foolish mistake we could possibly make would be to allow the subject races to possess arms\".",
    "start": 1527.6,
    "duration": 4.66
  },
  {
    "text": "This quote is taken from the book called \"Hitler's Table Talk\", also often mentioned by John Peterson, by the way.",
    "start": 1532.26,
    "duration": 5.16
  },
  {
    "text": "Now the problem with picking quotes from this book to support your argument is that the English and French translations are pretty flawed,",
    "start": 1537.42,
    "duration": 5.92
  },
  {
    "text": "and historians like Ian Kershaw and Richard Evans advise reading the book with caution.",
    "start": 1543.56,
    "duration": 3.7
  },
  {
    "text": "Luckily you have me, so we can check what it says in the original German version.",
    "start": 1547.32,
    "duration": 3.7
  },
  {
    "text": "This is the part where the English translation is taken from.",
    "start": 1551.02,
    "duration": 2.78
  },
  {
    "text": "Unsurprisingly, the meaning changes quite a bit if we look at the original.",
    "start": 1553.8,
    "duration": 3.74
  },
  {
    "text": "The people Hitler is talking about here are ones in the conquered Eastern territories and that it's a bad idea to give them weapons to provide security.",
    "start": 1557.54,
    "duration": 8.12
  },
  {
    "text": "\"German troops should take care of providing security and order in the occupied Russian territory, not the subjected populous\".",
    "start": 1565.68,
    "duration": 6.26
  },
  {
    "text": "So Hitler isn't talking about German Jews here, and I doubt that from a strategical standpoint anyone would argue that it's a good idea to give weapons to the populations you are currently occupying, while also committing a genocide and brutally murdering part of the population.",
    "start": 1571.94,
    "duration": 13.56
  },
  {
    "text": "Now, moving on from here it gets a bit weird, I'm afraid to say.",
    "start": 1585.78,
    "duration": 3.94
  },
  {
    "text": "His next point is abortion, as he claims in the video Hitler was radically pro-abortion.",
    "start": 1589.72,
    "duration": 5.12
  },
  {
    "text": "The paragraph starts out with: \"The great sacrament of the left, abortion.\"",
    "start": 1594.84,
    "duration": 3.94
  },
  {
    "text": "\"You'll be pleased to know that Hitler was pro-choice.\"",
    "start": 1599.18,
    "duration": 2.84
  },
  {
    "text": "He then goes on to say: \"Dr. Tessa Chelouche goes on to quote Hitler's 1942 policy statement on the application of abortion to Slavic people,\"",
    "start": 1602.02,
    "duration": 7.999
  },
  {
    "text": "\"which is chillingly similar to modern Planned Parenthood propaganda:\". And then a quote from an academic paper.",
    "start": 1610.02,
    "duration": 5.38
  },
  {
    "text": "Now, this is something I see a lot from the Crowder or Shapiro types.",
    "start": 1615.4,
    "duration": 3.32
  },
  {
    "text": "They make a statement, and the next point they are making to support that statement doesn't actually speak to their claim at all.",
    "start": 1618.72,
    "duration": 6.02
  },
  {
    "text": "Hitler was not pro-choice. He was pro-murdering-races-he-deemed-inferior.",
    "start": 1624.74,
    "duration": 4.92
  },
  {
    "text": "This is taken from the abstract of the cited paper:",
    "start": 1629.96,
    "duration": 2.42
  },
  {
    "text": "Putting that aside, the Nazis actually reintroduced laws penalizing abortion for Germans that had been abolished under the Weimar Republic.",
    "start": 1656.06,
    "duration": 6.58
  },
  {
    "text": "And after 1942, getting an abortion as a German was literally punishable by death.",
    "start": 1662.64,
    "duration": 5.2
  },
  {
    "text": "There was no choice involved here. Planned Parenthood today is about giving women the freedom to choose instead of the big government solution to have the state come in and dictate it.",
    "start": 1667.84,
    "duration": 8.88
  },
  {
    "text": "And their goal is not the extermination of, say, black people. Although if it was, Republicans might actually support it.",
    "start": 1676.72,
    "duration": 6.02
  },
  {
    "text": "I'm just kidding, folks. Please, don't get easily offended by my joke there.",
    "start": 1682.74,
    "duration": 3.8
  },
  {
    "text": "In a different section of the article, Crowder even compares Planned Parenthood to Josef freaking Mengele,",
    "start": 1686.54,
    "duration": 5.22
  },
  {
    "text": "the Nazi doctor who put innocent people into pressure chambers, made them drink salt water, and sewed twin children together back to back without anesthetization to see what would happen.",
    "start": 1691.76,
    "duration": 8.88
  },
  {
    "text": "You know, Germans are often stereotyped as not having a sense of humor, so maybe you guys have to help me.",
    "start": 1700.64,
    "duration": 5.64
  },
  {
    "text": "Is this some sort of post-comedy routine that Stephen Crowder is performing, or is he actually serious with this line of argumentation? Moving on.",
    "start": 1706.28,
    "duration": 7.66
  },
  {
    "text": "Take \"Jews\", switch it to the wealthy. Because the Jews were 1%. I have these numbers here. Jews in Germany made up less than 1%.",
    "start": 1714.36,
    "duration": 6.9
  },
  {
    "text": "They use that a lot. The one-percent rhetoric. Change \"Germans\" to \"working-class\".",
    "start": 1721.26,
    "duration": 5.64
  },
  {
    "text": "You have an economic version of exactly the same thing.",
    "start": 1726.9,
    "duration": 2.52
  },
  {
    "text": "So here Crowder equivocates [sic] Jews being less than 1% of the German population of the Weimar Republic in Nazi Germany with the statement that 1% of the world's population own about half of the world's wealth, and also denies the whole aspect of antisemitism.",
    "start": 1729.72,
    "duration": 13.52
  },
  {
    "text": "You know, the one thing the Nazis are most known for.",
    "start": 1743.48,
    "duration": 2.58
  },
  {
    "text": "Antisemitism was extremely prominent in Europe dating back to the Middle Ages in which Jews were collectively blamed for the death of Jesus by the Christian population.",
    "start": 1746.5,
    "duration": 8.26
  },
  {
    "text": "Rich Germans were not the ones being thrown in concentration camps just for being rich, just as much as the Jews weren't exterminated because of their financial assets.",
    "start": 1754.76,
    "duration": 8.14
  },
  {
    "text": "Okay, last point from this article and then we are done with Crowder.",
    "start": 1763.09,
    "duration": 3.65
  },
  {
    "text": "\"The police state. If you dared oppose the Nazis or Hitler politically, especially with your words, you better watch out.\"",
    "start": 1766.74,
    "duration": 6.3
  },
  {
    "text": "\"The Gestapo was on the hunt for political dissidents, many of whom would simply vanish.\"",
    "start": 1773.28,
    "duration": 4.04
  },
  {
    "text": "Okay, so far so good.",
    "start": 1777.52,
    "duration": 1.82
  },
  {
    "text": "\"Compare the Gestapo with how leftist want to jail people who do not believe in man-made climate change.\"",
    "start": 1779.34,
    "duration": 5.34
  },
  {
    "text": "\"Compare the Gestapo to the Gaystapo, who fines people who do not agree with gay marriage or the gay lifestyle. Compare the Gestapo to liberal New York, which finds you for not using the right gender pronouns.\"",
    "start": 1784.68,
    "duration": 10.74
  },
  {
    "text": "[Clears throat]",
    "start": 1795.42,
    "duration": 0.7
  },
  {
    "text": "Putting aside how out of bounds this comparison is, ask yourself: if you're living in the US is there a politician or a group of politicians who push for legislation to penalize people for not believing in man-made climate change or not agreeing to the gay lifestyle,",
    "start": 1796.12,
    "duration": 14.24
  },
  {
    "text": "whatever that's supposed to mean. And then you can ask yourself if this nonexistent legislation includes those people being snatched up by a secret police without due process and being tortured, gassed, or worked to death.",
    "start": 1810.36,
    "duration": 10.6
  },
  {
    "text": "I doubt it. And the only thing the here-mentioned New York City law does is putting intentional misgendering by landlords, employers and businesses under the umbrella of harassment. It even says it right there, if you click the link.",
    "start": 1820.96,
    "duration": 11.34
  },
  {
    "text": "\"New York City has warned landlords employers and businesses they could be running afoul of the law by purposefully calling a transgender woman 'him' or 'Mr.' when she prefers a female title and pronoun, or by barring her from using a woman's restroom.\"",
    "start": 1832.3,
    "duration": 12.26
  },
  {
    "text": "So excuse me for not seeing how this is comparable to the stuff the Gestapo did, who, by the way, literally hunted down and murdered countless LGBT people.",
    "start": 1844.56,
    "duration": 8.54
  },
  {
    "text": "Now we should have reached a point where Crowder's points are so baffling that people who actually like him will come out and say that this is all just comedy and not meant to stand up to any kind of rigor.",
    "start": 1853.1,
    "duration": 10.08
  },
  {
    "text": "To which I say: no, this is not comedy.",
    "start": 1863.18,
    "duration": 3.249
  },
  {
    "text": "While there are some elements in his article and his video that are meant to be comedic, like the word \"Gaystapo\" and such, this is a political and historical statement.",
    "start": 1866.429,
    "duration": 7.671
  },
  {
    "text": "The idea that Hitler was right-wing... no. He was a very, very emphatic liberal, big-government socialist.",
    "start": 1874.44,
    "duration": 8.68
  },
  {
    "text": "Undeniable.",
    "start": 1883.46,
    "duration": 0.76
  },
  {
    "text": "*ding*",
    "start": 1884.7,
    "duration": 1.14
  },
  {
    "text": "And even if it wasn't. Let's say nothing of this is genuine. That doesn't mean it does not have a clear political effect.",
    "start": 1887.04,
    "duration": 6.24
  },
  {
    "text": "That said, I find it very hard to believe that Crowder wrote this entire article, made the video and reiterated that opinion multiple times on Twitter, just for comedic effect.",
    "start": 1893.48,
    "duration": 8.86
  },
  {
    "text": "You could also respond that Crowder isn't trying to make the point that Hitler himself was left-wing but that the left wing of today has more in common with his politics than the right does.",
    "start": 1902.34,
    "duration": 8.32
  },
  {
    "text": "That's also not true though.",
    "start": 1910.66,
    "duration": 1.76
  },
  {
    "text": "If you made it this far through the video, good job.",
    "start": 1912.42,
    "duration": 2.7
  },
  {
    "text": "That is pretty much everything Crowder has to say about this and, in my opinion, it's quite embarrassing for him.",
    "start": 1915.12,
    "duration": 4.94
  },
  {
    "text": "Let's jump to a different argument made by the cool kids' philosopher, Ben Shapiro.",
    "start": 1920.06,
    "duration": 4.62
  },
  {
    "text": "The Nazis were of the left. The Nazis were of the left. And if you read Hitler's book, if you read \"Mein Kampf\", what you'll find is that Hitler's very heavily influenced by Marx.",
    "start": 1925.16,
    "duration": 10.62
  },
  {
    "text": "Right? The split between the National Socialists and the Communists was a split over power, not over fundamental principal.",
    "start": 1935.78,
    "duration": 5.24
  },
  {
    "text": "And the fact is that the Communists were Fascists. I mean, Stalin was a Fascist.",
    "start": 1941.02,
    "duration": 3.48
  },
  {
    "text": "I mean, fascism was a system of government that suggested that [unclear] ought to rule every aspect of life,",
    "start": 1945.1,
    "duration": 4.38
  },
  {
    "text": "and the economic system that has been traditionally attached to that is one that involves seizure of private property and redistribution of it,",
    "start": 1949.48,
    "duration": 5.62
  },
  {
    "text": "which is something that both Hitler and Stalin did.",
    "start": 1955.1,
    "duration": 4.58
  },
  {
    "text": "So there there is a high correlation between the fascist left of today and the fascist left of yesteryear.",
    "start": 1959.68,
    "duration": 6.8
  },
  {
    "text": "I don't draw a massive distinction, really, ideologically, between Nazism and Communism, because they both have the same source.",
    "start": 1966.48,
    "duration": 7.54
  },
  {
    "text": "It's just that the Nazis tended toward nationalism and the communists tended toward internationalism. This was their main conflict.",
    "start": 1974.02,
    "duration": 4.72
  },
  {
    "text": "Okay, so was Hitler influenced by Marx?",
    "start": 1979.299,
    "duration": 2.93
  },
  {
    "text": "Yes, he was. Who wasn't, really? But not in the way you might think listening to Ben Shapiro here.",
    "start": 1982.48,
    "duration": 5.0
  },
  {
    "text": "Hitler detested Marxism according to his writings and was convinced it would lead to the destruction of all life on the planet.",
    "start": 1987.7,
    "duration": 6.56
  },
  {
    "text": "Marxism and, by extension, Communism was to Hitler a Jewish weapon in the historic struggle between the Jewish and the Aryan race.",
    "start": 2026.82,
    "duration": 6.46
  },
  {
    "text": "So yes, Hitler was definitely influenced by Marx, but it doesn't support Shapiro's claim that the Nazis were left-wing.",
    "start": 2033.28,
    "duration": 5.8
  },
  {
    "text": "And also, the Nazis didn't split from the Communists, but they detested each other from the get-go because their world views vehemently were opposed to one another.",
    "start": 2039.08,
    "duration": 7.9
  },
  {
    "text": "As Lorna Waddington writes in her book \"Hitler's Crusade\":",
    "start": 2046.98,
    "duration": 2.74
  },
  {
    "text": "Kind of recycling a lot of quotes today.",
    "start": 2078.97,
    "duration": 2.0
  },
  {
    "text": "Anyway, even the anticapitalist Strasser-wing of the NSDAP was still vehemently anti-marxist for the reasons just mentioned.",
    "start": 2081.1,
    "duration": 6.559
  },
  {
    "text": "There are passages in \"Mein Kampf\" where Hitler talks about socialism, though, and even seems to support some of it.",
    "start": 2087.659,
    "duration": 4.739
  },
  {
    "text": "So how does that fit in?",
    "start": 2092.399,
    "duration": 1.351
  },
  {
    "text": "Well, Hitler knew that socialism was a very popular idea in Germany at the time, but instead of adhering to what it actually meant, he more or less constructed his own definition of the term.",
    "start": 2093.75,
    "duration": 9.27
  },
  {
    "text": "And it didn't resemble the idea of socialism that the other socialist parties in Germany had in mind.",
    "start": 2103.02,
    "duration": 4.56
  },
  {
    "text": "While using the term for political purposes, Hitler never showed interest in the actual tenets of socialism.",
    "start": 2107.58,
    "duration": 5.08
  },
  {
    "text": "This also heavily shows in how he himself uses the term. Like in one of his speeches from 1922.",
    "start": 2112.66,
    "duration": 5.34
  },
  {
    "text": "Of course, this led to some confusion, so when Hitler was pressed on what he actually meant by socialism, he responded with statements like this:",
    "start": 2134.68,
    "duration": 6.26
  },
  {
    "text": "The reason for this confusing choice of words is described by Joachim Fest in his biography about Hitler as follows:",
    "start": 2148.48,
    "duration": 5.96
  },
  {
    "text": "And as seen when we took a look at the economic system put in place by the Nazi government, they never implemented the economic implications of socialism.",
    "start": 2190.82,
    "duration": 6.46
  },
  {
    "text": "Ian Kershaw words it like this in his biography about Hitler:",
    "start": 2197.32,
    "duration": 3.5
  },
  {
    "text": "Last but not least, let's look at some promotional material of Dinesh D'Souza's new movie \"Death of a Nation\". Very Boomer-esque film poster there, by the way. Nice job.",
    "start": 2258.92,
    "duration": 9.3
  },
  {
    "text": "If you don't know who Dinesh D'Souza is:",
    "start": 2268.34,
    "duration": 1.66
  },
  {
    "text": "he's a filmmaker who frequently makes the news with takes so hot that you could almost think he got popular for talking about ethics and games journalism.",
    "start": 2270.0,
    "duration": 7.5
  },
  {
    "text": "Or he gets himself some coverage by retweeting a tweet that includes the hashtag \"Burn the Jews\".",
    "start": 2277.5,
    "duration": 5.0
  },
  {
    "text": "Let's watch.",
    "start": 2282.5,
    "duration": 1.04
  },
  {
    "text": "The very term Nazi is a compression of two words: \"Nationale\" and \"Socialista\".",
    "start": 2285.32,
    "duration": 6.72
  },
  {
    "text": "Short interruption before we get into the meat of this. The words Dinesh is trying to describe here are \"National\" and \"Sozialist\". There's no A at the end there, okay?",
    "start": 2292.62,
    "duration": 9.84
  },
  {
    "text": "At first I thought he might be referring to the Latin origin of the term, but why wouldn't he then also use the Latin origin for the word \"national\"?",
    "start": 2302.46,
    "duration": 6.58
  },
  {
    "text": "So maybe try to learn what the words actually are that you're trying to explain. Moving on.",
    "start": 2309.36,
    "duration": 5.14
  },
  {
    "text": "Check out the official Nazi platform.",
    "start": 2315.54,
    "duration": 2.86
  },
  {
    "text": "State-controlled healthcare, profit sharing for workers and large corporations, money lenders and profiteers punished by death,",
    "start": 2319.14,
    "duration": 8.86
  },
  {
    "text": "state control of education, state control of media and the press, state control of banks and industries, seizure of land without compensation, state control of religious expression.",
    "start": 2328.5,
    "duration": 12.12
  },
  {
    "text": "This reads like something jointly written by Elizabeth Warren and Bernie Sanders.",
    "start": 2340.62,
    "duration": 5.04
  },
  {
    "text": "Read the Nazi platform at the Democratic National Convention and most likely it would provoke thunderous applause.",
    "start": 2345.66,
    "duration": 6.7
  },
  {
    "text": "Death of a Nation.",
    "start": 2353.24,
    "duration": 1.2
  },
  {
    "text": "So most of these points I have already addressed, but it allows me to showcase something very important, because I myself have a hard time believing that Bernie Sanders, who is Jewish, would ever include a political demand like \"Jews cannot be citizens\" in his platform, or railing against the Treaty of Versailles.",
    "start": 2354.56,
    "duration": 15.48
  },
  {
    "text": "Putting aside that D'Souza misrepresents almost every point he mentions and doesn't give historical context, it's illustrative of how these people come to their conclusions.",
    "start": 2370.04,
    "duration": 8.02
  },
  {
    "text": "They have a goal, which is to paint the Nazis as left-wing, not even considering or maybe caring about that their previous assumption might be incorrect.",
    "start": 2378.06,
    "duration": 7.44
  },
  {
    "text": "If I'm being honest, the video you're currently watching could also have been only 30 seconds long.",
    "start": 2385.5,
    "duration": 4.72
  },
  {
    "text": "What are some things about the Nazis that everyone can agree on?",
    "start": 2390.22,
    "duration": 3.12
  },
  {
    "text": "They were strongly antisemitic, anti-Marxist, extremely nationalistic, and favored expansion.",
    "start": 2393.36,
    "duration": 5.48
  },
  {
    "text": "All undeniably positions of the German right from the time of the monarchy till 1945.",
    "start": 2398.84,
    "duration": 5.44
  },
  {
    "text": "And then you have Steven Crowder bursting through the door saying how left-wingers in 21st-century America support the penalizing of harassment towards trans people. \"It's cringey\" is all I can really respond to that.",
    "start": 2404.28,
    "duration": 10.74
  },
  {
    "text": "And if you're a conservative, I almost feel bad for you for having these people as some of your main representatives.",
    "start": 2415.02,
    "duration": 6.04
  },
  {
    "text": "Now, why do I dislike this debate so much? Well, the way it's had just seems pointless to me.",
    "start": 2421.06,
    "duration": 5.22
  },
  {
    "text": "\"Left-wing\" and \"right-wing\" mean different things across countries and time periods. And to compare decade-old systems to our local, modern understanding of those terms like Socialism doesn't provide anything to further our knowledge of either Socialism or the third Reich.",
    "start": 2426.28,
    "duration": 14.76
  },
  {
    "text": "It's nothing but a political exercise.",
    "start": 2441.04,
    "duration": 2.02
  },
  {
    "text": "This is also the reason I picked Steven Crowder for this video.",
    "start": 2443.06,
    "duration": 3.18
  },
  {
    "text": "How far do you have to be out there, and desperate to paint everything bad as left-wing",
    "start": 2446.24,
    "duration": 4.74
  },
  {
    "text": "to claim Nazi Germany was a democracy so that you can somehow vaguely connect it to Bernie Sanders-style social democracy?",
    "start": 2450.98,
    "duration": 6.84
  },
  {
    "text": "It's comical! In the context of German politics at the time the Nazis existed, they were undeniably a far-right extremist movement.",
    "start": 2457.82,
    "duration": 7.96
  },
  {
    "text": "What the Crowder and Shapiro types are doing is taking this out of its historical context and pressing it into their understanding of \"If the government does stuff, it's left-wing. If it doesn't, it's right-wing.\" But what does that actually do?",
    "start": 2465.78,
    "duration": 11.86
  },
  {
    "text": "And even if I wouldn't have gone through each of Crowder's arguments, explaining how a comparison like this is bound to fail from the get-go is enough to invalidate the entire claim.",
    "start": 2477.64,
    "duration": 9.16
  },
  {
    "text": "It's lazy demagoguery that only serves scoring cheap political points.",
    "start": 2486.8,
    "duration": 3.76
  },
  {
    "text": "We'll give Ben Shapiro an A for effort though, because he kind of acknowledges this nuance in a Quora post from last year, although he then goes on to abandon it completely.",
    "start": 2490.56,
    "duration": 8.08
  },
  {
    "text": "So, either Steven Crowder, Ben Shapiro, and Dinesh D'Souza are actually genuine in this belief, or this is just an act to further their political agenda.",
    "start": 2498.64,
    "duration": 7.0
  },
  {
    "text": "You can decide for yourself which one is worse.",
    "start": 2505.64,
    "duration": 3.72
  },
  {
    "text": "And that's probably a good time to end this video. Thanks for watching this episode of Steven Crowder is a Fraud: Change my Mind.",
    "start": 2509.36,
    "duration": 7.38
  },
  {
    "text": "I haven't been convinced though.",
    "start": 2516.74,
    "duration": 1.26
  },
  {
    "text": "This probably felt a bit like shooting fish in a barrel, but I had to address it eventually.",
    "start": 2518.0,
    "duration": 4.26
  },
  {
    "text": "Everyone watching this right now should also definitely check out the video of a YouTuber called Kaiser Williams",
    "start": 2522.26,
    "duration": 5.26
  },
  {
    "text": "which goes into a lot more detail regarding German politics.",
    "start": 2527.55,
    "duration": 3.29
  },
  {
    "text": "Link is in the description. As always, thank you very much to all of my patrons.",
    "start": 2530.84,
    "duration": 3.88
  },
  {
    "text": "I'm not joking when I say that you really keep this channel going.",
    "start": 2534.72,
    "duration": 2.62
  },
  {
    "text": "And if you would like to be honored in a similar manner, the link is in the description.",
    "start": 2537.34,
    "duration": 3.44
  },
  {
    "text": "Currently, all my videos are ad-free and I would love to keep it that way.",
    "start": 2540.78,
    "duration": 3.34
  },
  {
    "text": "Also, I have to apologize for being bad at sorting my sources in the past.",
    "start": 2544.12,
    "duration": 3.78
  },
  {
    "text": "Usually, I just copy everything in there, but now I've structured them a bit more to make it easier for you to find the relevant information.",
    "start": 2547.9,
    "duration": 5.9
  },
  {
    "text": "I think that's all I have for now.",
    "start": 2553.8,
    "duration": 1.74
  },
  {
    "text": "Hit me up on Twitter or Curious Cat if you would like to ask a question.",
    "start": 2555.54,
    "duration": 3.08
  },
  {
    "text": "And I hope to see you next time. Have a good one.",
    "start": 2558.62,
    "duration": 3.36
  }
]