[
  {
    "id": "Ugy9Y57KgATg6goqjJ14AaABAg",
    "author": "@MTanks24",
    "author_channel_id": "UCuF4RCiy8nFV29WYdKyOhDg",
    "text": "Great interview 👍👍keep striving comrades, all the hard work pays off 💪💪",
    "like_count": 20,
    "published_at": "2024-08-11T23:50:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyPBZWmyv_MU_9Nf6p4AaABAg",
    "author": "@theeredhorde",
    "author_channel_id": "UClaTXBxrCwcDraq34P4UTKA",
    "text": "Such a great video. Had no idea Carlos was vegan, very cool. Solidarity from WA✊",
    "like_count": 1,
    "published_at": "2025-03-26T07:18:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyrJogdZUYXlgMVDHt4AaABAg",
    "author": "@s.m975",
    "author_channel_id": "UCW0uexv7k9j7R60ttz6B_sA",
    "text": "Eddie❤❤",
    "like_count": 18,
    "published_at": "2024-08-11T23:08:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzqB7VZKrJfnGFOFpt4AaABAg",
    "author": "@moviemakerjo6756",
    "author_channel_id": "UCsKpmJ-fBtHjh_n2nueAX8A",
    "text": "9:22...every mouth full, every back clothed and every person housed....rule of the proloteriat! not only billionaires..🎉🎉",
    "like_count": 13,
    "published_at": "2024-08-12T00:39:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxG8lxTdu3XzciC8il4AaABAg",
    "author": "@gabagool44",
    "author_channel_id": "UC9go_7Z7aedf95fF59xohxQ",
    "text": "Great conversation. As a long time subscriber to MWM I’ve learned so damn much, but I’ve still had similar concerns as the fella on the left third of the screen. Specifically the bigotry he mentioned. It’s nice to hear 2 communists talking & clarifying some of it rather than a communist talking to a “leftist”/liberal because then it gets sidetracked fast into basic Marxist concepts. Hearing it elaborated on a little bit more would be nice, maybe in a future convo with these 2!",
    "like_count": 8,
    "published_at": "2024-08-12T17:51:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgynYB0j5SYxPb-gIxt4AaABAg",
    "author": "@stevenmichaelpalazzolo3503",
    "author_channel_id": "UC3Y99-TgQ8gj8wdpY_IbHew",
    "text": "great talk… who are these two guys?  i like them",
    "like_count": 7,
    "published_at": "2024-08-12T02:33:26Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzUWLyPrsWPgTB9y5d4AaABAg",
    "author": "@homieslice1996",
    "author_channel_id": "UCUXBvxugRT6aQw3ZZcTAs1g",
    "text": "A party airsoft team could be cool — it is a good sport to build comradirie.",
    "like_count": 8,
    "published_at": "2024-08-12T00:49:02Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgzUWLyPrsWPgTB9y5d4AaABAg.A70j11fZK_FA71nS7IwdLI",
        "author": "@nlsdrf1290",
        "text": "🤣🤣🤣🤓",
        "like_count": 3,
        "published_at": "2024-08-12T10:46:56Z",
        "is_reply": true
      },
      {
        "id": "UgzUWLyPrsWPgTB9y5d4AaABAg.A70j11fZK_FA72WGmOf-VX",
        "author": "@DMGrass-gb9kg",
        "text": "I honestly like the idea",
        "like_count": 1,
        "published_at": "2024-08-12T17:27:20Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzFNQVNJ_aMURg39V94AaABAg",
    "author": "@ulyanov17",
    "author_channel_id": "UCNAzsNIVrkHYn-Wan6-NRqA",
    "text": "it s hillarious to hear americans pronounce Gramsci as \"Gromsky\" 😂 it sounds soo polish",
    "like_count": 7,
    "published_at": "2024-08-12T22:04:16Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzFNQVNJ_aMURg39V94AaABAg.A73-y9Vc_pqA8LV8ShCKHL",
        "author": "@sacamain0",
        "text": "Fyi, it should sound like \"grumshy\"",
        "like_count": 0,
        "published_at": "2024-09-13T22:54:26Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyFVtyv7QCuO6_QpFZ4AaABAg",
    "author": "@gabagool44",
    "author_channel_id": "UC9go_7Z7aedf95fF59xohxQ",
    "text": "46:15 LMFAO CAULIFLOWER THAT HOLE\nThat shit had me dead",
    "like_count": 3,
    "published_at": "2024-08-12T17:26:31Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgyFVtyv7QCuO6_QpFZ4AaABAg.A72WAjpsq9nA732i0TlzWe",
        "author": "@HR-News-Channel",
        "text": "I will i swear...",
        "like_count": 2,
        "published_at": "2024-08-12T22:28:17Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgySB69gr4Xi26hyS2Z4AaABAg",
    "author": "@numbersix8919",
    "author_channel_id": "UCSg0yRT9cP1grJH6LwRnZ9A",
    "text": "Good talk MM, represented well.  Forward.",
    "like_count": 1,
    "published_at": "2024-08-28T02:53:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz2Fp2G65wSP0eFjS94AaABAg",
    "author": "@JaceHart33",
    "author_channel_id": "UC98AvwGTiOEvib3lO0mwAZA",
    "text": "Great informative interview.",
    "like_count": 2,
    "published_at": "2024-08-12T13:47:36Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxXVDlFGGq9K5KX9il4AaABAg",
    "author": "@Glumclam",
    "author_channel_id": "UCNqnIVnQxty2k-MUAWXD99w",
    "text": "I’m all for communism and communism with American characteristics even communism with Chinese characteristics but wtf is this maga communism stuff? It don’t fly. Now maybe you can teach them, but I tried teaching that type my whole work life for over 40 years but they won’t teach.",
    "like_count": 29,
    "published_at": "2024-08-11T23:16:05Z",
    "is_reply": false,
    "reply_count": 16,
    "replies": [
      {
        "id": "UgxXVDlFGGq9K5KX9il4AaABAg.A70ZOAhN6nEA70_1pKg2zP",
        "author": "@alexjeffrey3981",
        "text": "it's an attempt to recapture what is essentially a radical working class and petit-bourgeois movement away from reaction.",
        "like_count": 23,
        "published_at": "2024-08-11T23:21:46Z",
        "is_reply": true
      },
      {
        "id": "UgxXVDlFGGq9K5KX9il4AaABAg.A70ZOAhN6nEA70sHaCJJUc",
        "author": "@CamaradaCJ",
        "text": "Maga communism isn’t an ideology it was just a meme and Feds slandered it into a whole other thing.",
        "like_count": 1,
        "published_at": "2024-08-12T02:09:56Z",
        "is_reply": true
      },
      {
        "id": "UgxXVDlFGGq9K5KX9il4AaABAg.A70ZOAhN6nEA70sPThv8d7",
        "author": "@CamaradaCJ",
        "text": "All maga communism is was a slogan we made as a joke to catch the attention of working class conservatives to teach them the truth about communism to make America great. It never had anything to do with trump or conservatism.",
        "like_count": 2,
        "published_at": "2024-08-12T02:11:01Z",
        "is_reply": true
      },
      {
        "id": "UgxXVDlFGGq9K5KX9il4AaABAg.A70ZOAhN6nEA7176m5qkF3",
        "author": "@matthewkopp2391",
        "text": "Consider the fact that Trump got the worker cooperative industry vote of Wisconsin. Wisconsin who voted for Ralph Nadar in large numbers and has a very long history supporting socialists.\n\nHillary Clinton gave them nothing to vote for.\n\nReaching out to MAGA is important.",
        "like_count": 13,
        "published_at": "2024-08-12T04:28:16Z",
        "is_reply": true
      },
      {
        "id": "UgxXVDlFGGq9K5KX9il4AaABAg.A70ZOAhN6nEA717aigoEVb",
        "author": "@antediluvianatheist5262",
        "text": "MAGA Communism isn’t about supporting republicans or Donald Trump or their policies. It’s a concept that focuses on the idea that MAGA is a popular working class movement and therefore it is a Communist’s duty to try to co-opt it. Historically, successful communist movements have always required the backing of the working class, and so we cannot just write off a large section of the working class—even if we may not agree on every social position.\r\n\r[From Above]",
        "like_count": 14,
        "published_at": "2024-08-12T04:32:30Z",
        "is_reply": true
      },
      {
        "id": "UgxXVDlFGGq9K5KX9il4AaABAg.A70ZOAhN6nEA71HpaZ4RVc",
        "author": "@demonic.lionfish",
        "text": "What does MAGA stand for? Like the acronym, literally. Make America great again. What is the goal of any national communist movement if not to make that nation great?",
        "like_count": 0,
        "published_at": "2024-08-12T06:01:55Z",
        "is_reply": true
      },
      {
        "id": "UgxXVDlFGGq9K5KX9il4AaABAg.A70ZOAhN6nEA71LpDbfeJe",
        "author": "@mulligas",
        "text": "@matthewkopp2391 Even if some Nader voters vote for Trump as a protest, that doesn't make them MAGA.",
        "like_count": 3,
        "published_at": "2024-08-12T06:36:49Z",
        "is_reply": true
      },
      {
        "id": "UgxXVDlFGGq9K5KX9il4AaABAg.A70ZOAhN6nEA71TqYVLsjv",
        "author": "@mimosveta",
        "text": "it makes perfect sense. majority of trump supporters are working class people, and if you listen to them speak, what THEY expect trump to do, they are all already at least 60% communist. they just need a little nudge",
        "like_count": 4,
        "published_at": "2024-08-12T07:46:54Z",
        "is_reply": true
      },
      {
        "id": "UgxXVDlFGGq9K5KX9il4AaABAg.A70ZOAhN6nEA71iY0und2Q",
        "author": "@Glumclam",
        "text": "@demonic.lionfishnow you’re getting to the heart of the problem, National Socialism. I get the charity begins at home but you can carry the nationalism too far sometimes and that’s what I worry about.",
        "like_count": 4,
        "published_at": "2024-08-12T10:04:03Z",
        "is_reply": true
      },
      {
        "id": "UgxXVDlFGGq9K5KX9il4AaABAg.A70ZOAhN6nEA72ZsdeAa81",
        "author": "@JM57-99",
        "text": "@Glumclam History shows that a more nationalistic focus (as opposed to an internationalist one) to socialism makes the project more successful. Definitely not as a n*zi dogwhistle tho. That being said, it is necessary to build off from your culture and history if you want to create lasting change. Communism can only fight power with power, state power (ie the power of the nation).\n\nN*zis gained support because they claimed to represent working class interests, communists need to win that audience back with the right message.\n\nAmerican \"leftists\" generally understand that they need to reach out to liberals and appeal to them to convert them, but apparently they struggle to apply that same principle with conservatives.",
        "like_count": 0,
        "published_at": "2024-08-12T17:58:51Z",
        "is_reply": true
      },
      {
        "id": "UgxXVDlFGGq9K5KX9il4AaABAg.A70ZOAhN6nEA72gH7YuNFq",
        "author": "@Glumclam",
        "text": "@JM57-99I understand the differences but worry the proletariat will get confused. I’m impressed with the MWM crew and hope they keep their eyes on the prize.",
        "like_count": 1,
        "published_at": "2024-08-12T19:03:30Z",
        "is_reply": true
      },
      {
        "id": "UgxXVDlFGGq9K5KX9il4AaABAg.A70ZOAhN6nEA73bcPWeDqh",
        "author": "@CamaradaCJ",
        "text": "@Glumclam national socialism is liberalism it was never communism or socialism in its national or civilizational characteristic. So “nationalism” mixed with communism does not = natsoc Nazis… Nazis are merely Neo liberals who want to violently expand and rely on their war machine. Guys like Hitler would never say things that we say that appeal to American workers and he absolutely hated actual communists/socialists.",
        "like_count": 0,
        "published_at": "2024-08-13T03:42:06Z",
        "is_reply": true
      },
      {
        "id": "UgxXVDlFGGq9K5KX9il4AaABAg.A70ZOAhN6nEA75UgdKURG3",
        "author": "@Glumclam",
        "text": "Sorry the National socialists are not liberals, the NSs are nationalists who put the state above all else. Neoliberals put corporations above all else and original liberals were egalitarian.",
        "like_count": 0,
        "published_at": "2024-08-13T21:11:15Z",
        "is_reply": true
      },
      {
        "id": "UgxXVDlFGGq9K5KX9il4AaABAg.A70ZOAhN6nEA7Z643jpWoj",
        "author": "@seekingabsolution1907",
        "text": "​@antediluvianatheist5262nope. Maga communism abandons core communist principles to appeal to reactionary politics. It's not educating them out of their reactionary beliefs. It's tailism.",
        "like_count": 1,
        "published_at": "2024-08-25T09:13:21Z",
        "is_reply": true
      },
      {
        "id": "UgxXVDlFGGq9K5KX9il4AaABAg.A70ZOAhN6nEA7ZAMuuzmKS",
        "author": "@seekingabsolution1907",
        "text": "​@mimosvetathe majority of Trump supporters are petty bourgeois, with some serious money to throw around.",
        "like_count": 1,
        "published_at": "2024-08-25T09:50:52Z",
        "is_reply": true
      },
      {
        "id": "UgxXVDlFGGq9K5KX9il4AaABAg.A70ZOAhN6nEA7ZAqmZcok_",
        "author": "@seekingabsolution1907",
        "text": "​@antediluvianatheist5262dude, I thought you knew better than this, trying to coopt a far right movement by uniting with it doesn't work. It just makes you unwitting tools of fascists. Look at the strasserites, the economically left wing members of the nazi party who let their anti-semitism lure them into joining a fascist movement. They got murdered in the night of long knives. Any engaging with the working class supporters of Trump must involve bringing them out of MAGA not being pulled in ourselves.",
        "like_count": 1,
        "published_at": "2024-08-25T09:55:05Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugz3CWuAPVbFiFjUhoB4AaABAg",
    "author": "@RadicalJudgments",
    "author_channel_id": "UCfsAxf4kr0K_7eCWyK9Psow",
    "text": "5:47 me too brother. Me too 😢",
    "like_count": 0,
    "published_at": "2024-08-14T22:32:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyKMyO6NCihByQm1Ot4AaABAg",
    "author": "@edwardallan197",
    "author_channel_id": "UCUFk8VvvW9dyC1iB1YvM3iw",
    "text": "ACP will only look impossible UNTIL IT DOES NOT! ❤",
    "like_count": 3,
    "published_at": "2024-08-13T18:10:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyeXhmG8lkcMPwkdK14AaABAg",
    "author": "@rsavage-r2v",
    "author_channel_id": "UCcwVTyyclHKMZUGuHmRuxrw",
    "text": "I've been very skeptical, and I had a strongly negative view of Haz and Hinkle, but I agree with everything Eddie says here. I think the party would do well to pay special attention to its line on human reproduction and the feudal character of the family. In the streams that I've watched, everybody at MWM embraces an \"anti-woke\" rhetoric that makes them sound like they're tailing the Jordan Peterson far-Right, but in this discussion Eddie makes it clear that he knows the theory and has a correct materialist view. I think the way you talk about this could make a big difference.",
    "like_count": 8,
    "published_at": "2024-08-13T15:20:52Z",
    "is_reply": false,
    "reply_count": 14,
    "replies": [
      {
        "id": "UgyeXhmG8lkcMPwkdK14AaABAg.A74raIr-3UdA7CPEDIXkOe",
        "author": "@Lawns-Are-Fun",
        "text": "Have you ever seen Anthony Q Omene talk on a channel like RBN or Twitter? I used to be a little skeptical of Haz, but Omene talks to him like once a month and has said some very interesting positive things—and this is after they had a heated 5 hour debate. I could find the YouTube if you’re interested.",
        "like_count": 0,
        "published_at": "2024-08-16T13:38:13Z",
        "is_reply": true
      },
      {
        "id": "UgyeXhmG8lkcMPwkdK14AaABAg.A74raIr-3UdA7CUfUZJGU3",
        "author": "@rsavage-r2v",
        "text": "@Lawns-Are-Fun I found the stream where they're talking about the trucker protests. Is there a particular discussion you'd recommend?",
        "like_count": 0,
        "published_at": "2024-08-16T14:25:46Z",
        "is_reply": true
      },
      {
        "id": "UgyeXhmG8lkcMPwkdK14AaABAg.A74raIr-3UdA7Kq_uL6M6i",
        "author": "@Lawns-Are-Fun",
        "text": "@rsavage-r2vNo that stream is a slog lol. I’ll send you the one where Q talks about Haz like a year later. Q also admits he was wrong about the truckers and Haz was right:\n\nEdit see below-go to the 1hr 29 minute mark. It’s from 4 months ago. There’s another one of just them two months after that trucker argument that also shows how chill they’ve become but it’s hard to find. \n\n\nhttps://www.youtube.com/live/5tJ8KtJu6Bg?si=dsRDpW6amBG1c0ot",
        "like_count": 1,
        "published_at": "2024-08-19T20:19:55Z",
        "is_reply": true
      },
      {
        "id": "UgyeXhmG8lkcMPwkdK14AaABAg.A74raIr-3UdA7Kzr6jc_TJ",
        "author": "@rsavage-r2v",
        "text": "@Lawns-Are-Fun Wow thanks for digging that up for me.\n\nI see Nick is making the same mistake that a lot of the online ML community is doing, imagining that \"Social Issues\" somehow exist outside the material sphere. But I'm mostly with them here. I forget that Haz and Hinkle are in their 20s. They've come a long way, and if they're willing to be civil and put in the work I'll definitely give them a chance.",
        "like_count": 1,
        "published_at": "2024-08-19T21:40:54Z",
        "is_reply": true
      },
      {
        "id": "UgyeXhmG8lkcMPwkdK14AaABAg.A74raIr-3UdA7LvvPQW0Od",
        "author": "@Lawns-Are-Fun",
        "text": "@rsavage-r2vYeah there’s another one I mentioned—I wish I could find it—where Q calls in to Haz’s stream and Q, being the older wiser dude pushes Haz to like let this edgy trolly stuff go because Q can recognize Haz was young but a very well read bright dude. It was kind of interesting because Haz kind of admits part of the reason he acts this way is because he’s so so tired of any time he’s focusing on international issues, philosophy, or theory, someone drags him down into the culture war social muck for like not saying the exact right new word out of academia or doing leftist signal hedging (stuff like where you’re trying to talk about one thing but you have to say “and of course I’m not saying republican politicians are good but we shouldn’t give up on the working class MAGA voters”)—and he basically says something along the lines to Q of “You know I used to be more careful and PC and really sensitive, but it was never good enough and I’m just tired of dealing with these banal topics and arguments with pseudo-leftists so I just do this to weed out people who are otherwise not serious.” Not sure it was the best idea strategically, but interestingly I think Q conversely lost more and more patience with the pseudo left himself and is also extremely tired of having to pander/signal to them when he wants to talk about real stuff and just be honest. I think you can see it in that clip I shared with you. Q says Haz is like me and is tired of wasting time with people.",
        "like_count": 1,
        "published_at": "2024-08-20T06:25:47Z",
        "is_reply": true
      },
      {
        "id": "UgyeXhmG8lkcMPwkdK14AaABAg.A74raIr-3UdA7LwiF7Z-Gg",
        "author": "@Lawns-Are-Fun",
        "text": "@rsavage-r2vand look on Jackson, I haven’t seen nearly as much of him as Haz, but here’s my cautiously optimistic take on him. \n\nI get he’s not perfect, but if he wanted he could be MUCH MUCH bigger and making way more money being a Dave Reuben “I was on the left now I’m a right wing republican” guy or a “I was a commie but we’ve gotta get serious and vote blue” guy. Both of these options would be far more lucrative and avoid threats like he just faced in Venezuela. So for me, for now, I’m gonna see how it goes. Maybe he disappoints me and makes me look naive but you know , I’m in my mid 30s and I don’t wanna spend my whole life afraid to look foolish or naive because I hoped something could work. Otherwise you’re just a nihilistic doomer and at that point, why even care? So I’m going to have the courage to maybe look stupid and maybe get fooled. Oh well, could be worse 🤷‍♂️.",
        "like_count": 2,
        "published_at": "2024-08-20T06:32:43Z",
        "is_reply": true
      },
      {
        "id": "UgyeXhmG8lkcMPwkdK14AaABAg.A74raIr-3UdA7YQB_DaxNk",
        "author": "@aesop1451",
        "text": "Communists are uniquely positioned to take advantage of the situation. Trump exposed the uniparty (Bush, McCain, and Romney hate him). But he is ignorant or unwilling to defeat the Deep State. So Trumpers have a high amount of distrust of mainstream media. Unfortunately they do not have the most coherent worldview (they support  billionaires that want to microchip your brain).",
        "like_count": 0,
        "published_at": "2024-08-25T02:49:54Z",
        "is_reply": true
      },
      {
        "id": "UgyeXhmG8lkcMPwkdK14AaABAg.A74raIr-3UdA7fA0UV4p25",
        "author": "@numbersix8919",
        "text": "Mild correction, the feudal form of the family is what we today call the \"extended\" family or multi-generational family.  It was a supportive institution under feudalism, and would still be under capitalism, in place of the so-called \"nuclear family\" which is alienating and creates market dependency.  Only with socialism will people be free to choose the kind of family that suits their development as individuals.",
        "like_count": 1,
        "published_at": "2024-08-28T03:02:30Z",
        "is_reply": true
      },
      {
        "id": "UgyeXhmG8lkcMPwkdK14AaABAg.A74raIr-3UdA7gQGRgl6s4",
        "author": "@rsavage-r2v",
        "text": "@numbersix8919 Yes but don't forget the extraction of surplus labor from women, and their role as \"privately owned means of production\" who are used to keep birth rates high to ensure competitiveness in an agrarian society.\n\nThis is what liberals refer to as \"heteropatriarchy\" -- the enslavement of women and the violent repression of all behaviors or genetic traits that detract from maximum human reproduction.\n\nI do think it's accurate to point to the supportive function of the extended family, especially in underdeveloped societies where domestic goods and services have yet to be commodified. This is why peasants and workers in periphery societies (even socialist ones) tend to be \"socially conservative\". They depend on their cousins etc to mend clothes and roofs, to produce cooked food under primitive conditions. This is why I agree to a large extent with the position taken by MWM that we shouldn't take what is effectively a utopian/adventurist line on human reproduction when the poorest Americans still very much rely on the domestic economy of the extended family.\n\nI just mean that I think we need to be very clear about how we analyze this issue and very careful about how we articulate it.\n\nAnd yes, I think what Eddie is very clearly alluding to is that \"Abolish the Family\" per Engels means \"Abolish the family as a competitive economic unit,\" not that in an enlightened communist society everyone will be poly or whatever.",
        "like_count": 0,
        "published_at": "2024-08-28T14:43:43Z",
        "is_reply": true
      },
      {
        "id": "UgyeXhmG8lkcMPwkdK14AaABAg.A74raIr-3UdA7gQzkE4amq",
        "author": "@rsavage-r2v",
        "text": "@numbersix8919 I highly recommend Paul Cockshott's \"How the World Works\". It has a whole chapter on the emergence of state society, including the mechanism of \"stealing brides\" in neolithic cultures to fortify birth rates, and the extraction of surplus labor from women. He also has at least one talk on his channel where he roughly quantifies the work done by women in medieval/early modern times (using joules or some appropriate unit I believe) and argues that between cooking, child-rearing and hauling water/fuel they were objectively doing more work.",
        "like_count": 2,
        "published_at": "2024-08-28T14:50:03Z",
        "is_reply": true
      },
      {
        "id": "UgyeXhmG8lkcMPwkdK14AaABAg.A74raIr-3UdA7gRM6pznG1",
        "author": "@rsavage-r2v",
        "text": "@Lawns-Are-Fun There's a recent video on S4A citing some old gems from Hinkle and Haz which, unless they have very much learned and moved beyond their radically incorrect and reactionary ideas, would totally invalidate anything else they have to say and the ACP by extension. I do hope these represent an earlier stage in their ideological development.\n\nHaz seems to be saying that the ACP is some kind of trot/larouchite-style ponzi scheme. I really hope his comments can be shown to be inaccurate and unrepresentative. Bro, the Communist Party of China is not a \"decentralized business made up of entrepreneurs and 'ethical landlords.' \" I.e. an MLM (and not the kind with ultraleft guerillas).",
        "like_count": 0,
        "published_at": "2024-08-28T14:53:14Z",
        "is_reply": true
      },
      {
        "id": "UgyeXhmG8lkcMPwkdK14AaABAg.A74raIr-3UdA7gdkjbg6SZ",
        "author": "@numbersix8919",
        "text": "@rsavage-r2v OK.  What's your point?  Seems like you're trying to make a point.  Out with it then, don't be shy.",
        "like_count": 0,
        "published_at": "2024-08-28T16:50:20Z",
        "is_reply": true
      },
      {
        "id": "UgyeXhmG8lkcMPwkdK14AaABAg.A74raIr-3UdA7gg2HjxMP0",
        "author": "@rsavage-r2v",
        "text": "@numbersix8919 MWM and other \"Patriotic Socialists\" use right-tailist rhetoric (\"anti-woke\", hostility toward people who use \"pronouns\" etc.) and make incorrect statements asserting that \"cultural issues\" are somehow outside the material realm, but I know that some of the key people such as Liger are actually familiar with the relevant materialist analysis. I'm saying that anyone attempting to court the right-populist working class demographic should be very careful about how they approach these issues because there's a narrow path between alienating a working class that is dependent on feudal social forms versus embracing real reactionary hatred.\n\nFor example, liberals want to lowkey bomb Uganda to save the gay people because they are idealists and they consider that part of their White Man's Burden. Marxists know better, that conditions for gay people will improve when their society moves beyond semifeudal agrarian production. In the same sense, marxists should understand that leading with \"Abolish The Family\" in the rust belt is a bad idea, but we should understand it for materialist reasons, not because \"Well Actually Communists Are Socially Conservative.\" Because we're not. Communists have always been ahead of their respective societies on issues related to sex and the family.",
        "like_count": 0,
        "published_at": "2024-08-28T17:10:20Z",
        "is_reply": true
      },
      {
        "id": "UgyeXhmG8lkcMPwkdK14AaABAg.A74raIr-3UdA7gr-YBMxZ7",
        "author": "@numbersix8919",
        "text": "@rsavage-r2v  Thanks for your answer.  There are 3 key points to keep in mind concerning the co-option (recuperation) and betrayal of the trans rights movement by bourgeois mass culture.  Senationalizing trans people and their aspirations and aggressively promoting them to a public without proper education and preparation is actually intended to make it unpopular, distasteful, and even in fact objectionable.  I'm sure many trans people feel this as well.  At the same time, making it a cause celebre and identifying it with progressive politics 1) again distances left politics from class issues 2) divides would-be leftists from actual leftists, and 3) sets the polis at war with itself over another \"wedge issue\" or \"social\" issue that has little place in politics once the freedoms of individuals and protection for people identified as members of an oppressed minority group are constutionally assured.  This has been going on since the Reagan era and the Moral Majority, leading to the present where the only permissible political discourse is devised specifically to eliminate any chance at class solidarity and split the Left.\nThe CPGB-ML's Jodi Brar has an orthodox Marxist take on the problem.  It's on YT, and I suggest you listen to it and see where you disagree.",
        "like_count": 1,
        "published_at": "2024-08-28T18:46:05Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwUVHVBfh_LXCUSh9R4AaABAg",
    "author": "@sacamain0",
    "author_channel_id": "UCTJuZpBlCJuVBJrWnfIcciQ",
    "text": "Genuine question: what about the PSL? They seem great, maybe you can join forces 😍🔥",
    "like_count": 2,
    "published_at": "2024-09-13T22:08:31Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyDmvAn_TCgQvvcgwF4AaABAg",
    "author": "@SannonPwine",
    "author_channel_id": "UCdVj9lVXuPRVWEZkbqBUa0Q",
    "text": "Eddie isvxtra special",
    "like_count": 2,
    "published_at": "2024-08-12T03:58:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyUd9nnEWhxjxucA3h4AaABAg",
    "author": "@mat_j",
    "author_channel_id": "UCeF9wwJNNujpVSQ8sR3oCiA",
    "text": "lol.Who's Antonio Gromsky? I know Antonio Gramsci",
    "like_count": 7,
    "published_at": "2024-08-12T01:10:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyw_A3QKjqGXE0MN-Z4AaABAg",
    "author": "@payton7920",
    "author_channel_id": "UC9a4kG8dHfjw6oLkAIu596g",
    "text": "Everything Eddie says is correct as always",
    "like_count": 0,
    "published_at": "2024-08-13T03:29:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwax0hRjKCvLk_Oq3N4AaABAg",
    "author": "@NorthernMarx1934",
    "author_channel_id": "UCOVunyLQajzkdGro0fnrEWQ",
    "text": "The people we should be trying to reach are not \"people who show up to protests\", but yes MWM is aware of what is up on this.",
    "like_count": 0,
    "published_at": "2024-08-14T17:14:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzop0Zye8YVxI_Ede14AaABAg",
    "author": "@Comrade_Broski",
    "author_channel_id": "UCnY-q7mpJzuZ6eazWwz69Aw",
    "text": "Castro wasn't saying for people to embrace the literal symbols of a fascist, imperialist nation. He wouldn't tell German socialists to wave the nazi flag during the Nazi government's reign. He was talking about being patriotic for socialist nations, not imperialist nations. 🤦🏻‍♂️",
    "like_count": 14,
    "published_at": "2024-08-13T01:36:58Z",
    "is_reply": false,
    "reply_count": 6,
    "replies": [
      {
        "id": "Ugzop0Zye8YVxI_Ede14AaABAg.A73OIsgvVAQA75JLO2wBlT",
        "author": "@G_Moneyyyy",
        "text": "Castro waved the flag of the people who colonized Cuba before, during, and after the revolution",
        "like_count": 0,
        "published_at": "2024-08-13T19:32:06Z",
        "is_reply": true
      },
      {
        "id": "Ugzop0Zye8YVxI_Ede14AaABAg.A73OIsgvVAQA7HWrg2KzTr",
        "author": "@hmt4173",
        "text": "What tf are you talking about? Is cuba flying the taino flag? Or are certain nations inherently fascist and therefore hopeless?",
        "like_count": 0,
        "published_at": "2024-08-18T13:21:07Z",
        "is_reply": true
      },
      {
        "id": "Ugzop0Zye8YVxI_Ede14AaABAg.A73OIsgvVAQA7Kmy1YYqap",
        "author": "@khrachvikkhrachvik7049",
        "text": "This is untrue. My friend, please don’t assume things you don’t know about. \n\nFidel Castro used the same flag that the Batista regime used. She encouraged American radicals to do the same, to not allow the ruling class ownership over us or the symbols that are by rights ours and not theirs, as it is the proletariat that is the essential content of what makes up a country.",
        "like_count": 0,
        "published_at": "2024-08-19T19:48:15Z",
        "is_reply": true
      },
      {
        "id": "Ugzop0Zye8YVxI_Ede14AaABAg.A73OIsgvVAQA7ZBUPkU4Ym",
        "author": "@seekingabsolution1907",
        "text": "​@khrachvikkhrachvik7049the US is actively engaged in the displacement, oppression and genocide of indigenous peoples whose land it stole. It is a prison of nations to its very core. Its symbols cannot be reclaimed and it cannot be redeemed whilst this remains the case. You expect palestinian communists to work with zionists flying the Israeli flag do you? Did the Bolsheviks maintain the flag of the Tsars? No, Lenin set the oppressed nations of the Russian empire free. Created new symbols in place of the old.",
        "like_count": 0,
        "published_at": "2024-08-25T10:00:38Z",
        "is_reply": true
      },
      {
        "id": "Ugzop0Zye8YVxI_Ede14AaABAg.A73OIsgvVAQA7ZWkXUH97u",
        "author": "@seekingabsolution1907",
        "text": "​@hmt4173yes, there are certain nations inherently reactionary and settler colonies like the US are one of them.",
        "like_count": 1,
        "published_at": "2024-08-25T13:06:28Z",
        "is_reply": true
      },
      {
        "id": "Ugzop0Zye8YVxI_Ede14AaABAg.A73OIsgvVAQA7_3nSbUkOT",
        "author": "@hmt4173",
        "text": "@seekingabsolution1907 lmao look up what Lenin and Marx and Mao wrote about the United States. They had no doubt there is a world historic significance the US will still play",
        "like_count": 0,
        "published_at": "2024-08-25T18:12:42Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxMStDgPwmOHn8XnbB4AaABAg",
    "author": "@Justin72130",
    "author_channel_id": "UCww778T3Mve34vyMiCjoKVQ",
    "text": "Wild 90s was in Russia not China",
    "like_count": 2,
    "published_at": "2024-08-12T20:20:59Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgxMStDgPwmOHn8XnbB4AaABAg.A72p8fzMZMDA73EKiCPhgE",
        "author": "@antediluvianatheist5262",
        "text": "China had wild 90s too.",
        "like_count": 0,
        "published_at": "2024-08-13T00:09:50Z",
        "is_reply": true
      },
      {
        "id": "UgxMStDgPwmOHn8XnbB4AaABAg.A72p8fzMZMDA73FUENQZMi",
        "author": "@Justin72130",
        "text": "@antediluvianatheist5262 I’ve read plenty about the wild 90s in Eastern Europe, but I’ve never seen this term in reference to the 1990s in China.",
        "like_count": 0,
        "published_at": "2024-08-13T00:19:52Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgylH9Lj9ZjPIOuu5uZ4AaABAg",
    "author": "@reignofthestang",
    "author_channel_id": "UCmTZUTMU-vp8t73JGti5gvw",
    "text": "I love my steaks and veggies comrades 😊",
    "like_count": 0,
    "published_at": "2024-08-13T12:27:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwQnUCX7_FK8v-545Z4AaABAg",
    "author": "@megatallica091",
    "author_channel_id": "UCmVm9NyVzDkjGtQYZHqjBig",
    "text": "Great discussion! Shout out to vegans. Veganism is revolutionary.",
    "like_count": 2,
    "published_at": "2024-08-16T00:54:49Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgwQnUCX7_FK8v-545Z4AaABAg.A7B1ruBgtq-A7yI4VfrEZ2",
        "author": "@bolan1917",
        "text": "I dont mind vegans but i dont think its revolutionary. Also Immortal Technique interlude \"Beef & Broccoli\" is funny and i reccommend you to check it out",
        "like_count": 1,
        "published_at": "2024-09-04T13:18:31Z",
        "is_reply": true
      },
      {
        "id": "UgwQnUCX7_FK8v-545Z4AaABAg.A7B1ruBgtq-A7yOu91O4yE",
        "author": "@megatallica091",
        "text": "@bolan1917 I love immortal technique! thanks for sharing! \n\nI get his point, to each their own, live and let live - except that killing sentient animals for sustenance is not necessary anymore as it once was. we grow enough food to feed billions of animals just to slaughter them, and still we have hungry children all over. i.e. it's a distribution problem, not a production problem. i think it's revolutionary to stand up for the little guy and strive to end animal exploitation. like Che says, \"the true revolutionary is guided by a great feeling of love. It is impossible to think of a genuine revolutionary lacking this quality.\" Once we see that adequate nutrition can be obtained without slaughtering animals, and get profit out of food industry, i think we can socially evolve as a species. imo if we can end murder of animals we get closer to ending murder of humans too, and i think it's revolutionary to fight for that future. \n\nRosa also said \"the most revolutionary thing one can do is to proclaim loudly what is happening\". If we give the same love of dogs/cats to other animals, vegans won't have to remind you of the animal genocide happening under our noses. maybe immortal technique just needs to challenge his convictions a little more on the subject (e.g. omnivores die each day of preventable chronic disease - vegans are not all skinny or malnourished, etc). the way he challenged mine with his music.",
        "like_count": 1,
        "published_at": "2024-09-04T14:18:08Z",
        "is_reply": true
      },
      {
        "id": "UgwQnUCX7_FK8v-545Z4AaABAg.A7B1ruBgtq-A7yYnfouYRn",
        "author": "@bolan1917",
        "text": "@megatallica091 you are right, but i refuse to read all of that anyways. I enjoy meat",
        "like_count": 0,
        "published_at": "2024-09-04T15:44:38Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw6sNatzkHU1Zoah-x4AaABAg",
    "author": "@homieslice1996",
    "author_channel_id": "UCUXBvxugRT6aQw3ZZcTAs1g",
    "text": "23:49 The bigotry and homophobia are a concern I had too: even in the MWM Discord, I dealt homophobes a few times and then I got banned related to a heated conversation with a homophobe. \n   If you talk about a social issue for any reason, then you get treated with hate by some of that community, which is not helpful when they don’t live their neighbors as themselves. \n   But at the same time, the MWM Discord is not the ACP and the ACP is not the MWM Discord. The ACP is a better development honestly; and it doesn’t seem to promote or allow the prejudice that I experienced in the MWM Discord. \n   That’s likely because, like with racist white dudes who fought with slave labors to help the slave laborers free themselves, prejudice has to be put aside in a class struggle; and the MWM Discord is not class struggle in any way unlike what the ACP is created to help with — the ACP wants to get something done for the proletarians which I admire.",
    "like_count": 18,
    "published_at": "2024-08-12T00:08:15Z",
    "is_reply": false,
    "reply_count": 5,
    "replies": [
      {
        "id": "Ugw6sNatzkHU1Zoah-x4AaABAg.A70eMFcvyovA70q9OVzmqN",
        "author": "@joeschmoe2202",
        "text": "jackson hinkle is still stoking culture wars with the imane controversy.",
        "like_count": 9,
        "published_at": "2024-08-12T01:51:21Z",
        "is_reply": true
      },
      {
        "id": "Ugw6sNatzkHU1Zoah-x4AaABAg.A70eMFcvyovA71E5elm0B2",
        "author": "@tonight0000",
        "text": "@joeschmoe2202Jackson hasn’t mentioned Imane once, what are you talking about?",
        "like_count": 3,
        "published_at": "2024-08-12T05:29:17Z",
        "is_reply": true
      },
      {
        "id": "Ugw6sNatzkHU1Zoah-x4AaABAg.A70eMFcvyovA71IzGz_UZD",
        "author": "@mulligas",
        "text": "@joeschmoe2202 What is the Imane controversy?",
        "like_count": 1,
        "published_at": "2024-08-12T06:11:58Z",
        "is_reply": true
      },
      {
        "id": "Ugw6sNatzkHU1Zoah-x4AaABAg.A70eMFcvyovA72F234DRyR",
        "author": "@brycehmr",
        "text": "@joeschmoe2202there is no mention of imane on his page. Do you have proof showing otherwise?",
        "like_count": 0,
        "published_at": "2024-08-12T14:56:47Z",
        "is_reply": true
      },
      {
        "id": "Ugw6sNatzkHU1Zoah-x4AaABAg.A70eMFcvyovA7YQb1w1foZ",
        "author": "@aesop1451",
        "text": "The gay identity has to be decomidified. They should not be persecuted and allowed to live in peace while acknowledging that it’s not akin to a national or religious identity. Racism and homophobia would go down in a communist society because the economic angst would not exist for elites to play off each other.",
        "like_count": 0,
        "published_at": "2024-08-25T02:53:30Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwfwOoyYsXMrPpmS5B4AaABAg",
    "author": "@automaton111",
    "author_channel_id": "UCBsvnYCheWSxRa2obfXq6ag",
    "text": "What do you say to certain workers who find themselves in solidarity with the billionaire ruling class because those billionaires sign their paychecks and own the equipment that they use to do their jobs?",
    "like_count": 2,
    "published_at": "2024-08-11T23:14:56Z",
    "is_reply": false,
    "reply_count": 13,
    "replies": [
      {
        "id": "UgwfwOoyYsXMrPpmS5B4AaABAg.A70ZFkNrgxRA70c9B0kU56",
        "author": "@MTanks24",
        "text": "Remind them of their class position, the billionaires are only billionaires because they appropriate YOUR surplus labor as a worker, don't be satisfied with the crumbs that fall off the table, know that the issues you see in society and the crumbling system are based on this imbalance and it will only create further problems, don't wait for problems to finally show up at your door, stand with your class based on shared class interests, etc., etc., etc., etc.",
        "like_count": 10,
        "published_at": "2024-08-11T23:48:59Z",
        "is_reply": true
      },
      {
        "id": "UgwfwOoyYsXMrPpmS5B4AaABAg.A70ZFkNrgxRA70cuY20sWx",
        "author": "@automaton111",
        "text": "@MTanks24 their point is that there is nobody else capable of affording to fund the work they do except for people who are very rich",
        "like_count": 3,
        "published_at": "2024-08-11T23:55:35Z",
        "is_reply": true
      },
      {
        "id": "UgwfwOoyYsXMrPpmS5B4AaABAg.A70ZFkNrgxRA70dQjiJVV4",
        "author": "@lorsheckmolseh3345",
        "text": "Sheeple's one-way-solidarity for the wolves: Stockholm-syndrome",
        "like_count": 6,
        "published_at": "2024-08-12T00:00:07Z",
        "is_reply": true
      },
      {
        "id": "UgwfwOoyYsXMrPpmS5B4AaABAg.A70ZFkNrgxRA70e_W7Axp-",
        "author": "@alexjeffrey3981",
        "text": "@automaton111 that's because the billionaires own the means of production. There's nothing special about these individuals except the fact that they've hoarded the means. If the means were held in common then we'd be able to complete the necessary labour, but could also direct that labour towards benefitting the people instead of just generating further wealth for already insanely wealthy individuals.",
        "like_count": 8,
        "published_at": "2024-08-12T00:10:11Z",
        "is_reply": true
      },
      {
        "id": "UgwfwOoyYsXMrPpmS5B4AaABAg.A70ZFkNrgxRA71HtgeuVu9",
        "author": "@JM57-99",
        "text": "The big bourgeois made themselves the only option by dominating the industry. If the worker needs money, make sure you're the one paying them, if they need equipment, make sure you're the one providing it. That way they will depend on you.",
        "like_count": 3,
        "published_at": "2024-08-12T06:02:28Z",
        "is_reply": true
      },
      {
        "id": "UgwfwOoyYsXMrPpmS5B4AaABAg.A70ZFkNrgxRA72X3Zs3_rx",
        "author": "@Lawns-Are-Fun",
        "text": "Wouldn’t this same logic apply to the slave or the serf though? “My feudal lord keeps me safe, so it’s ok that he gets all my grain while I toil in the fields.” I don’t think people are realistically in solidarity with their billionaire owners — it’s just a means to an end.",
        "like_count": 2,
        "published_at": "2024-08-12T17:34:16Z",
        "is_reply": true
      },
      {
        "id": "UgwfwOoyYsXMrPpmS5B4AaABAg.A70ZFkNrgxRA72ybMNGzq8",
        "author": "@ulyanov17",
        "text": "oh my god, just teach them theory then! those billionaires wouldn't have had any funds if it wasn't for the workers, cmon😂",
        "like_count": 1,
        "published_at": "2024-08-12T21:43:41Z",
        "is_reply": true
      },
      {
        "id": "UgwfwOoyYsXMrPpmS5B4AaABAg.A70ZFkNrgxRA72z5V3A0Nv",
        "author": "@automaton111",
        "text": "@ulyanov17 Which piece of theory specifically? All they care is that their fat check keeps getting signed under the status quo (for now)",
        "like_count": 1,
        "published_at": "2024-08-12T21:47:56Z",
        "is_reply": true
      },
      {
        "id": "UgwfwOoyYsXMrPpmS5B4AaABAg.A70ZFkNrgxRA73-BrzZgPJ",
        "author": "@JM57-99",
        "text": "@automaton111 I'm reading Principles of Communism, within the first half the history behind this is briefly explained, but maybe it lacks a lot of details",
        "like_count": 1,
        "published_at": "2024-08-12T21:57:33Z",
        "is_reply": true
      },
      {
        "id": "UgwfwOoyYsXMrPpmS5B4AaABAg.A70ZFkNrgxRA732QCEF18D",
        "author": "@alexjeffrey3981",
        "text": "@ulyanov17 can't teach theory if someone isn't ready for it. They already have to have some degree of awareness that capitalism may not be the perfect system.",
        "like_count": 0,
        "published_at": "2024-08-12T22:25:43Z",
        "is_reply": true
      },
      {
        "id": "UgwfwOoyYsXMrPpmS5B4AaABAg.A70ZFkNrgxRA7YRJxz6gyt",
        "author": "@aesop1451",
        "text": "Are you talking about Trump supporters? Trump got his money hereditarily and in real estate. Makes him somewhat different from an upper middle-class banker or tech investor that went to an Ivy. He criticized Bush’s invasion of Iraq in the 2016 debates and he pulled out of Syria. The job of the American communist movement would be to deepen and expand these critiques of the establishment.",
        "like_count": 0,
        "published_at": "2024-08-25T02:59:46Z",
        "is_reply": true
      },
      {
        "id": "UgwfwOoyYsXMrPpmS5B4AaABAg.A70ZFkNrgxRA7Z7e61IE5v",
        "author": "@seekingabsolution1907",
        "text": "​​@automaton111the work only costs so much because of all the billionaires hoarding the equipment needed to do it. A collectively run workplace would enable their work just as much as a capitalist dictatorship. Money is just a middle man made to represent the value of labour, if the workers in the economy have the capacity to do the labour, the labour can be done.",
        "like_count": 0,
        "published_at": "2024-08-25T09:27:08Z",
        "is_reply": true
      },
      {
        "id": "UgwfwOoyYsXMrPpmS5B4AaABAg.A70ZFkNrgxRA7ZfEvEubNQ",
        "author": "@automaton111",
        "text": "@seekingabsolution1907 I suppose there are some who are the labor aristocracy who will never be convinced because they are making good money under the current system. As long as they got theirs that’s all they care about, and they think It will last forever.",
        "like_count": 0,
        "published_at": "2024-08-25T14:29:24Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwOeU_ikkuj5NcrewJ4AaABAg",
    "author": "@SannonPwine",
    "author_channel_id": "UCdVj9lVXuPRVWEZkbqBUa0Q",
    "text": "U bois are a circus act boiz",
    "like_count": 4,
    "published_at": "2024-08-12T03:58:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwifjVuiffHDqqN_1V4AaABAg",
    "author": "@mat_j",
    "author_channel_id": "UCeF9wwJNNujpVSQ8sR3oCiA",
    "text": "Didn't know Carlos is vegan. That's amazing !",
    "like_count": 7,
    "published_at": "2024-08-12T00:58:18Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgwifjVuiffHDqqN_1V4AaABAg.A70k4uP6vmWA718UEFg4rB",
        "author": "@angelg8445",
        "text": "I’m also vegan",
        "like_count": 3,
        "published_at": "2024-08-12T04:40:13Z",
        "is_reply": true
      },
      {
        "id": "UgwifjVuiffHDqqN_1V4AaABAg.A70k4uP6vmWA71Te6739x6",
        "author": "@mimosveta",
        "text": "not really",
        "like_count": 2,
        "published_at": "2024-08-12T07:45:12Z",
        "is_reply": true
      },
      {
        "id": "UgwifjVuiffHDqqN_1V4AaABAg.A70k4uP6vmWA71mSlkyypJ",
        "author": "@mat_j",
        "text": "@mimosveta here we go...",
        "like_count": 0,
        "published_at": "2024-08-12T10:38:17Z",
        "is_reply": true
      },
      {
        "id": "UgwifjVuiffHDqqN_1V4AaABAg.A70k4uP6vmWA71o_DDReSw",
        "author": "@mat_j",
        "text": "@angelg8445 vegan gang!",
        "like_count": 0,
        "published_at": "2024-08-12T10:56:46Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugzn3Yx50xsu-Af-iw14AaABAg",
    "author": "@bumam6665",
    "author_channel_id": "UCZm3XAhrKbvD1BV8ZiJ3RTQ",
    "text": "Beans are aweasome, But man i love me some sausage and eggs with my beans",
    "like_count": 2,
    "published_at": "2024-08-12T13:30:38Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugzn3Yx50xsu-Af-iw14AaABAg.A725B69BovkA732nIRR5JH",
        "author": "@HR-News-Channel",
        "text": "damn you",
        "like_count": 0,
        "published_at": "2024-08-12T22:29:00Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzOlEYFfvKNJeGsocp4AaABAg",
    "author": "@nathanjo1376",
    "author_channel_id": "UCMo615J0Tb2ahq3_t1-ISuA",
    "text": "I will have to strongly disagree with your views regarding Vaush : this person has the most malicious views on a wide range of critical issues - and for a citizen of a country that has tremendous power projection all over the world (800+ military bases, regime change operations endlessly etc.)  to show this little compassion for people all around the world   is atrocious and sadistic... ... plus this person makes his large following call the most wonderful communists : fascists , and makes them truly hate these wonderful communists and socialists ... ... absolutely toxic...",
    "like_count": 4,
    "published_at": "2024-08-14T04:23:38Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgzOlEYFfvKNJeGsocp4AaABAg.A76GAZx_u9YA76O0HZytxX",
        "author": "@MidwesternMarx",
        "text": "@nathanjo1376 I’m with you on that one",
        "like_count": 1,
        "published_at": "2024-08-14T05:32:08Z",
        "is_reply": true
      },
      {
        "id": "UgzOlEYFfvKNJeGsocp4AaABAg.A76GAZx_u9YA7kfuqjcudB",
        "author": "@Huy-G-Le",
        "text": "acp coop with too many \"maga communi\" man, those people who fall for maga just gonna be the germans who fall for the party in question.",
        "like_count": 0,
        "published_at": "2024-08-30T06:26:09Z",
        "is_reply": true
      },
      {
        "id": "UgzOlEYFfvKNJeGsocp4AaABAg.A76GAZx_u9YAAdW2i5Aavo",
        "author": "@bellton6293",
        "text": "Didn’t Eddie called him the most disgusting human being and called him a pedo",
        "like_count": 0,
        "published_at": "2024-11-10T01:10:44Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugzc-iwXuxj196__kAN4AaABAg",
    "author": "@Comrade_Broski",
    "author_channel_id": "UCnY-q7mpJzuZ6eazWwz69Aw",
    "text": "The problem with defending Haz and Hinkle based on the strategic reasoning of their popularity, is that most of the people closest to us ideologically, including the American youth, they're not bigots and they will vehemently oppose people like Hinkle and Haz specifically for their bigoted actions. It's a really bad look. It is, and I love Eddie and what him and his comrades are doing. I want ACP to succeed, I just think these people are really bad for the party image.",
    "like_count": 4,
    "published_at": "2024-08-13T01:56:49Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugzc-iwXuxj196__kAN4AaABAg.A73Q_KklsboA73TkZE_M6W",
        "author": "@Lawns-Are-Fun",
        "text": "So you think the key to spreading communism in the US is messaging to the youth and not working class adults? I dunno if I or history agrees.",
        "like_count": 0,
        "published_at": "2024-08-13T02:24:34Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzymoCQ9sg01PbLjAB4AaABAg",
    "author": "@bumam6665",
    "author_channel_id": "UCZm3XAhrKbvD1BV8ZiJ3RTQ",
    "text": "Yo, looks good",
    "like_count": 1,
    "published_at": "2024-08-12T13:31:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyHNnWpWGRQScZUOMl4AaABAg",
    "author": "@idealisticpinto",
    "author_channel_id": "UCww0r37pGRGVgMjklZni7NQ",
    "text": "vegan comrades FTW",
    "like_count": 0,
    "published_at": "2024-11-13T23:21:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzUVGSqyf7PqILYIxJ4AaABAg",
    "author": "@DengXiaoUnchained",
    "author_channel_id": "UCF-tnj4D3BJeppNFBgQFjCg",
    "text": "Haz still doesn't understand the optics. That horrible ACP poster with him on a motorcycle is a perfect example. That shit makes most people cringe",
    "like_count": 3,
    "published_at": "2024-08-13T18:56:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxmOGguW9wFo2ErnWx4AaABAg",
    "author": "@JohnnyYounitas",
    "author_channel_id": "UCpjws-wZpxHmqHSWrgJJR4g",
    "text": "MAGA communism? \n😐 no",
    "like_count": 21,
    "published_at": "2024-08-11T22:56:51Z",
    "is_reply": false,
    "reply_count": 15,
    "replies": [
      {
        "id": "UgxmOGguW9wFo2ErnWx4AaABAg.A70XBMm8vXAA70Z6vWgVZX",
        "author": "@alexjeffrey3981",
        "text": "I mean, it makes sense - MAGA are already radicalised, they've just been captured by reaction. Liberals are a lost cause, they only want the status quo.",
        "like_count": 0,
        "published_at": "2024-08-11T23:13:43Z",
        "is_reply": true
      },
      {
        "id": "UgxmOGguW9wFo2ErnWx4AaABAg.A70XBMm8vXAA70ZJnhvhQS",
        "author": "@EggEnjoyer",
        "text": "Maga communism isn’t about maga as it is. It’s about the fact that the maga crowd is a popular working class movement and it is communist’s prerogative to co-opt it.\nMarxist cannot just write off working class movements",
        "like_count": 24,
        "published_at": "2024-08-11T23:15:29Z",
        "is_reply": true
      },
      {
        "id": "UgxmOGguW9wFo2ErnWx4AaABAg.A70XBMm8vXAA70dxvT8u_U",
        "author": "@Oudplayer23",
        "text": "@EggEnjoyerwell not every working class movement is a good one. Nazbol, communist Zionists and maga communists are just as bad as right wing freaks. Supporting the liberation of only white workers is not what communism is about.",
        "like_count": 1,
        "published_at": "2024-08-12T00:04:47Z",
        "is_reply": true
      },
      {
        "id": "UgxmOGguW9wFo2ErnWx4AaABAg.A70XBMm8vXAA711c9xZ5Ix",
        "author": "@Lawns-Are-Fun",
        "text": "@EggEnjoyerThis is a very good succinct explanation. Thank you.\n\nDo you agree with my somewhat tweaked version:\n\nMAGA Communism isn’t about supporting republicans or Donald Trump or their policies. It’s a concept that focuses on the idea that MAGA is a popular working class movement and therefore it is a Communist’s duty to try to co-opt it. Historically, successful communist movements have always required the backing of the working class, and so we cannot just write off a large section of the working class—even if we may not agree on every social position.",
        "like_count": 5,
        "published_at": "2024-08-12T03:40:16Z",
        "is_reply": true
      },
      {
        "id": "UgxmOGguW9wFo2ErnWx4AaABAg.A70XBMm8vXAA713pS_w5qb",
        "author": "@Lawns-Are-Fun",
        "text": "@Oudplayer23this is such a lie omg…they are not advocating for this in any way—meanwhile the CPUSA is actively supporting a genocide",
        "like_count": 1,
        "published_at": "2024-08-12T03:59:34Z",
        "is_reply": true
      },
      {
        "id": "UgxmOGguW9wFo2ErnWx4AaABAg.A70XBMm8vXAA7146qTfCs9",
        "author": "@EggEnjoyer",
        "text": "@Lawns-Are-Fun Precisely and much better than I could put it",
        "like_count": 2,
        "published_at": "2024-08-12T04:02:04Z",
        "is_reply": true
      },
      {
        "id": "UgxmOGguW9wFo2ErnWx4AaABAg.A70XBMm8vXAA71U7ym-Xzy",
        "author": "@mimosveta",
        "text": "purity fetish. half of lamerican working class, at least, support maga, anyone who doesn't think that maga communism makes logical sense, doesn't understand communism",
        "like_count": 1,
        "published_at": "2024-08-12T07:49:25Z",
        "is_reply": true
      },
      {
        "id": "UgxmOGguW9wFo2ErnWx4AaABAg.A70XBMm8vXAA72tTH8LYZA",
        "author": "@VLX11387",
        "text": "🇺🇲 yes",
        "like_count": 0,
        "published_at": "2024-08-12T20:58:45Z",
        "is_reply": true
      },
      {
        "id": "UgxmOGguW9wFo2ErnWx4AaABAg.A70XBMm8vXAA7Q7nIHnThC",
        "author": "@JohnnyYounitas",
        "text": "@kevintewey1157 😄😆😆😆😄 yea ok",
        "like_count": 0,
        "published_at": "2024-08-21T21:35:14Z",
        "is_reply": true
      },
      {
        "id": "UgxmOGguW9wFo2ErnWx4AaABAg.A70XBMm8vXAA7QTmIaBXCu",
        "author": "@JohnnyYounitas",
        "text": "@kevintewey1157 Good luck Simple Jack 🫡",
        "like_count": 0,
        "published_at": "2024-08-22T00:47:20Z",
        "is_reply": true
      },
      {
        "id": "UgxmOGguW9wFo2ErnWx4AaABAg.A70XBMm8vXAA7Z7zEP47s8",
        "author": "@seekingabsolution1907",
        "text": "​@EggEnjoyerthe maga crowd is majority petite bourgeoisie",
        "like_count": 0,
        "published_at": "2024-08-25T09:30:02Z",
        "is_reply": true
      },
      {
        "id": "UgxmOGguW9wFo2ErnWx4AaABAg.A70XBMm8vXAA7Z8FQbffMS",
        "author": "@seekingabsolution1907",
        "text": "​@Lawns-Are-Funthey are vehemently anticommunist, as a movement. They cannot be coopted for this reason in addition, to all the appalling bigotry. You can pull people out of that movement, you can try and make them see that billionaires like Trump are their enemies, not their friends, but you can't coopt it.",
        "like_count": 0,
        "published_at": "2024-08-25T09:32:22Z",
        "is_reply": true
      },
      {
        "id": "UgxmOGguW9wFo2ErnWx4AaABAg.A70XBMm8vXAA7ZKtVcYR2L",
        "author": "@EggEnjoyer",
        "text": "@seekingabsolution1907 no it isn’t",
        "like_count": 0,
        "published_at": "2024-08-25T11:22:50Z",
        "is_reply": true
      },
      {
        "id": "UgxmOGguW9wFo2ErnWx4AaABAg.A70XBMm8vXAA7ZXzM1FDRf",
        "author": "@seekingabsolution1907",
        "text": "​@EggEnjoyeryes it is. They have much money and much anticommunist sentiment. Small business owners small landlords. People with big trucks and small minds. Petty bourgeois through and through. Not working class, not proletarian.",
        "like_count": 1,
        "published_at": "2024-08-25T13:17:14Z",
        "is_reply": true
      },
      {
        "id": "UgxmOGguW9wFo2ErnWx4AaABAg.A70XBMm8vXAA7_A_ww8rsK",
        "author": "@EggEnjoyer",
        "text": "@seekingabsolution1907 First of all, if you think of small business owners as as being antagonist to the working class you’re off base. Not all petite bourgeoisie are the same. The small family owned restaurant and farmer who has a small market is not the same as a guy who 2 McDonald’s and makes hundreds of thousands off of owning labor and land. Wait until you find out how common it is to be a small business owner in socialists states like china. Imagine calling a street vendor petite bourgeoisie and an antagonist to the working class. Absurd.\n\nSecond, nothing you said changes the fact that most of maga is still just regular working class people",
        "like_count": 0,
        "published_at": "2024-08-25T19:12:02Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwzIQiD3gIEtGluuq54AaABAg",
    "author": "@mat_j",
    "author_channel_id": "UCeF9wwJNNujpVSQ8sR3oCiA",
    "text": "Pls stop this MAGA nonsense",
    "like_count": 20,
    "published_at": "2024-08-12T00:09:13Z",
    "is_reply": false,
    "reply_count": 22,
    "replies": [
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA713KzTw0ji",
        "author": "@Lawns-Are-Fun",
        "text": "Can you guys please stop being like this and try to actually grapple with the concept. It’s extremely lazy.\n\nMAGA Communism isn’t about supporting republicans or Donald Trump or their policies. It’s a concept that focuses on the idea that MAGA is a popular working class movement and therefore it is a Communist’s duty to try to co-opt it. Historically, successful communist movements have always required the backing of the working class, and so we cannot just write off a large section of the working class—even if we may not agree on every social position.",
        "like_count": 12,
        "published_at": "2024-08-12T03:55:16Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA713vAG4U6U",
        "author": "@mat_j",
        "text": "@Lawns-Are-Fun this concept is extremely lazy",
        "like_count": 12,
        "published_at": "2024-08-12T04:00:20Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA714EhkIS8G",
        "author": "@Lawns-Are-Fun",
        "text": "@mat_jDude I’m serious can you just grapple with the concept? Like I’m tired of sniping and trash talking. Please try and think and if you don’t agree make an argument why it doesn’t make sense.",
        "like_count": 11,
        "published_at": "2024-08-12T04:03:09Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA716Jizg2Mk",
        "author": "@homieslice1996",
        "text": "@mat_j I live in the San Joaquin Valley, and nearly all counties in it supported Trump each time — there’s something that they didn’t see fitting about Clinton or Biden (except for Fresno County where I live since it has the 5th biggest city in the state and it’s a college town), and it is lazy to brush them off. \n    Doesn’t mean we agree with much of anything that they say, but there is some common ground. Even if they might have disagreeable prejudices: that can be broken when the work with others for a common goal to see that those they saw as lesser actually have more in common. \n   Most of the San Joaquin Valley is proletarian, and most of them supported Trump. Finding common ground with some but not all of the grievances can give a class perspective to folks like former Bernie bros who went to Trump; likely lots of the MAGA proletarians are that way. \n   Even the local petty bourgeoise, semi-proletarians, and lumpen-bourgeoisie are screwed by the imperialist bourgeoise. It is lazy to ignore them too, since they home little to no economic or political power locally or nationally.",
        "like_count": 7,
        "published_at": "2024-08-12T04:21:18Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA716rTvgY3K",
        "author": "@Lawns-Are-Fun",
        "text": "⁠@homieslice1996Exactly. Two of my neighbors are MAGA guys and all they do is complain to me about how 1) they hear we’re going to war with some new country they’ve never heard of and 2) the publicly traded electric utility is gouging them.",
        "like_count": 9,
        "published_at": "2024-08-12T04:26:03Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA71E8L3ArId",
        "author": "@homieslice1996",
        "text": "@Lawns-Are-Fun relatable! And a relative of mine told me that the nearby mayor (a Republican) talked of publicly owning public utilities like PG&E (despite him not being close to communist). Of course, the lobbying interests will hinder that if they keep allowing  it, but it is better than what Newsom promotes. \n   People think that my area’s region is socially backward, but they are actually tired of being exploited by Sacramento and the gentrifiers from bigger cities like SF and LA, which also affects Modesto and Stockton (of which most are proletarians including many of the gentrifiers from SF, although they tend to be lumpen-bourgeoise like scientists that steal jobs from local graduates). \n   As we know, woke imperialism makes many minorities look bad especially in regards to those you mentioned that are concerned of new wars and the justification for such wars nowadays.",
        "like_count": 4,
        "published_at": "2024-08-12T05:29:39Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA71HAyH2bL8",
        "author": "@JM57-99",
        "text": "Fascism succeeds by co-opting working class sentiment and giving them an escape goat. It's the job of Communists to capture back that audience with a better message",
        "like_count": 1,
        "published_at": "2024-08-12T05:56:13Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA71L-B7POg3",
        "author": "@mulligas",
        "text": "@homieslice1996 Most of those counties vote for previous Republicans such as Romney, McCain, Bush Jr, Dole and Bush  Sr.",
        "like_count": 1,
        "published_at": "2024-08-12T06:29:34Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA71UHNCBvKy",
        "author": "@mimosveta",
        "text": "stop pretending to be a communist",
        "like_count": 0,
        "published_at": "2024-08-12T07:50:42Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA71oLQWyY4c",
        "author": "@mat_j",
        "text": "@homieslice1996 except this all a theory. I saw Haz talking to Trumpers and it was all pandering and avoiding real issues.  Are you gonna say we sre nazi communist when you talk to some far right guys? Because you can find some positive aspects of nazi gov. This is same exact concept designed for schock value but in the end dilutes perverts the message makes us look weak. When i saw Haz talking to those people he looked totaly pathetic and wasn't able to brigde any gaps.  This is not the way.",
        "like_count": 2,
        "published_at": "2024-08-12T10:54:45Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA71qGUgehm_",
        "author": "@mat_j",
        "text": "@homieslice1996 you are confused, I'm  not saying to ignore anyone. You are trying to appeal to people lowest instincts almost like u say they are to stupid to understand whats good for them,  we need to trick them. It was a good meme, had social media schock value. But let's not forget who Trump really is and his real policies. Using this label needs to stop its a path that's creates more divisions and immediately alienates huge portion of young people. I understand your angle but i don't think it works the way you think. But of course we need to talk to everyone",
        "like_count": 2,
        "published_at": "2024-08-12T11:11:33Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA71tBXJ2oEY",
        "author": "@Lawns-Are-Fun",
        "text": "@mat_jNo, and again, if want to actually try and grapple with this stuff. If you did, you would see that Haz has been absolutely humiliating actual nazis on his stream as these Nick Fuentes fans keep going on his Vc to debate him. Unlike the weak DSA/CPUSA left that won’t even talk to these cannibalistic Nick Fuentes fans, Haz has been challenging them to debates and making them look so so stupid. \n\nSecond, this argument  doesn’t make sense as you are effectively saying to be good communists we have to go around telling all working class people how to think on social issues like some kind of communist HR supervisor.  Instead, I am saying, as we expose some of these MAGA or socially unenlightened masses to Marxism, we need to not “tail” their more reactionary social tendencies as some lefties lazily say but to simply ignore them. I think at some point, once there’s some buy in, if these working class people want to be party members, you might be able to do as Haz has done and say “hey chill, if you’re serious about this you have to ditch that edgy stuff and be respectful”, but there’s this tendency among the American left to want to be the HR police and it honestly makes no sense—it has nothing to do with Marxism. \n\nYou have to decide, do you care about *trying* to do something to help the working class where the leading cause of death is poverty and oppose US hegemony or do you just want to do internet dunks and be a social hall monitor? Is that the kind of “Marxist” you want to be? Also, where  has it gotten the US left the last 10 or so years?",
        "like_count": 0,
        "published_at": "2024-08-12T11:37:05Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA72JNOe6h7h",
        "author": "@R.ion64",
        "text": "​​​​​@Lawns-Are-FunI've always advocated ignoring people's personal beliefs and biases on issues having nothing to do with economics when trying to foment solidarity. Always. However the other side of that is that they understand not to bring those issues up either. It works both ways. And I didn't think that absolutely insisting on sane attitudes to public health should have been pushed as an exclusionary standard among groups getting together either,. What happened though was you have infantile jrks like many of the maga comm crowd who took that to the opposite and even more destructive extreme, pushing out explicitly anti-scientific garbage and dangerous skepticism along with contrarian socially backwards positions (adopted, i should add, much like a blue collar version of the dancing minstrels, in effect satirising poorly educated people),  So I can only hope intelligent people will get enough offline time to breathe in some sanity and ditch this contrarian garbage and return to what this channel used to be about; sound, intelligent non-nonsense education. Speed the hour.i agree with @mat_j here",
        "like_count": 0,
        "published_at": "2024-08-12T15:34:39Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA72NMQHIYhC",
        "author": "@Lawns-Are-Fun",
        "text": "@R.ion64This seems like a lot of vague dislike of vibes or something. Is ACP pushing bad policies or even social positions? I’m not seeing it. Now I agree, you can’t say don’t get involved in the social commentary and then make little barbs here and there. But, this naysaying and failure to grapple with some of their concepts just seems unwarranted. If I see it happen, I will reassess, but until then, I’m not going to be immobilized by fear.",
        "like_count": 0,
        "published_at": "2024-08-12T16:09:28Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA72Rawn8hDu",
        "author": "@Lawns-Are-Fun",
        "text": "@R.ion64Okay, it seems like your sole issue is vaccines. Like I say to the Jimmy Dore fans or RFK fans—it’s not really my top priority. Everything else is just this Charlie Day meme of trying to find if Jackson is secretly bad. If he’s bad, it will become apparent and again, as I just said, I’ll reassess. In the meantime I’m going to support the people pushing against US hegemony and trying to help the working class. Good luck 👍",
        "like_count": 0,
        "published_at": "2024-08-12T16:46:32Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA72SJHyRR0l",
        "author": "@R.ion64",
        "text": "​@Lawns-Are-Fun you mean like taking the \"scientific\" bit of \"scientific socialism\" seriously and not spreading dangerous, stupid conspiracy theories? Sure. If you call that morally superior, fine. I just call it good sense and sanity. But you're right. I've been hammering this ad nauseum to little or no effect. Do what you all want. We'll be seeing the consequences soon enough. I wish you peace.",
        "like_count": 4,
        "published_at": "2024-08-12T16:52:44Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA72UvFuOlrG",
        "author": "@Lawns-Are-Fun",
        "text": "@R.ion64You know, I shouldn’t have said morally superior, that came off of as unnecessarily dismissive. Really trying to have a dialog here and not devolve into a petty Twitter clap back thing, so my  apologies. \n\nBut I genuinely want to see this work, and I think I can be objective and reflect if I see it go in a negative direction. If it does, I guess I will look silly and naive, but you know, my philosophy with life on these things is that I’m willing to look foolish personally and try, rather than not trying to ever support anything new but protect my pride. Does that make sense?\n\nBest of luck on your journey comrade 🤝",
        "like_count": 1,
        "published_at": "2024-08-12T17:15:31Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA72X8KKur8L",
        "author": "@R.ion64",
        "text": "​@Lawns-Are-Fun no, seriously I know how it is and how were all under huge pressure from the madness of social media etc and how easy it is to let yourself get sucked in. I'm sorry for coming across harsh. I only caution not to make problems for ourselves in the future by courting charlatans and egomaniacs. I think I've been clinging onto this channel too long hoping they'd turn back from where they're headed. I've probably been causing needless trouble that way.  I really do wish all the best for you and them, despite extreme reservations about their partners.",
        "like_count": 4,
        "published_at": "2024-08-12T17:34:55Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA72agNqqLLL",
        "author": "@Lawns-Are-Fun",
        "text": "@R.ion64Totally understand. Thank you for the back and forth. Appreciate the good faith critiques and concerns.",
        "like_count": 1,
        "published_at": "2024-08-12T18:14:39Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA73SR-ondYM",
        "author": "@mat_j",
        "text": "Weird i don't see my long responses ...",
        "like_count": 4,
        "published_at": "2024-08-13T02:13:01Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA7QRcAOKk51",
        "author": "@mat_j",
        "text": "@kevintewey1157 grow up",
        "like_count": 0,
        "published_at": "2024-08-22T00:28:28Z",
        "is_reply": true
      },
      {
        "id": "UgwzIQiD3gIEtGluuq54AaABAg.A70eTSIyvEwA7Z8wTo5ShO",
        "author": "@seekingabsolution1907",
        "text": "​@Lawns-Are-Funthe maga movement is vehemently anti communist and filled with overt bigots and petition bourgeois Americans. There could not be a more hostile movement, pulling them out of the movement is far more important than trying to appeal to them as they are. Dropping Haz and Hinkle would be a good start for this process given that they aren't very good at conveying what capitalism is.",
        "like_count": 0,
        "published_at": "2024-08-25T09:38:23Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwGuOOLD3fVQdQDzSd4AaABAg",
    "author": "@johnschneider2664",
    "author_channel_id": "UCN3eAo9y1_WOMgx6_e_TRCA",
    "text": "Ya say “it's time to stop calling tue Vouch potato names and then call the everyone’s (fans) a bunch of delinquents “\nWow get your priorities straight. We’re not your fans we’re comrades \nMarginally famous little boy",
    "like_count": 4,
    "published_at": "2024-08-12T06:18:58Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwGuOOLD3fVQdQDzSd4AaABAg.A71JmVnulILA72F77WidGt",
        "author": "@Lawns-Are-Fun",
        "text": "“Marginally famous little boy”…Stop being so catty and try to have discourse like an emotionally stable adult sheesh..",
        "like_count": 0,
        "published_at": "2024-08-12T14:57:28Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzLaBB9LuZmDFAx4HB4AaABAg",
    "author": "@francolopez2460",
    "author_channel_id": "UCx-7ygVdW1ul9hyaXBOVc_A",
    "text": "Is this channel MAGA communist? I need to know so I can cancel my subscription",
    "like_count": 11,
    "published_at": "2024-08-12T03:13:56Z",
    "is_reply": false,
    "reply_count": 8,
    "replies": [
      {
        "id": "UgzLaBB9LuZmDFAx4HB4AaABAg.A70zbJyaZ15A713Db0exnY",
        "author": "@Blinky.Catttt",
        "text": "It's a shame that the left is already so tiny in the US, and here you are, threatening the pointless virtue signal of canceling your individual youtube subscription. Please, unsubscribe, you aren't paying them anyway",
        "like_count": 2,
        "published_at": "2024-08-12T03:54:15Z",
        "is_reply": true
      },
      {
        "id": "UgzLaBB9LuZmDFAx4HB4AaABAg.A70zbJyaZ15A7144hTD0nx",
        "author": "@Lawns-Are-Fun",
        "text": "@Blinky.Cattttyeah also they don’t want to even grapple with the concept….it’s just lazy honestly",
        "like_count": 5,
        "published_at": "2024-08-12T04:01:47Z",
        "is_reply": true
      },
      {
        "id": "UgzLaBB9LuZmDFAx4HB4AaABAg.A70zbJyaZ15A71UEg7RXiN",
        "author": "@mimosveta",
        "text": "okay trotskyite",
        "like_count": 7,
        "published_at": "2024-08-12T07:50:20Z",
        "is_reply": true
      },
      {
        "id": "UgzLaBB9LuZmDFAx4HB4AaABAg.A70zbJyaZ15A71iNiMw2zE",
        "author": "@morningstararun6278",
        "text": "Found the Trot.",
        "like_count": 8,
        "published_at": "2024-08-12T10:02:38Z",
        "is_reply": true
      },
      {
        "id": "UgzLaBB9LuZmDFAx4HB4AaABAg.A70zbJyaZ15A75prAp5AoM",
        "author": "@ReturntoYevropa-m1b",
        "text": "Frot Trot!!",
        "like_count": 4,
        "published_at": "2024-08-14T00:24:56Z",
        "is_reply": true
      },
      {
        "id": "UgzLaBB9LuZmDFAx4HB4AaABAg.A70zbJyaZ15A7Z9jK7_0vJ",
        "author": "@seekingabsolution1907",
        "text": "​trying to coopt a fascist movement has not, historically speaking, ever ended well for socialists. The US is an imperialist settler colony, you can no more be a chest thumping patriotic american communist than you can be a proud zionist communist. It creates an inherent contradiction within your worldview that will make anti-imperialism nigh impossible and sabotage the movement in the long run. Just look what happened to the self proclaimed communists in Israel. Those places are now filled with ardent genocidal zionists. Is that what you want the fruit of all your efforts to be?",
        "like_count": 1,
        "published_at": "2024-08-25T09:45:20Z",
        "is_reply": true
      },
      {
        "id": "UgzLaBB9LuZmDFAx4HB4AaABAg.A70zbJyaZ15A7ZYQWsxg90",
        "author": "@seekingabsolution1907",
        "text": "​@mimosvetatrotskyite doesn't have any more merit as a term than tankie does. It's just as overused and meaningless.",
        "like_count": 4,
        "published_at": "2024-08-25T13:21:05Z",
        "is_reply": true
      },
      {
        "id": "UgzLaBB9LuZmDFAx4HB4AaABAg.A70zbJyaZ15A7x_SrEwxBy",
        "author": "@ReturntoYevropa-m1b",
        "text": "@kevintewey1157 _ _ _ _ infrared",
        "like_count": 1,
        "published_at": "2024-09-04T06:39:53Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxpYJvFhZXf83vIo0p4AaABAg",
    "author": "@larsetom1",
    "author_channel_id": "UCaUX2nrypX0ueBts5st2yRw",
    "text": "Both \"right\" and \"left\" as political ideologies are bourgeois, they are capitalist constructs. As you know Marx started using the appellation \"communist\" to differentiate Marxists from the soup of socialists who were not revolutionaries. Back in the 1960's the left was characterized by its antiwar stance, its distrust of big business and government and its stalwart and principled defense of free speech. Today, those people are on the right, not left (the left, in practice, has abandoned those principles). You should abandon the left/right dichotomy. The left are not your allies and arguably have done more to insidiously distort Marxism and working class politics than the right.",
    "like_count": 2,
    "published_at": "2024-08-12T17:20:25Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxpYJvFhZXf83vIo0p4AaABAg.A72VU3j9qHEA7ZY9JjMmDi",
        "author": "@seekingabsolution1907",
        "text": "No not really. The terms have more merit than this maga communist nonsense.",
        "like_count": 0,
        "published_at": "2024-08-25T13:18:44Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwkpdjONGZvs2VSg_Z4AaABAg",
    "author": "@Noneyo-Bidness",
    "author_channel_id": "UCfNYDGn9cQ_Gt1fU1lhe7wg",
    "text": "Being from a conservative rural area, I get MAGA communism. It's an Americanized version of Putin Communism.",
    "like_count": 9,
    "published_at": "2024-08-11T22:58:30Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgwkpdjONGZvs2VSg_Z4AaABAg.A70XNUpAUaoA70cU8JGciQ",
        "author": "@woodytobiasjr8265",
        "text": "no such thing as Putin communism, stop making sh!t up.",
        "like_count": 2,
        "published_at": "2024-08-11T23:51:51Z",
        "is_reply": true
      },
      {
        "id": "UgwkpdjONGZvs2VSg_Z4AaABAg.A70XNUpAUaoA7ZA90Y7WVw",
        "author": "@seekingabsolution1907",
        "text": "Socially reactionary and internally incoherent due to the contradictory interests of its constituents?",
        "like_count": 0,
        "published_at": "2024-08-25T09:48:59Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwQuhYzmxaA-8g-8DF4AaABAg",
    "author": "@morningstararun6278",
    "author_channel_id": "UCWfyN4p7053pFmOIKWe9aYA",
    "text": "Whenever I used to watch Haz just a couple of years ago, and even though it was evident that he was a well-read Marxist-Leninist, I thought that this guy has zero chance of uniting the real left. But now, all of his videos scream professionalism.",
    "like_count": 8,
    "published_at": "2024-08-12T09:55:36Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgwQuhYzmxaA-8g-8DF4AaABAg.A71h_AAz3olA72JusmISKR",
        "author": "@Zayden.Marxist",
        "text": "I think, like CPI, ACP will not last. Their theory is on shaky ground, lacking consistency...too influenced by cynical online meme culture.",
        "like_count": 2,
        "published_at": "2024-08-12T15:39:21Z",
        "is_reply": true
      },
      {
        "id": "UgwQuhYzmxaA-8g-8DF4AaABAg.A71h_AAz3olA72KLOwwziV",
        "author": "@morningstararun6278",
        "text": "@Zayden.Marxist  Hello Trot",
        "like_count": 0,
        "published_at": "2024-08-12T15:43:07Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwIQbjD1zXn_GegaxV4AaABAg",
    "author": "@xuaevorpnitsuj",
    "author_channel_id": "UCeXnArAR1HiDpVUMnMUEr-w",
    "text": "27:48 - this is an important point being made here about how there’s not enough militant left groups that are doing enough activism.",
    "like_count": 0,
    "published_at": "2024-09-24T18:22:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzBDWPV0kUZfAsDYV14AaABAg",
    "author": "@katehw6205",
    "author_channel_id": "UCU8KFEnlw7ULBmv9pxzILfQ",
    "text": "It's a pity that I am not an American, otherwise I would definitely join ACP.",
    "like_count": 14,
    "published_at": "2024-08-12T01:08:49Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzBDWPV0kUZfAsDYV14AaABAg.A70lHqQccBMA71GLg0W9ha",
        "author": "@JM57-99",
        "text": "Have you considered groups in your home country?",
        "like_count": 4,
        "published_at": "2024-08-12T05:48:57Z",
        "is_reply": true
      }
    ]
  }
]