[
  {
    "id": "UgwZMa8AkfanEXC5rZl4AaABAg",
    "author": "@elevensiestoteatime",
    "author_channel_id": "UCpkGdgLcd9zS85puMMDXogA",
    "text": "YES OLAYEMI the sexism in the \"girls develop earlier\" thing! Science is not free of bias- sexism racism homophobia ableism etc are deeply entrenched in medicalism and academia! 🔊🔊🔊",
    "like_count": 403,
    "published_at": "2025-02-02T21:49:29Z",
    "is_reply": false,
    "reply_count": 15,
    "replies": [
      {
        "id": "UgwZMa8AkfanEXC5rZl4AaABAg.AE30a7p54ZAAE3BR2dvDrs",
        "author": "@ookamiblade6318",
        "text": "Agreed a large part of that research that isn’t mentioned is that part of why girls ‘develop’ faster is that they are expected to. They are expected to participate in household chores earlier, which gives them responsibility earlier, which means they’ve been socialized to learn from authority earlier, which preps them for learning faster.",
        "like_count": 86,
        "published_at": "2025-02-02T23:24:14Z",
        "is_reply": true
      },
      {
        "id": "UgwZMa8AkfanEXC5rZl4AaABAg.AE30a7p54ZAAE3VXMnQB55",
        "author": "@frostyfrenchtoast",
        "text": "@ookamiblade6318 social development is still a world away from biological development - social factors wouldn’t alter your very biology. Females do develop their brains faster than males and reach maturity quicker, this is still a fact at this point. \n\nWhatever reasons for that in nature are largely gone though, humans are just so far removed from our natural environment that referring strictly to naturalistic traits to justify saying stuff to girls and young women is still very weird and gross. Anyone who appeals to that in reference to talking dirty towards a girl is a complete creep",
        "like_count": 0,
        "published_at": "2025-02-03T02:19:52Z",
        "is_reply": true
      },
      {
        "id": "UgwZMa8AkfanEXC5rZl4AaABAg.AE30a7p54ZAAE3ddumqQ_K",
        "author": "@xbabu142x",
        "text": "@ookamiblade6318 \nAye. Basically the skinny of it being neurobiologically that this responsibility and work causes girls to optimize their neuronal connections before boys. For anyone wanting to read into this btw: [Scientists at Newcastle University in the U.K. have discovered that girls tend to optimize brain connections earlier than boys. The researchers conclude that this may explain why females generally mature faster in certain cognitive and emotional areas than males during childhood and adolescence. The new study was published on December 19, 2013, in Cerebral Cortex.]",
        "like_count": 0,
        "published_at": "2025-02-03T03:39:32Z",
        "is_reply": true
      },
      {
        "id": "UgwZMa8AkfanEXC5rZl4AaABAg.AE30a7p54ZAAE3nqscNJNE",
        "author": "@ravenseden3959",
        "text": "Thank you",
        "like_count": 2,
        "published_at": "2025-02-03T05:08:41Z",
        "is_reply": true
      },
      {
        "id": "UgwZMa8AkfanEXC5rZl4AaABAg.AE30a7p54ZAAE3nscGJtbL",
        "author": "@ravenseden3959",
        "text": "​@ookamiblade6318  I agree",
        "like_count": 1,
        "published_at": "2025-02-03T05:08:55Z",
        "is_reply": true
      },
      {
        "id": "UgwZMa8AkfanEXC5rZl4AaABAg.AE30a7p54ZAAE7HnhemYRs",
        "author": "@smelly1060",
        "text": "​@ookamiblade6318correlation ≠ causation",
        "like_count": 5,
        "published_at": "2025-02-04T13:36:51Z",
        "is_reply": true
      },
      {
        "id": "UgwZMa8AkfanEXC5rZl4AaABAg.AE30a7p54ZAAE7QoQmwZXe",
        "author": "@ookamiblade6318",
        "text": "@smelly1060 yeah, it doesn’t always mean, but when you find a correlation you look for a causation, and this causation is what the research found. Correlation: pickpocketing and ice-cream sales correlate. Correlation doesn’t mean causation: ice-cream doesn’t pick your pocket. The causation: ice-cream is frequently sold in tourist locations tourists are easier targets for pickpockets.",
        "like_count": 8,
        "published_at": "2025-02-04T14:55:36Z",
        "is_reply": true
      },
      {
        "id": "UgwZMa8AkfanEXC5rZl4AaABAg.AE30a7p54ZAAE7Y-1AnsMy",
        "author": "@smelly1060",
        "text": "@ookamiblade6318 yeah I agree 100%, I was affirming your comment😀",
        "like_count": 7,
        "published_at": "2025-02-04T15:58:21Z",
        "is_reply": true
      },
      {
        "id": "UgwZMa8AkfanEXC5rZl4AaABAg.AE30a7p54ZAAE7_Bir1IrE",
        "author": "@ookamiblade6318",
        "text": "@smelly1060 😅 too much stress these days, I’m primed to take things negatively. Thank you for being reasonable which your response, it’s a good reminder that not everyone is out to misunderstand you!❤️",
        "like_count": 6,
        "published_at": "2025-02-04T16:17:33Z",
        "is_reply": true
      },
      {
        "id": "UgwZMa8AkfanEXC5rZl4AaABAg.AE30a7p54ZAAE7_WUwuzkl",
        "author": "@smelly1060",
        "text": "@ookamiblade6318  Real",
        "like_count": 3,
        "published_at": "2025-02-04T16:20:24Z",
        "is_reply": true
      },
      {
        "id": "UgwZMa8AkfanEXC5rZl4AaABAg.AE30a7p54ZAAE7_laqsp24",
        "author": "@smelly1060",
        "text": "@ookamiblade6318  gotta take couple weeks breaks from media once in a while (I know I need one)",
        "like_count": 1,
        "published_at": "2025-02-04T16:22:36Z",
        "is_reply": true
      },
      {
        "id": "UgwZMa8AkfanEXC5rZl4AaABAg.AE30a7p54ZAAE7cqZ69Gxy",
        "author": "@ookamiblade6318",
        "text": "@ wish I could, but I’m a member of pretty much all groups targeted, so unfortunately I have to keep checking if I still have health insurance today…..",
        "like_count": 2,
        "published_at": "2025-02-04T16:49:29Z",
        "is_reply": true
      },
      {
        "id": "UgwZMa8AkfanEXC5rZl4AaABAg.AE30a7p54ZAAE7f46xOWU7",
        "author": "@smelly1060",
        "text": "@ookamiblade6318  Thi is truly the worst fucking timeline wtf🤦🏿‍♂️ They better not do you or your loved ones dirty🤎",
        "like_count": 0,
        "published_at": "2025-02-04T17:08:57Z",
        "is_reply": true
      },
      {
        "id": "UgwZMa8AkfanEXC5rZl4AaABAg.AE30a7p54ZAAE7lpzjl5rl",
        "author": "@xiyu-m8z",
        "text": "@smelly1060 In ancient Greece girls were expected to have sx and and get pregnant the second they got their period for fear that periods made them go insane and that they’d off themselves. \n\nThe belief was Having sx immediatly would help stop that and getting pregnant would fix them permanently. The reality was that because of this perception those girls were scared and that’s what would drive them insane with night terrors and make them off themselves these girls were probably as young as 9 getting molested by old men or killing hemselves the second they bled. \n\nSo if anyone tells u girls are mature the second they get their periods have them know that historically that idea has been tested in many societies and it’s been nothing short of devastating. There’s a reason laws against pedophillia and any laws in general exist we don’t just suddenly decide on a whim to have them.",
        "like_count": 0,
        "published_at": "2025-02-04T18:08:03Z",
        "is_reply": true
      },
      {
        "id": "UgwZMa8AkfanEXC5rZl4AaABAg.AE30a7p54ZAAEBYvEZcw6c",
        "author": "@yunglynda1326",
        "text": "phew yeah...i don't trust the origins of the western medical field, especially not about sex & gender.",
        "like_count": 0,
        "published_at": "2025-02-06T05:23:23Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzCjNFMr4ADbnjLYwx4AaABAg",
    "author": "@QueenOfTheHorn92",
    "author_channel_id": "UC1JmE49M4_aCiAblswna-JQ",
    "text": "The best conversation I ever had with my nephews, was after we watched Inside Out 2.  I was so proud of them, for being so open and honest with me about their more confusing feels. All kids need feeling wheels!",
    "like_count": 210,
    "published_at": "2025-02-02T18:52:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzZP7kP30TXQCClDxN4AaABAg",
    "author": "@AshleyBaxter-m6c",
    "author_channel_id": "UC8vMvqOX1Wojo3BB5pP7wxQ",
    "text": "I also think it's weird if you can only see yourself in other men. It's similar when yt people say they can't see themselves in Black people.",
    "like_count": 376,
    "published_at": "2025-02-02T19:16:23Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgzZP7kP30TXQCClDxN4AaABAg.AE2k3l2-9YfAE32KI-JN4e",
        "author": "@lindensalter6713",
        "text": "Yeah that sounds like at least a couple of red flags. Something something lacking empathy something something not seeing certain someones as full human beings",
        "like_count": 78,
        "published_at": "2025-02-02T22:04:40Z",
        "is_reply": true
      },
      {
        "id": "UgzZP7kP30TXQCClDxN4AaABAg.AE2k3l2-9YfAE51aOcLiWw",
        "author": "@marslara",
        "text": "@AshleyBaxter-m6c fr i commented on some video about sexism in my hero academia about how it's weird people give the excuse media \"for\" men can't have good female characters since it implies men can't relate to female characters at all so there's no use in developing them. And the replies were just round about proving the weirdness by reiterating male audience means they don't want to focus on women 😭\n\nAnd I was trying to say you shouldn't have to be a woman to understand why having good female characters alongside your well developed male characters make more sense than leaving the women as cardboard cutouts cause.. sexism I guess.",
        "like_count": 9,
        "published_at": "2025-02-03T16:36:45Z",
        "is_reply": true
      },
      {
        "id": "UgzZP7kP30TXQCClDxN4AaABAg.AE2k3l2-9YfAE7niGQMskM",
        "author": "@xiyu-m8z",
        "text": "I legit had a white person tell me they don’t wanna play games where the main character isn’t a white man and tell me it’s the same as wanting representation cause of a recent game with a butch asian woman as the main character that got a lot of hate. I had to break down how that wasn’t the same at all. Minorities always interact with media outside of themselves we don’t want to only see ourselves we don’t complain about interacting with content that’s about others, we complain that there isn’t any content relatable to us.",
        "like_count": 26,
        "published_at": "2025-02-04T18:24:28Z",
        "is_reply": true
      },
      {
        "id": "UgzZP7kP30TXQCClDxN4AaABAg.AE2k3l2-9YfAEax4mmnLEY",
        "author": "@staciegreene2262",
        "text": "What’s wrong with saying that ? There is nothing about me as a black woman that I see in white women 🤷🏽‍♀️. Not just white women though , any non black person.",
        "like_count": 1,
        "published_at": "2025-02-16T11:23:32Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwbBGVEy5HzXgxiYlh4AaABAg",
    "author": "@AnneLives81",
    "author_channel_id": "UC7kQlCfHD4SpVN9ZcYocxDQ",
    "text": "Yall and FD Signifier have had the best take on this situation. Really appreciate the nuance and perspectives you bring to the discussion.",
    "like_count": 118,
    "published_at": "2025-02-02T20:45:37Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwbBGVEy5HzXgxiYlh4AaABAg.AE2uHKA3QgyAE3hDS8a9I_",
        "author": "@t_ylr",
        "text": "Yeah I appreciate all the other ppl calling Ak weird, but I'm glad someone said this stuff happens all the time.  Being real when I listen to those clips, I lived that lol. Like i experienced adultification and hypersexualization from adults and my friends. It's crazy as a adult I think about some of the things my friends showed me when we were 11-12. Like where did they get that from? What was going on in their home?",
        "like_count": 16,
        "published_at": "2025-02-03T04:10:44Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwOm00ew4IO4dHK2sV4AaABAg",
    "author": "@milodavis1",
    "author_channel_id": "UCfLiIo2Pj8S_9Fy6cNe9btQ",
    "text": "What pisses me off about the whole thing is that Nore is a Palestinian refugee who lost his mom and now lives in Malaysia and he doesn’t have any friends there. The kid survived gcide and is looking to make friends via streaming and ak and his friends are doing predatory stuff",
    "like_count": 94,
    "published_at": "2025-02-02T19:24:16Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwOm00ew4IO4dHK2sV4AaABAg.AE2kyUs0-8yAFm1_rAA8-R",
        "author": "@Hail2daChief",
        "text": "@milodavis1 and then calling the kid a loser and broke in defense of Akademiks",
        "like_count": 10,
        "published_at": "2025-03-17T15:14:39Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugwe43C9wk3yvCMnGqZ4AaABAg",
    "author": "@Monochrome_11",
    "author_channel_id": "UCilJpmInijSrsvMmoXnlKQA",
    "text": "32:45\n\nthis is off topic but Olay saying \"i never thought about that , so i don't have a position on it\" made me appreciate her more \n\nits really cool to see people admitting that and not feeling the need to have something to say",
    "like_count": 137,
    "published_at": "2025-02-02T22:59:38Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugwe43C9wk3yvCMnGqZ4AaABAg.AE38bpGjRoAAE54s99L9AM",
        "author": "@lwitte8857",
        "text": "For a person that KNOWS that they are intelligent, having not learned something yet is not a sign of weakness or a ding against their intellect. It is an opportunity to learn and grow. \n\nI am in school to be an occupational therapist and the best mentors I have had have been a wealth of knowledge but have also been fully comfortable saying “I’m not sure, do your own research and let me know what you find”. \nThis mentality is actually an important part of improving health outcomes. Having the confidence and depth of knowledge to effectively convey what you do know AND the humility (and TIME) to say “I don’t know, let me research that” when you don’t or even “let me double check” if you are uncertain. Knowing enough to understand that you have only seen a small part of what’s out there (Dunning-Kruger effect) AND being able to admit it helps people be life long learners and better medical professionals.",
        "like_count": 18,
        "published_at": "2025-02-03T17:05:23Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugy08Kb0-RjjpDRYMqt4AaABAg",
    "author": "@sporer_",
    "author_channel_id": "UCxQeKatABEuyiGz5UM0Vvqw",
    "text": "I was so incredibly impressed with maturity of nour. Craaaaaazy that a 15 year old had to be so much more mature than everyone else in a room full of adults",
    "like_count": 245,
    "published_at": "2025-02-02T20:27:04Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxRCgHIJX80vGcXyQ94AaABAg",
    "author": "@AshleyBaxter-m6c",
    "author_channel_id": "UC8vMvqOX1Wojo3BB5pP7wxQ",
    "text": "This is a societal problem not just in the U.S. but world wide.",
    "like_count": 118,
    "published_at": "2025-02-02T18:39:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzKMcMSSGjO8se10MF4AaABAg",
    "author": "@guyincognegro99",
    "author_channel_id": "UCGcNNwBWFbtlYlwPr2HsfxA",
    "text": "That AK clip was mad uncomfortable to listen to",
    "like_count": 27,
    "published_at": "2025-02-02T21:06:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyhOS5dVD_1jaJg6Zt4AaABAg",
    "author": "@evrycliquegrl",
    "author_channel_id": "UCmkRPuIqtqD2EfAGrJ7d4rQ",
    "text": "the moral of this video is: be friends with vibe killers who are not afraid to call people out on their mess when they say some off the wall bs",
    "like_count": 51,
    "published_at": "2025-02-03T06:01:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzpkqwAMrDrIksjtT14AaABAg",
    "author": "@DarkJJ13948",
    "author_channel_id": "UCs-jylw0bsDAihDzkGYN8gA",
    "text": "This talk makes me glad my mom raised me to be a mature adult, not a man, A MATURE ADULT. Someone who can evaluate and articulate his feelings instead of just bottling them up and someone who sees women as other people and not just sex objects or trophies",
    "like_count": 67,
    "published_at": "2025-02-02T21:52:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwrcSpONgr89cLVGll4AaABAg",
    "author": "@TheeChristopherEsley",
    "author_channel_id": "UCGQgK25q1ujyVSPp9LDRZFA",
    "text": "54:05 blew my mind. I’ve never thought of that being an insult to women. I always centered the man and was like, “that’s what you get…DAUGHTERS. Take that.” Like WTF. It’s such an insult and it again, dehumanizes women. This deconstruction thing is hard. 🤣",
    "like_count": 63,
    "published_at": "2025-02-02T23:31:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugywn3EazPQGf4c0oiJ4AaABAg",
    "author": "@rstocker19",
    "author_channel_id": "UC_G9Zek6SCMDn2n5kx4kvIA",
    "text": "This and the Aziz video were absolutely top notch commentary. Olay keeps slaying",
    "like_count": 25,
    "published_at": "2025-02-02T20:48:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgydKihMj0fa8JoVeDh4AaABAg",
    "author": "@CEN-Tyra",
    "author_channel_id": "UCh2N-cxD4Y9OdQ7nUtzyXjg",
    "text": "This and FD’s video (as well the one Olay did on A. Ansari) are excellent",
    "like_count": 11,
    "published_at": "2025-02-02T22:55:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzR0XgsUPqnrvCFUZB4AaABAg",
    "author": "@RblastonYT",
    "author_channel_id": "UCbNRzVNCOyrR-c_41p5XaqA",
    "text": "Olay I want you to know you always help with giving multiple perspectives and intellectual analysis.",
    "like_count": 98,
    "published_at": "2025-02-02T18:04:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyRFkm6Ep2uzww47tN4AaABAg",
    "author": "@messybear",
    "author_channel_id": "UC2EXmAt-aottdWjUfs2YqrQ",
    "text": "“He needs a feeling wheel” 💯So fucking accurate. Hell, I need a feelings wheel!",
    "like_count": 32,
    "published_at": "2025-02-02T20:21:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz1xBs8kcbAYujbt3Z4AaABAg",
    "author": "@aminazebra",
    "author_channel_id": "UCMK2L4Z_mQs6Ovt6ycr55XA",
    "text": "\"its not just a weapon that they wield, they fall victim to it everyday\" ‼️‼️‼️ that parttt",
    "like_count": 13,
    "published_at": "2025-02-03T04:44:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwAEKG0eAGAdsQINYF4AaABAg",
    "author": "@lucyleptonyx5858",
    "author_channel_id": "UCJA28dlOKkE6cadkptmEQNw",
    "text": "Men can't be therapized by women because they don't respect them as fellow human beings IS SO TRUE not all men obvi but the problem is so prevalent that it HURTS, it hurts to have useful info but to have to pass that along verbatim through a third party that they DO respect just to have it actually connect with someone's brain is so disheartening and infuriating. Love this podcast ❤❤❤",
    "like_count": 61,
    "published_at": "2025-02-03T00:44:22Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwAEKG0eAGAdsQINYF4AaABAg.AE3Kb1KwYjFAEEiWT_Tk3s",
        "author": "@JDBaldBabyVance",
        "text": "I don't want to downplay sexism or the devaluation of women among men, that is real and should be talked about, but I feel like this comment (save for the not all to leave deniability) underestimates how many guys might rightfully recognize men and women play two different societal games that gives them unique challenges, and might feel like a women might not understand them on a man level the way another man would. I imagine there are many women who feel the same way about the idea of having a male therapist and I assume we wouldn't jump to attributing that to not respecting men as therapists or people. I'm nonbinary, but I am male, and I recognize when I move through the world many people will look at me, assume man, and treat me thusly, and for that reason I'd probably also prefer to get therapy from a man who knows what's it's like existing in the world as a male and how men are treated in ways women aren't likely to fully understand. That said, if I couldn't find a male therapist I'm not wholly opposed to a woman therapist, something would be better than nothing if I felt I needed psychiatric help.",
        "like_count": 6,
        "published_at": "2025-02-07T10:53:43Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxyhUy_6W-ZeDiZqS14AaABAg",
    "author": "@AprileB-t1t",
    "author_channel_id": "UCy722K6inUFWYMs2q4MxZGA",
    "text": "This was such a beautiful conversation and ties right into the Aziz video. May we all continue these discussions offline. ❤",
    "like_count": 35,
    "published_at": "2025-02-02T20:00:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzgOHQDY59P8InvECt4AaABAg",
    "author": "@spooty5383",
    "author_channel_id": "UCC19OPniwzovqbRydMSBJ5w",
    "text": "Really insightful episode. Im not sure how I feel about boys starting school late. I've heard about that idea, but Olay brought up a good counter point that boys aren't raised with the same restrictions and responsibilities as girls so maybe its less about development and more about how we nurture boys. A lot to think about.",
    "like_count": 126,
    "published_at": "2025-02-02T19:16:34Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgzgOHQDY59P8InvECt4AaABAg.AE2k57a_ZspAE36GJbk9QV",
        "author": "@air-headedaviator1805",
        "text": "The way the other two guests approached the idea gave gender essentialism vibes. Almost suggesting that its biological and not cultural. Slippery slope, like if we actually delayed a male child’s schooling, its unlikely things would be different",
        "like_count": 34,
        "published_at": "2025-02-02T22:39:05Z",
        "is_reply": true
      },
      {
        "id": "UgzgOHQDY59P8InvECt4AaABAg.AE2k57a_ZspAE7I6QDI4V6",
        "author": "@smelly1060",
        "text": "​@air-headedaviator1805people that are essentialist don't realise that approaching gender from a primarily sociocultural point will eventually lead to us finding out which aspect are ACTUALLY biological, if we treat it all as if it is we will never get to that point tho",
        "like_count": 0,
        "published_at": "2025-02-04T13:39:33Z",
        "is_reply": true
      },
      {
        "id": "UgzgOHQDY59P8InvECt4AaABAg.AE2k57a_ZspAEEiootJi3X",
        "author": "@JDBaldBabyVance",
        "text": "@air-headedaviator1805 Plus, if anything, it sounds like it'd be another thing toxic men could point to to try and drum up stupid culture war issues. \"It's no wonder men and boys are falling behind! Women get an early year of school as a head start! They have an academic advantage to take away men's success!\"",
        "like_count": 0,
        "published_at": "2025-02-07T10:56:21Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugwkl_AkoPyBf8qxE3Z4AaABAg",
    "author": "@angelawesneski5029",
    "author_channel_id": "UC_6uyffmVpUSwGR_wkyN-Vw",
    "text": "As a teacher in Baltimore, this was a good conversation to listen to and remind myself of my beliefs around education and mentorship. Thank you! ❤",
    "like_count": 15,
    "published_at": "2025-02-02T20:53:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyzM8SIayM1gksR7VV4AaABAg",
    "author": "@charlamd",
    "author_channel_id": "UCWAG_Ncqfi4k9od7C2NGyeg",
    "text": "Passive-aggressively sending this to every man I know. Loved this conversation. It really bridges the gap of how society also finds any masc person that doesn't fit the mold disposable.",
    "like_count": 117,
    "published_at": "2025-02-02T19:47:33Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgyzM8SIayM1gksR7VV4AaABAg.AE2nd-NEdRjAEBhCul-tt2",
        "author": "@yunglynda1326",
        "text": "👏🏽👏🏽👏🏽",
        "like_count": 1,
        "published_at": "2025-02-06T06:44:35Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugy8jjnQqnsZUtXlgiN4AaABAg",
    "author": "@jamesmcmillan2656",
    "author_channel_id": "UC3-qw9M-4yl2QV7JNC1ffoA",
    "text": "I’m a 66 year old white guy living in Australia. You guys are so lucky to have access to this sort of thing. When I was young I was clueless, there was no one and no where we could access information from. The grown ups were just as clueless as us. I never take technology for granted because I grew up before the internet and am amazed still by how much better it is with it even with all the disinformation. PS those guys grooming that child are disgusting a holes.",
    "like_count": 22,
    "published_at": "2025-02-03T16:28:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyGQDp282BqCa1YAjV4AaABAg",
    "author": "@kaleb9375",
    "author_channel_id": "UCPQfkhxywZXgQb8CRKeJ6Eg",
    "text": "I was really happy to see Olay and Antoinette push back against the \"fact\" ( I've no clue where this idea originates or what sort of information it's steeped in) that \"girls mature faster than boys\", because it's always seemed like a nasty trap to me. Like, what are you insinuating when you say that? That boys are just innately incapable of having emotional intelligence on par with girls? It's a very odd way to suggest nature over nurture. As though emotional/social intelligence isn't something that needs to be taught to *everybody*. Because a lot of people out here, irrespective of their gender or race, tend to be emotionally inept. I don't know, it's always seemed like a weak way to justify a man's emotional incompetence. \n\nThis is sort of on topic, but it reminds me of the time my cousin readily admitted he intentionally did not teach his 2 sons how to cook or clean because it would be something \"their wives would take care of\". It's this sort of gender essentialism that only seems to serve men and put more burden on women to be competent in all these facets of personhood.\n\nI hope this comment made sense! As always, love the show and all the input the guests have to offer",
    "like_count": 269,
    "published_at": "2025-02-02T20:59:38Z",
    "is_reply": false,
    "reply_count": 7,
    "replies": [
      {
        "id": "UgyGQDp282BqCa1YAjV4AaABAg.AE2vt1EnIFxAE3CbmK_7xH",
        "author": "@ammonstyles5417",
        "text": "You spit nothing but facts🫡\n\nI'm really close with my little cousin, who has a tenuous relationship with her family. One of the biggest talking points between us is that she SHOULD expect more from the men and boys in her life, and that her non-cooking trifling ass dad teaching her that she should be the emotional punching bag is WRONG. I get hot everytime we talk and she mentions how they keep referring to her as a \"woman\" when trying to justify why she should understand the neglectful men in her life, or why she should take up emotional or laborious duties that should be reserved for consenting adult women.\n\nShe hasn't even turned 17 yet. You put it perfectly✊🏾",
        "like_count": 37,
        "published_at": "2025-02-02T23:34:34Z",
        "is_reply": true
      },
      {
        "id": "UgyGQDp282BqCa1YAjV4AaABAg.AE2vt1EnIFxAE3GawmuQT0",
        "author": "@juicyparsons",
        "text": "I think it's like an old wives' tale.....it's up there with like, black ppl don't need sunscreen or black men have bigger penises....it reminds me that quote that says benevolent racism is still racism 😯",
        "like_count": 0,
        "published_at": "2025-02-03T00:09:25Z",
        "is_reply": true
      },
      {
        "id": "UgyGQDp282BqCa1YAjV4AaABAg.AE2vt1EnIFxAE3onCOfzU1",
        "author": "@ravenseden3959",
        "text": "Thank you for saying this. I was never a girly girl. Nothing wrong with it. I just wanted to wear tee shirts and shorts and bagged pants. My mom wanted me to wear skirts like my twin sis. She dressed up more. We are two completely different people. My brothers weren't made to help clean until we got older. It was weird.",
        "like_count": 14,
        "published_at": "2025-02-03T05:16:55Z",
        "is_reply": true
      },
      {
        "id": "UgyGQDp282BqCa1YAjV4AaABAg.AE2vt1EnIFxAE3yTs21oGv",
        "author": "@lirhennegan",
        "text": "Also for the young boys who live in homes that don’t promote emotional maturity, pushing back the years that they could have mentorship in school is not good for them! If anything boys should be going to school/daycares younger and be being taught emotional maturity to make sure they can mature as fast as the rest of the population😭",
        "like_count": 16,
        "published_at": "2025-02-03T06:41:31Z",
        "is_reply": true
      },
      {
        "id": "UgyGQDp282BqCa1YAjV4AaABAg.AE2vt1EnIFxAE7nZDgVeUU",
        "author": "@tacrewgirl",
        "text": "Agreed",
        "like_count": 1,
        "published_at": "2025-02-04T18:23:06Z",
        "is_reply": true
      },
      {
        "id": "UgyGQDp282BqCa1YAjV4AaABAg.AE2vt1EnIFxAE8Iie6qCBn",
        "author": "@yolandayoung7462",
        "text": "They are generalizing physical growth with psychological growth. They should specify that generally speaking girls do start their growth spurt (physical maturation) before boys -- that is fact. However, there is no difference in the capacity for psychological/emotional growth between the sexes.",
        "like_count": 4,
        "published_at": "2025-02-04T23:04:08Z",
        "is_reply": true
      },
      {
        "id": "UgyGQDp282BqCa1YAjV4AaABAg.AE2vt1EnIFxAEA7b_tKjim",
        "author": "@Wesleigh11",
        "text": "Yo that later logic always making me so mad.  What do you mean \" the men don't have to learn cooking and cleaning? Only wives do that?\"\n\nLike I was 17 when I overheard one of my Grandpa's friends say something very similar. Even back then I knew that sounded dumb. Probably because I was starting to think about college and will I be going out of state and whatnot. I thought \"If that was really true,  What about when I am living on my own? As a bachelor, Won't I still need to cook and clean for myself until I meet a woman to be my wife?\" Like it didn't make sense to me to not have those skills.",
        "like_count": 13,
        "published_at": "2025-02-05T16:05:32Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw8q-4wnDojjfy_f-14AaABAg",
    "author": "@rxbynofficial",
    "author_channel_id": "UCkRbbiw-2mTRRwpzLErxvMw",
    "text": "completely off topic, but OMG y’all are all soooo beautiful 😍👏🏽✨",
    "like_count": 7,
    "published_at": "2025-02-03T12:05:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwu9cwp4yfVhi1eaXx4AaABAg",
    "author": "@sippingFAFOtears",
    "author_channel_id": "UCalp2V2Vy5APElJSr3EufEA",
    "text": "To Marquise: When I was around eight, a mean-spirited elder heard me singing and as trashed my voice. It didnt stop my love of music, but I'd only sing in choirs--no solos. It took until my 30s to kick their message from my subconscious, find and love my voice. All this to say, please stop hiding your smile! It's beautifully joyous! 😁 I might be dead wrong, but whomever/whatever made you feel the need to hide it, just know it was a lie. ❤",
    "like_count": 29,
    "published_at": "2025-02-02T19:25:31Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzy8pdnN1ckvaBbtBl4AaABAg",
    "author": "@Theredeyedjedi",
    "author_channel_id": "UCvRTVKN4CPDJ7KuxHK-bDsQ",
    "text": "This is like the black version of the view 😍",
    "like_count": 12,
    "published_at": "2025-02-02T20:02:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyC9xeC-e91BKRHIl94AaABAg",
    "author": "@cmgoodell",
    "author_channel_id": "UC053TcHvKdOB2b1PjrWhztg",
    "text": "There is a gap in the market for positive contenrt for pre-teens and teens which allows these incel streamers to get a hold of them. It is natural to look for community and unfortunately a lot of kids are finding toxic communities.",
    "like_count": 62,
    "published_at": "2025-02-02T20:51:15Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgyC9xeC-e91BKRHIl94AaABAg.AE2uvbo-LWwAE34MwX8T84",
        "author": "@Purpleunicorn2701",
        "text": "So true.",
        "like_count": 5,
        "published_at": "2025-02-02T22:22:30Z",
        "is_reply": true
      },
      {
        "id": "UgyC9xeC-e91BKRHIl94AaABAg.AE2uvbo-LWwAE3GPw18M87",
        "author": "@queentopia9225",
        "text": "I feel like that came in heavily with the Nickelodeon generation.",
        "like_count": 3,
        "published_at": "2025-02-03T00:07:46Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwKoBX0TqoYguEuvfV4AaABAg",
    "author": "@leovalenzuela8368",
    "author_channel_id": "UCR7iRtoT_k-6NKLDohGI7Qw",
    "text": "“Be in a community with people that truly give a fuck about you” means having to accept and atone for your mistakes when you get called out on them. Otherwise you’ll just push away those friends brave enough to call you out.",
    "like_count": 13,
    "published_at": "2025-02-03T05:08:20Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxwF6qRHtH8m-H6npV4AaABAg",
    "author": "@npviking",
    "author_channel_id": "UCLnXeHGqmZMtM9lFpiMMKNA",
    "text": "Oooo I'm never just in time like this ever.",
    "like_count": 22,
    "published_at": "2025-02-02T18:01:31Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyi-n1-DArf0IpGEGJ4AaABAg",
    "author": "@Wordabro94",
    "author_channel_id": "UCHkwzeUKSLpBbc_MAq951cw",
    "text": "Soon as the akademiks weirdo news dropped I waited patiently for yall commentary and I was not disappointed",
    "like_count": 6,
    "published_at": "2025-02-03T00:21:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw9AWcfqxFPVSPV_mh4AaABAg",
    "author": "@TimRealTalk",
    "author_channel_id": "UC0S_bsiliZjQvwLYjVIIrWQ",
    "text": "Great convo. Love ya olay ✊🏾✊🏾✊🏾🍉🔥",
    "like_count": 4,
    "published_at": "2025-02-03T18:56:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyxRhtpgBWsMZtI2Xd4AaABAg",
    "author": "@postie2014",
    "author_channel_id": "UCRRCV21-OprTkGwMB3XTAng",
    "text": "Dang I’ve never been this early 😭",
    "like_count": 42,
    "published_at": "2025-02-02T18:01:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzStiJOCpVfg7iGE7J4AaABAg",
    "author": "@TheJadeAffect",
    "author_channel_id": "UCVn-XaJ_PMJw-SXSYsFLSjA",
    "text": "woah this live had me popping so many bubbles about black men and them growing up. I didnt grow up with many young black boys around so this perspective was eye opening and i will be sharing because everyones viewpoints hit different targets! love love loved this conversation!🖤",
    "like_count": 4,
    "published_at": "2025-02-04T16:48:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyPrudCgefSWOULYwB4AaABAg",
    "author": "@air-headedaviator1805",
    "author_channel_id": "UCWMYj72ZH57zdr3mjZuRpMw",
    "text": "29:16 if I was a teacher and heard my students say Andrew Tate in good light, I’d be crushed.",
    "like_count": 30,
    "published_at": "2025-02-02T22:30:28Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgyPrudCgefSWOULYwB4AaABAg.AE35HJ8JKsKAE37dXNoYBB",
        "author": "@reneeagatsuma1579",
        "text": "but they do see him in a good light, unfortunately",
        "like_count": 3,
        "published_at": "2025-02-02T22:51:07Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzC41PrGO7AM_uiSPR4AaABAg",
    "author": "@JasniaL",
    "author_channel_id": "UCPyTwSCbPS4q_3Mfg3QEwDw",
    "text": "I promise I'm paying attention to the conversation but is that an engagement ring? Okay Olayyyyy! happy for you!",
    "like_count": 32,
    "published_at": "2025-02-02T19:31:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyBBmvYdutU3vI7uvN4AaABAg",
    "author": "@matthemming9105",
    "author_channel_id": "UCfvlyFwbihJlp8WPMAcFDuA",
    "text": "I always enjoy these conversations, but this one in particular was really important. Thank you ❤",
    "like_count": 20,
    "published_at": "2025-02-02T19:14:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwxpz_GQbeuGAXDI754AaABAg",
    "author": "@Violette2102",
    "author_channel_id": "UCZqi_OeizU99jU_0eUe0elw",
    "text": "I don’t know about the gender difference but there is an educational system called Waldorf that suggests you start teaching kids academics as late as possible, around seven, and spend the first years teaching kids to love learning instead through art, community building and social emotional training.",
    "like_count": 19,
    "published_at": "2025-02-02T23:53:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxWlMIcu7PWuSEbG-x4AaABAg",
    "author": "@PFIO",
    "author_channel_id": "UCuYzVqr7ipuNT3tISKrofUw",
    "text": "51:36 all men need to listen to THIS. Such a brilliant point.",
    "like_count": 5,
    "published_at": "2025-02-03T19:58:59Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy0PQLXPhGZUdWjwih4AaABAg",
    "author": "@awake3607",
    "author_channel_id": "UC2M02B9GtarLSia6ScKcRZA",
    "text": "WTF. Akademics is so cringe. I feel violated having heard that ish. Wow.",
    "like_count": 19,
    "published_at": "2025-02-02T21:09:11Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugy0PQLXPhGZUdWjwih4AaABAg.AE2wyyXSsJaAE3EpXefF6u",
        "author": "@TreeHairedGingerAle",
        "text": "That was WILD. 😢\n\nIt really is a marker of how so many people accept abuse and generational curses as \"tradition\".\n\nThe only right answer to, 'Well a lot of rappers have gone through that', is, \"Yeah, and it shouldn't have happened to THEM either.\" \n\nThat is a fact to be mourned. Not imitated.",
        "like_count": 7,
        "published_at": "2025-02-02T23:53:56Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxUossWFDie6mqhlzh4AaABAg",
    "author": "@texas_tankie",
    "author_channel_id": "UCqVNanpyxuVhjRi10yVJ9Nw",
    "text": "Damn this was such a great conversation. What a brilliant and thoughtful group. I learned something today from every person on the call. Thank you, Olay.",
    "like_count": 20,
    "published_at": "2025-02-02T19:43:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwDf9zf28Px9iaK3wl4AaABAg",
    "author": "@TrekStar11",
    "author_channel_id": "UCA6scFQTnpoAOCeuu22PSHQ",
    "text": "51:00 - 51:15 is such a powerful moment. I really gotta think on that and whether or not im seeing myself in people other then men",
    "like_count": 8,
    "published_at": "2025-02-02T20:50:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzu1n3e9Nd8BHYwFSZ4AaABAg",
    "author": "@reneeagatsuma1579",
    "author_channel_id": "UCSdIMiQZvnG_9iwZEunBeaQ",
    "text": "really thoughtful and amazing conversation.  I'm sending this to some teachers I know who are helping students work through toxic masculinity",
    "like_count": 6,
    "published_at": "2025-02-02T22:47:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyv_4G3t7j-LuLyD_54AaABAg",
    "author": "@Outsideaire",
    "author_channel_id": "UCooWXbtF9x-hqlWqLgbXE_w",
    "text": "51:43 This point really resonates with me. Personally I think a large part of my ability to empathize with others across lines of race/gender/sexual orientation/etc. is rooted in an early love of reading where I often was just identifying as/with the protagonist whoever they were.",
    "like_count": 9,
    "published_at": "2025-02-03T15:28:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwIi1CHIqYneKEAchd4AaABAg",
    "author": "@aquazilla-y4i",
    "author_channel_id": "UCcIcPHotWDoxZGbOctpF2QQ",
    "text": "Olay THANK YOU for your take on the boy vs. girl development thing, because I need people to know the statement “Girls develop faster than boys” that’s NOT backed up by biology, that is a societal issue. If you put as much effort into boys as you do girls they will develop the same. Boys are only see as “easier” to raise is because y’all doing anything with them🙄.",
    "like_count": 25,
    "published_at": "2025-02-03T14:42:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzw5pKGPU-eon4szv14AaABAg",
    "author": "@thairabullock6240",
    "author_channel_id": "UCFnk8OPHdVVnfXrc7_aKgxA",
    "text": "The weekly panels are second to none. One of my absolute favorite channels. The genuine respect, the ability to have different opinions and still respect and not talk over one another is 💛. I love us, through the fire and back. No one is going to save us, we will save ourselves 💪🏾.",
    "like_count": 5,
    "published_at": "2025-02-03T14:34:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwFLqrwhX5wCTeocz14AaABAg",
    "author": "@jaelynguyton3359",
    "author_channel_id": "UCtxF3Ka284E6E4P67iiuKDA",
    "text": "In just 2 minutes and 37 seconds I have learned more about this man that I needed to know. Knew he was a weirdo and now he’s a weirdo that needs to be locked up",
    "like_count": 8,
    "published_at": "2025-02-02T21:07:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyFgolyHOmCcPKU5wZ4AaABAg",
    "author": "@callmechegaming",
    "author_channel_id": "UCPmaJtcaZT804vlxMEPDDsw",
    "text": "Since we’re talking about what we watch specifically on YT/Content Creators shaping who we were as teens to now. I wanna mention that I first seen Antoinette when I was 18 and I am grateful that I can still relate to her and find value in her words even now that I’m 28.",
    "like_count": 6,
    "published_at": "2025-02-03T18:10:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwjIVG0VfYxtQ1vnAN4AaABAg",
    "author": "@morethanyourbasics",
    "author_channel_id": "UCjUiNl028-pnnKtPzT6rFWQ",
    "text": "1:07:00 as a black woman I hate to be within this dynamic. of being perceived and acknowledged as socially responsible but sometimes being iced out of social activities while simultaneously limited when you need an ear to hear you out.\n\nI'm balancing that for myself but I've found a lot of people who fit this criteria are better off as acquaintances in my life or less.",
    "like_count": 33,
    "published_at": "2025-02-02T20:47:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzDPSDfKKQID-yTXXF4AaABAg",
    "author": "@flyingninjamimejr",
    "author_channel_id": "UCbFDx0nqei-Bq6EhlHB-zjQ",
    "text": "usually im iffy about ensemble pop culture shows but everyone had great points and I enjoyed listening",
    "like_count": 6,
    "published_at": "2025-02-02T20:06:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw210VeP2tywiGxzCJ4AaABAg",
    "author": "@air-headedaviator1805",
    "author_channel_id": "UCWMYj72ZH57zdr3mjZuRpMw",
    "text": "13:05 it disturbs me hearing these grown man talking to this child like this. Like listening to how soft his voice is (not that it wouldn’t be wrong if his voice wasn’t) just really sells home how wrong these dudes are.",
    "like_count": 17,
    "published_at": "2025-02-02T22:13:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz8mjCkao9ns60XH6Z4AaABAg",
    "author": "@icemeoutlikeelsa",
    "author_channel_id": "UCtGHNotaejd58c4fmiBx02Q",
    "text": "oh thank god he got banned",
    "like_count": 23,
    "published_at": "2025-02-02T18:05:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy-5Jcg0UFvuZ17gYN4AaABAg",
    "author": "@MarshaManeater",
    "author_channel_id": "UClsMBN1fd24KXHsmWLMaJDA",
    "text": "Love the video! I wanted to say that I think we miss an opportunity to talk about how the ideas of success via patriarchy and capitalism harm us ALL when we hone the conversation in on little boys. I don’t want them to fall out of discussion but as an only child who is also a woman/femme, \nI fit into a lot of these conversations. Not because I’m read as a boy/man but because these are the lessons being taught to any child being pushed towards the ideals of success in our society. In the case of boys, they’re pushed that way because under patriarchy they’re forced to be providers/leaders. For me it was simply because it was understood that once something happens to my parents I’ll be on my own. That’s why I loved y’all discussing being able to see yourself across gender lines. Being able to see myself in men, helped me understand how deeply the patriarchy can affect anyone concerned with power and success no matter their gender.",
    "like_count": 6,
    "published_at": "2025-02-03T14:00:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwnv3RDvxWPB9D_oj94AaABAg",
    "author": "@justhearmeout3959",
    "author_channel_id": "UCL9UFx1qh2lE7PGBVQreQ3Q",
    "text": "Dude 50 said this about Drake fans and I didn't believe him at first 😱",
    "like_count": 10,
    "published_at": "2025-02-02T18:54:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgztoDmj8wXv9OioUIt4AaABAg",
    "author": "@tech396",
    "author_channel_id": "UC8FnJx-ffhCXJ3xU0GjhxNw",
    "text": "Watching this video showed me I'm that responsible friend. I have had several of my guy friends straight up tell me. \"I aint tell you because I knew what you was gonna say\" after they done did some fuck shit, now they wanna talk about they feeling in the after math",
    "like_count": 7,
    "published_at": "2025-02-02T22:55:09Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw4J0rgqzCZo6t_lUJ4AaABAg",
    "author": "@kdennis2461",
    "author_channel_id": "UCHkspP37vcoRJ9PaQ0KwAZw",
    "text": "The clip is so much worse than I imagined",
    "like_count": 6,
    "published_at": "2025-02-03T01:53:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwsec7VbiYp79ibEQF4AaABAg",
    "author": "@fordgtbangout",
    "author_channel_id": "UCVqVofKI-toaVLwtt74BAGA",
    "text": "This Pod\n\nHelps",
    "like_count": 16,
    "published_at": "2025-02-02T17:42:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz8zEESm0Rz5Xpv9xJ4AaABAg",
    "author": "@oneshoej3",
    "author_channel_id": "UCjXorBTcHo480imclFn0Ing",
    "text": "51:10 @blacklvrboy makes a great point about how men need to be able to see women, and not just other men, as role models and leaders",
    "like_count": 4,
    "published_at": "2025-02-09T21:51:36Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwu34fFo9XNuB-iOwp4AaABAg",
    "author": "@electricVGC",
    "author_channel_id": "UCAw804fYCKuDryihLYXME7Q",
    "text": "i'm in a position now where my dad has finally done a lot of real work to unpack that patriarchial ideology as a man in his early 50s, but now he's a lot less involved in mentorship than he was when he was younger and worse, and i'm really trying to push him into doing mentorship now. feels like a lot of the men who were unable to escape being in mentorship positions in their community are now much more able to escape it due to the way communication and life is now",
    "like_count": 7,
    "published_at": "2025-02-03T02:04:34Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwmsAf7E7CCKV2gk1t4AaABAg",
    "author": "@mitchelldunn9149",
    "author_channel_id": "UCDoFwRoLjK54xCTClryiwBQ",
    "text": "One thing I’ve always wondered about  involving these kind of men and their relationship to sex, is where does their actual sexuality begin in comparison to what they think/been told by other men/pornography?",
    "like_count": 6,
    "published_at": "2025-02-03T03:22:36Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy-fpXn_MET0RYUS5l4AaABAg",
    "author": "@4aquilah",
    "author_channel_id": "UCwR-3m9ESiXMCr5WPd9uRIw",
    "text": "This man's name has been all over my social media feed and I've ignored every person's video until I saw it was Olu and friends. I'd listen to y'all talk about anything!",
    "like_count": 3,
    "published_at": "2025-02-02T20:55:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyiTqXlUmF57hklK154AaABAg",
    "author": "@dietbrasher7838",
    "author_channel_id": "UCELiaLk6h-NmxX22In0YV0A",
    "text": "Wonderful again Olay! Thank you for the work you do! ❤",
    "like_count": 8,
    "published_at": "2025-02-02T19:15:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzJgaq_hE9BIXuVa4d4AaABAg",
    "author": "@ChristopherSadlowski",
    "author_channel_id": "UCVgXUeZyX4OhHuEPh8RvYFA",
    "text": "Wow, I've never heard someone say, \"I see myself in women as a man.\" At least I don't remember hearing a man say that out loud. I'm sure many men feel this way but our society prevents them from being open about that. I'm a man who can see myself in girls and women, and in other men too. It's made my life so much bigger and more expansive having this kind of...empathy? Is this a kind of empathy? I don't know; chat can correct me because I'm sure that's not the right word. Anyway, let's teach boys and men to see their strength, power, and whatever else in the women they meet. It's not THE solution to misogyny, but it is A solution, and a easy place to start in my opinion. Admiring a woman/femme doesn't make a boy or man \"a girl\" or worse...\"a gay\"! 😄 \n\n::sigh:: We have so much damn work to do...",
    "like_count": 14,
    "published_at": "2025-02-02T20:18:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxzUwpNRC5N85RHX5N4AaABAg",
    "author": "@nickrelax1",
    "author_channel_id": "UCuPb5S37DYFF_ys3etuhVSw",
    "text": "I've been noticing a lot of the younger people i work with, having some particularly interesting takes. I mostly mind my business, but when i hear stuff that refers to gender roles, i always gotta push back on it. Ive heard stuff from they are feminizing men from 16yo teens to you dont want your partner to be independent from you from 19yo teens. I always challenge their thought process. And maybe its due to the youth but they end up getting so close but ending it with a shrug and give up before they realize the problem.",
    "like_count": 16,
    "published_at": "2025-02-02T21:18:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzeVdmUuJQchvzknU14AaABAg",
    "author": "@yourneighborhoodfriendlyme4242",
    "author_channel_id": "UCn5KAZuLeVmeQLXSMJNBMcA",
    "text": "My weekly therapy session is here! Love you so much Olay! Always introducing me to new voices too! ♥️♥️🥳🥳\n\nI've never heard a good thing about Akademiks. I think the first time i saw him was him being weird talking to our about Hasan. Then i found out he was Drake's strongest soldier. Then i found out FD hated him about as much as Drake it seemed. Now I'm hearing predators do indeed move in flocks. Who'd of thought 🤷🏾‍♂️🤷🏾‍♂️🤦🏾‍♂️🤦🏾‍♂️. \n\nI hope people start to see that once again this whole little situation is a product of patriarchy and toxic masculinity. People get sick of hearing it, but idk what to tell folks. Truth hurts. Nothing new under the sun. \n\nI wonder if society will ever progress pass this moment.",
    "like_count": 10,
    "published_at": "2025-02-02T19:25:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxmWQoCgGf9kyF7Aep4AaABAg",
    "author": "@RedRyz3n",
    "author_channel_id": "UCMiSUpqili8MzSQcFZxrjBw",
    "text": "I think having conversations like this with kids should be illegal, and jail time should be part of the punishment.",
    "like_count": 3,
    "published_at": "2025-02-03T13:40:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxogmIRmuXqcybxP2V4AaABAg",
    "author": "@djgreeneggsandhampton8680",
    "author_channel_id": "UCuUbTo0dBUUldedntE-q6qg",
    "text": "I'm 26 and I didn't realize I had been to conflate all forms of intimacy as sexual intimacy and I didn't realize how that had been messing me up.",
    "like_count": 12,
    "published_at": "2025-02-02T21:44:00Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxogmIRmuXqcybxP2V4AaABAg.AE3-xssp7dKAE3BJepWOML",
        "author": "@Violette2102",
        "text": "Been there. You’re out of the matrix now.",
        "like_count": 6,
        "published_at": "2025-02-02T23:23:14Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyHYI88o96yoQDZmfJ4AaABAg",
    "author": "@groovy3443",
    "author_channel_id": "UCdSal635kWTJMKOZeCae5XQ",
    "text": "I see Christian and Antoinette on the thumbnail I click",
    "like_count": 4,
    "published_at": "2025-02-03T03:25:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxoo0kxdgHSAARxczV4AaABAg",
    "author": "@theprisera1221",
    "author_channel_id": "UCGKfCuqXhYujyOm5QB2GqCg",
    "text": "such a beautiful episode full of love",
    "like_count": 2,
    "published_at": "2025-02-03T06:10:27Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx1Vr5bSdNoNAdhQmR4AaABAg",
    "author": "@Herola279",
    "author_channel_id": "UC-yjlxi1Yap-DXKrrDvBN0A",
    "text": "34:30 Thank you, Antoinette!!! It seems that this portion of the conversation is always the least addressed. It’s tiring to simply want this entire matter to be viewed and only see that there is nothing shown to benefit men for doing this.",
    "like_count": 4,
    "published_at": "2025-02-03T18:33:33Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyiNU89OstubfSYOQx4AaABAg",
    "author": "@yunglynda1326",
    "author_channel_id": "UC8RPr5fBFMRj9iryyI4yj3Q",
    "text": "i love this show💚💚💚",
    "like_count": 2,
    "published_at": "2025-02-06T06:00:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzUJkkVHg7E29TaArB4AaABAg",
    "author": "@july-youlied202",
    "author_channel_id": "UCjYJUlyX1EOw-eHGFPd6rSA",
    "text": "Just in time",
    "like_count": 10,
    "published_at": "2025-02-02T18:02:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz6mqqDJSEMAfJz5aJ4AaABAg",
    "author": "@tacrewgirl",
    "author_channel_id": "UCIyfJB1S8xqkp-SBK2sUTFA",
    "text": "34:30 - Thanks Antoinette for pushing back on emotional intelligence not being taught to boys.",
    "like_count": 2,
    "published_at": "2025-02-04T18:30:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugycyg2eZiI7HmMRFW54AaABAg",
    "author": "@brib6046",
    "author_channel_id": "UCukQ4YJGA7YTkgKlYmlqjiw",
    "text": "32:29 but do boys really develop later or are we holding boys to a standard that’s on a lower level?",
    "like_count": 26,
    "published_at": "2025-02-02T20:33:12Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugycyg2eZiI7HmMRFW54AaABAg.AE2srNBoYWVAE3f8rpUf6U",
        "author": "@xbabu142x",
        "text": "The latter truly. Girls develop neuronal complexities and such sooner than boys due to being asked to do structured complicated chores younger than boys.  \n\nLiterature for reference:\n[Scientists at Newcastle University in the U.K. have discovered that girls tend to optimize brain connections earlier than boys. The researchers conclude that this may explain why females generally mature faster in certain cognitive and emotional areas than males during childhood and adolescence. The new study was published on December 19, 2013, in Cerebral Cortex.]",
        "like_count": 0,
        "published_at": "2025-02-03T03:52:38Z",
        "is_reply": true
      },
      {
        "id": "Ugycyg2eZiI7HmMRFW54AaABAg.AE2srNBoYWVAE7T9ytD_aI",
        "author": "@ncpsbh1504",
        "text": "the standard they're held to is on the floor. I would think that speaks to the root of a lot of the negative reactions they have when women and fems try to hold them to standards even an inch higher as adults.",
        "like_count": 5,
        "published_at": "2025-02-04T15:16:09Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyXzrxqT0826ee_ac94AaABAg",
    "author": "@65avo65",
    "author_channel_id": "UC3_C-uI9aazuOXv19Hg8BUg",
    "text": "Where is that poor baby? Who are his parents? - they deserve flowers if they had anything in I do with him knowing how to respond. That kid is beyond mature. He’s been raised correctly despite mess like this in so many party rooms.",
    "like_count": 12,
    "published_at": "2025-02-02T20:54:45Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgyXzrxqT0826ee_ac94AaABAg.AE2vKArPGDtAE3erUdARka",
        "author": "@xbabu142x",
        "text": "He's a Palestinian refugee living in Malaysia with just his dad since his mom passed. On top of all that they were  telling him he was sad due to not having money. Not due to being displaced by an ongoing genocide to his people, losing multiple family members including his  mother.  What a horrific bunch of psychopaths for real. Literally trying to prey on the most vulnerable. The more I learn the more disgusted I am.",
        "like_count": 3,
        "published_at": "2025-02-03T03:50:07Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwYEIlyPEcjD8dCU8p4AaABAg",
    "author": "@SmartDave60",
    "author_channel_id": "UCOofJMI_Qpex95KWFZ29Ypw",
    "text": "I remember being 12 and other boys asking me if I’d “gotten some” yet and then laughing at me hysterically when I said no. \nI remember at the time feeling ashamed but years later as an adult realizing how ridiculous it all was. \nNone of them were doing anything.",
    "like_count": 3,
    "published_at": "2025-02-03T23:33:04Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgykrrsLw9emGz_SATZ4AaABAg",
    "author": "@peggingthestallion6365",
    "author_channel_id": "UCOhE28h5oWs_shUC7sHwGXg",
    "text": "Yall look into his bestfriend lil boom situation from walmart last year. He has a whole groom unit",
    "like_count": 7,
    "published_at": "2025-02-02T20:36:35Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgykrrsLw9emGz_SATZ4AaABAg.AE2tF6fCdFKAE3fZt30kAT",
        "author": "@xbabu142x",
        "text": "Lil boom is a full on predator, he was sticking phones under the skirts of little children and taking pictures. It's all on video.",
        "like_count": 0,
        "published_at": "2025-02-03T03:56:19Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyTVRaaLmWLsLN6IB54AaABAg",
    "author": "@ammonstyles5417",
    "author_channel_id": "UC1PxTC-Wdao6h0DUFYjvQ6Q",
    "text": "40:52 KEEP COOKINGGG",
    "like_count": 2,
    "published_at": "2025-02-03T00:48:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzOWMmHJ8UwrXuEiad4AaABAg",
    "author": "@VanAlexi",
    "author_channel_id": "UCEotEL2SdPRd-CgtxnjqTdg",
    "text": "I learned about this from Breakfast Club, then when DJ Envy tried to give props the kid for recognizing grooming, Charlamagne The Clown wanted to make Diddy jokes of all things.\n\nI'm glad I stopped watching The Breakfast Club, the video just popped up in my algo.",
    "like_count": 81,
    "published_at": "2025-02-02T19:28:15Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgzOWMmHJ8UwrXuEiad4AaABAg.AE2lQdbomsIAE3INGadrtp",
        "author": "@juicyparsons",
        "text": "Same. I was actually just saying I'm really grateful that a new class of smarter, more mature YT commentators have come into the hip-hop space- I don't need mfers like Joe Budden and CTG anymore",
        "like_count": 17,
        "published_at": "2025-02-03T00:24:53Z",
        "is_reply": true
      },
      {
        "id": "UgzOWMmHJ8UwrXuEiad4AaABAg.AE2lQdbomsIAE6sEoJYK9s",
        "author": "@a1ntcry1noveru",
        "text": "@juicyparsons I generally agree, but even Joe Budden had a good take on this . He’s matured a bit, but still problematic in many ways",
        "like_count": 4,
        "published_at": "2025-02-04T09:44:46Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyNJ6c8BKz2VJlyP-t4AaABAg",
    "author": "@princekareem",
    "author_channel_id": "UC1ek_ZocHUBqfRI753003Sw",
    "text": "I feel like it's the way the hip-hop reactors picked up on it that propelled this and a child being involved. It's post-beef awareness people have about Ak and his closeness to Drake",
    "like_count": 3,
    "published_at": "2025-02-03T02:44:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyMO9kT1ugGjso-1Nd4AaABAg",
    "author": "@sherr275",
    "author_channel_id": "UCV2zlNvkmFRbvFt3uPc6Ouw",
    "text": "I think people are seeing it differently this time because it's a literal child he was grooming online. As a woman, I cannot understand how he has never been cancelled prior but I do realize that sadly, this world doesn't give a damn about Black women so they don't care when men disrespect or abuse us. I just hope this is the last we hear of him until he's locked up. this shit is ridiculous",
    "like_count": 14,
    "published_at": "2025-02-02T22:18:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzGyRv1_VdjgRIJhXd4AaABAg",
    "author": "@veronicajade20",
    "author_channel_id": "UCzJAhm88rhuY5A58CRTqH4w",
    "text": "Akademics has been garbage since he defended Tory Lanez for his crime against Megan thee Stallion. Can't stand him.",
    "like_count": 6,
    "published_at": "2025-02-04T00:25:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz9CrG8EMduRX3RArd4AaABAg",
    "author": "@woopwoopswoop",
    "author_channel_id": "UC0vPhxtLU8LUeb1LiyVNXWg",
    "text": "Pedagogy of the oppressed by paulo freire is about redefining education system, highly recommend",
    "like_count": 2,
    "published_at": "2025-02-03T16:13:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwcGeFFOUvVE7OMZTB4AaABAg",
    "author": "@Ezargli",
    "author_channel_id": "UCaIe8_8-Io4WM45QNdiWvfA",
    "text": "\"Canceling\" is so fake. Chris Brown just won best R&B Album, and Louis CK won best comedy thing the year after he was \"canceled\"",
    "like_count": 6,
    "published_at": "2025-02-03T16:57:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyBuIMAlA2ogdVAcX14AaABAg",
    "author": "@jadedsabre13",
    "author_channel_id": "UCPezM5d23l69c1rpkGs1gqw",
    "text": "Shame that FD wasn't on this panel, I would have loved to see the number 1 Ak/Drake hater getting to let loose lol",
    "like_count": 7,
    "published_at": "2025-02-02T20:58:34Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzRSBPdRNBrUcfFZQp4AaABAg",
    "author": "@tylerhackner9731",
    "author_channel_id": "UCbwlrgLNVjnejJT6NKWfzMQ",
    "text": "Never liked the man",
    "like_count": 22,
    "published_at": "2025-02-02T18:13:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwCtQTFDTr4SfgV1ER4AaABAg",
    "author": "@BBDxGAMER",
    "author_channel_id": "UCk_I7Bx6uUVXzFWReS46Ohg",
    "text": "35:10 Antionette is the realest for coming at the point holistically and not just shifting the blame on Cis men genetically and explain its a societal problem",
    "like_count": 21,
    "published_at": "2025-02-02T21:23:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy0_W2hueDXvcVXR8d4AaABAg",
    "author": "@JayRushinComedy",
    "author_channel_id": "UCH9lRX6_LhVp-l2VLtJh5HA",
    "text": "I’m so glad Xian is legally allowed to be in a video longer than 3 minutes",
    "like_count": 2,
    "published_at": "2025-02-04T23:06:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz7ZwtkFlNJkjH_hDN4AaABAg",
    "author": "@khamilaalebiosu",
    "author_channel_id": "UCkpvfV0Skv-7TbEC8dlpLBw",
    "text": "Love this discourse!",
    "like_count": 1,
    "published_at": "2025-02-02T20:09:33Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyTD-MiSiH1ukuBauZ4AaABAg",
    "author": "@Vward5182",
    "author_channel_id": "UCmg69vJk2XbFxdoSzzSYVbw",
    "text": "Similar outburst like R Kelley ehen confronted",
    "like_count": 1,
    "published_at": "2025-02-02T19:29:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxoerWhknNG-vzBbPd4AaABAg",
    "author": "@tipp8437",
    "author_channel_id": "UC9mckX6NlRy4-GifwhjKXdA",
    "text": "21:00 stuck in their second childhood",
    "like_count": 2,
    "published_at": "2025-02-02T20:09:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyG4Q8tHlMrUpXIHaJ4AaABAg",
    "author": "@apparentlylivin",
    "author_channel_id": "UCopT202oXwKGh1OoRe_ELqg",
    "text": "I love this channel",
    "like_count": 2,
    "published_at": "2025-02-04T19:54:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw_J5Q5k7D5MekXgWt4AaABAg",
    "author": "@JonDundas10",
    "author_channel_id": "UCmjFGGxplRfcATGTOi7lsnA",
    "text": "Akademics has always been a complete loser, he's been making a fool of himself since Desus and Mero lmao",
    "like_count": 6,
    "published_at": "2025-02-02T19:57:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxrmGucYbVROT-Ss4J4AaABAg",
    "author": "@LucindaR",
    "author_channel_id": "UClnlaqX8aOsLw1fnWIfPmFQ",
    "text": "ssshhhhhiiiddddd I need a feelings wheel",
    "like_count": 1,
    "published_at": "2025-02-03T13:50:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwmonyQzk2WB2mYie94AaABAg",
    "author": "@Demonreached",
    "author_channel_id": "UC-3lBOv4GMrRnhtMmoGEymA",
    "text": "I love your intro!",
    "like_count": 1,
    "published_at": "2025-02-16T23:12:09Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyZ30wl7neIeMOiHt94AaABAg",
    "author": "@NotSoCivilEngineer",
    "author_channel_id": "UCPc2VLBcTAVFJ_txGDvuQ5g",
    "text": "33:00 I’m aware of this research, but I’m also aware of research from 2021 that showed that, in the US, gay men have the highest rates out of all combinations of binary gender and sexual orientation of obtaining both undergraduate degrees (52% compared to the national average of 36%) and advanced degrees (6% compared to the national average of about 4%).\n\nThat same study found gay men in each of the four major racial and ethnic groups recognized on the US census, in aggregate, academically outperformed the straight men within the same racial/ethnic groups.\n\nThere is some interesting exploration for potential reasons why this plays out for gay men like this, but it still is interesting because I have no reason to believe that gay men are somehow inherently more academically inclined than straight men.",
    "like_count": 7,
    "published_at": "2025-02-03T00:30:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzQdQgEMb6ySuoBE8Z4AaABAg",
    "author": "@listamato",
    "author_channel_id": "UCKTaCkZ0UZLH1qmUbqLrE_w",
    "text": "Wait. Am I the CJ. Lol Some things really make sense now. Oh wow. Thanks for that part. Geez.",
    "like_count": 4,
    "published_at": "2025-02-02T21:10:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxdnpMz0lId1OWhYDF4AaABAg",
    "author": "@l.h.5629",
    "author_channel_id": "UCE2wCqon1WOcIxSrHSDneJg",
    "text": "When we talk about \"rewarding\" boys who develop social emotional learning skills and emotional intelligence... what exactly do we mean? What would be a reward?",
    "like_count": 2,
    "published_at": "2025-02-03T02:11:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyCUkd0oSllQq4VIud4AaABAg",
    "author": "@brudamo9203",
    "author_channel_id": "UCz_OH5hMel7gp7ewo1BHjVA",
    "text": "Whoa that next inside comment was wildly disgusting.",
    "like_count": 1,
    "published_at": "2025-02-03T01:55:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxAQjOH6ZjtuilE4_Z4AaABAg",
    "author": "@aaronstewart3352",
    "author_channel_id": "UCnAo9YDJ-Z2fTDwe12eTYcA",
    "text": "This isn’t a trauma dump, bc I’ve done the work to come to terms w it, but I was molested by my stepdad for years in high school. The single largest issue I had to work on through therapy is the fact that, bc I felt this physical imperative and drive towards sex as a teenage kid, I spent a large amount of time wrestling with the idea that it was something that I wanted, or that I “asked for it” (spoiler: I didn’t). Growing up in a very small, conservative, and homophobic, pro abstinence area, I had no one to talk to or work through those feelings, which made me vulnerable to abuse, and that’s what predators prey on. They rely on ignorance and the power dynamic. Education is fundamental. Letting your boy explore their feelings, letting them know that it’s safe to be open about sex and sexuality, letting them know about boundaries, letting them know about bodily autonomy, is so crucial to making sure that they don’t fall victim to predators. I really appreciated this discussion.",
    "like_count": 3,
    "published_at": "2025-02-04T21:20:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy2bS6ZqGqph4GI9BF4AaABAg",
    "author": "@ImaniBlues",
    "author_channel_id": "UCsymYMz0hPW8DZf2NjmBPbw",
    "text": "I think it’s important not to infantilize those men by saying they didn’t know any better. They knew better. What they didn’t know, is that everyone would decide that protecting a child is a priority given the history. Says more about where we are as whole for sure.",
    "like_count": 5,
    "published_at": "2025-02-03T21:43:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxFjIS-a_hFqu1P9Gh4AaABAg",
    "author": "@mahaliahlittle1914",
    "author_channel_id": "UC7miaVUOaZxlUBfRk3CFYDA",
    "text": "I appreciate your channel and the conversations you facilitate! I just wanted to comment that some of the comments from the commenters (a) coddled men’s decisions - for example, you don’t have to know about patriarchy to necessarily know, for example, you’re hurting someone repeatedly. Ak and Boosie and Tory are not teenage boys that are seeking out motivational content that end up getting sucked in because they’re impressionable. I also felt like some of the comments about girls maturing faster or being more emotionally intelligent were a little essentialist. Girls are given responsibility at an early age - for cleaning, helping others, care taking etc, and these things manifest as seeming “more mature.” I really appreciated your comment recentering socialization in the conversation! Thank you! Boys don’t get much direction as you mentioned (left to their own devices but also taught to routinely repress their emotions), but they’re also, either directly or implicitly incentivized to pursue their own interests. Girls only seem to develop faster because they’re socialized to be more considerate. Still a great convo! And again, I think socialization is the big baddie in everything, not innate gendered traits",
    "like_count": 1,
    "published_at": "2025-02-04T07:51:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyjdwo6b8BcP6vXbKZ4AaABAg",
    "author": "@sooksNJ",
    "author_channel_id": "UCsGi-QNipzZcVjiyeh9j9dg",
    "text": "He is a creep. I only see him when he is crashing out or perving out.",
    "like_count": 1,
    "published_at": "2025-02-06T20:29:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzWE29eGs1iOy2ykVR4AaABAg",
    "author": "@mandrillsass5687",
    "author_channel_id": "UCup0mavPBikswupnlaVbcOw",
    "text": "That guy should be sent to gen pop see what they do to him",
    "like_count": 1,
    "published_at": "2025-02-06T19:16:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy4W1FChZCjeyZ1LFZ4AaABAg",
    "author": "@curvelinedot",
    "author_channel_id": "UCLNxjohaCjBcaKV0tpqkUBQ",
    "text": "Girl I’m always there when they want to go rehab n not at same time",
    "like_count": 0,
    "published_at": "2025-05-28T10:22:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzHs47Hf4GgwItPrnd4AaABAg",
    "author": "@annnee82",
    "author_channel_id": "UCaspbpjFmQgpMQMFSrJ7GEA",
    "text": "I finally saw a belly I’m screaming and happy for you Olay!!! 🎉🎉🎉🎉 congrats and happy and healthy blessings to you and yours",
    "like_count": 0,
    "published_at": "2025-02-03T02:32:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwVuLkUsufObdOcUOF4AaABAg",
    "author": "@RemembrancerMersadieOliton",
    "author_channel_id": "UC2NZDq4dL1sflFdPoc5K4ow",
    "text": "everyone else but FD was talking around this thank you for this",
    "like_count": 344,
    "published_at": "2025-02-02T19:18:23Z",
    "is_reply": false,
    "reply_count": 18,
    "replies": [
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE2l-dzg1nV",
        "author": "@Marss_8",
        "text": "too much “ I respect what he built but” money buys male respect smh",
        "like_count": 108,
        "published_at": "2025-02-02T19:24:34Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE2rgvSd4jH",
        "author": "@michalapalmer8874",
        "text": "FD talked about this on his B sides what 😭",
        "like_count": 96,
        "published_at": "2025-02-02T20:23:02Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE2s9cNg5cR",
        "author": "@pandapplepiee",
        "text": "he did.",
        "like_count": 31,
        "published_at": "2025-02-02T20:27:05Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE2xOxyIBX9",
        "author": "@naviisnothere",
        "text": "@michalapalmer8874 Op is saying everyone except for FD",
        "like_count": 42,
        "published_at": "2025-02-02T21:12:53Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE2yoZqsUgJ",
        "author": "@sevenkpink2894",
        "text": "@naviisnotherebut he did talk about it lol on his B side channel",
        "like_count": 16,
        "published_at": "2025-02-02T21:25:15Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE2zhg1ZdZv",
        "author": "@naviisnothere",
        "text": "@sevenkpink2894 read the original post again, they’re saying that everyone EXCEPT for FD was talking around the topic . They’re saying that FD did talk about it and others chose not to.",
        "like_count": 0,
        "published_at": "2025-02-02T21:33:03Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE3-_9V6SSc",
        "author": "@IamEmpr3ss",
        "text": "@michalapalmer8874  They know he spoke about it, hence why they said FD didn't speak about the situation in a round about way like many others did. They are saying Fd spoke directly to the issue instead of dancing around the topic.",
        "like_count": 91,
        "published_at": "2025-02-02T21:40:37Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE30IPzfC_L",
        "author": "@sebastiaanv",
        "text": "@sevenkpink2894yall need to start reading things and comprehend, damn.",
        "like_count": 89,
        "published_at": "2025-02-02T21:46:56Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE316wC75nG",
        "author": "@jeshuamathis9013",
        "text": "AK has “listeners” not fans",
        "like_count": 5,
        "published_at": "2025-02-02T21:54:06Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE35uFS0NTF",
        "author": "@jayarrsquare",
        "text": "@sebastiaanv ngl I misread OP's post as FD wasn't talking *about* this, but what they typed was *around* lol oops",
        "like_count": 13,
        "published_at": "2025-02-02T22:35:56Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE36cETgzxB",
        "author": "@thearksideofthought",
        "text": "I've seen three different videos from FD addressing this topic, and not just on Ak.",
        "like_count": 4,
        "published_at": "2025-02-02T22:42:12Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE3OjtJw1Hp",
        "author": "@Social_Pugatory",
        "text": "@Marss_8yep you can be deadass piss poor in every other metric around being a \"man\" but as long as you're gettin money performing the \"provider\" part of masculinity, you get a pass.",
        "like_count": 0,
        "published_at": "2025-02-03T01:20:32Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE3V9dqaLbi",
        "author": "@raspberryshortcake8478",
        "text": "@RemembrancerMersadieOliton FD literally made a video on this.",
        "like_count": 1,
        "published_at": "2025-02-03T02:16:37Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE3nVJPoGt2",
        "author": "@leovalenzuela8368",
        "text": "Ambiguous wording makes it sound like you’re saying he did not address it.",
        "like_count": 5,
        "published_at": "2025-02-03T05:05:36Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE44Vj-Xj-Q",
        "author": "@Fie9969",
        "text": "Not gonna lie it took me a second to read this comment correctly too lol.",
        "like_count": 5,
        "published_at": "2025-02-03T07:42:57Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE4isiv50Q0",
        "author": "@youngwolf024",
        "text": "​@leovalenzuela8368  maybe I just have a significantly higher reading comprehension than most but....how was op writing ambiguous? It's pretty straightforward and grammatically standard, and I'm just a nigga from the projects😂",
        "like_count": 0,
        "published_at": "2025-02-03T13:44:29Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE6OgnwLXr7",
        "author": "@amethyst034",
        "text": "@RemembrancerMersadieOliton this comment is very clearly stating that FD addressed it. This isn’t difficult wording. Unless you’re dyslexic.",
        "like_count": 10,
        "published_at": "2025-02-04T05:17:50Z",
        "is_reply": true
      },
      {
        "id": "UgwVuLkUsufObdOcUOF4AaABAg.AE2kIKyJGEqAE88-kXU4U7",
        "author": "@excelsia.studio",
        "text": "@leovalenzuela8368 they were not ambiguous at all about what they said lol",
        "like_count": 3,
        "published_at": "2025-02-04T21:30:30Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzWzOHAD0NyG448mxJ4AaABAg",
    "author": "@dracoeveils4282",
    "author_channel_id": "UCZ58BE3FD84KVHYJYjRBzvQ",
    "text": "Predatory behavior is what this is!!!!",
    "like_count": 1,
    "published_at": "2025-02-02T21:08:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwolIUV4XC4PoZYyNR4AaABAg",
    "author": "@uzernamex",
    "author_channel_id": "UCMwVQkOY-uwSxkyo-vVxWjA",
    "text": "This breaks my heart. I am so disgusted. People don’t deserve to be around kinda what the fuck 😢",
    "like_count": 0,
    "published_at": "2025-03-04T18:52:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw8yKcFCU2sDdvdIER4AaABAg",
    "author": "@BeeSunshine-vf2im",
    "author_channel_id": "UCDeaaIJdW9wYXNVSLL758pQ",
    "text": "I loved loved loved this conversation and it's so nice to hear some sane people say things I think. The girls do not develop faster thing, boys are easier, how it's disturbing how some people only compliment boys and tie their achievements to them getting girls later rather than just being a good person ❣💙💚💛Also don't know who that pedo guy is but proud of the 15 year old, that is truly a scary situation. Hope everyone stay safe!",
    "like_count": 0,
    "published_at": "2025-06-11T01:42:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwM_xnhhEpribNKlOd4AaABAg",
    "author": "@IvoGrissom",
    "author_channel_id": "UCK11vMLHyhILfnpa8N6DWkQ",
    "text": "34:25 This hit me like a truck",
    "like_count": 0,
    "published_at": "2025-02-03T03:04:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzJSWlvLLyftGHh1cJ4AaABAg",
    "author": "@cayana608",
    "author_channel_id": "UCpOsPWVLJlgfxmBz-6Ucutg",
    "text": "i was sitting here wracking my brain where I knew xiandivyne from, and I finally remembered. It was from a tik tok skit he did shuckin' n' jivin' as Clarence Thomas overturning AA. Great convo & happy to find your platform again xiandivyne!",
    "like_count": 0,
    "published_at": "2025-02-02T23:25:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwti6ieDX2-MixM2tB4AaABAg",
    "author": "@muffinpoots",
    "author_channel_id": "UCxddWw6J1hJyuW4lfa6Zu_g",
    "text": "i think one reason why this is his downfall was that the video is the offense. not a victim telling a story. the evidence is the crime.",
    "like_count": 1,
    "published_at": "2025-02-03T06:42:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxdrghovceKl7wqoD54AaABAg",
    "author": "@shunnamaewilliams9989",
    "author_channel_id": "UCIBfK6RNBrN2vZtzftF5LQw",
    "text": "The true problem is these weirdos are in kid spaces talking to kids like their reading a corn script. The little boy was playing fortnight.",
    "like_count": 1,
    "published_at": "2025-02-03T20:35:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxAwoG0GP4OShVuNVN4AaABAg",
    "author": "@Ruto_Da_Legendary",
    "author_channel_id": "UCCoTZhOUrWngEjIkYGx2lEg",
    "text": "35:16 not for nothing I completely agree with her because as a preschool teacher you're teaching these kids the ABCs and a 123s emotional intelligence ,how to cool down and like basically decompress and stuff like that and then they come back from a vacation worse than when you first got the child😅",
    "like_count": 2,
    "published_at": "2025-02-03T15:38:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzIYJO4L7dyzE-kLkt4AaABAg",
    "author": "@Ariosbi",
    "author_channel_id": "UCyWmU2Gpl3Ct9wd7EOZPMig",
    "text": "Great vid❤❤",
    "like_count": 0,
    "published_at": "2025-02-06T08:45:31Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxmw6InJwVY4c-c3D54AaABAg",
    "author": "@infamouseli92",
    "author_channel_id": "UC_8fNks8sEtIRLpRVNdXqjw",
    "text": "29:46 Bugatti makes sense 🤷🏾‍♂️",
    "like_count": 1,
    "published_at": "2025-02-02T20:33:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyZhJ3FPxQ4gZO1ie14AaABAg",
    "author": "@erikmurray9564",
    "author_channel_id": "UC1L5-DGbQB9DzNCaP9Giddw",
    "text": "Kendrick made it cool to be against sexual assault.",
    "like_count": 4,
    "published_at": "2025-02-02T22:56:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzI7-kqKSEFzH8KRz54AaABAg",
    "author": "@imanadult7432",
    "author_channel_id": "UCBkdtblR4jIkrpP9x7pPYEA",
    "text": "I did go back and replay Olay's reenactment of CJ scrambling to dial his friends like 20 times and im not ashamed of it 😂",
    "like_count": 0,
    "published_at": "2025-03-03T01:27:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw_KSQoGs6IUmuGlk94AaABAg",
    "author": "@GregoryCarnegie",
    "author_channel_id": "UC3_T2YHkLqY96760kmE_U5w",
    "text": "Won't be long till we see him on EDP watch",
    "like_count": 0,
    "published_at": "2025-02-07T16:30:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyG84zGvHy6ye5l0Jt4AaABAg",
    "author": "@Lolamola102",
    "author_channel_id": "UCJIphN_zFbi99BXXMsQihLQ",
    "text": "Interactions like this of black boys are adultified, in addition to the shit child safety guidelines/algorithms on social media rly scare me. Working after school I’ve seen little boys do a complete 180 the next school year after spending a summer etc with too many older men that think that behavior is acceptable/ borderline groom them.",
    "like_count": 2,
    "published_at": "2025-02-04T15:31:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyk9N5LyEV9iviaK0h4AaABAg",
    "author": "@dawnphillips6442",
    "author_channel_id": "UC0TsiKSe6_kQHr0nxLlwd9Q",
    "text": "He's groomed his community because he's told them as a Jamaican he's smarter than Americans and he's better than them and they still listen to him.",
    "like_count": 2,
    "published_at": "2025-02-02T22:29:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxoiv-Wz09qH1vl2lN4AaABAg",
    "author": "@TeelovesLaw",
    "author_channel_id": "UCFqbXRUz_aRhbWSpbdXaN_g",
    "text": "*runs to hobby craft to buy supplies for feelings wheel*\n🤣🤣🤣",
    "like_count": 0,
    "published_at": "2025-02-02T19:32:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxiRclPhGaDmdzzUXV4AaABAg",
    "author": "@shondadiggins21",
    "author_channel_id": "UCqmqDbQbd3uildbY4PxREhw",
    "text": "Ak deserves consequences for his actions. A lot of these men understand what they are doing wrong but they push forward because yhey think they gotta save face thats why they need real consequences like jail. Im sorry but once you reach a certain age therapy and discussion ain't enough. Victims gotta deal with the bs for the rest of their lives especially hearing this mans voice and seeing him online not having any consequences to his actions.",
    "like_count": 4,
    "published_at": "2025-02-03T13:16:34Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxi7fdVBpYgTb-vD0N4AaABAg",
    "author": "@rastaog9257",
    "author_channel_id": "UC1qHWvcupbDNXfToGlw9Gyw",
    "text": "19:23 The word i always associate Boostie with is Odious",
    "like_count": 1,
    "published_at": "2025-02-02T21:17:59Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzXwWUdPCq3kjVzGk14AaABAg",
    "author": "@d.l.mhaoir.33",
    "author_channel_id": "UCKdIn1WjW0WT7m59DmRssVg",
    "text": "15:38 I can't believe y'all think we ain't know what CDs are lmao",
    "like_count": 1,
    "published_at": "2025-02-02T22:45:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyKsyL9Uz7YmgplXb94AaABAg",
    "author": "@TimRealTalk",
    "author_channel_id": "UC0S_bsiliZjQvwLYjVIIrWQ",
    "text": "& Kevin is so cute.. wassup boo 😂😍😍 frfr",
    "like_count": 1,
    "published_at": "2025-02-03T19:00:10Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgyKsyL9Uz7YmgplXb94AaABAg.AE5I-oz2UA3AE8xB7VUKLL",
        "author": "@hereswhykevin",
        "text": "🙏🏽🤍",
        "like_count": 0,
        "published_at": "2025-02-05T05:06:26Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw16rcz5spOvC-6TWN4AaABAg",
    "author": "@LamarFrancis",
    "author_channel_id": "UCoeU2GuiIibcpSHEbXxCzUw",
    "text": "I need a fantasy football group chat with CJ lol. I have the same experiences.",
    "like_count": 0,
    "published_at": "2025-02-03T01:50:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyLtf_IxWqj0DX1iA54AaABAg",
    "author": "@TrekStar11",
    "author_channel_id": "UCA6scFQTnpoAOCeuu22PSHQ",
    "text": "Love this",
    "like_count": 0,
    "published_at": "2025-02-02T19:41:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgysdMZtvIR2NztdI8F4AaABAg",
    "author": "@BellamyJay",
    "author_channel_id": "UCNBjzqv4_zwR4Sy6n79vs3Q",
    "text": "Yo shout-out to that lil boy tho. I am so impressed with him standing up to grown men who have power over him like that. I'm so glad this started off like that.\n\nI hadn't seen the video until now and I can't articulate how that made me feel. I'm so impressed with NXRDGOD (I think that's how you spell it).",
    "like_count": 0,
    "published_at": "2025-02-03T23:40:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxpAsIFXY5Ss6fQHEh4AaABAg",
    "author": "@WillieEarlSon",
    "author_channel_id": "UCv1Kau62pcK8j5xNkHB_-Fw",
    "text": "Not really important but hearing Olay say boosie is funny “Boozy” 💀💀💀. \n\nI can’t put it all into words yet but “get to the bag”, “keep going “ or “by any means necessary “ sentiments have been pushed for years and long as you are getting bread people feel like it’s wrong to hate or not take the discrepancies as serious. \n\nI also think there is something to say about the fans or the culture not demanding more from our people. Especially early on and buy the time we hit our 20s and not being expected in the home or just around each other to be better or be critical we get stuff like this",
    "like_count": 5,
    "published_at": "2025-02-02T19:36:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw_D3oAK9s5FlMmx6t4AaABAg",
    "author": "@Cdr2002",
    "author_channel_id": "UC_apmwJ-Qu_FE9V9npGIe-Q",
    "text": "57:17 he’s using the same argument Drake used in The Hurt Part 6",
    "like_count": 0,
    "published_at": "2025-02-03T00:29:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxXSfpco95PrDUXgCV4AaABAg",
    "author": "@StonedHunter",
    "author_channel_id": "UCYd2hmv2lUI0pz1HAL8tauA",
    "text": "I am often the killjoy and it sucks... thankfully I'm getting better at being friends with people who are similar. But the amount of times I get pushback or outright anger and insults in friend groups for calling out shit like giving horrid people money just for a mediocre piece of media.\n\nIt feels really isolating at times but I just...can't not speak up...",
    "like_count": 1,
    "published_at": "2025-02-06T18:00:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyXHOXe0-pTx1L6PTd4AaABAg",
    "author": "@FoxSt3v3",
    "author_channel_id": "UCReX-NQgxzrCVD6gYs3Shvg",
    "text": "good shit Olay",
    "like_count": 0,
    "published_at": "2025-02-03T00:14:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwvZ5xJmHOj5_UbTYB4AaABAg",
    "author": "@despres380",
    "author_channel_id": "UCc5BxHM3w_iAxaH8Zc5_Z1A",
    "text": "the main thing i know him for is chanting *DRAKE! DRAKE! DRAKE!* so this checks out",
    "like_count": 1,
    "published_at": "2025-02-02T21:19:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzeBladMnAvy_luyEB4AaABAg",
    "author": "@DymondCityRydaz",
    "author_channel_id": "UCT8Z8GY0iwAAXRYZ5pdtpUw",
    "text": "0:31 success 😢😢",
    "like_count": 0,
    "published_at": "2025-08-26T16:01:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy4uvkrvqFpjVpZJOp4AaABAg",
    "author": "@DymondCityRydaz",
    "author_channel_id": "UCT8Z8GY0iwAAXRYZ5pdtpUw",
    "text": "21:15 my mom and Aunts TOLD ME THIS!",
    "like_count": 0,
    "published_at": "2025-08-26T16:04:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzrAp3eREkrPwxf3Wl4AaABAg",
    "author": "@yourfavpersuasion9385",
    "author_channel_id": "UCnpjsWcA8SK9qlKta_UEMQw",
    "text": "good!! but he needs to be in jail tho",
    "like_count": 3,
    "published_at": "2025-02-02T19:32:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwvre3wOWTXABX8aTN4AaABAg",
    "author": "@kal7974",
    "author_channel_id": "UCPRnmttVl7ZWygTZTflfz3Q",
    "text": "🫖🫖🫖🫖 The tea at the end was hot",
    "like_count": 0,
    "published_at": "2025-02-07T21:40:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyzcav4-Nddar6G6yB4AaABAg",
    "author": "@ShanuWral",
    "author_channel_id": "UC1P_Q606UYNQfLtDttvdvCw",
    "text": "Dayum! my god...Dayum!",
    "like_count": 0,
    "published_at": "2025-02-02T23:12:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzOjqfNvpQii4pQLBd4AaABAg",
    "author": "@FullElvenCosplay",
    "author_channel_id": "UCaLUrEIEDvfxqRZx7Z7KyMQ",
    "text": "The crazy thing, and I say this from experience of raising my 4 little boys, boys can easily be emotionally mature. It's wild how emotionally mature they become when you let them not only feel their feelings, but start helping them process what they're feeling, why, and being okay with feeling negative emotions without feeling 'unsafe' about feeling them. Letting them know it's okay to need a moment to breathe because they're angry before they talk about what made them angry. Letting them know it's okay to cry and be sad, even if it's something no one feels is worth crying over. It's worth crying over because it's important to them. \n\nLike...my oldest will be 16 this year, and he's been standing up and starting conversations since he was 6 about things with peers. He's called out friends for racism and sexism and bullying, about how we 'shouldn't play guns, they're not toys'. He's been so comfortable talking about his feelings and even telling me when I've messed up. And all my kids have followed that path too. \n\nAnd all I did was be patient and talk to them. Boys are every bit as able to be emotionally mature as girls are. We're a big neurodivergent family, so maybe that's why we have those tools to work though it, cause Autism and ADHD and anxiety, but yeah.",
    "like_count": 26,
    "published_at": "2025-02-03T18:47:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzuEc3ZUMCvIuPqVqp4AaABAg",
    "author": "@ahmetyegenaga",
    "author_channel_id": "UCcFUmCFhXYWf63lO7sDnS_A",
    "text": "AHHH she has christian divyne onnn!! my goat tiktoker, love that dude",
    "like_count": 0,
    "published_at": "2025-02-02T20:10:36Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwUvBG2FTuuUX3h0ax4AaABAg",
    "author": "@clippy2cool",
    "author_channel_id": "UCckXQUyTzIqBytNYGF9bIhg",
    "text": "34:47 nither are women. We shouldn't have to \"reward\" men for understanding their emotions 🤦🏾‍♀️ this is why they think were their mothers.\n\nWhen has a woman been \"rewarded\" for being emotionally mature?",
    "like_count": 16,
    "published_at": "2025-02-02T21:45:43Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwUvBG2FTuuUX3h0ax4AaABAg.AE309Tug3RbAE3BpZMKk-7",
        "author": "@Violette2102",
        "text": "Honestly if I were in danger I’d want a random man who’s around capable to help me, so I don’t think it’s too much to give them credit for growing in emotional awareness lol it happens against all odds",
        "like_count": 3,
        "published_at": "2025-02-02T23:27:43Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxDku7g6nI0SPYYaW54AaABAg",
    "author": "@merchdatslilj",
    "author_channel_id": "UCGpNwJ6i92l-clilBlh6R0w",
    "text": "this is crazy",
    "like_count": 0,
    "published_at": "2025-02-03T15:34:04Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwHHjS5pge1T0eSEG94AaABAg",
    "author": "@Chimponaut",
    "author_channel_id": "UCmYNuYcEvsBH8KnCjw7k7BQ",
    "text": "Sex is always seen as something you do to a woman in these weirdo circles, it's never talked about like something two people enjoy together.",
    "like_count": 0,
    "published_at": "2025-06-21T18:01:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyprso_afMpkQf_fr14AaABAg",
    "author": "@mariogooch9634",
    "author_channel_id": "UCovgc1SWk8WOQn_NOqTZI9Q",
    "text": "The realists conversation he had on air was when Joe Budden warned him about running around with Takashi 69. He yelled to him that these rapper's are not ya friend. The look on his face, was hurt, confused and Joe ol' he don't know. All at once. Love ya show. 😊",
    "like_count": 0,
    "published_at": "2025-02-03T00:52:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx5UvWhAFN8ZfI0MZR4AaABAg",
    "author": "@thatguy.7608",
    "author_channel_id": "UCa_CUUBMsBlZCHmgiyN2H5w",
    "text": "This was crazy to watch. And they just keep going even after he stated boundaries and laws. I feel like this is only being talked about because he’s not black. Imagine all the black boys he’s done this to 😣",
    "like_count": 0,
    "published_at": "2025-02-04T23:35:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwvPwDt58k0uVZOGD14AaABAg",
    "author": "@uzernamex",
    "author_channel_id": "UCMwVQkOY-uwSxkyo-vVxWjA",
    "text": "19:08 🎯🎯🎯",
    "like_count": 0,
    "published_at": "2025-03-04T18:57:59Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzQeQJu4EDDBnboCaN4AaABAg",
    "author": "@janeeyx5672",
    "author_channel_id": "UCtYC3zx6AnZbOGY5-rlYBIg",
    "text": "Chris Brown, Lil Wayne, Boosie, all of them have issues… says alot",
    "like_count": 0,
    "published_at": "2025-02-03T21:45:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwReTVOyiqzKy58Qup4AaABAg",
    "author": "@sarahjane434",
    "author_channel_id": "UCJFEOJ3I3PbmIVU1OfALoyQ",
    "text": "go birds",
    "like_count": 2,
    "published_at": "2025-02-02T21:54:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzl6aFx2Igcw8R9TNN4AaABAg",
    "author": "@OneForAll0224",
    "author_channel_id": "UCcI3Hpe1QucqZ-PsvJo_b8w",
    "text": "His response was the same as drake’s",
    "like_count": 1,
    "published_at": "2025-02-02T21:19:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwIrKZfiFyNhiNoekZ4AaABAg",
    "author": "@latresemilton6729",
    "author_channel_id": "UCzjOTyfuwo6J9nNc6yNwZcA",
    "text": "Side Note: Antoinette's lippie is beautiful! I need the deets!",
    "like_count": 0,
    "published_at": "2025-02-03T11:50:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz5IqRoQH8ZuYLRPvd4AaABAg",
    "author": "@rubberwoody",
    "author_channel_id": "UCkQlCEizvL54ot2SQp_M3zA",
    "text": "\"throw you the box\" is the most unappealing way to put a sexual thing",
    "like_count": 0,
    "published_at": "2025-02-05T14:13:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzEmrofJYuJduQyfZJ4AaABAg",
    "author": "@Lovelyinternetperson",
    "author_channel_id": "UCdpEJMUTr7trXDd5nhxnDcA",
    "text": "1:08:11 enablers not community",
    "like_count": 0,
    "published_at": "2026-01-06T15:53:20Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzL5gfvBR-Vc2AZZvR4AaABAg",
    "author": "@LethalLemonLime",
    "author_channel_id": "UC5k0_ckjxMDN9iuG8B8VyGw",
    "text": "32:45 lol which Asian country? Not the one I live in lol. Boys and girls start at the same age.",
    "like_count": 1,
    "published_at": "2025-02-03T04:27:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzdxUJSxfJsBy0Cc5Z4AaABAg",
    "author": "@reffa2858",
    "author_channel_id": "UCoDE07eQOLkZgcp8Bc9c7UA",
    "text": "I'll never get over the way Olay says lil Boosie's name 😂.  Down here in Louisiana we say Bootsay but she says Boozy.",
    "like_count": 0,
    "published_at": "2025-02-04T12:12:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy5uXPkepdmqccrtil4AaABAg",
    "author": "@P0rk_Sinigang",
    "author_channel_id": "UCnQr3lARvR-dck56mbd5mlA",
    "text": "CJ sounds really cool!",
    "like_count": 0,
    "published_at": "2025-02-07T16:16:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwJbphD8jAzYjS69Rx4AaABAg",
    "author": "@anony1596",
    "author_channel_id": "UClkOGf5LTK3yRCR57J-orCw",
    "text": "“Lord I pray for the “wife guy” of the group. Amen.” -Ciara’s prayer probably \nmhm me next 😌",
    "like_count": 0,
    "published_at": "2025-02-03T14:25:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyqojFBYCni7DMiR-54AaABAg",
    "author": "@BiRuhBiDem",
    "author_channel_id": "UC6dvF87zAJTjXyUYG6_-XQg",
    "text": "The most mature one is the 15 year old.",
    "like_count": 0,
    "published_at": "2025-02-05T01:14:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxl6V7CO4H7zX6IEBl4AaABAg",
    "author": "@nahyell",
    "author_channel_id": "UCoASZ1eDLU0Xi29Gm4dMMYA",
    "text": "Thank you for this vid but can u blur the 15 y/o’s face? It’s a bit uncomfortable showing footage of a minor getting verbally assaulted 🥹 13:00",
    "like_count": 3,
    "published_at": "2025-02-02T20:49:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxBoIEEsA26zvMXnMB4AaABAg",
    "author": "@merchdatslilj",
    "author_channel_id": "UCGpNwJ6i92l-clilBlh6R0w",
    "text": "so glad he got exposed",
    "like_count": 0,
    "published_at": "2025-02-03T15:34:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzkEBWMJ615tWErM5l4AaABAg",
    "author": "@LethalLemonLime",
    "author_channel_id": "UC5k0_ckjxMDN9iuG8B8VyGw",
    "text": "12:32 this is so disgusting",
    "like_count": 0,
    "published_at": "2025-02-03T04:06:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyFGi-N9MhKJ1TD7Pl4AaABAg",
    "author": "@TT-bu6fx",
    "author_channel_id": "UCfemsqU7wymTh_D7kV57_xA",
    "text": "Where is Asaata? Hope she’s doing ok?",
    "like_count": 0,
    "published_at": "2025-02-03T05:09:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxFpJxvNHspwvEYRYt4AaABAg",
    "author": "@maxbmofficiel1269",
    "author_channel_id": "UC0e3jhyI0woJ-Y8fBnJL-zQ",
    "text": "Marquise what patriarchy has to do with this ?",
    "like_count": 0,
    "published_at": "2025-02-03T22:20:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx0vUcr75GRBveoBCB4AaABAg",
    "author": "@KawaiiPrncessBby",
    "author_channel_id": "UCL9yowP7xnm3i1JNFWwX3LA",
    "text": "Marquis looks familiar as f*ck... was he on The Grapevinetv?",
    "like_count": 0,
    "published_at": "2025-02-03T05:49:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxb7uHDJRMzciwhjeN4AaABAg",
    "author": "@P0rk_Sinigang",
    "author_channel_id": "UCnQr3lARvR-dck56mbd5mlA",
    "text": "Lol Poor Kevin",
    "like_count": 0,
    "published_at": "2025-02-06T20:05:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxlIACV6HlwG75sBEx4AaABAg",
    "author": "@kel-A-3414",
    "author_channel_id": "UCYk-ob0cf23tGg8Tmjpv7TQ",
    "text": "Bruh why he blaming Kendrick fans😭",
    "like_count": 0,
    "published_at": "2025-05-21T02:24:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyJNZDEEz5JwhnOcsp4AaABAg",
    "author": "@jkclark5204",
    "author_channel_id": "UCf7XxJFw3IB6e8XkJHhf_1w",
    "text": "Whenever you see a serious problem and propose radical change, someone immediately gets nervous and wants to shut it down.\n\nThe concept that \"girls mature faster\" isn't just about physical attributes. It IS about our educational system, it's reinforcement of patriarchy, and the unexamined biases of even the most well-intentioned of educators. It may be that boys need the extra time and attention for emotional development.\n\nLike it or not, schools are doing a LOT of the work we conventionally think parents should do. We should consider changing that  system, drastically, to adjust for the real world conditions, not what we want it to be. It may be that boys need extra time for emotional regulation and expression. (Of course, our government is in the process of destroying our educational system right now, so let me shut up...)",
    "like_count": 0,
    "published_at": "2025-02-03T00:21:33Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzahb4EfuiH-QEigKJ4AaABAg",
    "author": "@Lovelyinternetperson",
    "author_channel_id": "UCdpEJMUTr7trXDd5nhxnDcA",
    "text": "13:19 those’d bunch of males ganging up on the 15 year old lil boy…. 22:24 podcast bros",
    "like_count": 0,
    "published_at": "2026-01-06T15:16:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxevSPxCSpaO7cNkr94AaABAg",
    "author": "@TheOnlyTaps",
    "author_channel_id": "UC1rtY5xwA_nKjoPwaFyLeYg",
    "text": "🫡👊🏿🙏🏿",
    "like_count": 1,
    "published_at": "2025-02-02T18:54:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw8tVcsTx63lRc-WUp4AaABAg",
    "author": "@jon-cx7jq",
    "author_channel_id": "UCI099GsaBCDucPWfnmnBkYQ",
    "text": "Christian divyne??",
    "like_count": 0,
    "published_at": "2025-02-02T21:22:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxYTbbNWPV0nuMaGYd4AaABAg",
    "author": "@kelliezee",
    "author_channel_id": "UCFHqQJzA9tXJo1hMROENT3g",
    "text": "Akademiks still has a job, i hear his shit dj-ing on the radio. He needs to be cut off.",
    "like_count": 0,
    "published_at": "2026-01-22T18:57:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyukUioI3qN1LAauYx4AaABAg",
    "author": "@mariogooch9634",
    "author_channel_id": "UCovgc1SWk8WOQn_NOqTZI9Q",
    "text": "❤",
    "like_count": 0,
    "published_at": "2025-02-02T23:16:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxRVH8uOybQR5bTVcZ4AaABAg",
    "author": "@infamouseli92",
    "author_channel_id": "UC_8fNks8sEtIRLpRVNdXqjw",
    "text": "Jumpier to get more stupider?",
    "like_count": 0,
    "published_at": "2025-02-02T20:56:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxkIOQudRlBtHpiLjp4AaABAg",
    "author": "@thearksideofthought",
    "author_channel_id": "UCbe5Zda9Br7TRT9ghpIRBeA",
    "text": "Nah, I hate Drake for real.",
    "like_count": 1,
    "published_at": "2025-02-02T22:41:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwpFOYzLaONU-7l2D14AaABAg",
    "author": "@Mumra2K",
    "author_channel_id": "UCcsjlazSwXPTsay8i4lQIxw",
    "text": "41:25 😮👀👀👀👀",
    "like_count": 0,
    "published_at": "2025-02-02T20:56:29Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwpFOYzLaONU-7l2D14AaABAg.AE2vWtBWNEnAE2w35zjivx",
        "author": "@Mumra2K",
        "text": "45:03",
        "like_count": 0,
        "published_at": "2025-02-02T21:01:09Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxIxtSq5CmWReSBk4F4AaABAg",
    "author": "@SpooksMcGhie",
    "author_channel_id": "UCt8I7ls2GaNKREXG8nwXj_w",
    "text": "Ak is finished",
    "like_count": 0,
    "published_at": "2025-02-03T14:34:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyEmxuKNK-qfWqJ2Mt4AaABAg",
    "author": "@blockavelli",
    "author_channel_id": "UCfobrsO2WbpahRXpoW-k_2w",
    "text": "DJ AK is 35?! I thought this ignorant clown was in his early 20s. Not that it would be an excuse, but at least I could’ve chalked up his antics—outside of this incident—to immaturity.",
    "like_count": 0,
    "published_at": "2025-03-04T12:56:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwDS9k635IAgJzvZ8B4AaABAg",
    "author": "@sylvrstone",
    "author_channel_id": "UC83vVTcFBDpZCXFkcGHE84A",
    "text": "",
    "like_count": 0,
    "published_at": "2025-02-03T01:50:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyRWzpHpgmsHyq19zl4AaABAg",
    "author": "@zakjackson2610",
    "author_channel_id": "UCqHFRSFyxjVW4ELFmfMNkeg",
    "text": "I don’t really follow hip hop… but he always seemed like a creeper to me. 🤷🏽‍♂️",
    "like_count": 0,
    "published_at": "2025-02-02T20:22:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxpv6-hTirMNY9eD_l4AaABAg",
    "author": "@AndresGomez-ct7qb",
    "author_channel_id": "UCBWs7_A2q1gxzjQY6qLt0kQ",
    "text": "7:48 This interpretation is too charitable.\nAkademiks has shown he's basically just too deep into degenerate internet culture where things like this are \"funny\".\nIt isn't patriarchy or them passing on trauma, it's just people who don't realize they're weirdos and that the real world isn't like their freaky discord chats.\nAnd that internet culture is what has too many people too comfortable making racial \"jokes\" and all type of edgy humor ubiquitous and just assuming people who aren't chronically online have to accept it.",
    "like_count": 0,
    "published_at": "2025-02-13T04:38:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzg3lfF2WGch1Ml1b94AaABAg",
    "author": "@shesaghost9920",
    "author_channel_id": "UC9GgNPpW9FUPkQ1HTE3M_tQ",
    "text": "Luv u might want to watch a video it actually says why he was banned today on twitch and it wasn’t for this at all. Twitch spokesman or something said exactly why he was banned. This is why BECAUSE HE HAD A EX TWITCH  MEMBER ON HIS LIVE THAT WAS BANNED. That said not because of what he did. Look for the video and do an update on it and let your followers know. And supposedly the case was dropped. Lack of evidence and he has text messages saying different. Again do research before yall do a video it will make the video better because then it will make you question his connections",
    "like_count": 0,
    "published_at": "2025-02-04T05:07:27Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwgGb-MCAdm-F8easZ4AaABAg",
    "author": "@RashidYCK",
    "author_channel_id": "UCle8dRVN5KIRv9duMiYvvSw",
    "text": "whats SEL?",
    "like_count": 0,
    "published_at": "2025-02-05T10:04:16Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgwgGb-MCAdm-F8easZ4AaABAg.AE9UGWk_IpnAEDENF-yjR4",
        "author": "@marquisedavonproductions",
        "text": "Social Emotional Learning",
        "like_count": 1,
        "published_at": "2025-02-06T21:02:20Z",
        "is_reply": true
      },
      {
        "id": "UgwgGb-MCAdm-F8easZ4AaABAg.AE9UGWk_IpnAEEKPjSCr9y",
        "author": "@RashidYCK",
        "text": "@marquisedavonproductions  👍",
        "like_count": 0,
        "published_at": "2025-02-07T07:14:21Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyszHkJG9H7cIXyLcB4AaABAg",
    "author": "@oddliquid8996",
    "author_channel_id": "UClIqQGhUjGk1s3AYw2vNMjw",
    "text": "This isnt important at all but I hate that his face doesnt utilize all of the space it has. Just two little eyes and a blank canvas.",
    "like_count": 5,
    "published_at": "2025-02-02T20:55:20Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzXSpF--Daj2OEqHdN4AaABAg",
    "author": "@djnes2k7",
    "author_channel_id": "UCVfcedwa1SqnhhHZTFPKgpw",
    "text": "3.28 nah can’t roll with that that ole town road kid whole this is about being gay, so is the dude with the diamond in his forhead. Plenty have dressed like women and were celebrated. That’s an old outdated stereotype. No one is mad at diddy for any of the gay things in the story…. We off that.",
    "like_count": 0,
    "published_at": "2025-02-02T21:29:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwFVtCL1ANavLVxzcV4AaABAg",
    "author": "@MalakianM2S",
    "author_channel_id": "UCfwbWTWRuapqUUxJQOtjBaQ",
    "text": "The kid is 15, not 16. Ak has been temporally banned from twitch several times, not permanently banned and reinstated several times.",
    "like_count": 0,
    "published_at": "2025-02-03T01:12:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyAZhqHeQgFmw0H6U54AaABAg",
    "author": "@BeingMr.Whitty",
    "author_channel_id": "UC_IcM_tX1y1tKWj_kgRirfA",
    "text": "Low Key - I didn't know anything about AK until I watched him cover the Diddy and then Drake stuff BUT Ak is a totally West Indian and so I understand him. He's a typical West Indian man who's gonna make as much money off dumb American society and he doesn't care how people feel about him doing it. I respect it because I see how African Americans like to gatekeep EVERYTHING and try to control who gets into hip hop etc and yet outside of Joe Budden AK is top tier. He actually does research, he actually sits and talks with people, he's very transparent. Whereas a lot of these dudes are Snoop Dogs. Everybody loves them but they voting Trump and doing weirdo stuff behind closed doors. Can he say weird things YES but I'm sorry until they take Joe Budden down for his long list of bad behaviors I'm watching him for entertainment like everybody else. \n\nKendrick said there aren't enough and there aren't! Dudes aint solid these days so not expecting AK to be. (insert shrug emoji)",
    "like_count": 0,
    "published_at": "2025-02-02T22:05:19Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgyAZhqHeQgFmw0H6U54AaABAg.AE32P0q23DsAE39mWHHfcu",
        "author": "@ADubbs-fd8xf",
        "text": "I'm just curious, why do you think African-Americans are gatekeeping Hip-Hop from other Black folks from other backgrounds? Also, even if you do think that that is happening, how does that excuse AK being a creep?",
        "like_count": 8,
        "published_at": "2025-02-02T23:09:49Z",
        "is_reply": true
      },
      {
        "id": "UgyAZhqHeQgFmw0H6U54AaABAg.AE32P0q23DsAE3BDY4IzRD",
        "author": "@kamikazemind327",
        "text": "@ADubbs-fd8xfthe whataboutism is DISGRACEFUL I can not.",
        "like_count": 0,
        "published_at": "2025-02-02T23:22:26Z",
        "is_reply": true
      },
      {
        "id": "UgyAZhqHeQgFmw0H6U54AaABAg.AE32P0q23DsAEb2ZEexvhB",
        "author": "@staciegreene2262",
        "text": "Why can’t we control what we started ? Everyone else control their own thing . Make that make sense ! When we say “nah, we don’t like yall doing that , that’s our thing” . Everyone gets so offended , it’s weird . Gatekeeping is what keep a culture in tact . I’m not mad at anyone for not wanting to share/dilute their culture. See yall aren’t used to MULTIPLE ethnicities wanting to take from your culture. Until that happens to your people , you would never understand the importance of gatekeeping !!",
        "like_count": 0,
        "published_at": "2025-02-16T12:20:08Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzrBTu5oEbIlc3YUxl4AaABAg",
    "author": "@afrokai",
    "author_channel_id": "UCceS2QpKYQrmJ4Q5k12gwMw",
    "text": "the comment about holding boys back at 32:10 was dead on. Because of my birthday I started later and i think that was to my benefit",
    "like_count": 0,
    "published_at": "2025-02-03T00:09:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxNWx-QMHmdLVcs0-54AaABAg",
    "author": "@Blackronin357",
    "author_channel_id": "UC-25PDzxxRwxka5c3EHOwpg",
    "text": "Ace Vane has a comical yet great skit on this whole situation. Mind you, he notes that this is meant to be an uncomfortable teaching moment. \n\nhttps://youtu.be/_jdqf9JMnik?si=h1XiC_D3i8PJDd7B",
    "like_count": 0,
    "published_at": "2025-02-03T03:20:36Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx-VrTXHEMGMmfNqBR4AaABAg",
    "author": "@KindnessKillsNONDO",
    "author_channel_id": "UCSwoUY8yrHfsu6nCwcfK72w",
    "text": "3:48 double edged sword. On one hand it's okay to bully women but if you bully men they will defend themselves. On the other hand it's okay to not love girls but it's not okay to love boys. I am genuinely confused as to when the outrage at male banter became so quickly accepted as infact toxic. If anything could have been dismissed as \"boys will be boys\", it should have been this. I wonder if Diddy has something to do with why men are on the shallow end of the water and indirectly addressing their pain. We look forward to them swimming.",
    "like_count": 0,
    "published_at": "2025-02-06T09:50:33Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwEEc0upPtuHBdwPUZ4AaABAg",
    "author": "@ruetoo",
    "author_channel_id": "UCho8rtuq76CDu6Y2FEbTaVg",
    "text": "As a multiracial gay 24 year old, \nI completely agree with the gay vs alpha male complex in gaming and media. As a young boy, with an alpha male brother I was honestly traumatized with the alpha male complex. Gaming was a big one, I was terrified by male spaces like playing violent games with violent game video chats. Always homophobic, graphic and bullying each other. I was never accepted into male spaces as a kid in the 2000s.\nAlso the grooming with men on YouTube reminds me of Shane Dawson. I was his demographic at the time, preteen/ teen boys. He made racist, homophobic, graphic and sexual content for humor didn't come out as gay until much later in his career. His videos invited a really weird energy in the space with for a young kid growing up.\nTechnology has affected my generation as the \"anxious generation\" because we saw graphic, sexual and explicit content as children that we have to heal from. We were anxious as children from our environments. History repeats itself truly.\nI love Kevin's idea of boys starting school 2 years later. As a five year old, I was not ready for the environments I was in. Bullying, social norms, authority (who some also follow these ideals). If you're not apart of the norm you played alone or pushed to aggressive male play like sports (don't even get me started lol).\nINVENT IN BOYS BEFORE \"IT TOO LATE\" (it's never too late)\nSo we don't keep repeating this cycle.",
    "like_count": 4,
    "published_at": "2025-02-02T20:19:42Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwEEc0upPtuHBdwPUZ4AaABAg.AE2rJR1E6DjAE39Sj7pLiZ",
        "author": "@ADubbs-fd8xf",
        "text": "I'm definitely curious about the whole having boys start school later thing, I haven't read much about it. My knee jerk reaction is to be against it, but there's clearly a problem with how boy children are educated so I'm definitely open to it, even though I feel like it could have some unfortunate consequences.",
        "like_count": 1,
        "published_at": "2025-02-02T23:06:59Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzDgvTaE27t08L7RsB4AaABAg",
    "author": "@dameluz5228",
    "author_channel_id": "UChjBMKhJITGUoCzFHHALluw",
    "text": "So I think Petit Blanq Kevin is onto something with regards to educating boys; that being said, i started school (in DR) before age 2 (i walked early and my brain developed fast i guess) so we should def apply a post gendered-binary approach to early childhood education..👁🪬👁",
    "like_count": 2,
    "published_at": "2025-02-03T23:51:12Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzDgvTaE27t08L7RsB4AaABAg.AE5oJNwtNWcAE8x5OTXHLV",
        "author": "@hereswhykevin",
        "text": "AYO THIS WAS INSANE 😂 but  thanks you make a great point",
        "like_count": 2,
        "published_at": "2025-02-05T05:05:39Z",
        "is_reply": true
      }
    ]
  }
]