[
  {
    "id": "Ugz9b4omPni7qkB5J_h4AaABAg",
    "author": "@MisfitCartoon",
    "author_channel_id": "UCi09IKTuRjp2rkA67j-Yuew",
    "text": "🎵 Happy birthday to you,\nHappy Birthday To You,\nHAPPY BIRTHDAY, DEAR OLAY,\nHappy Birthday To You!!!! 🎵",
    "like_count": 215,
    "published_at": "2024-07-28T17:12:57Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugz9b4omPni7qkB5J_h4AaABAg.A6RrhIPRw2DA6UNQwlrL-M",
        "author": "@olurinatti",
        "text": "thank you so much!",
        "like_count": 13,
        "published_at": "2024-07-29T16:37:25Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw1iYZa2ZHj-Xk1LPB4AaABAg",
    "author": "@Wanda_M_DS9",
    "author_channel_id": "UCIS5PTFnqGHwevRgPAn_iZg",
    "text": "I was skeptical until I participated in countless calls this week with hundreds of thousands of mostly white people. I didn’t realize how many folks just didn’t want another rematch of two old guys. It’s an uphill battle but the advantage may be a shortened race and it’s weird that MAGA seems so surprised Biden is out. We shall see but I am volunteering from now until Election Day",
    "like_count": 407,
    "published_at": "2024-07-28T17:14:00Z",
    "is_reply": false,
    "reply_count": 7,
    "replies": [
      {
        "id": "Ugw1iYZa2ZHj-Xk1LPB4AaABAg.A6Rrp0b3JogA6RtXP59VP6",
        "author": "@spinningbackkick6021",
        "text": "Yeah but there's 81 million diehard Trump voters that have to be beat back.",
        "like_count": 0,
        "published_at": "2024-07-28T17:28:56Z",
        "is_reply": true
      },
      {
        "id": "Ugw1iYZa2ZHj-Xk1LPB4AaABAg.A6Rrp0b3JogA6S5N6jdaQL",
        "author": "@smokypies",
        "text": "I am a white/white passing, English-only speaking, Hispanic woman living in a west coast blue state in community with many white men. These people are tired of the two old guys, and many Obama-Trump-Biden voters think Trump is a worse candidate than Hillary was in 2016.  Even working class men who always vote (R) are planning to stay home. I am fully expecting and prepared to be disappointed by the larger American electorate or the court system, but Trump is a uniquely bad candidate with incredible weaknesses.",
        "like_count": 57,
        "published_at": "2024-07-28T19:21:08Z",
        "is_reply": true
      },
      {
        "id": "Ugw1iYZa2ZHj-Xk1LPB4AaABAg.A6Rrp0b3JogA6SF1fgvda-",
        "author": "@AuDHDVee",
        "text": "MAGA can't fathom someone willingly giving up power. The very idea is anathema to them, and they also don't really know what to do if they're not running against Biden because the entire campaign has been built on claiming all the problems we have now are Biden's fault and gaslighting everyone into believing his presidency wasn't the failure it was. They have no clue what to do now that the landscape has changed.",
        "like_count": 0,
        "published_at": "2024-07-28T20:45:35Z",
        "is_reply": true
      },
      {
        "id": "Ugw1iYZa2ZHj-Xk1LPB4AaABAg.A6Rrp0b3JogA6TYM644qqv",
        "author": "@PinkPygmyPuff",
        "text": "Not all heroes wear capes 🫡\nIf you don’t mind me asking, in which state(s) are you doing calls?",
        "like_count": 5,
        "published_at": "2024-07-29T08:53:38Z",
        "is_reply": true
      },
      {
        "id": "Ugw1iYZa2ZHj-Xk1LPB4AaABAg.A6Rrp0b3JogA6U1NslOs3_",
        "author": "@karasukafka6918",
        "text": "Sadly I am not American and I cannot vote in US elections thus. But to me Kamala (while I am critical of her) is someone I would vote without hesitation. More so then I would had been to Biden. \r\n\r\nI do feel like that Trump's campaign against Biden's age hits him back now. I look with hope, because us abroad will be effecetd of another Trump presidency gravely too...\n\nBest wishes and lot of strength to all of you!",
        "like_count": 6,
        "published_at": "2024-07-29T13:24:46Z",
        "is_reply": true
      },
      {
        "id": "Ugw1iYZa2ZHj-Xk1LPB4AaABAg.A6Rrp0b3JogA6Xy98TvRzI",
        "author": "@samwight",
        "text": "Kamala is like all over TikTok right now. It's like every word she says becomes a meme. I'm not gonna say Gen Z loves her because I don't think they really love any specific politician. But there's a ton of white Gen Z folks on TikTok that are super excited that she's even an option.\n\nThat all being said, I was extremely checked out of the race already and Kamala probably isn't going to make me an active participant.",
        "like_count": 0,
        "published_at": "2024-07-31T02:04:46Z",
        "is_reply": true
      },
      {
        "id": "Ugw1iYZa2ZHj-Xk1LPB4AaABAg.A6Rrp0b3JogA6a_hgU7npW",
        "author": "@BearKat9",
        "text": "Thank you for the work you're doing. Let's do this!",
        "like_count": 1,
        "published_at": "2024-08-01T11:48:07Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugyp7mgT2Pp6PGHe0ih4AaABAg",
    "author": "@tylerhackner9731",
    "author_channel_id": "UCbwlrgLNVjnejJT6NKWfzMQ",
    "text": "Can she? Yes \n\nWill she? Remains to be seen",
    "like_count": 293,
    "published_at": "2024-07-28T17:06:23Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "Ugyp7mgT2Pp6PGHe0ih4AaABAg.A6Rqx9JOlpDA6RtkKUjJqq",
        "author": "@coss1",
        "text": "Preach!!",
        "like_count": 5,
        "published_at": "2024-07-28T17:30:50Z",
        "is_reply": true
      },
      {
        "id": "Ugyp7mgT2Pp6PGHe0ih4AaABAg.A6Rqx9JOlpDA6SNX9i39Jz",
        "author": "@BeCalmSeeClearly",
        "text": "Is she qualified? Yes \n\nDoes white America believe she qualified? Remains to be seen 😤😤😤",
        "like_count": 0,
        "published_at": "2024-07-28T21:59:47Z",
        "is_reply": true
      },
      {
        "id": "Ugyp7mgT2Pp6PGHe0ih4AaABAg.A6Rqx9JOlpDA6Szl6i1n65",
        "author": "@satyasyasatyasya5746",
        "text": "hey you stole my format/comment :P",
        "like_count": 2,
        "published_at": "2024-07-29T03:42:37Z",
        "is_reply": true
      },
      {
        "id": "Ugyp7mgT2Pp6PGHe0ih4AaABAg.A6Rqx9JOlpDA6eZHeUHuDE",
        "author": "@AlexMartinez-dl9xi",
        "text": "Howdy, I wasn't expecting to find you here!",
        "like_count": 0,
        "published_at": "2024-08-03T00:52:39Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugxn37m9J-vOvYJtQmx4AaABAg",
    "author": "@grandpafalkenrath2988",
    "author_channel_id": "UC3DgpSXlbOjYsl4QB8JjTqA",
    "text": "I'm absolutely voting for Kamala,  what a great show, Olay and friends",
    "like_count": 111,
    "published_at": "2024-07-28T18:21:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgznMYZG6pKxY7U4FlN4AaABAg",
    "author": "@rootsm3",
    "author_channel_id": "UC43B44hLCCys22irrbvshPw",
    "text": "I needed this bad. This past week has been an emotional rollercoaster and I need to hear intelligent voices help me work thru my feelings.",
    "like_count": 105,
    "published_at": "2024-07-28T17:40:47Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgznMYZG6pKxY7U4FlN4AaABAg.A6RutCJQWCcA6Sr261APsi",
        "author": "@tylergriffin3667",
        "text": "This. Thank you for saying it better than I could have",
        "like_count": 2,
        "published_at": "2024-07-29T02:26:26Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxjsDpyRxq6cU1_Fv14AaABAg",
    "author": "@pisceanbeauty2503",
    "author_channel_id": "UCM1TbR_JxBd19TL13IMN9FA",
    "text": "Just want to also clarify that during Obama’s first run it was mostly the media and black political class that were skeptical. Many average black people were supporting him from the start, even with the hesitancy and concern some had of his electability. I do think having non-white candidates has become more normalized to the point that the questions that existed in 2008 aren’t as relevant today.",
    "like_count": 89,
    "published_at": "2024-07-28T18:49:14Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgxjsDpyRxq6cU1_Fv14AaABAg.A6S1iUeIU0KA6SUnw4W4t1",
        "author": "@AriesGirl77",
        "text": "Right!!! I remember seeing him on Oprah and I said, “he should run for president.” So when he did, I knew I was voting for him from jump.",
        "like_count": 6,
        "published_at": "2024-07-28T23:03:23Z",
        "is_reply": true
      },
      {
        "id": "UgxjsDpyRxq6cU1_Fv14AaABAg.A6S1iUeIU0KA6SeBjfPMpy",
        "author": "@pisceanbeauty2503",
        "text": "@TC-uj6jc Nope, 2004 was my first election. Most black people I knew were slightly skeptical he could win but still supported him in the primaries over Hillary. I saw very little discussion or concern with his background as being biracial or half African. It was mostly black politicians and the leadership class who were truly questioning him and throwing their support to Clinton.",
        "like_count": 8,
        "published_at": "2024-07-29T00:34:09Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzHUEbKbISRheF8L3Z4AaABAg",
    "author": "@justhearmeout3959",
    "author_channel_id": "UCL9UFx1qh2lE7PGBVQreQ3Q",
    "text": "Literally watching another episode of Olay and Friends when this notification popped up!",
    "like_count": 61,
    "published_at": "2024-07-28T17:02:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx-Br2iO5VKAFrKuUZ4AaABAg",
    "author": "@emekeanazia",
    "author_channel_id": "UC-OPaQaVbzWA2TCXZkod9lA",
    "text": "i would love to see this same conversation in two weeks.",
    "like_count": 35,
    "published_at": "2024-07-28T19:07:31Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw05QK9jZodQa65XGB4AaABAg",
    "author": "@NPelham",
    "author_channel_id": "UC0jObXaoE3Inb3mQD6OmpUA",
    "text": "I just want to say that I love these videos. I'm a 40 year old white man. I appreciate the opportunity to be a fly on the wall in these rooms. You don't need voices like mine in these rooms, but ears like mine will benefit from being open to these conversations.",
    "like_count": 23,
    "published_at": "2024-07-29T18:58:35Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugw05QK9jZodQa65XGB4AaABAg.A6Uc_qlp6aXA6XT6tRBBBf",
        "author": "@lamech006",
        "text": "I came here to say this.",
        "like_count": 2,
        "published_at": "2024-07-30T21:24:50Z",
        "is_reply": true
      },
      {
        "id": "Ugw05QK9jZodQa65XGB4AaABAg.A6Uc_qlp6aXA6rZ46lLg7e",
        "author": "@misery_of_mika",
        "text": "This! White 18 year old in a very non-racially diverse area here. I fully agree",
        "like_count": 3,
        "published_at": "2024-08-08T02:00:56Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzCMWek7_tRzM6V2WJ4AaABAg",
    "author": "@spooty5383",
    "author_channel_id": "UCC19OPniwzovqbRydMSBJ5w",
    "text": "This was a fun Convo to tune into. Helps me gain perspective on how others in the black community feel about all of this. Thanks and happy birthday Olay. 🎂🎈",
    "like_count": 36,
    "published_at": "2024-07-28T18:13:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzJZI_wS6vMflVLN1t4AaABAg",
    "author": "@user-ow6oo2uw1e",
    "author_channel_id": "UCendCb-iebZH8X42h0cW2kw",
    "text": "Now to agree with you Olay, it ain't over til its over and we have seen this election season shift like the ocean so its not a done deal by any means.  Lest this turn out like 2016, and half the Democrat stay home saying \"We got this.\"",
    "like_count": 42,
    "published_at": "2024-07-28T18:12:20Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyh0PmWZ5OFLocS0Hh4AaABAg",
    "author": "@iamchrisvolpe",
    "author_channel_id": "UC61JhVuvRoPGGxCUTZwDACQ",
    "text": "I walked out of my apartment building in Harlem today and directly into a ‘Black Women for Harris’ rally at the Harriet Tubman statue and when I walked by again like 20 mins later Cordell Cleare was addressing a crowd 3-4x the size of when I originally passed that essentially stopped traffic on St Nicholas and 122nd. It was awesome.",
    "like_count": 90,
    "published_at": "2024-07-28T22:03:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxUj7ZjsWDfaHMwJLF4AaABAg",
    "author": "@RNNNPTH",
    "author_channel_id": "UC6uXh1AyiiitnVKOvaBndDg",
    "text": "I'm a leftist (also an Indian American who supposedly could be swayed by Kamala Harris' part Indian identity-- for the record there are too many bad humans in the Indian diaspora for that to do anything for me), not a fan of Harris or any Democrats, but definitely recognize how catastrophic Trump winning could be. I also haven't been swayed by the supposed virtue or benefit of voting symbolically or for third parties in a long time (I did vote for Nader in 2000). I was probably not going to be able to stomach voting again for Biden (I did in 2020 and not proud of it). Despite Harris being a part of that administration, Biden being replaced has really cleared most of the ill stench the prospect of voting for for the Democratic ticket, and I'm not under any delusion that Harris will be all that different. But the buck stops with Biden, and with Harris at the top of the ticket, the buck still stops with Biden (at least until/if she becomes president). At any rate voting for \"the lesser of two evils\" rhetoric should be retired in favor of \"pick the administration we can resist better\". Liberals will be complacent if Democrats win but they were never the allies you want anyway. We should normalize the idea that even if you vote for someone you still have a responsibility to resist and pressure against their oppressive policies, which Harris will likely have if she wins.\n\nWith regards to the white woman question, I doubt many white woman who voted for Trump in 2016 and 2020 are going to be swayed to vote differently especially with a Black woman at the top of the ticket, but morbidly, I wonder if a statistically significant number of older white people have died off (the pandemic killed and is still killing a lot of people) and will be replaced by younger voters who turned 18.",
    "like_count": 74,
    "published_at": "2024-07-28T19:41:26Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgxUj7ZjsWDfaHMwJLF4AaABAg.A6S7grw74QzA6SLjcu0Ghy",
        "author": "@jonathanphilip4776",
        "text": "I do believe abortion rights is a reason some white woman vote for Harris",
        "like_count": 18,
        "published_at": "2024-07-28T21:44:09Z",
        "is_reply": true
      },
      {
        "id": "UgxUj7ZjsWDfaHMwJLF4AaABAg.A6S7grw74QzA6ShmcIE4Wh",
        "author": "@JDBaldBabyVance",
        "text": "Morbid is right, but you do have a point. Trump did NOT do his voter base any favors with his handling of covid. Granted, that affected us and our loved ones too and even now it's naïve to suggest we're \"past\" it, but we're the ones still here who tried to protect ourselves and others. Bet Trump lost a lot of would be racist voters with the antivax crap.",
        "like_count": 0,
        "published_at": "2024-07-29T01:05:32Z",
        "is_reply": true
      },
      {
        "id": "UgxUj7ZjsWDfaHMwJLF4AaABAg.A6S7grw74QzA6XyscZHyHd",
        "author": "@samwight",
        "text": "I generally agree but I don't think either administration is going to be great to organize under. Stop Cop City protesters were literally executed by police. University students protesting peacefully were beaten to shit, arrested, and had the full arm of the state weapons against them. Both of those happened under a Dem administration.",
        "like_count": 0,
        "published_at": "2024-07-31T02:11:06Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyIi7mVLHYPy4Rr2aB4AaABAg",
    "author": "@amoss9737",
    "author_channel_id": "UCENe_wnWGAIWw99u014iexw",
    "text": "My only issue is feeling like I can never vote for what I want. We’re constantly in this cycle of voting for someone in order to block “evil”. When do we get to vote for our actual interests without the constant fear of rights being taken away?",
    "like_count": 54,
    "published_at": "2024-07-28T20:16:59Z",
    "is_reply": false,
    "reply_count": 9,
    "replies": [
      {
        "id": "UgyIi7mVLHYPy4Rr2aB4AaABAg.A6SBlEGoFgTA6SDViu7WUV",
        "author": "@user-lp2nz7vq6b",
        "text": "Right now. This election is when you can vote for your interest, will be one of the most progressive, forward-thinking people to ever win the White House.",
        "like_count": 10,
        "published_at": "2024-07-28T20:32:13Z",
        "is_reply": true
      },
      {
        "id": "UgyIi7mVLHYPy4Rr2aB4AaABAg.A6SBlEGoFgTA6SI_5UoXOP",
        "author": "@TreeHairedGingerAle",
        "text": "It's understandable.\n\nMy thinking: vote. Or don't vote. But _organize._ Both before and after. People need to stop going back to sleep. \n\nStopgaps are fine, but what matters the most rn is community and network building...because the US government will NEVER take care of the People the way that _The People_ can take care of the People.",
        "like_count": 21,
        "published_at": "2024-07-28T21:16:30Z",
        "is_reply": true
      },
      {
        "id": "UgyIi7mVLHYPy4Rr2aB4AaABAg.A6SBlEGoFgTA6SJuUaMGmx",
        "author": "@Beastw1ck",
        "text": "@amoss9737 Probably once we get rid of Trump. Obama McCain and Obama Romney were two elections where neither candidate was a dangerous extremist.",
        "like_count": 0,
        "published_at": "2024-07-28T21:28:10Z",
        "is_reply": true
      },
      {
        "id": "UgyIi7mVLHYPy4Rr2aB4AaABAg.A6SBlEGoFgTA6SPb-vM5Xd",
        "author": "@thzene4967",
        "text": "Honestly when the right shifts to policy alternatives other than ones that ban and limits. As long as that's their game it's the thing we'll always be fighting.",
        "like_count": 10,
        "published_at": "2024-07-28T22:17:55Z",
        "is_reply": true
      },
      {
        "id": "UgyIi7mVLHYPy4Rr2aB4AaABAg.A6SBlEGoFgTA6SQhUsSOAz",
        "author": "@amoss9737",
        "text": "@user-lp2nz7vq6b this is still an establishment democrat vs extremist right-winger. This is definitely not the type of election that allows me to vote for what I want vs simply not being taken over by extremists.",
        "like_count": 5,
        "published_at": "2024-07-28T22:27:33Z",
        "is_reply": true
      },
      {
        "id": "UgyIi7mVLHYPy4Rr2aB4AaABAg.A6SBlEGoFgTA6SS5K6TnwD",
        "author": "@amoss9737",
        "text": "@thzene4967 this is exactly my point. It’s very exhausting, especially for us in red states, to constantly have to fight off people who only want to infiltrate and conquer. This leaves you not really making a choice but just voting to block other people’s destructive choices.",
        "like_count": 5,
        "published_at": "2024-07-28T22:39:40Z",
        "is_reply": true
      },
      {
        "id": "UgyIi7mVLHYPy4Rr2aB4AaABAg.A6SBlEGoFgTA6SXxcYU3hG",
        "author": "@jojodelacroix",
        "text": "Voting isn't about expressing your conscious frankly. It's tactical.",
        "like_count": 5,
        "published_at": "2024-07-28T23:30:55Z",
        "is_reply": true
      },
      {
        "id": "UgyIi7mVLHYPy4Rr2aB4AaABAg.A6SBlEGoFgTA6VoEhFjXIj",
        "author": "@hrwise89",
        "text": "​@amoss9737 my guess is that it will be a long-ass time before we will truly be voting for a *president* in a way that isn't just blocking something worse.\n\nIn terms of how we get there, I've heard some pretty good arguments that we need to do away with first past the post voting and move to ranked choice so we can actually vote for third parties without throwing away votes each time critical mass isn't reached. Alternately, if we could get said third parties to focus on local elections / congress seats, that might be a start too.\n\nIf we can push the shit out of those two things, maybe, some day, far in the future, we could vote for a president without plugging our noses?",
        "like_count": 2,
        "published_at": "2024-07-30T05:59:40Z",
        "is_reply": true
      },
      {
        "id": "UgyIi7mVLHYPy4Rr2aB4AaABAg.A6SBlEGoFgTA6pUA07ZZTn",
        "author": "@WeAreNotGoingBackEver",
        "text": "I don't ever recall feeling this pressure.",
        "like_count": 1,
        "published_at": "2024-08-07T06:39:34Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxeLt21OX2O-cLw6aF4AaABAg",
    "author": "@towandacastaneira8491",
    "author_channel_id": "UCsWy73ydX-x0h1Z2SOy9TXg",
    "text": "She’s also going to need a House and Senate majority to get any policy positions she wants to implement. She definitely can’t do it alone.",
    "like_count": 14,
    "published_at": "2024-07-28T19:46:02Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxeLt21OX2O-cLw6aF4AaABAg.A6S8DVtUb_XA6SsXFrzTrG",
        "author": "@tylergriffin3667",
        "text": "Tbf, I think the tactic here isn't as much about getting thing passed as it is about preventing things from being passed. AKA Project 2025. Yes, it's a delay tactic. Yes I hate it with every fiber of me soul. But if we're gonna be honest and work with the real material conditions we have, it makes sense. I can't bring myself to be enthusiastic or hopefull; living where I do it wouldn't help her cause much for me to advocate and campaign for her, which I'm not sure I could stomache, but I'm gonna vote for her.",
        "like_count": 0,
        "published_at": "2024-07-29T02:39:25Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwXex8ID_7gQwgW2G14AaABAg",
    "author": "@RNNNPTH",
    "author_channel_id": "UC6uXh1AyiiitnVKOvaBndDg",
    "text": "Okay, I just went down a rabbit hole with the whole 'Coconut\" meme... a lot of memes and internet culture goes over my head. At any rate, I've learned the origins are Kamala Harris quoting her South Indian mother, so it has decidedly South Indian origins. Her mother is from Tamil Nadu (my family is from Kerala, the South Indian state that borders Tamil Nadu). Coconuts are very culturally significant in Kerala, even more so than Tamil Nadu (example, in Tamil Nadu they sell young (green) coconuts on the street with straws for drinking coconut water out of them, but you never see that in Kerala because it's important to let coconuts fully ripen there). I do find it a bit weird that there's a lot of discourse around this meme that is completely divorced from the obviously South Indian origins.\n\nAlso, among the South Asian diaspora,  South Asian people with white assimilation aspirations are derisively referred to as 'coconuts' (brown on the outside, white on the inside). All things told I'd say white Harris supporters should ditch the 'coconut' meme.",
    "like_count": 16,
    "published_at": "2024-07-28T21:11:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyMlheiMBkwizWpxAN4AaABAg",
    "author": "@millenniumvintage9726",
    "author_channel_id": "UC9rBC8PMKoa60kHyLOwKo7A",
    "text": "One thing that gave me hope was an old white boomer (probably Trump voter) saying he will vote for Kamala so that Hillary gets to see another woman become president that isn’t her lol. Ice cold.",
    "like_count": 42,
    "published_at": "2024-07-29T03:57:15Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgyMlheiMBkwizWpxAN4AaABAg.A6T0RHRjiTGA6XIAEM36eS",
        "author": "@crazierthanusince96",
        "text": "😂",
        "like_count": 3,
        "published_at": "2024-07-30T19:49:10Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx9MHV8TIL9kczvp054AaABAg",
    "author": "@coss1",
    "author_channel_id": "UCsQTy2NvND5JOFWFY4V4tdg",
    "text": "I'm a bitter leftist, I usually can't stand the liberal perspective. This time I'm in shock, because I'm in total agreement with most liberals. I think she can do it. I really feel like it's more than just vibes, there's a momentum building. Maybe it's hopeful thinking, because if she can't do it, Lord help us all.",
    "like_count": 242,
    "published_at": "2024-07-28T17:30:10Z",
    "is_reply": false,
    "reply_count": 5,
    "replies": [
      {
        "id": "Ugx9MHV8TIL9kczvp054AaABAg.A6RtfQOpNnhA6Rzs3w3V25",
        "author": "@user-ow6oo2uw1e",
        "text": "Yeah I feel the framing of this conversation is hinges on the view that the other candidate hasn't called for a terminating of the Constitution, basically wanting to be a dictator, overturning Roe v Wade, tried to do a Coup of the 2020 election, and is just all around cringe vibes (last part being the only part that matters to normie voters).",
        "like_count": 34,
        "published_at": "2024-07-28T18:24:19Z",
        "is_reply": true
      },
      {
        "id": "Ugx9MHV8TIL9kczvp054AaABAg.A6RtfQOpNnhA6S7sQT_8of",
        "author": "@Electrosoulgurrl",
        "text": "Hope as small as a mustard seed is powerful. Martin Luther Kings book A Testament of Hope is a political strategy of mind and action. Don’t let the echo chambers and gas lighting maga hate wounds make you stumble. Kamala Harris is not perfect but she is a listener and can adapt to her constituents. Already seeing it from her time in office vs her beginning. We are allowed to evolve. MAGA does not want to evolve they want to go backwards and their selected Supreme Court justices proves it.",
        "like_count": 0,
        "published_at": "2024-07-28T19:43:01Z",
        "is_reply": true
      },
      {
        "id": "Ugx9MHV8TIL9kczvp054AaABAg.A6RtfQOpNnhA6SpnmVEHhj",
        "author": "@ChristopherSadlowski",
        "text": "I feel you. I'm ANGRY that the establishment Democrats forced Biden on us by not holding a primary. I'm ANGRY that Biden was so deluded that he thought he was the ONLY person in this entire country who could beat Trump. I'm ANGRY that Biden assumed his eighty year old ass could last another FOUR YEARS in office. I'm ANGRY at Biden for wasting our goddamn time. I'm. ANGRY. \nBut...Kamala isn't a terrible choice now. I'm at least comfortable voting for her instead of the begrudging dread I had voting for Biden. It's really annoying me how Boomers simply refuse to let go of power. It's annoying that they won't retire, don't trust us, their children, to take over, and appear to believe they're going to live forever to continue forcing their garbage that doesn't work anymore on us. It's annoying that it's taking DEATH to force open the seats of power instead of retirement. I'm bitter...but I'm not giving up just yet.",
        "like_count": 0,
        "published_at": "2024-07-29T02:15:36Z",
        "is_reply": true
      },
      {
        "id": "Ugx9MHV8TIL9kczvp054AaABAg.A6RtfQOpNnhA6SsRYgENPb",
        "author": "@HomeAtOahu",
        "text": "I agree.",
        "like_count": 1,
        "published_at": "2024-07-29T02:38:39Z",
        "is_reply": true
      },
      {
        "id": "Ugx9MHV8TIL9kczvp054AaABAg.A6RtfQOpNnhA6XyT7D3r0x",
        "author": "@samwight",
        "text": "Saaaaaameeee. Like ultimately I was and still am not convinced that either candidate is going to do things on the things that matter most to me (Palestine) and I wasn't going to vote for Biden at all. But now I'm gonna vote for kamala purely because of the coconut meme lol",
        "like_count": 0,
        "published_at": "2024-07-31T02:07:29Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwRBuPL04pXGR-di0F4AaABAg",
    "author": "@TheWholeSelf-ld1br",
    "author_channel_id": "UCnFdcVgtPgiGOD2J6k1z_VQ",
    "text": "I’d love to hear thoughts about how do we help her win given the intense mysogynoir? I don’t think this is just Kamala’s fight. It’s our fight.",
    "like_count": 11,
    "published_at": "2024-07-29T06:00:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxwWZbWywr4bMrSg-94AaABAg",
    "author": "@tylerblack3505",
    "author_channel_id": "UCGrqpjVgiQK3aMRkxkiKYCQ",
    "text": "I knew yall was at it it's Sunday and my algorithm hating I searched and found love yall",
    "like_count": 15,
    "published_at": "2024-07-28T17:30:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx3LbdMPN35CGuL5Xh4AaABAg",
    "author": "@satyasyasatyasya5746",
    "author_channel_id": "UCoCB28eBwZJMQwiKvrqwkjQ",
    "text": "CAN she win? Yes.\nWILL she win? ...uh... um...",
    "like_count": 44,
    "published_at": "2024-07-28T15:53:36Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugx3LbdMPN35CGuL5Xh4AaABAg.A6Ric9IFYB7A6S-5_Cbrif",
        "author": "@user-ow6oo2uw1e",
        "text": "EXACTLY!",
        "like_count": 2,
        "published_at": "2024-07-28T18:26:18Z",
        "is_reply": true
      },
      {
        "id": "Ugx3LbdMPN35CGuL5Xh4AaABAg.A6Ric9IFYB7A6X0YJnr_0t",
        "author": "@FYC2007",
        "text": "She will win.",
        "like_count": 1,
        "published_at": "2024-07-30T17:15:10Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugz9ZKRjSxexyMJsKhN4AaABAg",
    "author": "@ktsig287",
    "author_channel_id": "UCvgv9eYYEKQLsjS0oL_G-kg",
    "text": "The American electorate is so strange sometimes.\n\nMy 76 year old step-grandma voted for Trump and was planning to vote for him again.\n\nThe other day, she was \"well i am just tickled and amazed that we will see the first woman president in my lifetime. How exciting! I can't wait to cast my vote for Kamala Harris.\"\n\nIt's like...huh...what? How did you go from Trump to Kamala? I won't argue it, but I swear so many people just get vibes and change their minds.\n\nShe called Hilary Clinton \"nasty and corrupt\", but now she's like \"I don't like the way they're talking about Kamala Harris..that is just lowly and uncalled for.\" \n\nI know so many people who hated hilary who are now all in for Harris.",
    "like_count": 38,
    "published_at": "2024-07-29T04:13:19Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugz9ZKRjSxexyMJsKhN4AaABAg.A6T2H-Im4lQA6W3u56F98N",
        "author": "@ktsig287",
        "text": "@coygraf7897 wow you truly summed it up perfectly. Kamala has a quality that is winning the more we get to know her.",
        "like_count": 3,
        "published_at": "2024-07-30T08:25:15Z",
        "is_reply": true
      },
      {
        "id": "Ugz9ZKRjSxexyMJsKhN4AaABAg.A6T2H-Im4lQA6W8vw5weE9",
        "author": "@sonjarogers2513",
        "text": "The right wing are being out and out cruel, nasty, racist towards her.They are treating her as awful as they treated president Obama",
        "like_count": 0,
        "published_at": "2024-07-30T09:09:12Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwJ-fidi6gwhJcV5yN4AaABAg",
    "author": "@spontaneousmixx",
    "author_channel_id": "UClLLZ4j2nw4BZaF244LNZMw",
    "text": "I wish I had been part of this conversation. So much  Identity based focused right out the gate.  People liked Harris in the 2020 primary UNTIL she waffled on her policy positions.  Go back and look at her polling numbers and compare that with the dates when she had reneged on her support for Medicare for all.  This was her turning point.  It ain't about her identity it's about her consistency. \n\nIf there's any MAIN criticism i have of her, it's that she shifted ideals for her own political advancement, not as bad as Tulsi did, but because of this, i don't know if her initial policy positions when she was more progressive are her true positions, or if she was like, \"let me try the Bernie approach, oh he's got that locked up, let me try a more corporate angle.\" Or if it was donors that got to her. That shift in the primary i can never forget.",
    "like_count": 21,
    "published_at": "2024-07-28T19:24:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzyzNuW7ju88YPtflR4AaABAg",
    "author": "@bell_knight",
    "author_channel_id": "UCVp_1vVhq8v6S-PxGdbQs0A",
    "text": "HBD OLEMI! You’ve become one of my favorite creators!! Hope the celebrations are amazing!",
    "like_count": 7,
    "published_at": "2024-07-28T18:19:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzEUEXqzmbEUWhknBt4AaABAg",
    "author": "@luckyape",
    "author_channel_id": "UCe7jUoEdBbDybM4iH46BZBw",
    "text": "Great panel, thanks!",
    "like_count": 6,
    "published_at": "2024-07-28T20:02:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxk09VMFPWb3f01BEl4AaABAg",
    "author": "@celeste_xo",
    "author_channel_id": "UCGaKS0eMJNdPYqc1nE7D2CA",
    "text": "I CAAANT WAIT🎉🎉🎉🎉",
    "like_count": 11,
    "published_at": "2024-07-28T02:57:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwnElpiVniKVm3nn8F4AaABAg",
    "author": "@noturnunstoned",
    "author_channel_id": "UCbj_VCly7DvD9E6g2DHcWOQ",
    "text": "You want china on the mantle with Kamala's face? I already checked Etsy twice! xo 💖",
    "like_count": 10,
    "published_at": "2024-07-28T17:15:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx_2ahwG4rED5fpCGp4AaABAg",
    "author": "@marktaylor3290",
    "author_channel_id": "UCGJj4ey__1WhgSi9Pj9tG2A",
    "text": "You get the best guests consistently Olay!",
    "like_count": 5,
    "published_at": "2024-07-28T20:46:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyFJImy57yw2p3I--x4AaABAg",
    "author": "@daxdim",
    "author_channel_id": "UC3x3V52uQDt_DQLkP2XjMug",
    "text": "S/O to my bday twin, Olay!",
    "like_count": 7,
    "published_at": "2024-07-28T20:34:51Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgyFJImy57yw2p3I--x4AaABAg.A6SDo0S4dXIA6SGzaejXk7",
        "author": "@olurinatti",
        "text": "Happy birthday to you boo!",
        "like_count": 4,
        "published_at": "2024-07-28T21:02:38Z",
        "is_reply": true
      },
      {
        "id": "UgyFJImy57yw2p3I--x4AaABAg.A6SDo0S4dXIA6U69W9awD9",
        "author": "@DoctorQcumber",
        "text": "​@TC-uj6jcYouTube has a volume slider and a speed adjustment option if you need it. I listened on 2x speed and found her perfectly understandable",
        "like_count": 0,
        "published_at": "2024-07-29T14:06:30Z",
        "is_reply": true
      },
      {
        "id": "UgyFJImy57yw2p3I--x4AaABAg.A6SDo0S4dXIA6_UyOxMaxq",
        "author": "@shola1213",
        "text": "@TC-uj6jc subtitles are what you’re looking for 🤗",
        "like_count": 0,
        "published_at": "2024-08-01T01:38:44Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzPvgCBfXSQpGaefeN4AaABAg",
    "author": "@jenn7296",
    "author_channel_id": "UCjap09ZbRw4nNuMPgOvnP_Q",
    "text": "So appreciate the points raised in this conversation! I’ll take them with me when I knock doors and keep organizing after the election.",
    "like_count": 1,
    "published_at": "2024-08-04T22:19:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxSPjwCJyrX4KSiAkp4AaABAg",
    "author": "@newdawn7586",
    "author_channel_id": "UCLL0f2z1m1xySiMsyqNYONQ",
    "text": "We LOVE YOU Olay!!!",
    "like_count": 3,
    "published_at": "2024-07-28T20:01:19Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxSPjwCJyrX4KSiAkp4AaABAg.A6S9yRXKe4aA6SGxQytnTG",
        "author": "@olurinatti",
        "text": "",
        "like_count": 0,
        "published_at": "2024-07-28T21:02:20Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgymifiGYGaggU4dblp4AaABAg",
    "author": "@CMDR_Lani",
    "author_channel_id": "UCuBZw8o0cb_9F0fsoZNzt-Q",
    "text": "Insightful convo, as always. Thanks, Olay!",
    "like_count": 3,
    "published_at": "2024-07-28T18:56:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwMl52eG62fTm-FEVl4AaABAg",
    "author": "@lewa3910",
    "author_channel_id": "UCd2i9FX8_xI8-Ip8BR9hDEw",
    "text": "Olurin delivering the conversations that Need to be happening!\nAlso Happy BDay Olay!❤🎉🎂\nHope you had a good fun time after all the tiring convos about this mess",
    "like_count": 5,
    "published_at": "2024-07-28T19:25:25Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzjJJw6AwlQSZLXgL54AaABAg",
    "author": "@scroogemcduckASF",
    "author_channel_id": "UCfbgF7wiCZ8QfwCHoKRr5Pw",
    "text": "13:11 I like this guy! He’s a star",
    "like_count": 4,
    "published_at": "2024-07-28T21:47:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxV5bcVZch9sHyRg-14AaABAg",
    "author": "@xSolomon454x",
    "author_channel_id": "UC8w7Vd7bK04tdwhLZF-fNkQ",
    "text": "Great episode y'all!",
    "like_count": 4,
    "published_at": "2024-07-28T18:43:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyEg7lJpgXy4-G5zvZ4AaABAg",
    "author": "@tonymcdonnly6492",
    "author_channel_id": "UCoXIbc6tlTLjadOmkSwowjQ",
    "text": "Excellent view points from the entire panel. Proud to be a subscriber. Keep up the good work Olay.",
    "like_count": 2,
    "published_at": "2024-07-29T14:49:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyrOHXV4zo36Dk9Lel4AaABAg",
    "author": "@Achilla09",
    "author_channel_id": "UCuPfoZ7RIvH356_g9eCBdzQ",
    "text": "As usual this was a great conversation. I think you laid out very accurate expectations for what her presidency will be like if she wins. I'm completely on the \"Vote for the weakest adversary\" vibe for these presidential elections now. Hopefully we can get something more significant rolling after donald trump isnt a threat anymore.",
    "like_count": 4,
    "published_at": "2024-07-29T05:44:52Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgyrOHXV4zo36Dk9Lel4AaABAg.A6TCkVnO2J1A6W6wsVHGrC",
        "author": "@sonjarogers2513",
        "text": "​@bisiashleybut if trump gets back in as president he will make project 2025 a dream come true. My opinion trump will destroy America. He is impressed with leadership like Putin from Russia",
        "like_count": 1,
        "published_at": "2024-07-30T08:51:51Z",
        "is_reply": true
      },
      {
        "id": "UgyrOHXV4zo36Dk9Lel4AaABAg.A6TCkVnO2J1A6W7PRFj4ZZ",
        "author": "@sonjarogers2513",
        "text": "I will take a prosecutor over a felon like trump anytime",
        "like_count": 1,
        "published_at": "2024-07-30T08:55:53Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugz2Pp_PqafeVCc4Fa14AaABAg",
    "author": "@dfoster4001",
    "author_channel_id": "UCFtTsYrcJCXF4BrOJG7zVbw",
    "text": "This is a fast moving situation. I think it’s reasonable to be cautiously optimistic,  but don’t forget the last part. Even the numbers, $200M in small donations raised in 7 days, 200K volunteers signed up, all relevant dem endorsements, Beyoncé cleared soundtrack. As a reliable  democratic voter, this is not common for a campaign since 44. Black men and white women following Black women into Zoom calls organizing and donating. We have a lot to be optimistic about at this point. History is history. The present is live and active. Let’s go!",
    "like_count": 18,
    "published_at": "2024-07-28T23:39:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxuhH0Iv6DJXDMP43p4AaABAg",
    "author": "@angelawesneski5029",
    "author_channel_id": "UC_6uyffmVpUSwGR_wkyN-Vw",
    "text": "I'm desperately trying to hold onto my enthusiasm and hope so that I'm able to message that enthusiasm to the people in my life and get out the vote. I totally understand the pragmatism that you all have around this election, but I'm really trying to let myself feel joy and let that fuel my engagement and support. (Even if it ends up being a little cringy sometimes...😅)",
    "like_count": 4,
    "published_at": "2024-07-28T21:09:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyEWv11Tz33DT5Xaeh4AaABAg",
    "author": "@chadalpha7983",
    "author_channel_id": "UC5zqlXIKmjKUtwvyLWa9lpQ",
    "text": "Yes we Kam !",
    "like_count": 3,
    "published_at": "2024-07-30T06:50:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwb5HVBRlG8DY4qWTR4AaABAg",
    "author": "@Vev02.",
    "author_channel_id": "UCGFp30pl8-fbNPCL1n96Q2w",
    "text": "ur friend group gives air sign vibes i love it",
    "like_count": 1,
    "published_at": "2024-07-29T22:31:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyWUNyeqbXbweNIpA14AaABAg",
    "author": "@65avo65",
    "author_channel_id": "UC3_C-uI9aazuOXv19Hg8BUg",
    "text": "That family feud idea was pretty good haha",
    "like_count": 0,
    "published_at": "2024-07-29T01:08:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxWsNNIGHxYoMEV3XZ4AaABAg",
    "author": "@mikey-wl2jt",
    "author_channel_id": "UCq3R2qp0HYOwykrKNlSYPRQ",
    "text": "\"The most american thing is 'ive had a heart attack every four years and still refuse to work out'\" 🔥🔥🔥",
    "like_count": 3,
    "published_at": "2024-07-28T22:26:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzY95eLN_9CmCunWtZ4AaABAg",
    "author": "@bell_knight",
    "author_channel_id": "UCVp_1vVhq8v6S-PxGdbQs0A",
    "text": "5:52 this shit is DEFINITELY already starting",
    "like_count": 1,
    "published_at": "2024-07-28T18:18:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzd2032_xtF9x09u5B4AaABAg",
    "author": "@MySqueezingArm",
    "author_channel_id": "UCdi_5Pz6QYT7Lp7Zf8MPkkg",
    "text": "I hope she picks up Beshear for VP.  Regardless, hoping for a Harris win in November so I can keep doing my part locally.",
    "like_count": 5,
    "published_at": "2024-07-28T21:17:27Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy_PaOAziYI4Uek4Gt4AaABAg",
    "author": "@jeremiahp9225",
    "author_channel_id": "UC5ODk9786SuW-9mEqM4MgAQ",
    "text": "Olay here's my take on everything, (Sorry about it being long) I love you, Garrison & Rebecca!! ❤❤ First I really think you should invite @2rawtooreal on your show. He's a very intelligent dude & I think he'd bring a great aspect to the discussion. Ok so, I understand the statistical aspect of that on paper, in black & white & based on America being deep rooted in Racism, sexism & misogyny that \"she can't win\" but we must not be statistically stagnant meaning we need to understand that without hope there can be no systematic change so we must be hopeful & have optimism about Kamala Harris having a chance of winning because we as a society get so focused on the reality, facts & data that we're scared to dream or scared to be optimistic & as human beings, I think that's a problem. Everything from the ending of slavery, to the moon landing, to electing the first black president all started with hope & optimism. The chance of her winning might not be great but there's a chance nonetheless. Also the reason why people go straight to her record as a prosecutor & AG for a reason to not vote for her is because they tend to not have an intellectual factual reason as to why they wouldn't vote for her. They'll just say what everybody said & become a bandwagon person.  People like that are usually ignorant, they're mis-educated,  misinformed, mislead especially when it comes to politics. We live in an Idiocracy meaning people tend to believe something that's word of mouth rather than doing their own research. We must put an end to that & encourage & even demand that people study on these important issues & learn the real qualifications of people before they open their mouth. They need to read articles & books about it. To Rebecca's point, I think she has been pointing out her agenda this entire week. A lot of Democrats who have rallied behind her have also laid out her agenda. To Garrison's take on VP Kamala doing Dances & stuff on TikTok & black sororities. Garrison you're wrong. I'm a proud Gen Z member & I actually didn't download TikTok until last week believe it or not & I said I would never download it. She has energized me about politics that much. Since I've been on there, I've seen hundreds of thousands of people like hundreds of videos of members of Black Sorority groups supporting her, Charlie XCX fans supporting, Beyonce fans & alot of Democrats in General. So I would have to disagree, I think that it's connecting to a lot of people that are supporting & donating to her, more than y'all might think. She's moving with the time & era in which we all live.  It's like y'all just want \"Facts, policies & nothing else\" from her which doesn't make any sense, even Obama had humor. Do you want her to act like a politician from the 1950s? No, it's called being relatable, being fun, having a sense of humor, realizing she's a human just like us,  ENERGIZING THE DEMOCRATIC PARTY!!! It doesn't mean when it's time to be serious, she can't be serious. Just some food for thought. By the way I'm a progressive Democrat saying this stuff!! Another thing, I love Project Coconut & it's becoming a movement. 🇺🇲💚🥥🌴",
    "like_count": 5,
    "published_at": "2024-07-30T06:08:45Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "Ugy_PaOAziYI4Uek4Gt4AaABAg.A6VpHKKjlO5A6W2ta8Fg5Y",
        "author": "@sonjarogers2513",
        "text": "❤❤❤ perfect comment 😊",
        "like_count": 2,
        "published_at": "2024-07-30T08:16:27Z",
        "is_reply": true
      },
      {
        "id": "Ugy_PaOAziYI4Uek4Gt4AaABAg.A6VpHKKjlO5A6WAW3QgcYu",
        "author": "@jeremiahp9225",
        "text": "@sonjarogers2513 Thank you so much. I'm excited to get Madame VP Kamala Harris elected 💚💚💚🥥🌴",
        "like_count": 1,
        "published_at": "2024-07-30T09:23:00Z",
        "is_reply": true
      },
      {
        "id": "Ugy_PaOAziYI4Uek4Gt4AaABAg.A6VpHKKjlO5A6_Jc4LtK0m",
        "author": "@79thakidd",
        "text": "I agree, perfectly said. and all I've seen so far is her speaking of her agenda from what she wants to do starting day 1. makes me wonder when did they record this lol. to me, she has a policy agenda I can get behind just like all the policies she been for this entire time VOTE BLUE 💙 VPHARRISFORPRESIDENT",
        "like_count": 1,
        "published_at": "2024-07-31T23:59:34Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyqskaOmXsZ6JEbVEB4AaABAg",
    "author": "@danielthomas9843",
    "author_channel_id": "UCubs9xOEfJMWl9XJGek_t_A",
    "text": "She CAN win, and I hope she does. I'm going to vote for her and I've already donated to her campaign and will do so again. But I'm still nervous about it.",
    "like_count": 5,
    "published_at": "2024-07-28T21:48:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx7tBdqAHIgKh8THbF4AaABAg",
    "author": "@ShmazProducts",
    "author_channel_id": "UC9wps4NQzVCaDBqsnaG7SHg",
    "text": "Great show!",
    "like_count": 1,
    "published_at": "2024-07-28T21:48:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwxI0kwMEs8DKWPj_F4AaABAg",
    "author": "@sr-xv4hi",
    "author_channel_id": "UCwjytN0vxk4ZaWK8QIpdRmw",
    "text": "Love these discussions, tyvm Olay, Happy Birthday Olay for God to bless you and the best always. To all your dreams to come through, many more healthy years. 🎂🎁🙏💝🥳🌺🎊🎉✨️Great Sunday to all",
    "like_count": 1,
    "published_at": "2024-07-28T20:52:25Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwCx-f0OkbYWfpNy3B4AaABAg",
    "author": "@etspiritus",
    "author_channel_id": "UC3ZnT5ITBPw13h_Y-iWN6HQ",
    "text": "✊🏾✌🏾",
    "like_count": 2,
    "published_at": "2024-07-28T17:07:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxJ6hAjA1CP6Gx0vgp4AaABAg",
    "author": "@NicoleReign",
    "author_channel_id": "UC2y6R5FsC45t0Xo8WtpJZ_g",
    "text": "Olay done been in my home state that’s craaazy aw 😭💓",
    "like_count": 0,
    "published_at": "2024-07-30T01:08:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxmFLmxStyv0YqKcwp4AaABAg",
    "author": "@TheOnlyTaps",
    "author_channel_id": "UC1rtY5xwA_nKjoPwaFyLeYg",
    "text": "👊🏿🙏🏿",
    "like_count": 0,
    "published_at": "2024-07-28T17:39:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx-0QmRzlIVuteXez54AaABAg",
    "author": "@jimmypad5501",
    "author_channel_id": "UCW_NM_VrG2GVlUPIVyefG4w",
    "text": "I love my peoples but I really need us to not mistake our lack of healing as true political commentary. Our racial traumas are real, but they are not true signs of future political behavior and making sure we are not analyzing the projections of our own pain is critically important in this moment. Electoral politics is equally about what we make happen as much as it is about analyzing what is.",
    "like_count": 9,
    "published_at": "2024-07-28T19:57:25Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwVrpX6ZDmLYUxpbnJ4AaABAg",
    "author": "@ssft12056",
    "author_channel_id": "UC9C8aq4HGTiqNA0xqupz4LQ",
    "text": "\"Prepare for the worst, hope for the best\" seems to be the theme here. I am on team hope!",
    "like_count": 0,
    "published_at": "2024-07-30T21:42:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwi01hSFBN-MvTB1n94AaABAg",
    "author": "@Huggybear711",
    "author_channel_id": "UCd_jYdlJkItS_vEQJBjaM_A",
    "text": "Oh no a wait time 😢",
    "like_count": 1,
    "published_at": "2024-07-28T05:20:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgysGRH_RbXCJ3O-ZbB4AaABAg",
    "author": "@JosephKerr27",
    "author_channel_id": "UCQrdqGABt_sKdShub99Dh9w",
    "text": "Rebecca was right to call out the coconut trend. Kamala talked about some folksy saying her mom told, but it's gone viral and people don't necessarily think about the implications. I'm thinking about her coming from Hawaii and the colonial aspect there, but there's just as much colonial context in the Caribbean. People need to reminded to think twice about memes.\n\nAlso, ngl Harris isn't an orator like Obama, but she can turn a phrase and I genuinely like it compared to the old and older combo.",
    "like_count": 6,
    "published_at": "2024-07-29T02:45:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxs901SPHNG9QntkN54AaABAg",
    "author": "@riderouter",
    "author_channel_id": "UCtz9A1UwYBaslXVtRB1I1YA",
    "text": "HARRIS/WALZ 2024!!!!!!",
    "like_count": 41,
    "published_at": "2024-07-28T04:32:09Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "Ugxs901SPHNG9QntkN54AaABAg.A6QVd4cmvIQA6RrhjNKpaZ",
        "author": "@tylerhackner9731",
        "text": "That’d be a great ticket",
        "like_count": 13,
        "published_at": "2024-07-28T17:13:01Z",
        "is_reply": true
      },
      {
        "id": "Ugxs901SPHNG9QntkN54AaABAg.A6QVd4cmvIQA6S-oz1ZEaI",
        "author": "@user-ow6oo2uw1e",
        "text": "Seconded.  Want a Progressive, will DEFINITELY take this for now.",
        "like_count": 10,
        "published_at": "2024-07-28T18:32:38Z",
        "is_reply": true
      },
      {
        "id": "Ugxs901SPHNG9QntkN54AaABAg.A6QVd4cmvIQA6UQeflkjnJ",
        "author": "@jaefrmbk2k",
        "text": "💯",
        "like_count": 1,
        "published_at": "2024-07-29T17:05:39Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugy5tgP2TzNxj97hvMp4AaABAg",
    "author": "@brandonwoods9952",
    "author_channel_id": "UC2OvcwEIvvcNRmnkfQq6m2w",
    "text": "Thank you for another great conversation. How do we factor in the fact that the Democratic presidential nominee has lost the popular vote once since 1992? That is eight election cycles. It comes down to the Electoral College (which has worked as intended - to disenfranchise the majority). It comes down to whether Harris can drive out the vote in those 4-5 states, and that's where it gets scary.",
    "like_count": 4,
    "published_at": "2024-07-28T17:24:30Z",
    "is_reply": false,
    "reply_count": 7,
    "replies": [
      {
        "id": "Ugy5tgP2TzNxj97hvMp4AaABAg.A6Rt0u7X6bzA6Rtrt6MKPV",
        "author": "@coss1",
        "text": "True. It can easily go either way. It's going to be so close that none of us will get any sleep. I'm not a big fan of the liberals, I would much prefer Nina Turner, But I also fear Trump on an existential level.",
        "like_count": 0,
        "published_at": "2024-07-28T17:31:52Z",
        "is_reply": true
      },
      {
        "id": "Ugy5tgP2TzNxj97hvMp4AaABAg.A6Rt0u7X6bzA6RuDuddjP7",
        "author": "@jusletursoulglobaby",
        "text": "are you sure about that. I'm pretty sure one of the celebrations of 08 and 12 was the overwhelming selection of Obama",
        "like_count": 3,
        "published_at": "2024-07-28T17:35:01Z",
        "is_reply": true
      },
      {
        "id": "Ugy5tgP2TzNxj97hvMp4AaABAg.A6Rt0u7X6bzA6S-O1-1OGy",
        "author": "@user-ow6oo2uw1e",
        "text": "Yeah and THATS why donating, phone calling, canvassing, and door knocking is so important as well.  Because it CAN'T be close or else the Supreme Court will step in and hand it to Trump, the part that MOST scares me, it HAS to be a blow out for Ol Donny to be down for the count.",
        "like_count": 5,
        "published_at": "2024-07-28T18:28:49Z",
        "is_reply": true
      },
      {
        "id": "Ugy5tgP2TzNxj97hvMp4AaABAg.A6Rt0u7X6bzA6S-ezz5LbR",
        "author": "@user-ow6oo2uw1e",
        "text": "Don't get it twisted either, the Conservatives WILL NOT stop trying to push Project 2025, even if they lose this round, they'll keep trying until it happens, one thing about the Right, they don't give up, they tried for 50 years to overturn Roe until they put enough Federalist Society goons in there to finally make it happen.",
        "like_count": 0,
        "published_at": "2024-07-28T18:31:17Z",
        "is_reply": true
      },
      {
        "id": "Ugy5tgP2TzNxj97hvMp4AaABAg.A6Rt0u7X6bzA6S2ZtUOguB",
        "author": "@brandonwoods9952",
        "text": "@user-ow6oo2uw1e Yes, it can't be another Gore/Bush outcome!",
        "like_count": 2,
        "published_at": "2024-07-28T18:56:40Z",
        "is_reply": true
      },
      {
        "id": "Ugy5tgP2TzNxj97hvMp4AaABAg.A6Rt0u7X6bzA6SEDIze6f5",
        "author": "@user-lp2nz7vq6b",
        "text": "It doesn’t get all that scary, really, when you take into account that the states that matter, the rustbelt, are often blue. There’s an argument had that they went red in 2016 as a fluke, but they’ve gotten bluer since 2016",
        "like_count": 0,
        "published_at": "2024-07-28T20:38:26Z",
        "is_reply": true
      },
      {
        "id": "Ugy5tgP2TzNxj97hvMp4AaABAg.A6Rt0u7X6bzA6TPraLPimv",
        "author": "@Itsmichelle04",
        "text": "Bill won the popular vote in 92 and 96. \nAl Gore won the popular vote against Bush by almost 600k in 2000 but lost the election. The popular vote win by Bush in was such a narrow margin, it was .7.  Obama won the popular voice twice - in 08 and 12\n\nHillary won the popular vote by almost 3 million votes and Joe Biden garnered more than 7 million votes than Trump.",
        "like_count": 0,
        "published_at": "2024-07-29T07:39:26Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzVA5lEZUxHiDf54Jd4AaABAg",
    "author": "@wendyflores1092",
    "author_channel_id": "UCrxPI7mHLzQ884lxLLl7QTA",
    "text": "👏👏👏👏👏👏👏👏👏👏",
    "like_count": 0,
    "published_at": "2024-07-29T15:25:38Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzPyyiFNDDXHjd8DnV4AaABAg",
    "author": "@lerualnaej5917",
    "author_channel_id": "UCylLI118LJWFf29L4WUb-GQ",
    "text": "I'm reminded of a comment I made to my great-aunt about Hillary. She did not like Hillary Clinton for a lot of reasons, some of which were valid, many of which were just misogyny. She kept talking about how all women in politics were xyz and she didn't like that. I remember asking her \"Isn't it a problem that the only women who can make it to the national stage in politics are the ones who are xyz?\" There are certain kinds of marginalized people (personality, educational and professional background, etc) who have an easier time actually getting ahead in our political system so it's not surprising that white men in positions with the most power have the most diversity of thought and background.",
    "like_count": 3,
    "published_at": "2024-07-29T18:39:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyee-DEscIlKbi1Kc94AaABAg",
    "author": "@BeCalmSeeClearly",
    "author_channel_id": "UCzu9KSh9sk4qpvxMCLBqhPw",
    "text": "Olay Happy Birthday weekend and I still believe when we turn out we win people didn't turn out for Hillary like she THINKS they were going too over confidence Arrogance short sited was to me what Hillary ran on Kamala knows I repeat KNOWS this is an uphill battle no matter the outcome we HAVE TO stick together and focus on improving and bettering life",
    "like_count": 2,
    "published_at": "2024-07-28T21:58:27Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugyee-DEscIlKbi1Kc94AaABAg.A6SNNMKyfcbA6U57IJT_Fj",
        "author": "@olurinatti",
        "text": "Thank you !",
        "like_count": 0,
        "published_at": "2024-07-29T13:57:27Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwT5UCXDLPq7TemUEd4AaABAg",
    "author": "@KalinTheZola",
    "author_channel_id": "UCG3AnvVdeR77ooqM_8Lb2Lg",
    "text": "I sure hope so",
    "like_count": 0,
    "published_at": "2024-07-28T19:21:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx1waaiaCHocKxRZLJ4AaABAg",
    "author": "@SlumSapien",
    "author_channel_id": "UCLYDLriC1ENFEVTLmdOQyFg",
    "text": "That director daddy dude looks like eddy griffin",
    "like_count": 0,
    "published_at": "2024-07-29T13:01:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwr8x82GpMIIpmxjHt4AaABAg",
    "author": "@majikai9077",
    "author_channel_id": "UC2E8BsBXZqNaqMUAnpc7vNQ",
    "text": "This show reminds me of The Grapevine Tv when it was good for some reason. (Iykyk)",
    "like_count": 1,
    "published_at": "2024-07-29T18:11:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyBwdDa0doGQZ9WvSB4AaABAg",
    "author": "@frostedflower2032",
    "author_channel_id": "UCeCeCyzpMhAHzq_T53oLdfg",
    "text": "Great video! This is off topic, but after the recent hurricane that tore through St.Vincent & Grenada I keep hoping that the next administration will start taking climate issues more seriously. I keep getting more worried about my family in St.Vincent and the future of all islands if things don't change soon with these historic storms. I was wondering if you've considered doing an Olay & Friends/video on how climate change will disproportionately impact black people (East coast US, Africa, & the Caribbean, etc)? I understand if this is outside of what you want to focus on. I am so glad I have been recommended your channel, your commentary has been resonating with me- thank you for your work!",
    "like_count": 0,
    "published_at": "2024-08-03T00:59:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxBxaHhwsVDGUVv8z94AaABAg",
    "author": "@michaeljluh",
    "author_channel_id": "UCmkDbijw7DhDbxO5IKtVmlw",
    "text": "She need to run a new deal platform",
    "like_count": 0,
    "published_at": "2024-07-28T21:34:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwVfIdrHYjIt789LjR4AaABAg",
    "author": "@BeCalmSeeClearly",
    "author_channel_id": "UCzu9KSh9sk4qpvxMCLBqhPw",
    "text": "Btw 90k and MOREEEEE",
    "like_count": 1,
    "published_at": "2024-07-28T22:30:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyneLsjn75ejpIJAbB4AaABAg",
    "author": "@Lucythefallenone",
    "author_channel_id": "UCAi-uva-vLCRTAab-2Z0BeQ",
    "text": "Women are statistically more likely to hand 50% more wealth to their kids than men, she's had some progressive wins, establishment doesn't have a lot of time to sink their teeth in. She's the first first in a lot of areas and her intelligence should not be underestimated. Yes she has stances that need to improve, but I think we have more if a chance with her than any predecessor. Yes work needs to continue, but I think we have a shot for change with her and did not feel that with H Clinton. We were a couple votes shy of a 6 trillion dollar package with congress and Biden. Her momentum might bring unexpected flips in the house and senate, flips that will likely last. She will also likely get to flip or reform the Suprem Court.",
    "like_count": 4,
    "published_at": "2024-07-28T21:33:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwY25yzulSECklAk_14AaABAg",
    "author": "@mindyourbusiness660",
    "author_channel_id": "UCFVidyYIlQCNWUsQjRzTZ-Q",
    "text": "Dangit! I'm late",
    "like_count": 0,
    "published_at": "2024-07-28T18:07:04Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyystVdwcvohqD1jyt4AaABAg",
    "author": "@thecameron_brooks",
    "author_channel_id": "UCx9BcsLmjLHOViOmJdi4LDA",
    "text": "Hearing the accuracy of this is both satisfying and sickening almost one year into Trump’s second term.",
    "like_count": 1,
    "published_at": "2025-09-24T13:57:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzsruZ2cGAAiQXeuct4AaABAg",
    "author": "@Thato494",
    "author_channel_id": "UCzLTtsJibygF4uXWzMRTG0A",
    "text": "She raised 100m in 24h ,mind u no other president has done this",
    "like_count": 2,
    "published_at": "2024-07-28T20:55:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwBZZMEZwHVxpYJYxF4AaABAg",
    "author": "@scroogemcduckASF",
    "author_channel_id": "UCfbgF7wiCZ8QfwCHoKRr5Pw",
    "text": "11:08 What attacks can they throw around Kamala that doesn’t RICOCHET back to Trump?😂",
    "like_count": 3,
    "published_at": "2024-07-28T21:45:15Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwBZZMEZwHVxpYJYxF4AaABAg.A6SLrlBckNkA6SP9-SYRnn",
        "author": "@mikey-wl2jt",
        "text": "except \"she's Black and Brown and a woman\"",
        "like_count": 1,
        "published_at": "2024-07-28T22:13:58Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzQHMXsMjEyQCU4GmF4AaABAg",
    "author": "@jonathanfrank8240",
    "author_channel_id": "UCeb36LAMrkki9Stj1OU6udw",
    "text": "Just to let you guys know there is no sound",
    "like_count": 0,
    "published_at": "2024-07-28T18:43:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxBtqcdLXG7WZqAhHZ4AaABAg",
    "author": "@darcipeeps",
    "author_channel_id": "UCWOVljhM_gtwxsSo_zSp4gA",
    "text": "I asked my friend what he doesn’t like about Kamala and the first thing he said was her laugh 🙄",
    "like_count": 1,
    "published_at": "2024-08-05T17:08:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy-c4fb5dhYD-Tto2V4AaABAg",
    "author": "@ChristopherSadlowski",
    "author_channel_id": "UCVgXUeZyX4OhHuEPh8RvYFA",
    "text": "I love these chats you all have. They get my brain running in overdrive so much that I often forget to comment for the algorithm. I'll be sitting here like, \"oh that's a really interesting point! It just gave me an idea I want to add to the conversation!\" As I'm typing I'll hear something else really interesting and that keeps piling up until my mind can't hold everything I want to say. Once I hit that point my brain is so electrified I forget that I haven't left a comment at all. From now on I'll leave a nothing comment just to help get these videos out into other's feed.\nI have thoughts and feelings about Kamala. If we thought the whitelash from Obama was bad...\nI feel that if Kamala shows she can listen to young voters, take their ideas seriously, and have honest conversations it might help. I think young people want to feel involved in politics and are tired of being they're too idealistic or immature. If she can show that her mind can be changed after talking to young people and take their concerns seriously and WHY they feel the way they feel it might give her a leg up over the white supremacy that's running rampant desperately trying to maintain the status quo.",
    "like_count": 0,
    "published_at": "2024-07-29T02:06:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxIqwOl5tNnhEBW-0R4AaABAg",
    "author": "@IanJAGreen",
    "author_channel_id": "UCpF_bxSSbfJFghsqPXushZw",
    "text": "GARRISON!!😍",
    "like_count": 2,
    "published_at": "2024-07-28T18:05:50Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgxIqwOl5tNnhEBW-0R4AaABAg.A6RxkZY15tWA6ToP7rNg7i",
        "author": "@GarrisonHayes",
        "text": "👋🏾👋🏾👋🏾👋🏾",
        "like_count": 2,
        "published_at": "2024-07-29T11:22:36Z",
        "is_reply": true
      },
      {
        "id": "UgxIqwOl5tNnhEBW-0R4AaABAg.A6RxkZY15tWA6U-wEan5Sh",
        "author": "@IanJAGreen",
        "text": "@GarrisonHayes great to see you here.",
        "like_count": 1,
        "published_at": "2024-07-29T13:12:07Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxSz4l6p7paCD0V6Ot4AaABAg",
    "author": "@lasonjahill3349",
    "author_channel_id": "UCyO-onPM085ShJhQ0UolNZg",
    "text": "I wish we could stop talking about policies the potential presidential candidates are promising or running on as if they’re going to pass them unilaterally. They are not!  There’s this branch called the Legislature that controls the passing and failure of policies not the President.  If VP Harris wins the White House, you better hope she also has a Congress that will help her get those policies passed and implemented. If she doesn’t then she can’t deliver.",
    "like_count": 44,
    "published_at": "2024-07-28T18:08:40Z",
    "is_reply": false,
    "reply_count": 8,
    "replies": [
      {
        "id": "UgxSz4l6p7paCD0V6Ot4AaABAg.A6Ry4Q2PCVcA6SVsZHQKuc",
        "author": "@AriesGirl77",
        "text": "People always MISTAKENLY only vote for president. In reality, voting in local elections and state elections matter more.",
        "like_count": 12,
        "published_at": "2024-07-28T23:12:45Z",
        "is_reply": true
      },
      {
        "id": "UgxSz4l6p7paCD0V6Ot4AaABAg.A6Ry4Q2PCVcA6ScqjtFcQa",
        "author": "@AriesGirl77",
        "text": "@TC-uj6jc Dude, are you slow? What do you think I mean by STATE elections? Talking tough for no reason. An apology is in order, wouldn’t you agree?",
        "like_count": 5,
        "published_at": "2024-07-29T00:22:25Z",
        "is_reply": true
      },
      {
        "id": "UgxSz4l6p7paCD0V6Ot4AaABAg.A6Ry4Q2PCVcA6T588wcHcZ",
        "author": "@Bostonceltics1369",
        "text": "Is this any reason not to put a Democrat in there what are you advocating for as the alternative?",
        "like_count": 1,
        "published_at": "2024-07-29T04:38:20Z",
        "is_reply": true
      },
      {
        "id": "UgxSz4l6p7paCD0V6Ot4AaABAg.A6Ry4Q2PCVcA6T6pxavjYu",
        "author": "@Bostonceltics1369",
        "text": "You're right we should confront the challenges head on and be realistic You're also wrong in the sense that she doesn't have a chance. She definitely has a chance and she really hasn't even begun to campaign yet Don't gaslight yourself don't live in a fake world but at the same time try to believe that she can actually do it!",
        "like_count": 2,
        "published_at": "2024-07-29T04:53:11Z",
        "is_reply": true
      },
      {
        "id": "UgxSz4l6p7paCD0V6Ot4AaABAg.A6Ry4Q2PCVcA6U7JKi1U84",
        "author": "@jinx526",
        "text": "Yeah but when democrats do have the majority they still fail on promises and resisting the right. Ultimately they preserve the status quo. People should be cognizant and critical of that. It's why people must organize outside of elections.",
        "like_count": 0,
        "published_at": "2024-07-29T14:16:34Z",
        "is_reply": true
      },
      {
        "id": "UgxSz4l6p7paCD0V6Ot4AaABAg.A6Ry4Q2PCVcA6Ue1guQBBq",
        "author": "@Bostonceltics1369",
        "text": "@AriesGirl77 you said always and you set yourself up for me to just find one counterexample to make you wrong. If I vote in local elections then I'm a person therefore it's not always true. Sorry to be so pedantic. I think you're trying to say the president comes with an administration and we are voting for a platform not a cult of personality. If I'm steel-personing your position?",
        "like_count": 0,
        "published_at": "2024-07-29T19:11:15Z",
        "is_reply": true
      },
      {
        "id": "UgxSz4l6p7paCD0V6Ot4AaABAg.A6Ry4Q2PCVcA6UeMDm-Iu4",
        "author": "@Bostonceltics1369",
        "text": "@AriesGirl77 I'll apologize for that person, but I think we should ALL try to understand each other through criticism. On the left we don't all agree and we're not a monolith so we have to have the ability to have reasoned discussions, where criticisms are levied in good faith, forgive the expression I'm atheist.",
        "like_count": 0,
        "published_at": "2024-07-29T19:14:04Z",
        "is_reply": true
      },
      {
        "id": "UgxSz4l6p7paCD0V6Ot4AaABAg.A6Ry4Q2PCVcA6UkpKMKseD",
        "author": "@AriesGirl77",
        "text": "@Bostonceltics1369 The “always” is meant for the people who typically only concern themselves with the presidential vote and don’t worry about the other elections. If it doesn’t apply then let it fly. Also, you cannot apologize for someone else nor did I ask you to.",
        "like_count": 0,
        "published_at": "2024-07-29T20:10:36Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwoHShF9yMjHj070oR4AaABAg",
    "author": "@bdot0276",
    "author_channel_id": "UCBK03eraMNPDGen4C7vcB-A",
    "text": "Represent Rather!!! 🧡🐍🐍🐍💚",
    "like_count": 0,
    "published_at": "2024-07-29T19:37:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxr1_-IpHDNKYs2YSR4AaABAg",
    "author": "@chriswhite3006",
    "author_channel_id": "UC1jXLPdacp3-M5XQqZpE4rg",
    "text": "How do we hold Harris accountable if she wins? I don’t see what tools or mechanisms we have to hold her accountable",
    "like_count": 8,
    "published_at": "2024-07-28T22:14:45Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugxr1_-IpHDNKYs2YSR4AaABAg.A6SPEm23lkkA6SQhja-34V",
        "author": "@mikey-wl2jt",
        "text": "that's fair.  her only accountability as POTUS is four years from now",
        "like_count": 3,
        "published_at": "2024-07-28T22:27:35Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxYRbblFNi-pqgt4214AaABAg",
    "author": "@candygameher",
    "author_channel_id": "UC6otHi8GXwyt-E904RDDjEg",
    "text": "I get the pessimism about if Kamala. Especially when it was first announced but have yall been watching the news cycle since? She’s been polling greatly in a short period of time. Also don’t underestimate how awful of a pick JD Vance has been and his comments about single cat childless women will definitely be swaying a lot of white women to vote for Harris. Still plenty enough time left to see what’s happens, especially of Trump stops running from a debate",
    "like_count": 6,
    "published_at": "2024-07-29T06:19:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwXZv8oGhd3Y1NLil54AaABAg",
    "author": "@npalmer020",
    "author_channel_id": "UCdYU_eCqJn5yOso_k9-4Hog",
    "text": "I was worried this was just gonna be like \"do this cause we need to win\" olay's analysis really was one that resonated. like me personally I'm not voting for president but its not something I'm telling people not to do I think we need to focus on what we should do like organize just as olay said like we need to organize so these elections don't matter as much like vote or not vote what are you really doing to build the future we need regardless we know we cant hold these people accountable they don't care what we do",
    "like_count": 0,
    "published_at": "2024-07-31T17:25:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzDG-UhJcIoBTdCECB4AaABAg",
    "author": "@vihuang4215",
    "author_channel_id": "UCylnXaiwokFzzzhRmJ4ZWIQ",
    "text": "Lmao I went to my grandma’s house and she was like vote Kamala. Trump is bad. Not to mention the Chinese channel she was watching was insulting trump- 😂😂",
    "like_count": 1,
    "published_at": "2024-07-29T03:23:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxldCrIihL_nStoFSd4AaABAg",
    "author": "@J1m_kr4m",
    "author_channel_id": "UCh57esghZur-VnZti8SveXw",
    "text": "I understand the pessimism in regards to is the US ready for a woman president let alone a biracial woman president. Yet we don’t really know that until the election and who is in office by the end of it. I also notice most of the conversations around if she is black I have mostly seen among white conservatives. Yet I remain hopeful and skeptical as there is still a lot of work to be done in the next 3 months.",
    "like_count": 1,
    "published_at": "2024-07-28T20:51:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyv3Klw72uIqjwV7bN4AaABAg",
    "author": "@dariavision",
    "author_channel_id": "UCxR6Cd7TPgtIIJwgVcFxATw",
    "text": "I’m located in a suburb of a large liberal east coast city and the discourse on one of the town Facebook groups is so nasty, racist and misogynist right now that it’s terrifying",
    "like_count": 2,
    "published_at": "2024-07-29T13:47:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxvEPlj-PZAs1B3Kht4AaABAg",
    "author": "@TwoTonTaft",
    "author_channel_id": "UC4rSKAtSddS5bhTHzHGjbxQ",
    "text": "Kamala made Brett Kavanaugh cry. That's what you lean on",
    "like_count": 1,
    "published_at": "2024-07-31T06:55:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzu_0sbQYbfBFpxeFl4AaABAg",
    "author": "@donkeydanny2114",
    "author_channel_id": "UCYug01R1TqqVb8jE5qGeWaw",
    "text": "Always look forward to having these on while meal prepping for the work week😂\n\nAs for Kamala, at least with my electoralism hat on, she might have a good chance against Trump but she is no progressive game changer. We got the aesthetics of that with Obama, but the same neoliberal policies. Her inability to distinguish herself completely from Biden so far, as well as her track record in the 2020 primaries of not being able to distinguish herself such as Bernie or Warren, does not spell good for a progressive presidency going further than Biden's (just a continuation). Definitely better than Trump though. \n\n\nWith my leftist hat on, I'm very angry she  has not been able to distinguish herself clearly from Biden against Netanyahu and stand up for Gaza. Additionally, as Biden said nothing in our system will \"fundamnetally change\". If she sees herself as a continuation of Biden with how much she's mentioned him, she will NOT be the progressive, \"cool Aunt\" the media potrays her to be. Makes me even angrier considering her background (she should know the theory!) We have much work to do organizing, volunteering, and agitating.",
    "like_count": 9,
    "published_at": "2024-07-28T19:46:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwCOltxvUHIksDOImR4AaABAg",
    "author": "@ashleyp.2258",
    "author_channel_id": "UC3a8UY8b77hHVkTbAaE-tFg",
    "text": "Now since we know the results, what you said in your most recent uploaded video in 2:39 I remember it happening not liking how they responded to what you said but I agreed with you",
    "like_count": 0,
    "published_at": "2024-11-06T17:31:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxOTgHTKF2AogrK_2R4AaABAg",
    "author": "@scyofstate",
    "author_channel_id": "UCIpfesxBB6-skSGN6PGAICQ",
    "text": "How can I invite you to be a speaker at an event?",
    "like_count": 0,
    "published_at": "2024-07-31T20:55:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxVkU-LTKX9Bwr0xTF4AaABAg",
    "author": "@AfroRedMusic",
    "author_channel_id": "UCTL6M1JIiLVW1Mv43nGqSAg",
    "text": "Happy belated Olu! And yeah, there's too much nuance and work needed for this to work, and I hope but highly doubt this shit is gon pan out...",
    "like_count": 0,
    "published_at": "2024-08-05T02:06:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzznzvPcD0NhAigh8J4AaABAg",
    "author": "@FishOfTheSea",
    "author_channel_id": "UC13V5pUeLkMuTA7vsTFa_lA",
    "text": "As of rn she is winning in favorability among suburan women. So there's more hope than I thought",
    "like_count": 1,
    "published_at": "2024-07-29T14:28:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy3IWw4LTY7hykOdSZ4AaABAg",
    "author": "@cameronoday5424",
    "author_channel_id": "UCXhXwFRoP9H080wro7zbvaw",
    "text": "Prejudice needs to be faced head on for her to have a chance to win. If repeated lies can convince people on the right and left, then that shit needs to be dispelled openly. Can't cower from american bigotry.",
    "like_count": 0,
    "published_at": "2024-07-28T22:58:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwD-dnif8hJP69x1dt4AaABAg",
    "author": "@taoloveu",
    "author_channel_id": "UCe1WwEjVkDYtcOWeC5z7YOA",
    "text": "For the left \nWe need to get our shit together \nWe need to organize like the right has \nSTRATEGICALLY \nIn few areas\nContinue alt media, local worker organization, local politics etc",
    "like_count": 7,
    "published_at": "2024-07-29T04:32:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzlB59b8iX-gB_wi2R4AaABAg",
    "author": "@bdot0276",
    "author_channel_id": "UCBK03eraMNPDGen4C7vcB-A",
    "text": "All already know this but Congress is a huge part of the problem as well. A big thing is having the votes so that when we try to hold them accountable, they will have the mechanisms to pass the legislation we want. As well as a point judges that aren’t right winging nuts.",
    "like_count": 1,
    "published_at": "2024-07-29T20:02:25Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxaK0wkKNVIfshkNkl4AaABAg",
    "author": "@illinnyan4053",
    "author_channel_id": "UCVwlvue3QflbyaDMBhbVXTg",
    "text": "You have to remember in the context of 2020, we had a Bernie. Kamala was great when she went up against Biden for his support for busing. I was cheering for her, but did I want her? I wanted Bernie. \n\nEvery woman I know is on board for Kamala. Admittedly, i have removed Trumpers from my circle, but even those who wanted Biden to stay in, they've all consolidated for Kamala. My husband is 100 % on board as well. Kokonuts all the way! We're all khive now!",
    "like_count": 0,
    "published_at": "2024-07-28T23:28:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxDWfkCJ6YZkA_671J4AaABAg",
    "author": "@vegetarko09",
    "author_channel_id": "UCUdUwDFYuIsO4L2F-PSe7gQ",
    "text": "We gotta stop with the what is she gonna do for us. Lets get her in there first. Then we mobilize and pressure her to help us out.",
    "like_count": 0,
    "published_at": "2024-08-18T21:49:36Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy_Gbaw1HY-7qyA_sx4AaABAg",
    "author": "@kayiness",
    "author_channel_id": "UCzcHW9mnLkHU6LduThO_W6Q",
    "text": "On 27:05, Kamala's going to have to make a real genuine appeal to people on the fence and demonstrate how Trump will be so much worse for them than she will ever be.",
    "like_count": 1,
    "published_at": "2024-07-29T11:54:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxzExZYWy1DnmgNAMN4AaABAg",
    "author": "@ronniewilliamson1765",
    "author_channel_id": "UCp_HPBEfp11Pej2c_7dAlag",
    "text": "The idea of Voting for someone no matter what, without hearing their agenda, without demanding something to get a Vote, is like the tale of the Skorpion and the Frog.",
    "like_count": 11,
    "published_at": "2024-07-28T20:48:08Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgxzExZYWy1DnmgNAMN4AaABAg.A6SFKP_xLzIA6SOtn8lqiw",
        "author": "@mikey-wl2jt",
        "text": "good thing that ain't happening here, huh?",
        "like_count": 5,
        "published_at": "2024-07-28T22:11:45Z",
        "is_reply": true
      },
      {
        "id": "UgxzExZYWy1DnmgNAMN4AaABAg.A6SFKP_xLzIA6UjQxygdh7",
        "author": "@mgbl2808",
        "text": "Who have you voted for in the past?",
        "like_count": 1,
        "published_at": "2024-07-29T19:58:24Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyFLzVIL_auytd9V854AaABAg",
    "author": "@lionmom7629",
    "author_channel_id": "UCt5waZfn7ABisiEgnEeQ-_A",
    "text": "Yes. I know. I voted for Hillary. And Biden. Obama was the first president I voted for. But I know way too many other white women that either voted for Trump, or for Jill Stein, etc. \n\nWhite \"suburban\" women is what got Trump elected. And believe me, that $hit got brought up on that call. Oh yes it did. A whole lot!  Especially since Roe got overturned because of that $hit.",
    "like_count": 2,
    "published_at": "2024-07-29T13:05:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgznTUG2jTVNfuP7BRF4AaABAg",
    "author": "@raemmsunshine",
    "author_channel_id": "UCVSIcwcnapIFOAIhEgfIxVg",
    "text": "To all the English teachers who talked to EVERY black kid in the class like they were a sensitive baby with no vocabulary, I hope you see this video and explode.",
    "like_count": 0,
    "published_at": "2024-07-29T04:15:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxyep80SYccInzI9Rt4AaABAg",
    "author": "@FaySwine",
    "author_channel_id": "UCYYKUoGBKqyFbFSg5X3sVwA",
    "text": "Maybe she needs to campaign on the idea that I vote for Camilla is a vote against xenophobia.",
    "like_count": 0,
    "published_at": "2024-08-04T21:34:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzhbvuPnhnUCrWqjZ54AaABAg",
    "author": "@sheryljackson5471",
    "author_channel_id": "UCFdW2ozdZ3BSS8-mJculkVA",
    "text": "Yes yes we can vote blue 💙  for Kamala stand togeher America Freedom freedom in Jesus name come together  with Faith love wins over evil Trust Jesus 💙 ❤",
    "like_count": 0,
    "published_at": "2024-07-30T19:52:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz7B16l5Bzu_A3zi0N4AaABAg",
    "author": "@Katja-Kitty",
    "author_channel_id": "UCSgJMBD42ooXJ4rIG9l4HMQ",
    "text": "💯 @Olay",
    "like_count": 4,
    "published_at": "2024-07-28T17:20:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwcbh13iosxrHSOaFJ4AaABAg",
    "author": "@HeyLetsDoAThing",
    "author_channel_id": "UCC4TA9a7lwxOkAhKVgjHDDg",
    "text": "She isn’t perfect, no politician will ever be, and ACAB of course, but I’ll take having a shot at winning with Kamala over having no chance of winning with Biden. She’s the least divisive and really only option that makes sense at this point.",
    "like_count": 2,
    "published_at": "2024-07-29T23:25:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzROfYvCnbYDk6Txx14AaABAg",
    "author": "@catlyn777",
    "author_channel_id": "UCoPrnfEsAOI2TNKsVQWXqMQ",
    "text": "I wish it was a real progressive too but it’s still a little progress.  These are dangerous times, but progress is still coming. Whitmer is not great either, but has still been kinda good for purple MI.",
    "like_count": 0,
    "published_at": "2024-08-07T03:12:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgztuowHOdefn-FjAJZ4AaABAg",
    "author": "@eugenebaker7800",
    "author_channel_id": "UC8wJegiIQwb4TbQA6BIBiQg",
    "text": "If you had asked me “Do you think Kamala can win?” before Biden dropped out I would have said “No”. But within hours after he dropped out I changed my mind. I remember telling my 8th grade Civic students back in 2016 that Kamala may became our first female POC to become President. (We did same research on how many POC have won state wide elections.)  In a country of over a 100million voters and only 10s of thousands in a few states deciding the winner, it’s hard to predict. But I truly believe she has a good chance.",
    "like_count": 1,
    "published_at": "2024-07-29T01:29:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxrp563wYN92Y_3UGZ4AaABAg",
    "author": "@Jerzibredon",
    "author_channel_id": "UCX6ccDK6tQNdZWeXKSh28Cw",
    "text": "It’s nonsensical to vote for someone regardless of their positions and then claim you’re gonna pressure them. They have no incentive to care",
    "like_count": 10,
    "published_at": "2024-07-29T11:08:27Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwf7Cq8XNxCwHyZ9yl4AaABAg",
    "author": "@Elleh42",
    "author_channel_id": "UCJXIVOHnIdC1P5JVZNNo6jQ",
    "text": "As a leftist white woman who watches your show, I just want to apologize for the cringe. I'm sorry for any cringe that I may or may not contribute.",
    "like_count": 3,
    "published_at": "2024-07-28T19:41:12Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugwf7Cq8XNxCwHyZ9yl4AaABAg.A6S7f5vLVqmA6S9srvT0dw",
        "author": "@jimmypad5501",
        "text": "This comment is cringe",
        "like_count": 2,
        "published_at": "2024-07-28T20:00:33Z",
        "is_reply": true
      },
      {
        "id": "Ugwf7Cq8XNxCwHyZ9yl4AaABAg.A6S7f5vLVqmA6SAqq8Huee",
        "author": "@Elleh42",
        "text": "@jimmypad5501 yeah but I mean it sincerely",
        "like_count": 1,
        "published_at": "2024-07-28T20:09:01Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwH_XiF10noRbULeht4AaABAg",
    "author": "@Autistic_Goblin",
    "author_channel_id": "UCm24nWUFZQB8aXbUmzXDivg",
    "text": "I can't speak for all white women, but in my opinion, I think a lot of us wish we could participate in black culture because we're terrified of being boring and basic. There really isn't much of a \"white culture\" beyond mayo and bland pasta salad, so the idea of a culture with a rich and vibrant history makes us envious af. I know I can't invite myself to the bbq, but it looks like so much fun!",
    "like_count": 10,
    "published_at": "2024-07-28T20:13:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzndziRhgV9wwoaRdV4AaABAg",
    "author": "@Hotshot3334",
    "author_channel_id": "UC7Mm39MOKE3GU4DdOtfOYEQ",
    "text": "In my view, this is just about the best opportunity there is to elect a woman of color to the white house. \n• Trump is a known quantity and his administration was rejected last election despite voters not being enthusiastic with Biden. \n• Harris will likely be seen as a continuation of the incumbency, which is very powerful. While there are many issues with this adminstration, I don't think the average voter is looking for a dramatic shift in overall policy at this time. \n• Biden dropping from the race to support Harris is big news and makes for good press for the party, resulting in the enthusiasm we're seeing now.\n• Harris isn't that well known to the common electorate and that ambiguity means aspiration can be projected onto her more easily, unlike Clinton. \n\nI really think Harris has a *downhill* battle to win this election. I just hope she doesn't stumble, for all of our sakes. \nNot really looking forward to post election either.",
    "like_count": 0,
    "published_at": "2024-07-29T05:16:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx2phg7H7TXq5Oe7l94AaABAg",
    "author": "@tomhirschi1603",
    "author_channel_id": "UCYmxSahte2MifL_oy7fR_xw",
    "text": "Gotta change direction on Gaza to win, + some economic populism(UAW, Teamsters)",
    "like_count": 0,
    "published_at": "2024-07-29T01:19:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx1duMKn_djHUnAYOZ4AaABAg",
    "author": "@hustle_simmons",
    "author_channel_id": "UCWztI_cOQK8-o9WVTwBZ6GQ",
    "text": "I definitely think she can. The fact Trump's campaign committee's reaction has been negative is a sign that she poses a threat to him in a debate. One of the things I'm concerned with is black people talking about \"I'm not voting for her.\" Ok so then what's the alternative to that? The guy who said \"You'll never have to vote again.\" and his party that are calling her a DEI hire? Which we know DEI is basically code word for the n word.",
    "like_count": 0,
    "published_at": "2024-07-28T19:11:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgznyuljSKsXiYIgw_F4AaABAg",
    "author": "@literofcola",
    "author_channel_id": "UCvqVzLG7Utnkk3cLi6FCRKw",
    "text": "That part about Biden setting the bar so low. But don't forget the bar was set low by Hilary and Trump in 2016, followed by the Trump presidency. The bar hasn't been this low in generations, so we're seeing a lot of excitement for someone who wasn't on track prior.",
    "like_count": 3,
    "published_at": "2024-07-28T19:35:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwIlQJsPRrhZmQAZm94AaABAg",
    "author": "@MonkeyNewzz",
    "author_channel_id": "UCisKDiHk9wd6a1Eb2DSnehg",
    "text": "Olay is incredibly burdened by what has been.",
    "like_count": 3,
    "published_at": "2024-07-28T21:25:09Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwIlQJsPRrhZmQAZm94AaABAg.A6SJZXm96SyA6SPu3BJ3p1",
        "author": "@mikey-wl2jt",
        "text": "and reasonably so",
        "like_count": 6,
        "published_at": "2024-07-28T22:20:32Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyoJNve8rFhg1KFOhp4AaABAg",
    "author": "@pitpride1220",
    "author_channel_id": "UCS77Bz96XHgcL8WKxF_gYmw",
    "text": "The coconut meme was a racist right wing meme. It just backfired and white liberal women reversed it to be affirmative towards Kamala. It came from a right wing think tank. It was a video at a small meeting at the white house. It probably never would've surfaced on line otherwise.",
    "like_count": 2,
    "published_at": "2024-07-28T20:38:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyTHCo36W3DH8u64_14AaABAg",
    "author": "@Villainyjustified",
    "author_channel_id": "UCx3PwG1dWD0ScvPCE9sXvxQ",
    "text": "The liberal energy was thick in this one lol 😷",
    "like_count": 7,
    "published_at": "2024-07-28T18:28:15Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgyTHCo36W3DH8u64_14AaABAg.A6S-JmwVTeVA6S0t2zJufV",
        "author": "@mageIIan",
        "text": "Can you explain what you mean by liberal energy?",
        "like_count": 1,
        "published_at": "2024-07-28T18:41:56Z",
        "is_reply": true
      },
      {
        "id": "UgyTHCo36W3DH8u64_14AaABAg.A6S-JmwVTeVA6SSzfqRz9P",
        "author": "@eugenewilliams3788",
        "text": "​@mageIIan capitalism basically as locke puts it life liberty and the pursuit of property it was changed to happiness do to the fact capitalism can't provide property like that do to propaganda but tbh it's not like folks have a choice but we must understand that we have different material condition than the third world",
        "like_count": 0,
        "published_at": "2024-07-28T22:47:31Z",
        "is_reply": true
      },
      {
        "id": "UgyTHCo36W3DH8u64_14AaABAg.A6S-JmwVTeVA6sfeTT6vmY",
        "author": "@Villainyjustified",
        "text": "@mageIIan for one they are actually entertaining voting for a cop to keep the republican out of office, that’s some liberal logic.",
        "like_count": 0,
        "published_at": "2024-08-08T12:26:27Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgziXNBIib2o6Nn5yOV4AaABAg",
    "author": "@NoraMorgan",
    "author_channel_id": "UC5yylzYhHYXLqjtaiqkoudQ",
    "text": "Not sure it helps. I was NOT going to vote for Biden. I AM going to vote for Kamala. At the very least, I have hope she won’t be the butcher that Biden was. \nAs for the perception, her leaning into her being an actual woman and the whole brat thing truly resonates with me. I think the authenticity of that is so important. It’s a great way to fight back against it being used as a negative. And I’m older. Okay dang it, I’m 51. And Hillary just is completely unlikable and it’s obvious she knows jack about regular people. 🤷‍♀️\nI have hope.\nAnd honestly, in response to your statement about white women not supporting her, I’m glad she’s a black and Asian woman and not white. If she becomes our first female president, then she’s truly broken the ceiling. I’m sure you dislike being lumped in with all other black women, being assumed to be Republican because I’m white is pretty gross.",
    "like_count": 0,
    "published_at": "2024-07-29T01:58:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyRPwyZI3ovLOa-9fl4AaABAg",
    "author": "@chimezie7",
    "author_channel_id": "UCDyCJ8ofXF8KFY47h_N3xyA",
    "text": "I’m gonna be honest, ain’t no way WW are voting for Kamala bro lol. They have voted majority republican in EVERY election since 2000, they haven’t missed one 😅. I agree with Olay, there is just no way that happens, I just don’t see it at all lol.",
    "like_count": 3,
    "published_at": "2024-07-28T23:07:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyn53chFlpcNHu9gCp4AaABAg",
    "author": "@IndomitableAde",
    "author_channel_id": "UCVDaSDy_ewHNJCY1oLBAdiA",
    "text": "She might be able to win, but she won't do it with my vote. Out of NINETY-TWO counties in my red state, I don't live in one of the 3 that decide which candidate gets my state's 11 electoral votes. Plus, I don't want yet another President who will continue to turn a blind eye to the 👖O'side in Gaza, and VP Harris is that chick.",
    "like_count": 5,
    "published_at": "2024-07-29T12:48:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugze3IzIWFzI_eSAnGZ4AaABAg",
    "author": "@literofcola",
    "author_channel_id": "UCvqVzLG7Utnkk3cLi6FCRKw",
    "text": "Something i want Kamala, and us who advocate for abolition, to acknowledge is that 1) her history is bad, immoral, unconscionable, etc. 2) she wouldn't be in the running to be able to do good for people (nor would any other Black woman who didn't engage in nefarious acts) if she didn't. \nI could be wrong and am open to argument, but in the moment we're in, idgaf about her history. I care about what she says from now to October. \nBut i really do want her to acknowledge this too, because i think people hate knowing they're being lied to. We all know the situation, and saying \"I'm proud of the hard work i did, but didn't realize the extent it was hurting people,\" is nothing to be ashamed of. We want people to learn and improve. We also forget how strong propaganda is when people get into power. They're still in there beleiving in what America told them to. That, plus the money and power is hard to.overcome, which is why we have to keep organizing, protesting, and yeah, voting for enemies as weak as Kamala when the other choice is Trump. \nEasy for me to say, though, cause i get to vote my conscience because i live in a safe, blue state. 🤷🏾",
    "like_count": 1,
    "published_at": "2024-07-28T19:44:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw12Dem0LAT4HLaTih4AaABAg",
    "author": "@wakandavibranium5053",
    "author_channel_id": "UC52oGlOn30l89ngujHO7XsA",
    "text": "A lot of Kamala's shortcomings are being glossed over. Too wishy washy. And agree she must stop trying to be cool because it's extremely cringey. The choices are dire.",
    "like_count": 6,
    "published_at": "2024-07-29T08:29:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxYHQmUJjm9kQmZAhF4AaABAg",
    "author": "@lionmom7629",
    "author_channel_id": "UCt5waZfn7ABisiEgnEeQ-_A",
    "text": "So, coming from a white chick, I was listening over on #resistancelive about this \"electability\" BS.  I was looking for how to combat that nonsense.  Here's a good comeback to the \"is she electable?\" Question. \n\nShe's electable if we elect her. \n\nAnd we are going to elect her! At least, I know of 159,000 other white women besides me that are also fired up to elect her! \n\nHarris2024🇺🇸",
    "like_count": 2,
    "published_at": "2024-07-29T12:21:06Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxYHQmUJjm9kQmZAhF4AaABAg.A6Tv5cJlQccA6W5rUL11az",
        "author": "@sonjarogers2513",
        "text": "Thank you you 😊❤",
        "like_count": 0,
        "published_at": "2024-07-30T08:42:22Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyECHfgukIMdautZHd4AaABAg",
    "author": "@summteach",
    "author_channel_id": "UCuIBsFfGMHxk05nLzQZNtag",
    "text": "She won’t but hopefully she wins I won’t vote for her if she doesn’t pick a vp progressive",
    "like_count": 0,
    "published_at": "2024-07-28T20:14:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyXTSlY6VJuzbSMcXJ4AaABAg",
    "author": "@tylergriffin3667",
    "author_channel_id": "UCdw8B0l1_KF_K021yf38DEQ",
    "text": "Over the last 24-48 hours, I've begun to recognize that a lot of my resistance to participating in this election was rooted in the conviction that Biden was just doomed out the gate. Just thinking about the fact that I can realistically entertain the idea of Harris winning has made me much more optimistic. Not that I think she's any better than Joe, but she isn't Trump and Project 2025",
    "like_count": 1,
    "published_at": "2024-07-29T03:50:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgymTYCtZpRT8T1vty94AaABAg",
    "author": "@clflamez6861",
    "author_channel_id": "UCCE-CSHCmw2Sdp1OVP7XRIQ",
    "text": "I wish her luck but she’s no Obama. Her speeches are not inspiring, her need to be down and connect with the youth is cringe, and I’m not crazy about her lying so much in the 4 years of being VP. I’m sorry but we can’t just ignore these things. Obama had a swag and aura that couldn’t be created. It wasn’t because he was a man it was because he was real with the character he led with. I get people are being misogynistic and racist towards her which is disgusting. But I do feel there are people who have valid critiques towards her. Before Joe stepped down everybody was saying Michelle Obama should run. That woman hasn’t been near the White House in years. Why? Because she is a real woman that carrys herself well. No drama, no bad past, connects with the youth. She could’ve just been the wife of a president and sit in the shadow but she didn’t. She stood by Obama and was doing so much. I’m sorry but when Kamala became VP it was a run on joke that she just disappeared.",
    "like_count": 2,
    "published_at": "2024-07-28T19:00:09Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgymTYCtZpRT8T1vty94AaABAg.A6S2yPEYwOXA6S6Rs8-soW",
        "author": "@its_me_ke1282",
        "text": "@clflamez6861  I hear people saying that she hasn't done anything as VP & that she just disappeared. I genuinely want to know what the VP does. The VP can't sign executive orders, can't write laws, etc. The VP usually disappears behind the President. What is the expectation for VP?",
        "like_count": 8,
        "published_at": "2024-07-28T19:30:31Z",
        "is_reply": true
      },
      {
        "id": "UgymTYCtZpRT8T1vty94AaABAg.A6S2yPEYwOXA6S7X0xzyqX",
        "author": "@clflamez6861",
        "text": "@its_me_ke1282 I saw Mike pence more than I saw Kamala. That is a problem. Nobody’s asking her to sign laws. Be seen and you knew she was expecting Biden to step down after the 4 years when she became vp. When democrats started saying he was running again. I saw her less. That is a problem. I’m not crazy about Biden but even he was in the public eye more than her when he was VP. She doesn’t have the I’m Old excuse. Go to colleges, go to community meetings, go to women focused organizations even if it just in blue states. Show your face.",
        "like_count": 0,
        "published_at": "2024-07-28T19:39:58Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugy9zOuQSIvroFyPe9d4AaABAg",
    "author": "@armyofdiamondsmedia",
    "author_channel_id": "UCC7CK991MEClKpIW8IYS9hQ",
    "text": "NOPE. WE DONT WANT KAMALA.",
    "like_count": 1,
    "published_at": "2024-07-29T01:16:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxV8NjSAcEzHk0qPbJ4AaABAg",
    "author": "@1738straight",
    "author_channel_id": "UCOgTBmwan339_ajNDFmcxiw",
    "text": "Kamala will win, I am in complete shock, I had no idea ppl would rally behind her like this. I thought the giggling was weird then I was introduced to JD Vance. You’re not looking at the bigger picture. JD VANCE and his weird behavior +BLACK,+WOMAN, +ABORTION, and +exciting the young voters. She will win. Ppl are excited.Ive seen more positive reception, I’m not sure where all the negative reactions are. Besides the right news media everybody pretty hype. Y’all thinking to dam hard democrats begged for a replacement they gave them a replacement and they are hopping on board we don’t have time to think about who TF Kamala is they are tagging her in and saying GO. PPL are just happy for another candidate",
    "like_count": 6,
    "published_at": "2024-07-28T19:45:50Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxV8NjSAcEzHk0qPbJ4AaABAg.A6S8C-1x45CA6SJ3BCazjf",
        "author": "@majaherold1325",
        "text": "I do hope you're right although I'm not quite as optimistic as you are.\nBut you make an excellent point about JD Vance distracting people and making the entire republican side look kinda bad right now just by being such a major weird goober. I really hope he sticks around and continues to generate horrible press for the republicans. Even Trump is pissed at him, it's beautiful.",
        "like_count": 0,
        "published_at": "2024-07-28T21:20:45Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxM2mTEcj5b2kdpSQ54AaABAg",
    "author": "@thehighpriest333",
    "author_channel_id": "UChkx56VGSnvbipNYHWCHS-A",
    "text": "I would LOVE to see @AsToldByKenya on one of your panels!",
    "like_count": 3,
    "published_at": "2024-07-29T06:37:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwzJoljfnWe0lVfBK94AaABAg",
    "author": "@polyticks8453",
    "author_channel_id": "UCwqalJzYM7aPdCpJTGzXtyA",
    "text": "Likely not in racist america",
    "like_count": 0,
    "published_at": "2024-08-01T23:53:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  }
]