[
  {
    "id": "UgydasOfcl3lY6gjYtl4AaABAg",
    "author": "@ilyamuromets317",
    "author_channel_id": "UC02TFqF80icGOi20U1TUboA",
    "text": "'You haven't lived through it. When I was five I had the same toys every year'. 😢",
    "like_count": 95,
    "published_at": "2024-12-31T03:34:34Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgydasOfcl3lY6gjYtl4AaABAg.ACh52kHCxVOACioxsB0kTV",
        "author": "@mimosveta",
        "text": "when i was a kid in yugoslavia, we had the best toys.",
        "like_count": 11,
        "published_at": "2024-12-31T19:43:42Z",
        "is_reply": true
      },
      {
        "id": "UgydasOfcl3lY6gjYtl4AaABAg.ACh52kHCxVOAPX4w36i0VM",
        "author": "@Zaiydo",
        "text": "I could only dream of that being the extent of my problems.",
        "like_count": 0,
        "published_at": "2025-11-14T23:49:59Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugxz_4R3A5sDAi36xbV4AaABAg",
    "author": "@ilyamuromets317",
    "author_channel_id": "UC02TFqF80icGOi20U1TUboA",
    "text": "Why is it always the people born in the 80s, that were too young to even remember anything, that are the first to play the 'i lived it' card and tell you how terrible it was. While it's generally the older generations that have nostalgia for it...\n\nBloke's latest memory was from when he was FIVE years old. What insights can he possibly offer? 'Mars bars taste better than Alyonka'. Cheers. Thanks for that.",
    "like_count": 76,
    "published_at": "2024-12-31T03:50:36Z",
    "is_reply": false,
    "reply_count": 10,
    "replies": [
      {
        "id": "Ugxz_4R3A5sDAi36xbV4AaABAg.ACh6tG9nFWjACh9BtoAc0C",
        "author": "@antibaathism",
        "text": "Tether millennials who feel main character syndrome by buying into ethno nationalist larp",
        "like_count": 2,
        "published_at": "2024-12-31T04:10:46Z",
        "is_reply": true
      },
      {
        "id": "Ugxz_4R3A5sDAi36xbV4AaABAg.ACh6tG9nFWjAChCDgqXkQ_",
        "author": "@OlgaRykov",
        "text": "Alyonka is delicious, btw.",
        "like_count": 1,
        "published_at": "2024-12-31T04:37:13Z",
        "is_reply": true
      },
      {
        "id": "Ugxz_4R3A5sDAi36xbV4AaABAg.ACh6tG9nFWjAChZeUvXZUO",
        "author": "@krod6535",
        "text": "Even a person considered an adult these days having his room full of marvel merch and led lights, what insight does this have in the real society of the time?\nSuch fking lib nonsense annoys me so much these says😅",
        "like_count": 16,
        "published_at": "2024-12-31T08:02:00Z",
        "is_reply": true
      },
      {
        "id": "Ugxz_4R3A5sDAi36xbV4AaABAg.ACh6tG9nFWjACiHm-vQujA",
        "author": "@Raydaruckuz",
        "text": "😂😂 so true",
        "like_count": 2,
        "published_at": "2024-12-31T14:44:59Z",
        "is_reply": true
      },
      {
        "id": "Ugxz_4R3A5sDAi36xbV4AaABAg.ACh6tG9nFWjACiPrUaRa4n",
        "author": "@nminkovsky",
        "text": "I was 25 when Soviet Union broke down. I completely agree with you.  \nMy recollection - free and excellent healthcare and education.  Lots of free extracurricular activities and fun summer camps in beautiful nature locations. Also, tasty food! The bread lines they like to point to are actually Gorbachev's legacy.",
        "like_count": 13,
        "published_at": "2024-12-31T15:55:38Z",
        "is_reply": true
      },
      {
        "id": "Ugxz_4R3A5sDAi36xbV4AaABAg.ACh6tG9nFWjACiULf3NUH-",
        "author": "@numbersix8919",
        "text": "Well, I'll tell you.  His grandad was a councilman or police chief in some podunk town where the banderites shoved a bunch people into a barn and burned them alive.  His dad was under suspicion as a result and had to shovel shit for a living.  When our 3rd generation banderite asked mommy why daddy was drunk all  the time she said it was because of the terrible way the communists had ruined their lives.  In the West the fascists got all the best jobs, but in the East there are millions of malcontents like this boy.  What can you do?",
        "like_count": 0,
        "published_at": "2024-12-31T16:34:50Z",
        "is_reply": true
      },
      {
        "id": "Ugxz_4R3A5sDAi36xbV4AaABAg.ACh6tG9nFWjACip7rmCnai",
        "author": "@mimosveta",
        "text": "it's not. it's always people born nasty that always say that. normal people are all like \"man, why were we overthrowing communism again\"?",
        "like_count": 0,
        "published_at": "2024-12-31T19:45:11Z",
        "is_reply": true
      },
      {
        "id": "Ugxz_4R3A5sDAi36xbV4AaABAg.ACh6tG9nFWjACkJFwchchs",
        "author": "@kiberme",
        "text": "Always hated Mars bars. Snickers is better. And Alyonka is a great dark chocolate, way better than anything you can get by the same price in US, for example.",
        "like_count": 2,
        "published_at": "2025-01-01T09:36:25Z",
        "is_reply": true
      },
      {
        "id": "Ugxz_4R3A5sDAi36xbV4AaABAg.ACh6tG9nFWjACl2DwtLFTA",
        "author": "@DranguDghu",
        "text": "they do remember. The economic reforms of perestroika. they remember capitalism, scarcity, corruption and all other results of capitalism and they are taught this is communism. But lets think WHEN was the globe full of ex-soviet countries prostitutes? Was it in communism or capitalism? In capitalism they did have a choice. Starve (in reality) or turn to prostitution (a big percenantage of the ex-soviet countries people)",
        "like_count": 0,
        "published_at": "2025-01-01T16:26:50Z",
        "is_reply": true
      },
      {
        "id": "Ugxz_4R3A5sDAi36xbV4AaABAg.ACh6tG9nFWjAGQ9UztjWwC",
        "author": "@nekocekoBiHMK",
        "text": "Millennials aren't really known for their critical thinking skills. They're the reddit generation for a reason. \n\nBut it's definitely interesting how these 80's/90's kids are instantly validated for their \"lived experiences\", but when you point out that the vast majority of older generations (i.e. the ones that ACTUALLY lived it) have a fond memory of communism, the exact same people who buy that shit will just say \"they don't know what they're talking about, they're just nostalgic for their youth\"",
        "like_count": 0,
        "published_at": "2025-04-02T14:32:37Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzPSFjr1E6wF_ErZ1x4AaABAg",
    "author": "@tottifan6979",
    "author_channel_id": "UCKxIdGAIfwrq-vzQuOJJJ-g",
    "text": "It would be interesting to hear what he thinks about the banning of Russian language in Ukraine prior to the SMO.  He likes to talk about self-determination for Ukrainians as long is it is consistent with Banderite philosophy.",
    "like_count": 43,
    "published_at": "2024-12-31T03:14:09Z",
    "is_reply": false,
    "reply_count": 11,
    "replies": [
      {
        "id": "UgzPSFjr1E6wF_ErZ1x4AaABAg.ACh2iCYpNEIACinp3_G9B6",
        "author": "@mimosveta",
        "text": "self determination as long as its what lamericans tell us to do... like so many",
        "like_count": 3,
        "published_at": "2024-12-31T19:33:45Z",
        "is_reply": true
      },
      {
        "id": "UgzPSFjr1E6wF_ErZ1x4AaABAg.ACh2iCYpNEIACjBU7jFF-k",
        "author": "@beibotanov",
        "text": "There was no formal ban, their government made it the smart way, although I forgot how exactly. So the Ukrainian would just answer \"there is no ban\" and would be formally right",
        "like_count": 0,
        "published_at": "2024-12-31T23:09:13Z",
        "is_reply": true
      },
      {
        "id": "UgzPSFjr1E6wF_ErZ1x4AaABAg.ACh2iCYpNEIACjGF6hNkjU",
        "author": "@tottifan6979",
        "text": "@beibotanov  they legislated it. So yes it was formal.",
        "like_count": 4,
        "published_at": "2024-12-31T23:50:51Z",
        "is_reply": true
      },
      {
        "id": "UgzPSFjr1E6wF_ErZ1x4AaABAg.ACh2iCYpNEIACkuup-9NfC",
        "author": "@linusmayden8465",
        "text": "​@beibotanov I remember their Rada tried to ban it in 2014, they reversed the laws but it was too late, Crimea and Donbass wanted nothing to do with Ukrainian's post maiden government but don't pretend they weren't trying to \"derussfiy\" Donbass against their will.",
        "like_count": 2,
        "published_at": "2025-01-01T15:14:11Z",
        "is_reply": true
      },
      {
        "id": "UgzPSFjr1E6wF_ErZ1x4AaABAg.ACh2iCYpNEIACl2M7T87Bf",
        "author": "@DranguDghu",
        "text": "a self determination that Lenin (as a result of the communist ideology they seem to dislike so much) made possible",
        "like_count": 4,
        "published_at": "2025-01-01T16:27:57Z",
        "is_reply": true
      },
      {
        "id": "UgzPSFjr1E6wF_ErZ1x4AaABAg.ACh2iCYpNEIAClJ4aVku3-",
        "author": "@BringBackGulags",
        "text": "Self-determination for me, not for thee.",
        "like_count": 2,
        "published_at": "2025-01-01T18:54:07Z",
        "is_reply": true
      },
      {
        "id": "UgzPSFjr1E6wF_ErZ1x4AaABAg.ACh2iCYpNEIAD1oPIvVtyH",
        "author": "@Max91019",
        "text": "In Ukraine there are too strict restrictions on the Russian language when it comes to  education (which is a mistake) system but there is no ban on the Russian language as such. Why distort reality so much only in order to promote the theses of Russian ultranationalists? And why is it not taken into account that there are strict restrictions and social stigma against everything Ukrainian in Russia, Crimea and the territories occupied by Russia in Ukraine. In fact, many Russian speakers in Ukraine are fighting not for the right to use the Russian language but for the right for rincipled refusal to use Ukrainian, which from the point of view of millions of Russians and self-hating Ukrainians  is a backward and rural language that must disappear. Ukrainians are less numerous, more poor materially, historically stateless unlike Russians who own Large Empire with possessions and territories in 2 continents. But millions views Russians as innocent victims and Ukrainians as evil oppressors!\n\n People like you are obsessed to talk about \"banderites\". Right wing Ukrainian nationalism is not something good. As an Ukrainian myself I think that Ukraine need centre left anti-imperialist nationalism which would be not just against Russians hegemony but also against dependency from the West and against privilege of Ukrainian ruling class. But Russian far right nationalism which is rooted in political and cultural traditions of czarist Russia is much worse, had more blood on its hand historically (millions were killed due to Russian expansionism in XV-XIX century in order to install Russian supremacy) and it's THE MAIN obstacle to peaceful coexistence between Ukrainians and Russians!",
        "like_count": 0,
        "published_at": "2025-01-08T14:03:39Z",
        "is_reply": true
      },
      {
        "id": "UgzPSFjr1E6wF_ErZ1x4AaABAg.ACh2iCYpNEIAD1pA1s5CK2",
        "author": "@Max91019",
        "text": "Russian far right nationalism which is rooted in political and cultural traditions of czarist Russia is the main obstacle to peaceful coexistence between Ukrainians and Russians as equals. Russians wants to preserve their privileges while Ukrainians who are less numerous, historically stateless and poor materially. Stupid and too much anti-russian politics of Ukrainian ruling class is not justification for russian brutality. Nicholas II, Stolypin, Dugin, Putin and other far right russian ultranationalists and ukrainephobes are not better than Bandera. And Yes being pro-ukrainian doesn't mean to be pro-western. As an Ukrainian I view dependency from the West as lesser evil but STILL evil than dependency from Russia. We Ukrainians as historically stateless people in periphery of global capitalist system are marginalized in relation to both Russia and the West.",
        "like_count": 0,
        "published_at": "2025-01-08T14:10:18Z",
        "is_reply": true
      },
      {
        "id": "UgzPSFjr1E6wF_ErZ1x4AaABAg.ACh2iCYpNEIAD6AhvWTu5C",
        "author": "@fireg8892",
        "text": "I can freely speak Russian in Kyiv being exactly what I have been doing all my life, but I would really like to see how fast you are going to be arrested trying to start speaking Ukrainian in Moscow, that would be pretty fun to watch",
        "like_count": 0,
        "published_at": "2025-01-10T06:44:16Z",
        "is_reply": true
      },
      {
        "id": "UgzPSFjr1E6wF_ErZ1x4AaABAg.ACh2iCYpNEIAD6BH7Fn9bb",
        "author": "@fireg8892",
        "text": "​​@linusmayden8465I wonder what happened to all the 20% Ukrainian speaking people in Kuban and Don regions of Russia since 1920s census, they have probably switched to Russian in a completely humane and willing way, but for some reason Ukrainian radio stations and newspapers appear there again after soviet union collapsed and then magically disappeared as soon as Putin came in power... That is a bit suspicious but of course Ukrainians are the one's in the wrong trying to speak Ukrainian in Ukraine",
        "like_count": 0,
        "published_at": "2025-01-10T06:49:12Z",
        "is_reply": true
      },
      {
        "id": "UgzPSFjr1E6wF_ErZ1x4AaABAg.ACh2iCYpNEIAD6Bu-L_RA4",
        "author": "@fireg8892",
        "text": "​@beibotanovThere us no formal or informal ban, the only thing is that Ukrainian authorities and or companies working in Ukraine are required to provide their services in Ukrainian on the demand of a customer, it is that simple, and just imagine, lessons Ukrainian schools are required to be taught in Ukrainian, what a horrendous oppression of human rights indeed..",
        "like_count": 0,
        "published_at": "2025-01-10T06:54:39Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw9PgKZfd8z5UicGPN4AaABAg",
    "author": "@erayskirata6716",
    "author_channel_id": "UCaHisiIDmJyzJ-U_QxpmzZg",
    "text": "Is this guy mad that some second-hand toy store didn't update it's stock?",
    "like_count": 42,
    "published_at": "2024-12-31T05:07:03Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "Ugw9PgKZfd8z5UicGPN4AaABAg.AChFd6YNFfiAChghI_7H-z",
        "author": "@danielvalleduarte",
        "text": "He should see our half empty Rite Aids in Pasadena",
        "like_count": 7,
        "published_at": "2024-12-31T09:12:17Z",
        "is_reply": true
      },
      {
        "id": "Ugw9PgKZfd8z5UicGPN4AaABAg.AChFd6YNFfiACjFhAwKtM8",
        "author": "@erayskirata6716",
        "text": "@danielvalleduarte i feel for you, we haven't had empty stores in bakersfield since covid. That's probably largely due to no one being able to afford shit",
        "like_count": 3,
        "published_at": "2024-12-31T23:46:05Z",
        "is_reply": true
      },
      {
        "id": "Ugw9PgKZfd8z5UicGPN4AaABAg.AChFd6YNFfiACkbuYbm6rq",
        "author": "@danielvalleduarte",
        "text": "@erayskirata6716  plus you can't get away with theft in lower population densities in my experience on the west coast",
        "like_count": 2,
        "published_at": "2025-01-01T12:28:07Z",
        "is_reply": true
      },
      {
        "id": "Ugw9PgKZfd8z5UicGPN4AaABAg.AChFd6YNFfiAClI_U2iFh8",
        "author": "@BringBackGulags",
        "text": "Yes. This is exactly how children think, taking for granted all the necessities provided them. Their hatred is purely ideological and its directly tied to russophobia.",
        "like_count": 2,
        "published_at": "2025-01-01T18:49:43Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzASK8sFM7cWmGE5TV4AaABAg",
    "author": "@bumam6665",
    "author_channel_id": "UCZm3XAhrKbvD1BV8ZiJ3RTQ",
    "text": "It is a funny thing, this guy says how there was nothing in the shops during communism yet my father travelled to post communist ukraine in the 90s, the only thing you could by in the shop was vodka, bread and pickles. what a sortiment!",
    "like_count": 18,
    "published_at": "2024-12-31T11:52:24Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgzASK8sFM7cWmGE5TV4AaABAg.AChz149hCRUACiISrxZWYE",
        "author": "@beibotanov",
        "text": "Ukrainian government and parliament both stalled the market reforms, and it is arguable was it a good or a bad thing",
        "like_count": 0,
        "published_at": "2024-12-31T14:50:58Z",
        "is_reply": true
      },
      {
        "id": "UgzASK8sFM7cWmGE5TV4AaABAg.AChz149hCRUACnHRGDUTEZ",
        "author": "@numbersix8919",
        "text": "@beibotanov  The shock therapy was a bad thing.",
        "like_count": 1,
        "published_at": "2025-01-02T13:18:12Z",
        "is_reply": true
      },
      {
        "id": "UgzASK8sFM7cWmGE5TV4AaABAg.AChz149hCRUACnMp-VWFZ4",
        "author": "@beibotanov",
        "text": "@numbersix8919 yet there was no other way to sanitize the economies. Now post-Soviet economies are hyper specialized and poor, yet effective!",
        "like_count": 0,
        "published_at": "2025-01-02T14:05:17Z",
        "is_reply": true
      },
      {
        "id": "UgzASK8sFM7cWmGE5TV4AaABAg.AChz149hCRUACnOqocmFye",
        "author": "@numbersix8919",
        "text": "@beibotanov Ukraine the most corrupt country in Europe if not the world.  GFY",
        "like_count": 0,
        "published_at": "2025-01-02T14:23:00Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugxk1OrFjcj1-LTjTix4AaABAg",
    "author": "@numbersix8919",
    "author_channel_id": "UCSg0yRT9cP1grJH6LwRnZ9A",
    "text": "Hey guys, you should let the guy speak for as long as he wants to.  1) his Banderite education is utterly fascinating and 2) your responses will be that much more effective.\nIf his family suffered loss of status due to grandpa's fascist collaboration in WWII, he'd never be told the reason his dad could only work at  low-responsibility jobs.  There's millions like this entitled cryptofascist everywhere in former nazi _Europa_ -- I have spoken.",
    "like_count": 50,
    "published_at": "2024-12-31T04:26:05Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "Ugxk1OrFjcj1-LTjTix4AaABAg.AChAx7yj42OAD6AJ1MupMV",
        "author": "@fireg8892",
        "text": "If you actually read about Ukrainian Insurgency Army you can find out that they fought both the Nazi Germany and the Soviet Russia aiming to restore Ukraine's independence, if Soviet \"Union\" was the liberty paradise then why all the Ukrainian speaking communist authors and politicians were labeled as nationalists and shot, despite their efforts in achieving their communism not based on any of the Moscow dictates, ideas of Serhiy Mazalac as a communist, and Volodymir Vinnichenco as a Socialist were based on equality and for that reason first was shot and the second one was unable to come back to Ukraine due to repressions of the soviet dictatorship, if that's how you see a proper communism then you are no better then a national-\"socialist\"",
        "like_count": 0,
        "published_at": "2025-01-10T06:40:44Z",
        "is_reply": true
      },
      {
        "id": "Ugxk1OrFjcj1-LTjTix4AaABAg.AChAx7yj42OAD6arBMLTgY",
        "author": "@numbersix8919",
        "text": "@fireg8892  nobody wants to hear you except banderites",
        "like_count": 0,
        "published_at": "2025-01-10T10:41:28Z",
        "is_reply": true
      },
      {
        "id": "Ugxk1OrFjcj1-LTjTix4AaABAg.AChAx7yj42OADApQMFNiA1",
        "author": "@ilyamuromets317",
        "text": "@fireg8892 That's only if you read about it in pseudo-historical Ukrainian propaganda pamphlets. The only people the UPA actually fought against were Polish and Jewish women and children. And the only people that support the kind of historic revisionism that you're spewing, are Banderite Fascists and Nazis.",
        "like_count": 0,
        "published_at": "2025-01-12T02:05:42Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyGi_tmuUkUpVCGVPd4AaABAg",
    "author": "@Nunyabusiniss",
    "author_channel_id": "UCgTgb6GKCHe0PMo5cCVLbMg",
    "text": "Noah trying to treat the guy as a good faith actor. Carlos and Eddie like https://youtu.be/fsXUkyOfrNw?t=19 🤣",
    "like_count": 17,
    "published_at": "2024-12-31T02:49:39Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgyGi_tmuUkUpVCGVPd4AaABAg.ACh-upj0KCKACh0GWOlpUU",
        "author": "@MidwesternMarx",
        "text": "@Nunyabusiniss exactly",
        "like_count": 4,
        "published_at": "2024-12-31T02:52:45Z",
        "is_reply": true
      },
      {
        "id": "UgyGi_tmuUkUpVCGVPd4AaABAg.ACh-upj0KCKACh11XEZ_98",
        "author": "@antediluvianatheist5262",
        "text": "Appropriate handling.",
        "like_count": 3,
        "published_at": "2024-12-31T02:59:26Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzxBOuBPwyfXZZKJaR4AaABAg",
    "author": "@TheRisenPeopleEire",
    "author_channel_id": "UC1ySjbb6AyvLOT3tO1j-Bvg",
    "text": "\"same toys everyyears\" So horribles. Great show!",
    "like_count": 10,
    "published_at": "2024-12-31T16:30:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzhgCu7pwdhUwYWjiJ4AaABAg",
    "author": "@BringBackGulags",
    "author_channel_id": "UClnD_6ooFnm-eVZPsS2GM6g",
    "text": "Well, my parents lived through the Soviet Union and they would never ever wish it to have collapsed. My father straight up loved Communism and my mother's only complaint is that sometimes the jews were held back from high positions (take that fascists) and she would have liked more free speech. But no one would say the 90s or even the 21st century is better. My uncle lived through it, he'll tell you how much cheaper everything was. Even my Jewish grandfather, who was a factory director, was offered a job with living expenses paid in America, and he declined because he was a proud Soviet. His apartment didnt have hot water, and he never once complained even though his position would afford him the influence. Such proud and grateful people lived in the USSR. All my relatives who died during WW2 volunteered to defend their ungrateful great-grandchildren who grew up on trash tv from America, Macdonalds, and fables about Holodomor.",
    "like_count": 36,
    "published_at": "2025-01-01T19:05:00Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgzhgCu7pwdhUwYWjiJ4AaABAg.AClKKJmPnywACnI3Nnxh-G",
        "author": "@numbersix8919",
        "text": "@BringBackGulags Hear, hear!    🇷🇺  +  🇺🇦  + 🇧🇾",
        "like_count": 3,
        "published_at": "2025-01-02T13:23:41Z",
        "is_reply": true
      },
      {
        "id": "UgzhgCu7pwdhUwYWjiJ4AaABAg.AClKKJmPnywAEsCEYpnbxR",
        "author": "@anthonymckeown3903",
        "text": "Even the social democratic 'Welfare State' which was established in Britain after World War II, which I was born into in the late Fifties, was far better than the rampant neo-liberalism that prevails in the UK now, and is ruining what's left of the socialist heritage here in the post-Communist Czech Republic.",
        "like_count": 1,
        "published_at": "2025-02-23T04:11:46Z",
        "is_reply": true
      },
      {
        "id": "UgzhgCu7pwdhUwYWjiJ4AaABAg.AClKKJmPnywAEsC_YTDG80",
        "author": "@anthonymckeown3903",
        "text": "Each political system has its flaws, but with Capitalism the flaws are now actively engineered to immiserate and crush the people.",
        "like_count": 1,
        "published_at": "2025-02-23T04:14:47Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzhuDNebwUch_9-BbV4AaABAg",
    "author": "@linusmayden8465",
    "author_channel_id": "UC2ucB7Ty-NzM2hlbeu-QaeA",
    "text": "Guy could've literally ended up like Somalia, 30 years after the USSR dissolved, they didn't create the life \"that could've been,\" instead they created Oligarchs, destroyed their economy, destroyed their Soviet industries, allowed Banderites to become integrated into the military, tried to snuff out Donbass for not renouncing their Soviet legacy and Russian roots and look at them now, the poorest country in Europe.",
    "like_count": 8,
    "published_at": "2025-01-01T15:09:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzc_4SjqjoP7AfvLk94AaABAg",
    "author": "@ad5792",
    "author_channel_id": "UCA8VegQ3GD9RGDmJYXruYHA",
    "text": "I got a very serious illness when I was a child in SU. The amount and quality of health care I received then, saved my life! Same with my grandma when she had a stroke",
    "like_count": 2,
    "published_at": "2025-01-09T08:16:59Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzqt7sVy91MToVgMVx4AaABAg",
    "author": "@locuraromantica",
    "author_channel_id": "UCFm1loNxuphESaAA-XweyIw",
    "text": "There is a youtuber in Spain with a Channel called \"Mi YouTuber Marxista\", he has an interviuw with a women from Rusia that lived in the soviet union. She said that the health care system was good, but at the end of the soviet era was lacking specially in very advanced techniques to diagnose, that is why she moved to Spain. This guy lies. They don't realize that they no longer can use the \"here is a guy from that country that talks shit\" card because nowdays there is communications and access to more testimonies.",
    "like_count": 8,
    "published_at": "2024-12-31T20:48:40Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugzqt7sVy91MToVgMVx4AaABAg.ACiwOhFKWSEACjCgPcX-Kk",
        "author": "@beibotanov",
        "text": "Don't you believe? The whole Soviet block has completely missed the revolution of introducing MRT, CT (and densitometry), these kinds of machines arrived by import only at the very end. As well as multi-use syringes, because \"AIDS is a Capitalist decease\", an then the Union suddenly has AIDS too. And so on",
        "like_count": 0,
        "published_at": "2024-12-31T23:19:46Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwnpQ__uBwd1KcxjN94AaABAg",
    "author": "@SockPuppetski",
    "author_channel_id": "UCLiN0wItPaA0GWT2Iiczp6g",
    "text": "Ukie got COOKED",
    "like_count": 15,
    "published_at": "2024-12-31T04:38:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxEcD20ymEs-uIDXz14AaABAg",
    "author": "@real_comrade_jb",
    "author_channel_id": "UCKQ5GeP5C9DCpgGIDn2SXnw",
    "text": "I agree w MidWestern Marx BUT I would have liked the anti communist to get a few extra minutes. Its 3 on 1 dunk",
    "like_count": 7,
    "published_at": "2024-12-31T19:05:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzIArrCkq60UTADSaZ4AaABAg",
    "author": "@numbersix8919",
    "author_channel_id": "UCSg0yRT9cP1grJH6LwRnZ9A",
    "text": "Banderite-educated kid educated to not talk to foreigners about Bandera doesn't want to talk about Banderism.",
    "like_count": 42,
    "published_at": "2024-12-31T04:09:37Z",
    "is_reply": false,
    "reply_count": 10,
    "replies": [
      {
        "id": "UgzIArrCkq60UTADSaZ4AaABAg.ACh93XG87svACi00g4zgBw",
        "author": "@itsnony77",
        "text": "He pointed out the Benderite argument was totally anachronistic when talking about the declaration of the 1918 Ukrainian independence.  The caller sounded far more historically knowledgeable than this entire panel which was basically spewing an extreme revisionist and inaccurate account of events back then.  The 1918 independence was declared by Ukrainian socialists!  Not fascists like the panel wants you to believe.  These socialists weren't \"an abusive husband\".  They had a very socialist program and never invited the bolsheviks to intervene militarily.  I'd fact check everything these guys tell you when speaking about the history of Ukraine because I'm shocked by the level of ahistorical nonsense uttered in this upload.",
        "like_count": 2,
        "published_at": "2024-12-31T12:09:50Z",
        "is_reply": true
      },
      {
        "id": "UgzIArrCkq60UTADSaZ4AaABAg.ACh93XG87svACiI3ilCANc",
        "author": "@beibotanov",
        "text": "@itsnony77 I did not watch it yet, but there are kinds of socialist. Simon Petlyura was one. And jews had the greatest of times under his rule - well, at least he did not exterminate them like another politician calling himself a socialist",
        "like_count": 2,
        "published_at": "2024-12-31T14:47:32Z",
        "is_reply": true
      },
      {
        "id": "UgzIArrCkq60UTADSaZ4AaABAg.ACh93XG87svACiSy8UQeAz",
        "author": "@numbersix8919",
        "text": "@itsnony77 The Ukrainian nationalist movement started about the same time and with the same rationale as Zionism.  They weren't nearly as anti-Russian as they were anti-Polish.  As a matter of fact Poles are still Enemy #1 for banderites.",
        "like_count": 0,
        "published_at": "2024-12-31T16:22:45Z",
        "is_reply": true
      },
      {
        "id": "UgzIArrCkq60UTADSaZ4AaABAg.ACh93XG87svACjFEjMFK96",
        "author": "@Sh7s8w82",
        "text": "​​@itsnony77The Ukrainian nationalists didn't have the support of the Ukrainian people. The Ukrainian people supported the BOLSHEVIKS, which is we won and YOU lost in 1918. If you were to declare as one man your own house to be a sovereign breakaway state from your country and the country cracked down on you, they would not have invaded you because you had no legitimacy or right to declare independence. Such was the case for the unpopular Ukrainian nationalists.",
        "like_count": 0,
        "published_at": "2024-12-31T23:42:04Z",
        "is_reply": true
      },
      {
        "id": "UgzIArrCkq60UTADSaZ4AaABAg.ACh93XG87svACkJ1Xvo-l2",
        "author": "@kiberme",
        "text": "@itsnony77 \n>The 1918 independence was declared by Ukrainian socialists\n\nYeah, bro. If you call the dominant UPSF (Ukranian Party of Socialists Federalists) a 'socialist' government - then I guess you should call Moustache Man's party - a socialist government too. Also having fcking cannibal S. Petliura as military statesman doesn't help your cause of twisting history as well. \n\n>They had a very socialist program\n\nHow inviting German and Austria-Hungary forces into Ukraine to fight a literal first socialist government in history - is a 'very socialist program'? please explain, I'm curious.",
        "like_count": 0,
        "published_at": "2025-01-01T09:34:27Z",
        "is_reply": true
      },
      {
        "id": "UgzIArrCkq60UTADSaZ4AaABAg.ACh93XG87svACkJR2YTDt8",
        "author": "@kiberme",
        "text": "​@itsnony77 \n>The 1918 independence was declared by Ukrainian socialists\r\n\r\nYeah, bro. If you call the dominant UPSF (Ukranian Party of Socialists Federalists) a 'socialist' government - then I guess you should call Moustache Man's party - a socialist government too. Also having S. Petliura as military statesman doesn't help your cause of twisting history as well. \r\n\r\n>They had a very socialist program\r\n\r\nHow inviting German and Austria-Hungary forces into Ukraine to fight a literal first socialist government in history - is a 'very socialist program'? please explain, I'm curious.",
        "like_count": 0,
        "published_at": "2025-01-01T09:37:56Z",
        "is_reply": true
      },
      {
        "id": "UgzIArrCkq60UTADSaZ4AaABAg.ACh93XG87svACkvRpCI9Pg",
        "author": "@linusmayden8465",
        "text": "​@beibotanovJewish pogroms happened under his government.",
        "like_count": 0,
        "published_at": "2025-01-01T15:18:50Z",
        "is_reply": true
      },
      {
        "id": "UgzIArrCkq60UTADSaZ4AaABAg.ACh93XG87svACyvi9ZjtO3",
        "author": "@the_NZH",
        "text": "@itsnony77 Could you please point out what parts were revisionist, inaccurate and ahistorical? Details please.",
        "like_count": 0,
        "published_at": "2025-01-07T01:50:34Z",
        "is_reply": true
      },
      {
        "id": "UgzIArrCkq60UTADSaZ4AaABAg.ACh93XG87svAD6D7RkyKx-",
        "author": "@fireg8892",
        "text": "You won't believe but I think there was a difference between Germany's ​level of freedom that Ukrainian Hetmanate had and a hell on earth Ukraine recived soon after \"first socialist state\" decided that Ukrainians being the second biggest nationality in \"the Union\" can destroy Russia's dominance over it and first neutralised Ukrainian communist politicians and then creating a one of the biggest artificial famines in history to also repay their debts by exporting food",
        "like_count": 0,
        "published_at": "2025-01-10T07:05:22Z",
        "is_reply": true
      },
      {
        "id": "UgzIArrCkq60UTADSaZ4AaABAg.ACh93XG87svADAs7RADVMD",
        "author": "@ilyamuromets317",
        "text": "@the_NZH course he won't. He's a Banderite.",
        "like_count": 0,
        "published_at": "2025-01-12T02:29:19Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgypmfiG7dqi5ozmNLd4AaABAg",
    "author": "@waspwrap1235",
    "author_channel_id": "UCUHJ7XAeCvyfLL_U1upAeiQ",
    "text": "What’s weird is Americans are okay with their own revolution, but not other ones",
    "like_count": 14,
    "published_at": "2024-12-31T16:10:38Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxNfPdrD0fLwwj3XrN4AaABAg",
    "author": "@Gothicgamer-rz2rx",
    "author_channel_id": "UC4Aqr6HFSrsgDcwZZKhYMcA",
    "text": "Living in England we have so many Eastern Europeans here and I can see that this Ukrainian on here he's no different to any other Ukrainian I have met in my country brainwashed by their Media to think the Soviet Union and of course Russia is awful and Evil without the Soviet Union Eastern Europe would simply not exist so if you are from Eastern Europe you may very well thank the Soviet Union for thr existence of ur nation I do MMA including BJJ and there are so many Polish people doing it I don't normally talk to politics to them but I definitely no they would definitely hate Soviet Union great Fighters not very good brain's",
    "like_count": 24,
    "published_at": "2024-12-31T05:51:12Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgxNfPdrD0fLwwj3XrN4AaABAg.AChKgZ_8IPwACmzwDzGOY_",
        "author": "@yoboyfiness1828",
        "text": "Why would Ukrainians like the Soviet union that did the bead basket famine and the holdomor that killed 15 million combined",
        "like_count": 0,
        "published_at": "2025-01-02T10:36:33Z",
        "is_reply": true
      },
      {
        "id": "UgxNfPdrD0fLwwj3XrN4AaABAg.AChKgZ_8IPwADH9LcVQyRP",
        "author": "@shiningstarsshiningthoughts",
        "text": "bro...",
        "like_count": 1,
        "published_at": "2025-01-14T13:04:00Z",
        "is_reply": true
      },
      {
        "id": "UgxNfPdrD0fLwwj3XrN4AaABAg.AChKgZ_8IPwADHBcjsdciv",
        "author": "@Gothicgamer-rz2rx",
        "text": "Yh",
        "like_count": 0,
        "published_at": "2025-01-14T13:23:56Z",
        "is_reply": true
      },
      {
        "id": "UgxNfPdrD0fLwwj3XrN4AaABAg.AChKgZ_8IPwAGKkRejhQoq",
        "author": "@mudkipsarelife4885",
        "text": "bro will live anywhere but the country he meat riding",
        "like_count": 0,
        "published_at": "2025-03-31T12:08:46Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxaS4SNJgCvAgpjaad4AaABAg",
    "author": "@danielvalleduarte",
    "author_channel_id": "UCdd39Nehsul4HuNSB5lKQlA",
    "text": "\"Unless youre from there, you cant explain it\"....Ukrainian list the debate in 2 min",
    "like_count": 6,
    "published_at": "2024-12-31T09:11:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxEVcOaNNw3awtSd3B4AaABAg",
    "author": "@nikolay-e8l",
    "author_channel_id": "UCBwVGeS7RM1Y6hXjA_joT4g",
    "text": "pro Ukraine communist vs anti communist ukrainian",
    "like_count": 13,
    "published_at": "2024-12-31T06:04:19Z",
    "is_reply": false,
    "reply_count": 12,
    "replies": [
      {
        "id": "UgxEVcOaNNw3awtSd3B4AaABAg.AChMBdnLkqhAChxytcaNMW",
        "author": "@itsnony77",
        "text": "true.  but the misconception by this panel and many viewers is all European anti-communism is fascist or in Ukrainian context Banderite.  This is clearly a misconception as the 1918 Ukrainian People's Republic was founded by a socialist movement.  Many if not most of the socialist political parties in Europe have anti-communist sentiments.  The accusations made against him being Banderite were uncalled for.",
        "like_count": 5,
        "published_at": "2024-12-31T11:43:14Z",
        "is_reply": true
      },
      {
        "id": "UgxEVcOaNNw3awtSd3B4AaABAg.AChMBdnLkqhACi_mENfKZq",
        "author": "@Lawns-Are-Fun",
        "text": "@itsnony77I dunno if you listen to Slava’s discussion of growing up there — it seems like there’s been a huge revisionist campaign (probably funded by NATO) to reteach everyone how great Bandera and his thugs were and how bad the Soviet Union was.",
        "like_count": 3,
        "published_at": "2024-12-31T17:31:02Z",
        "is_reply": true
      },
      {
        "id": "UgxEVcOaNNw3awtSd3B4AaABAg.AChMBdnLkqhACiaVCV1jqj",
        "author": "@itsnony77",
        "text": "@Lawns-Are-Fun Oh certainly.  I do acknowledge that.  But the caller was talking about 1918 Ukraine, decades before Bandera was even born but got slandered with being brainwashed by Banderites.  That's like liberals calling everyone nazis.   It's not a Banderite revisionist history of Ukraine saying the first Ukrainian state was militarily overthrown by bolsheviks.  Those Ukrainians who opposed bolsheviks back then were socialist and pretty marxist in their own right.  They just didn't want a foreign rule.  Projecting Banderism onto that requires a lot of mental gymnastics and rewriting of history.",
        "like_count": 1,
        "published_at": "2024-12-31T17:37:18Z",
        "is_reply": true
      },
      {
        "id": "UgxEVcOaNNw3awtSd3B4AaABAg.AChMBdnLkqhACih9Sgwv4t",
        "author": "@itsnony77",
        "text": "@Lawns-Are-Fun While I do acknowledge what you said, it's just not right to slander every Ukrainian having an opposing towards communism as a Banderite or brainwashed by Banderites.  Whether the caller falls into those categories will remain a question since they didn't ask him directly.  But he said nothing ahistorical about the events in Ukraine in 1918.  What he said was not a revisionist Banderite historical account but mainstream accepted history.  He got slammed with the \"Banderite\" label while talking about a 1918 socialist independence movement crushed by bolsheviks.  The only thing that proved is the panel either did not understand what he was talking about or they themselves have a revisionist history of events in Ukraine in 1918.",
        "like_count": 1,
        "published_at": "2024-12-31T18:35:30Z",
        "is_reply": true
      },
      {
        "id": "UgxEVcOaNNw3awtSd3B4AaABAg.AChMBdnLkqhACikBBwKKs5",
        "author": "@ilyamuromets317",
        "text": "@itsnony77 That's not quite true. Ukrainian SSR was the Socialist Republic and it allied with, and fought alongside the Soviet forces. Petlyura's short-lived People's Republic (which existed only in Western Ukraine) was defeated by the Poles before 'joining forces' with them and effectively becoming a Polish proxy army. Then you had the Hetman's forces, allied with the White Army, and that's before we get to the Anarchists led by Makhno. All of these armies were chaotically fighting one another, as is well covered by Bulgakov in 'The White Guard'.  This was a very complicated civil conflict- one front on the much wider Russian civil war- and not an 'invasion', as it is misrepresented in Ukrainian history books today.",
        "like_count": 2,
        "published_at": "2024-12-31T19:01:58Z",
        "is_reply": true
      },
      {
        "id": "UgxEVcOaNNw3awtSd3B4AaABAg.AChMBdnLkqhACilh0po5nE",
        "author": "@itsnony77",
        "text": "@ilyamuromets317 Yes it was very complex and I wouldn't call it an invasion either.  Nor would I call it a civil war.  That's a soviet perspective.  However you want to call the events of 1918, fact is the independence movement was initiated by Ukrainian socialists only to end up as part of the Soviet Republic.  So I'm not quite sure what part of what I said you disagree with other than the caller labeling it an \"invasion\".  That doesn't justify slandering him as Banderite.  If that's Banderite revisionism most western historians on this topic should be deemed Banderites too.",
        "like_count": 1,
        "published_at": "2024-12-31T19:15:11Z",
        "is_reply": true
      },
      {
        "id": "UgxEVcOaNNw3awtSd3B4AaABAg.AChMBdnLkqhACjBZ9pMLQf",
        "author": "@lorsheckmolseh3345",
        "text": "@itsnony77, not that all the \"Ukrainian nationalists\" did collaborate with their buddy Hitler, the West wanted to get all the dark soil from the \"evil Communists\" or Bandera is the father of Ukrainian \"independence\".",
        "like_count": 0,
        "published_at": "2024-12-31T23:09:54Z",
        "is_reply": true
      },
      {
        "id": "UgxEVcOaNNw3awtSd3B4AaABAg.AChMBdnLkqhACkwqS4g0UE",
        "author": "@linusmayden8465",
        "text": "​@itsnony77There were 3 different Ukraines, Free Territory of Ukraine(Anarchist Ukraine), Soviet Ukraine,  West Ukrainian  People's Republic, within Ukraine's own civil war. I don't count the  Ukrainian People's Republic as legitimate because they were in exile and didn't live among the people they claim to represent besides lasting no more than two years but the Soviet Ukraine flourished under Odessa and other municipal governments.",
        "like_count": 2,
        "published_at": "2025-01-01T15:31:04Z",
        "is_reply": true
      },
      {
        "id": "UgxEVcOaNNw3awtSd3B4AaABAg.AChMBdnLkqhAClCjYiQQ1z",
        "author": "@nikolay-e8l",
        "text": "@itsnony77 never said he was a Banderite just said he was anti communist. I don’t think he supports Bandera but he’s clearly anti communist",
        "like_count": 1,
        "published_at": "2025-01-01T17:58:40Z",
        "is_reply": true
      },
      {
        "id": "UgxEVcOaNNw3awtSd3B4AaABAg.AChMBdnLkqhAClEBxccMSQ",
        "author": "@nikolay-e8l",
        "text": "@itsnony77 the Bolsheviks did invade Ukraine but again its way more complicated that what history will portray it as. The Bolsheviks were fighting against the white army and many white army elements were within the former Russian territories like the Baltics, Belarus, Ukraine, the Caucasus, and in Central Asia and wider Siberia. The Bolsheviks were focused on there internal struggles which means its former territories which they had feared would become buffer states by Poland and Germany. And after the Soviet Polish war the Polish invaded and occupied parts of modern day Ukraine and Belarus. And Ukraine was split into different factions. You the the communist republics in the east. Then you had the Ukrainian peoples republics, and then west Ukrainian peoples republics which was mostly under Polish rule to counter balance the communist forces. Many of the Ukrainian western republics. To understand the essence of the processes taking place in Ukraine, it is necessary to clearly understand how, under what influence and from what ethnic groups Ukrainian society was formed. Today, official Ukrainian propaganda claims that Ukraine is a unitary state in which only Ukrainians live, with a small interspersing of other ethnic groups united in a monolithic Ukrainian nation. All this is a fiction, no Ukrainian nation exists, Ukraine is a patchwork, woven in different historical eras from different nations that were part of different civilizations. Galicia after the collapse of Kievan Rus more than 700 years before its accession by Stalin in the 1939 year was at the margins of Western civilization as an oppressed people and has long lost its Russian roots. The center of Ukraine for a long time was under Polish rule, acquired the specific features of a mixture of Russian and Polish culture with its originality, and in the 17th century it became part of the Russian Empire. Southeast - the original Russian land, the Wild Field, mastered by the administration of the Russian Empire in the XVIII century under the leadership of Prince Potemkin.\n\nThe Bolsheviks united all these territories into the Ukrainian Republic, which, with the collapse of the Union, became an independent state. So in one state on occasion there were different peoples with different historical destinies, with different mentality and national values ​​and diametrically opposite ideas about their future. At the same time, it should be noted that in these three megaregions, population groups that are fundamentally different in their social composition have developed. One the of main factions that belonged to the Ukranain nationalist movement was the OUN. more extreme Ukrainian nationalist in Russian-controlled Ukraine, Mykola Mikhnovs’kyi, who would preach a worldview that saw a Ukrainian race surrounded by enemies that needed to be eliminated. He inserted 19th century Social Darwinism and scientific racism into Ukrainian nationalism, writing in the majority Russian city of Kharkov. He labelled “Russians, Poles, Magyars, Romanians and Jews as enemies of Ukraine” (as long as they ruled or exploited Ukrainians) and hoped to create a Ukrainian state stretching from the Caucuses to the Carpathian Mountains. His Ten Commandments of the UNP (Ukrainian National Party) founded in 1904 would be a major influence on the OUN. It included such memorable lines as “Do not marry a foreign woman because your children will become your enemies.” Elsewhere Mikhnovs’kyi wrote “Ukraine for Ukrainians, and as long as even one alien enemy remains on our territory, we are not allowed to lay down our arms.”",
        "like_count": 0,
        "published_at": "2025-01-01T18:11:25Z",
        "is_reply": true
      },
      {
        "id": "UgxEVcOaNNw3awtSd3B4AaABAg.AChMBdnLkqhAClGAlxCf7L",
        "author": "@nikolay-e8l",
        "text": "@itsnony77 However Ukraine became a battleground between the Red Army, the Germans, the Polish, and the white Russian counter-revolutionary forces. Also fighting were the West Ukrainian army, Petlura’s forces, the forces of the Ukrainian Anarchist Makhno, and various bandit warlords and Cossacks. Kiev would change hands more then a dozen times. Initially the Ukrainian People’s Republic rejected the Soviet ultimatum to allow the Red Army to pass through to attack the white forces. However war was avoided for a couple months. Soon the Red Army was occupying Kiev as the Rada lacked popular support. People wanted land reform not Ukrainization, something viewed as annoyance by many Russian speakers. The Rada forces had deserted to the Red Army. However the Soviets would control Kiev for only three weeks. The Rada turned to the Germany and Austria who recognized the UNR. The Germans invaded Ukraine forcing the Red army to withdraw. Symon Petliura’s forces took power. In April 1918, the Germans disbanded the Rada and installed a puppet Government under Hetman Skorpadsky. Germany was under an economic blockade with its people facing starvation. The Germans proceeded to loot Ukraine’s grain, angering the peasants. In November 1918 the German military collapsed and they abandoned Ukraine. Skorpadsky retreated with them. Petliura and the new Rada government called “The Directorate” seized power in Kiev yet again before being forced out by the Red Army. As Petliura’s forces retreated they carried out massive pogroms against the Jews. Petliura’s forces often dressed up as communist forces to carry out these Pogroms murdering the communist sympathizers who came to greet them first, and then spending days robbing, raping, and murdering the rest of the Jews. With Germany out of the war, Britain and France were free to back the even more bloodthirsty white General Denikin in his attempt to destroy the Soviet Union. Ironically Denikin was a Russian nationalist who viewed Ukraine as inseparable from Russia. Denikin’s forces carried out equally horrific pogroms. Petliura allied with Denikin and then with Poland.",
        "like_count": 2,
        "published_at": "2025-01-01T18:28:44Z",
        "is_reply": true
      },
      {
        "id": "UgxEVcOaNNw3awtSd3B4AaABAg.AChMBdnLkqhADFVWVc_XzA",
        "author": "@ilyamuromets317",
        "text": "@nikolay-e8l This! Thank you for your brilliant summary of what was without any shadow of a doubt a very complicated 'civil war'.  Hopefully that's finally put these Banderite revisionists to bed now.",
        "like_count": 0,
        "published_at": "2025-01-13T21:39:14Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxfN6cwRC2QVSPWibx4AaABAg",
    "author": "@waspwrap1235",
    "author_channel_id": "UCUHJ7XAeCvyfLL_U1upAeiQ",
    "text": "All these people and I would know because I have family members from the USSR always say the weirdest things about the USSR. It’s not even any direct criticism about how the state worked, usually the first thing they say, revolves around something meaningless like alcohol variety",
    "like_count": 5,
    "published_at": "2024-12-31T16:08:29Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxfN6cwRC2QVSPWibx4AaABAg.ACiRK_YxgRGAFfzLUh65e7",
        "author": "@OlgaRykov",
        "text": "Yes, brainwashed perestroikians.",
        "like_count": 0,
        "published_at": "2025-03-15T06:50:54Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxTQfjpDP-o0qLVtTl4AaABAg",
    "author": "@RexTheGoldendoodle",
    "author_channel_id": "UCTvk3tfYOBxtK7KRM81fPCw",
    "text": "Samantha Lomb PhD covered in her book about the 1936 constitution and collectivization.  Only 22% of collective farms in Kirov near Novgorod DID NOT have cows in personal property in the 1930s.  Collectivization differed wildly per region and the collective farmers instituted their own justice.",
    "like_count": 3,
    "published_at": "2024-12-31T16:24:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxeRKK9wmzaMaYXv454AaABAg",
    "author": "@ad5792",
    "author_channel_id": "UCA8VegQ3GD9RGDmJYXruYHA",
    "text": "Soviet Union was dissolved in spite of the people's wishes, according to 1991 referendum! Baltic states and Georgia aside, since they didnt take part in the referendum.",
    "like_count": 3,
    "published_at": "2025-01-09T08:27:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwPxXsGiZ27hZg4AOF4AaABAg",
    "author": "@RexTheGoldendoodle",
    "author_channel_id": "UCTvk3tfYOBxtK7KRM81fPCw",
    "text": "My fencing coach's mother in law had a brother who worked on Tito's personal island.  I heard he was really personable.",
    "like_count": 2,
    "published_at": "2024-12-31T16:18:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzTEB2BNlpXRXbkufh4AaABAg",
    "author": "@real_comrade_jb",
    "author_channel_id": "UCKQ5GeP5C9DCpgGIDn2SXnw",
    "text": "Guys slow down. We get it. The communists won this debate but this dunk is hard to watch. Lots of interrupting when he is responding. Noah even recognized the dunk then continued to.dunk, instead of letting the anti communist dig himself his own grave",
    "like_count": 5,
    "published_at": "2024-12-31T19:11:40Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzTEB2BNlpXRXbkufh4AaABAg.ACilIJ6GNFoAFfzSvOlMBD",
        "author": "@OlgaRykov",
        "text": "I've been hearing these perestroikians all my life, thank you very much. I think it's time to let the educated speak for once. Please and thank you.",
        "like_count": 0,
        "published_at": "2025-03-15T06:51:55Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw0S7lwW79_NBd34yR4AaABAg",
    "author": "@mimosveta",
    "author_channel_id": "UCXrwF1REHzbcY5elwQKx-tw",
    "text": "will you guys be uploading latest brigid show, or should I just watch it on twitter? I'd rather watch it here, better controls ><",
    "like_count": 1,
    "published_at": "2024-12-31T19:32:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyeUWDHT4daRIyyibV4AaABAg",
    "author": "@zalmoxis5148",
    "author_channel_id": "UCNnAHmAx7tuzPBZnlLT-2Zw",
    "text": "A) \"evil commies did not gimme toys\"- while on the 90% of ALL other countries things were better. For example Ugandan kids had a lot of toys in 1985 (or now), or Haitian kids, or alla kids except Europe and America (and not all in these two regions) B). 1985's USSR was devastated by CAPITALIST econoic reforms, not socialist. For socialist economy he should ask his grandpa to see how  a backwards country (russia) turned into number one military power and number two economic power without any colonies.MAGIC!??!!!. C)If commies so bad, why the russian people did NOT want the dissolution of the USSR (1991 referendum with more than 77% voting for the preservation of the USSR?) and D). why after 5 years of blessed capitalism, the number one party was the Communist under Zyuganov, and it was so surely that he will win, that the oligarchs had to meet in Davos to make an agreement on funding anticommunist publications, movies, academics, writers and bribe media etc, so that Zyuganov does not become the new president of Russia?? you can find that source in anticommunist wikipedia in 1996 russian elections if you do not believe :)",
    "like_count": 8,
    "published_at": "2024-12-31T11:13:07Z",
    "is_reply": false,
    "reply_count": 11,
    "replies": [
      {
        "id": "UgyeUWDHT4daRIyyibV4AaABAg.AChuXH50KRcACiJ00Fveq4",
        "author": "@beibotanov",
        "text": "USSR peoples voted for the \"renewed Union\", the very case of vouching for all good against all bad. Yet there was no uprising, nobody really tried to protect the old way of life. KPRF was a disaster, the only thing I remember of them accomplishing while having the majority - denouncing the Belovezha Accords. I.E. they accomplished NOTHING",
        "like_count": 0,
        "published_at": "2024-12-31T14:55:46Z",
        "is_reply": true
      },
      {
        "id": "UgyeUWDHT4daRIyyibV4AaABAg.AChuXH50KRcACiOMl59ojT",
        "author": "@DranguDghu",
        "text": "@beibotanov the bad being the economic changes that came with perestroika and supposedly glasnost. You know why? Cause capitalist economic policies starting from 1956 and kruschevite revisionism caused them. There is a tragic western documentary just before the collapse. There are two sides represented. Those that say \"i am not a communist\" and he actually described communism as what he wanted,but because of the gorbachevite alteration he didnt like it, and the second was people actually saying \"i like communism\" and they continued by saying that they trust Gorbi and his policies, and that with perestroika and glasnost the problem caused would be solved. Both groups represented in the documentary were politically uneducated, but the confusion that perestroika and \"glasnost\" caused by the C. P. was visible.",
        "like_count": 1,
        "published_at": "2024-12-31T15:42:34Z",
        "is_reply": true
      },
      {
        "id": "UgyeUWDHT4daRIyyibV4AaABAg.AChuXH50KRcACjB4EVES6H",
        "author": "@beibotanov",
        "text": "@DranguDghu a common Stalinist mythology. The truth is real socialism was quite uncomfortable to live in. You have 8 hour work day just to waste an hour or two a day to queuing to \"get\" something \"thrown out\" in the shops. Having the feeling of unfairness, when seeing or hearing about people able to skip through the queues, to steal the \"deficit\" and sell it with market price, the luxury these kinds of people, like vegetable depot's bosses, supposedly live in. My friend's mum, being a child in the early 80's, had to wake up 4-5 a.m. to go through the milk line before her school. And there were many other aspects, such as crass service sector workers. I always project these stories upon myself, and would not really liked to live this way. The only thing I can mention that is much worse now is in housing, thanks to our wise Gov't overheating the estate market",
        "like_count": 0,
        "published_at": "2024-12-31T23:05:41Z",
        "is_reply": true
      },
      {
        "id": "UgyeUWDHT4daRIyyibV4AaABAg.AChuXH50KRcACjDa2x9SbB",
        "author": "@lorsheckmolseh3345",
        "text": "@beibotanov \nThe March 1991 referendum was about Keeping the Union not Updating the Union and had 78% Yes as result.",
        "like_count": 1,
        "published_at": "2024-12-31T23:27:38Z",
        "is_reply": true
      },
      {
        "id": "UgyeUWDHT4daRIyyibV4AaABAg.AChuXH50KRcACjFEhk_m0B",
        "author": "@beibotanov",
        "text": "@lorsheckmolseh3345 \"Do you consider it necessary to preserve the Union of Soviet Socialist Republics as a renewed federation of equal sovereign republics, in which the rights and freedoms of people of any nationality will be fully guaranteed?” - pay attention to \"renewed\" and \"sovereign\". \n\nBasically, the question was: \"Do want everything good without everything bad?\"",
        "like_count": 0,
        "published_at": "2024-12-31T23:42:04Z",
        "is_reply": true
      },
      {
        "id": "UgyeUWDHT4daRIyyibV4AaABAg.AChuXH50KRcACjFlLW0dj1",
        "author": "@beibotanov",
        "text": "@lorsheckmolseh3345 \"Do you consider it necessary to preserve the Union of Soviet Socialist Republics as a renewed federation of equal sovereign republics, in which the rights and freedoms of people of any nationality will be fully guaranteed?”\n\n>renewed\n>sovereign",
        "like_count": 0,
        "published_at": "2024-12-31T23:46:39Z",
        "is_reply": true
      },
      {
        "id": "UgyeUWDHT4daRIyyibV4AaABAg.AChuXH50KRcACjyU40GMnb",
        "author": "@DranguDghu",
        "text": "@beibotanov This is a classic common western cold war plain lie. Scarcity in the USSR on goods existed in time of WW1, civil war (14 foreign countries invaded young RSFSR plus the Whites, and at some points Greens and Blacks), WW2 and finally the perestroika. You can add to that the facts of the various economic sanctions on the USSR,military funding for the preservation of the country caused again by foreign enemies, millions of work force and infrastructure lost in these wars etc As for the lines, do not forget US had lines too, and still has, with a major difference: in the end of the line in the US people have (and had) to pay a lot. Also, i really wonder how most of the countries on earth (except the US, Europe and 2-3 more countries) are poor. Uganda, Zimbabwe, Malaisia, Haiti and almost all arabic, african, south african, east countries are POOR? Why capitalism does not work for them>? if capitalism works like that, well, we dont like it. Also being from Greece, a country that has many immigrants from ex-USSR, believe me, i ve spoken with many of them, not only \"one friends mum\".",
        "like_count": 1,
        "published_at": "2025-01-01T06:26:07Z",
        "is_reply": true
      },
      {
        "id": "UgyeUWDHT4daRIyyibV4AaABAg.AChuXH50KRcACjzxKYEAS0",
        "author": "@DranguDghu",
        "text": "@beibotanov as for the referendum, renewed and sovereign was about capitalist reforms that took place. For example you can see that in the first years of USSR, rights and freedoms of all nationalities were guaranteed, that is why USSR publishes books on over 150 native languages for example. Also as exactly happened in the recent Greek referendum, ALL people i know were in a fake dilemma of no and yes about taking money from IMF and voted no, but if you read carefully, while everyone voted for No Imf funding, they turned it in\" Not on this particular imf funding \" And imposed another, worse. In this logic, most people of the USSR voted for the part of the preservation of the USSR and not for the sovereignty etc in the way you think, but in the way they had it in the years before capitalist corrosion of the economy, just as greeks voted for a general NO and not a no to this particular only IMF funding",
        "like_count": 0,
        "published_at": "2025-01-01T06:38:59Z",
        "is_reply": true
      },
      {
        "id": "UgyeUWDHT4daRIyyibV4AaABAg.AChuXH50KRcACkz6rW7cVN",
        "author": "@beibotanov",
        "text": "@DranguDghu capitalism works good enough in RF. Even despite sanctions. If not for estate market overheated by the government",
        "like_count": 0,
        "published_at": "2025-01-01T15:50:55Z",
        "is_reply": true
      },
      {
        "id": "UgyeUWDHT4daRIyyibV4AaABAg.AChuXH50KRcACkzTj2GGJV",
        "author": "@beibotanov",
        "text": "@DranguDghu renewed and sovereign meant \"all good no bad\", nothing more. And then most Republics either voted for independence, or had it declared without a public vote. When everyday life is depressing, boring and plain uncomfortable - nobody would protect it with their lives  - and nobody did",
        "like_count": 0,
        "published_at": "2025-01-01T15:54:03Z",
        "is_reply": true
      },
      {
        "id": "UgyeUWDHT4daRIyyibV4AaABAg.AChuXH50KRcACl1cRu1yxT",
        "author": "@DranguDghu",
        "text": "@beibotanov Who said capitalism does NOT work? Of course it works. Anyone saying capitalism does NOT work is delusional. Capitalism works perfect, as it is really meant to. Few have  A LOT, and the rest have few. It works but in whose favor? Whole countries suffer. Whole percentages of \"rich\" capitalist countries suffer. This is the problem socialism tries to solve, As capitalism DID solve SOME of the feudal problems before.",
        "like_count": 0,
        "published_at": "2025-01-01T16:21:35Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwaYS0i-9KunLXwLIB4AaABAg",
    "author": "@dongusfinkleburn4172",
    "author_channel_id": "UCZgb8ZMwGNrX7Sgr3CfsIqQ",
    "text": "This guy is complaining about having the same toys? Cool story bro I’m sure the people who have lost families due to rejected medical insurance claims will play you a song on the worlds smallest violin",
    "like_count": 2,
    "published_at": "2025-01-12T16:10:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxfBCCrEUGQ2fTfkSB4AaABAg",
    "author": "@Valentinhxc",
    "author_channel_id": "UC-vh7XSGHM-Ht8H_eHg7Beg",
    "text": "Lived during Gorbachevs reforms and complained about toys, not even old enough to understand what \"economy\" is, is not a good argument. Instead he should have looked at why everything was bad and where it went wrong. You can thank Gorbachev, McDonald's, and PizzaHut for that",
    "like_count": 1,
    "published_at": "2025-02-25T19:40:45Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxfBCCrEUGQ2fTfkSB4AaABAg.AEz08MluKViAFg-6Im8p01",
        "author": "@OlgaRykov",
        "text": "Nice one 👏🏻",
        "like_count": 1,
        "published_at": "2025-03-15T06:57:34Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugxx-4dpmP7eeVFTgfN4AaABAg",
    "author": "@OlgaRykov",
    "author_channel_id": "UCzwvyzPTzgmqbJCzYUNXR1g",
    "text": "10:02 \"you have this, you know, utopian...\" says the maloross. Well, Eddie gave you facts as argumentation, and other than repeating the label that your masters taught you to parrot, do you have anything else to say to that, maloross?",
    "like_count": 3,
    "published_at": "2024-12-31T08:30:59Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwxckesaVWF7NVZlD54AaABAg",
    "author": "@nikolabolesnik",
    "author_channel_id": "UCThVobypXhKzyuAENXn8XnA",
    "text": "I wonder how often they update the toy stores in hyper exploited countries that make the privelidged life of anticommunists viable",
    "like_count": 1,
    "published_at": "2025-01-04T11:39:04Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyvxjLHfCRhcIO8uOt4AaABAg",
    "author": "@advoyZ",
    "author_channel_id": "UC0G1D2_SubPmEPDt0uU2cbg",
    "text": "Why does bro sound like he's talking through gnashed teeth filled with so much hated haha",
    "like_count": 3,
    "published_at": "2024-12-31T15:45:13Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgyvxjLHfCRhcIO8uOt4AaABAg.ACiOfC72sfeAFg-3geGJv1",
        "author": "@OlgaRykov",
        "text": "Accurately noted",
        "like_count": 1,
        "published_at": "2025-03-15T06:57:12Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzeU5ub-u4Z0RjIeSt4AaABAg",
    "author": "@grahamjones5400",
    "author_channel_id": "UCiBCwlAfHTwsj6qy5UTnqyg",
    "text": "My family has lived in the US since the 1700s, me my parents and siblings AREN'T flag waving nationalists, capitalism and Imperialism dont/wont end well for most people.",
    "like_count": 4,
    "published_at": "2024-12-31T20:07:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyEFgujQZeY1AtNeBJ4AaABAg",
    "author": "@ad5792",
    "author_channel_id": "UCA8VegQ3GD9RGDmJYXruYHA",
    "text": "When Gorbachev came to power in mid 80s, it all went to shits. Ordinary people including me were absolutely taken by surprise with \"perestroika\" crap. All of a sudden we started experience shortages, where we never had them. People were getting nervous and on the edge. So, when Yeltsin appeared, everybody was ready for somebody else but Gorbachev. And Yeltsin turned out to be even bigger traitor than the one before him.",
    "like_count": 1,
    "published_at": "2025-01-09T07:56:20Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyVHD2hefGWtD0_Yht4AaABAg",
    "author": "@anthonymckeown3903",
    "author_channel_id": "UC0riMcdp-3msAfrLwclt3iQ",
    "text": "Nice work dealing with that poor propaganda-addled Ukrainian. I've met a few of them here in the Czech Republic.",
    "like_count": 1,
    "published_at": "2025-02-23T04:06:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwStoDIJ7kXSyR_KEd4AaABAg",
    "author": "@nminkovsky",
    "author_channel_id": "UCPtql4jhcVv2oeFw3GNdEkQ",
    "text": "On the one hand, a lack of toy diversity in a store.  On the other hand, free universal healthcare,  free college, almost free housing, and guaranteed jobs. What would you rather choose?\nAlso, this trope about people not working hard because of collective ownership is just western capitalist propaganda.  I was 25 (not 5 like this guy) when the USSR broke down. Everyone around me was working hard and took pride in their work. I bet, if you ask this guy's parents,  if they didn't do their best at work,  because they didn't personally own the company,  they would be offended.",
    "like_count": 8,
    "published_at": "2024-12-31T15:45:09Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgwStoDIJ7kXSyR_KEd4AaABAg.ACiOenBJsWSACjE5f8v-fD",
        "author": "@beibotanov",
        "text": "The truth is real socialism was quite uncomfortable to live in. You have 8 hour work day just to waste an hour or two a day on queuing to \"get\" something \"thrown out\" in the shops. Having the feeling of unfairness, when seeing or hearing about people able to skip through the queues, to steal the \"deficit\" and sell it with market price, the luxury these kinds of people, like vegetable depot's bosses, supposedly live in. My friend's mum, being a child in the early 80's, had to wake up 4-5 a.m. to go through the milk line before her school. And there were many other aspects, such as crass service sector workers. I always project these stories upon myself, and would not really liked to live this way. The only thing I can mention that is much worse now is in housing, thanks to our wise Gov't overheating the estate market. I know nobody of young age during the collapse, who would not support SU's dissolution and reforms by action or inaction",
        "like_count": 0,
        "published_at": "2024-12-31T23:32:05Z",
        "is_reply": true
      },
      {
        "id": "UgwStoDIJ7kXSyR_KEd4AaABAg.ACiOenBJsWSACjXa-V_LeZ",
        "author": "@nminkovsky",
        "text": "@beibotanov  your \"truth to be told\" is just a bunch of tropes. Life was comfortable in the USSR in 70-s and 80-s. I was there.",
        "like_count": 5,
        "published_at": "2025-01-01T02:22:23Z",
        "is_reply": true
      },
      {
        "id": "UgwStoDIJ7kXSyR_KEd4AaABAg.ACiOenBJsWSACn-EyL-Lup",
        "author": "@yoboyfiness1828",
        "text": "It’s funny how communist forget the holdomore",
        "like_count": 0,
        "published_at": "2025-01-02T10:39:15Z",
        "is_reply": true
      },
      {
        "id": "UgwStoDIJ7kXSyR_KEd4AaABAg.ACiOenBJsWSAFYXt6LwfBw",
        "author": "@milton-d5r",
        "text": "Where did you live? Rural or urban? Life in the USSR depended on where you lived and your family, really.",
        "like_count": 0,
        "published_at": "2025-03-12T00:08:17Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzXQQttONRFiCD4OAx4AaABAg",
    "author": "@Robert-ls3op",
    "author_channel_id": "UC3Fupi-HUf17HeQHJOSRhYA",
    "text": "ACP 👍",
    "like_count": 3,
    "published_at": "2025-01-01T18:55:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwkJnK3qQn5mNkH3VF4AaABAg",
    "author": "@Gigika313",
    "author_channel_id": "UCOlKZjfFoTc6qo-Sk3_8saA",
    "text": "We had the same toys for years! 🤦🏻‍♂️ I’m sure Russia in the 90s had the ps5",
    "like_count": 7,
    "published_at": "2024-12-31T14:26:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx_vQN_eWqXwGvNGtF4AaABAg",
    "author": "@ad5792",
    "author_channel_id": "UCA8VegQ3GD9RGDmJYXruYHA",
    "text": "What do you mean everything belongs to everybody? My mom had a title to the condo she bought, same with my dad and his car, etc. Don't confuse means of production with private property! By the way, we never lived in communism, we lived in socialism, with communist party rule.",
    "like_count": 2,
    "published_at": "2025-01-09T08:03:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxpAqVL-JsAgEQ2rRd4AaABAg",
    "author": "@english4037",
    "author_channel_id": "UCVt7jx67x3RlZz6R8zvqbag",
    "text": "Dont forget what happened to Makhnovschina",
    "like_count": 0,
    "published_at": "2025-02-09T16:26:59Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxmH2EqydYy9Mt_eyB4AaABAg",
    "author": "@payton7920",
    "author_channel_id": "UC9a4kG8dHfjw6oLkAIu596g",
    "text": "Not the toys 😩😩",
    "like_count": 0,
    "published_at": "2025-01-02T04:41:04Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwfjBxTFOse3vxFS754AaABAg",
    "author": "@Gaiafreak6969",
    "author_channel_id": "UCLeyWHe41cArozNflNoKYLw",
    "text": "Based",
    "like_count": 0,
    "published_at": "2025-01-01T17:56:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy_4_Dk2yviTF0ZpXt4AaABAg",
    "author": "@Tariq-oj5zz",
    "author_channel_id": "UC5F5yvtG4eWJpqlvFWAluKA",
    "text": "Forgive me if I sound incredibly ignorant, All I did was read the principles of communism by Engels.\n\nSpeaking of the USSR's vs. China's Communist Parties, is the American Communist Party's goal to grow through a period of industrialization in disadvantaged areas through capitalism, or is it to go for centrally planned 5 year plans all at once? Chinese people do far better than many Americans, we leave people on the street because they're disabled, poor, elderly, children, single parents etc. when there could be enough productive force to create a 100% employment rate, we could easily abolish poverty their way, but I prefer ML economics.\n\n I would have never supported this 2 years ago, but Elon's  DOGE is straight up radicalizing all those that rely on the government.",
    "like_count": 6,
    "published_at": "2024-12-31T02:57:53Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "Ugy_4_Dk2yviTF0ZpXt4AaABAg.ACh0r7ap0WfACh6ovPKEab",
        "author": "@jamesgudgeon453",
        "text": "I got radicalized after the election. I voted for trump then realized I was lied to. Yes, I realize I was very dumb.",
        "like_count": 1,
        "published_at": "2024-12-31T03:50:01Z",
        "is_reply": true
      },
      {
        "id": "Ugy_4_Dk2yviTF0ZpXt4AaABAg.ACh0r7ap0WfACh9TTWGf7L",
        "author": "@Tariq-oj5zz",
        "text": "@jamesgudgeon453  I voted for Kamala, but I totally get that the two wings of populism can coexist and even combine. I can totally get behind the maintaining of our children's innocence and single payer healthcare at the same time, no matter if we choose a socialism with American characteristics or a planned economy like the USSR. There's a neutral paper that shows how Soviet socialism was superior for everyone per unit of development in all objective measures, think Human Development Index, HDI is the acronym. \nYou're based for coming to the right side man, we'll both see the day when the working people of America regain control of this country.\nThe worker's state will defend freedom, ironically there's more freedom in China than America these days, you can tell a joke in China, you just can't criticize the government.",
        "like_count": 4,
        "published_at": "2024-12-31T04:13:10Z",
        "is_reply": true
      },
      {
        "id": "Ugy_4_Dk2yviTF0ZpXt4AaABAg.ACh0r7ap0WfAChK1YAbE7F",
        "author": "@therollerlollerman",
        "text": "@Tariq-oj5zz In China you can fiercely criticize gov't policies and force a change in them, not the political system. In the US you can criticize the political system as much as you want as an escape valve, just don't expect any policy changes.\n\nAlso, the poverty alleviation efforts were entirely state-driven and planned, targeted at less wealthy regions and the countryside that market forces would not even bother investing in because the margins aren't attractive enough. It's the rich coastal urban areas in China that are more capitalistic and market driven, as a way to generate and concentrate wealth. Here, the people's mindsets are more greedy, pro-western and status chasing. Fortunately there is still the political monopoly of the Communist Party that forces redistribution to the places feeding and sustaining their opulent lifestyles.",
        "like_count": 5,
        "published_at": "2024-12-31T05:45:28Z",
        "is_reply": true
      },
      {
        "id": "Ugy_4_Dk2yviTF0ZpXt4AaABAg.ACh0r7ap0WfAE5Xg0Qyy_R",
        "author": "@JonathanSimantov",
        "text": "100% employment isnt good dipshit leave your room and take an intro to econ course lmao",
        "like_count": 0,
        "published_at": "2025-02-03T21:17:08Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxVdmZ0aFpNIr6TO8d4AaABAg",
    "author": "@shiningstarsshiningthoughts",
    "author_channel_id": "UCn_XKIPyl0VKsw7E3KWZkQg",
    "text": "this was unpleasant to listen to because of the hosts' arrogance. the topic is fascinating yet in my opinion, it lacks real-world examples and verified data..",
    "like_count": 0,
    "published_at": "2025-01-14T13:02:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwKnnmcmDbhklp-FiB4AaABAg",
    "author": "@ad5792",
    "author_channel_id": "UCA8VegQ3GD9RGDmJYXruYHA",
    "text": "You didn't really live in SU. I was born in the 60s and what was going on in the 80s is a total different story. Gorbachev brought country to a complete economic ruin, with his \"perestroika and uskorenie\". Eltsyn just finished it of",
    "like_count": 0,
    "published_at": "2025-11-24T09:52:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyvpLOAXkVFCBXmR114AaABAg",
    "author": "@slovakianleftnat3",
    "author_channel_id": "UC29So0C9dXejvV6xW2_jyFQ",
    "text": "Ik your right, but chill, your not gonna solve anything by yelling",
    "like_count": 0,
    "published_at": "2025-04-22T20:07:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzXvVwOMlWAUZ1rWGF4AaABAg",
    "author": "@ComradeLenin197",
    "author_channel_id": "UCSdAx7YarKsiZRxTeEztlHA",
    "text": "I support Ukraine but am also a Leninist these pro Russia losers are kinda dumb imo",
    "like_count": 4,
    "published_at": "2025-01-05T04:59:01Z",
    "is_reply": false,
    "reply_count": 9,
    "replies": [
      {
        "id": "UgzXvVwOMlWAUZ1rWGF4AaABAg.ACu6glFM6zzAE2r5VcjOAZ",
        "author": "@ulyanov17",
        "text": "why tho",
        "like_count": 0,
        "published_at": "2025-02-02T20:17:47Z",
        "is_reply": true
      },
      {
        "id": "UgzXvVwOMlWAUZ1rWGF4AaABAg.ACu6glFM6zzAEKTP4g1uxC",
        "author": "@english4037",
        "text": "@ulyanov17Same reason to support Palestine",
        "like_count": 0,
        "published_at": "2025-02-09T16:28:20Z",
        "is_reply": true
      },
      {
        "id": "UgzXvVwOMlWAUZ1rWGF4AaABAg.ACu6glFM6zzAEKTPwPrkFm",
        "author": "@english4037",
        "text": "Thank you for supporting us",
        "like_count": 0,
        "published_at": "2025-02-09T16:28:27Z",
        "is_reply": true
      },
      {
        "id": "UgzXvVwOMlWAUZ1rWGF4AaABAg.ACu6glFM6zzAEKUQF9GCgH",
        "author": "@ulyanov17",
        "text": "@english4037 not at all the same, Palestine is a victim of colonialism and ethnic cleansing. Western Ukrainians were ethnically cleansing russian speakers for past 10 years and the russians invaded to fight NATO influence. You can discuss whether SMO is good or bad, but it's nothing like Palestine 🤦",
        "like_count": 0,
        "published_at": "2025-02-09T16:37:14Z",
        "is_reply": true
      },
      {
        "id": "UgzXvVwOMlWAUZ1rWGF4AaABAg.ACu6glFM6zzAEKUzjy87Pa",
        "author": "@ulyanov17",
        "text": "@english4037  not the same reason",
        "like_count": 0,
        "published_at": "2025-02-09T16:42:13Z",
        "is_reply": true
      },
      {
        "id": "UgzXvVwOMlWAUZ1rWGF4AaABAg.ACu6glFM6zzAEKWs_12NNX",
        "author": "@english4037",
        "text": "@ulyanov17 How is it different",
        "like_count": 0,
        "published_at": "2025-02-09T16:58:43Z",
        "is_reply": true
      },
      {
        "id": "UgzXvVwOMlWAUZ1rWGF4AaABAg.ACu6glFM6zzAEKXedbyaep",
        "author": "@ulyanov17",
        "text": "@english4037  Palestinians are g3n0c1ded by colonialism, Ukrainians were ethn1c4lly cle4ns1ng russian speakers for a decade. Russia's SM0 is a war against NATO and western imperialism. War doesn't equal g-word liberal",
        "like_count": 0,
        "published_at": "2025-02-09T17:05:33Z",
        "is_reply": true
      },
      {
        "id": "UgzXvVwOMlWAUZ1rWGF4AaABAg.ACu6glFM6zzAELBrj9HBK7",
        "author": "@ComradeLenin197",
        "text": "@ulyanov17 why support Russia?",
        "like_count": 0,
        "published_at": "2025-02-09T23:14:21Z",
        "is_reply": true
      },
      {
        "id": "UgzXvVwOMlWAUZ1rWGF4AaABAg.ACu6glFM6zzAFg08sbOskT",
        "author": "@OlgaRykov",
        "text": "You're dumb tho",
        "like_count": 0,
        "published_at": "2025-03-15T07:06:40Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw4OTLIAMgr3O0IZDB4AaABAg",
    "author": "@prescientdove",
    "author_channel_id": "UC7VzlspRpw2Lv8WgHdpphgw",
    "text": "\"Here's what you experienced within the Soviet Union...\"",
    "like_count": 1,
    "published_at": "2025-01-18T05:05:13Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugw4OTLIAMgr3O0IZDB4AaABAg.ADQajSxALuIAE2quPNaJVk",
        "author": "@ulyanov17",
        "text": "nah, he didn't experience shit in the soviet union. Noah has greater \"authority\" in drawing from his parent's experience. There are lots of those \"victims of communism\" here in eastern europe today - victims of standing in line to a shop and the lack of trendy jeans...\nThey were kids who ran around and graffitied streets when communism was collapsing. They just happened to live their childhood throught an economic crisis, that's all.",
        "like_count": 2,
        "published_at": "2025-02-02T20:16:08Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyXAJC_kxnrCsF1xI14AaABAg",
    "author": "@Lionfish5656",
    "author_channel_id": "UCO5_6h6vXjVRRZidl5hKj5w",
    "text": "Also, Masherov & Romanov had ideas to fix the problems.",
    "like_count": 0,
    "published_at": "2024-12-31T05:57:33Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz4jOsRoNGLJaayENJ4AaABAg",
    "author": "@volition2015",
    "author_channel_id": "UCHvVgrhJI3_eN2eozYdU_6g",
    "text": "I was also a Soviet kid in the 80's and remember visiting our relatives in Ukraine in 1990. Going to a toy store in Mykolaiv was an experience. There were new car models, trucks, toy guns, water pistols, electronics, all kinds of stuff. I've never seen half of those things in my hometown in Russia. \n\nAt the same time I understand why many Ukrainians, especially young people, hate literally everything about Soviet Union (derogatory term \"sovok\" is often used). Since 1987 they were surrounded by anti-communist and anti-Soviet messaging 24/7. Literature, movies, songs, mass media, museums, internet, political rhetoric. All of that went into overdrive after 2014. And since 2022 USSR is being deliberately linked to Putin's Russia and the horrors of war. Anticommunism is being burned into the Ukrainian identity.  \n\nWhen it comes to Ukrainian nationalism, it's much bigger than OUN(b) aka \"banderites\". Some members were sympathetic to national-socialism and Hitler's ideas, but majority were not Nazis in my opinion.",
    "like_count": 2,
    "published_at": "2025-01-03T08:00:40Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugz4jOsRoNGLJaayENJ4AaABAg.ACpHtMY0kJfAFg-1MYFQmS",
        "author": "@OlgaRykov",
        "text": "The uneducated youth erroneously think that perestroika that they have observed is Soviet Union and instead of calling it what it is - perestroika - they call it sovok. But what they actually imagine in their heads when they say it is not Soviet Union, it's perestroika.",
        "like_count": 1,
        "published_at": "2025-03-15T06:56:53Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg",
    "author": "@itsnony77",
    "author_channel_id": "UC9YAkxlRdwc89L2kME3lsTA",
    "text": "This debate lacked some nuance.  Caller gets accused of having been indoctrinated by Banderites.  In reality not all anti-communist sentiment in Ukraine has always been exclusively Banderite nor iis all of anti-communist sentiment today in Ukraine exclusively Banderite in origin.  Some people just don't like communism.   Some people interpret the events of 1918 as an invasion without resorting to Banderite indoctrination.  You should be more careful throwing these accusations around.  It's quite patronizing.  It really muddied an otherwise interesting debate.",
    "like_count": 7,
    "published_at": "2024-12-31T03:10:18Z",
    "is_reply": false,
    "reply_count": 16,
    "replies": [
      {
        "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg.ACh2H-hKY3FAChDnY-6ZCB",
        "author": "@OlgaRykov",
        "text": "Nah, pretty much all are indoctrinated into Banderite ideology. Bandera having been a western intelligence agency asset and appointed to fulfil the goal of brainwashing eastern european slavs into hating their communist brethren and edging on a civil war in the form of collaboration with yahtzee invaders so that russians k i l l each other, much like today, while the yahtzees unalive them as well - that's all banderite ideology. Much like I did, many russians/ukrainians/belarussians have no clue what the roots of their dislike of USSR is, and then when you grow up and read the declassified cia documents on using uk rain ian nationalism to spark civil unrest and even war in USSR you begin to understand you're just a cog in the banderite ideology. So yeah, it's ALL banderite ideology, whether the pawn is aware of it or not.",
        "like_count": 1,
        "published_at": "2024-12-31T04:51:00Z",
        "is_reply": true
      },
      {
        "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg.ACh2H-hKY3FAChIuMABpI3",
        "author": "@therollerlollerman",
        "text": "@OlgaRykov the CIA refined the original notsee strategy on Banderites by helping BY/UA/RU nationalists ally with each other to overthrow the Soviet Union then began funding one side (the Ukrainian one) to start fighting against the rest. Much less direct from the CIA and more confusing for the belligerents involved",
        "like_count": 6,
        "published_at": "2024-12-31T05:35:37Z",
        "is_reply": true
      },
      {
        "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg.ACh2H-hKY3FAChLYKOYgz2",
        "author": "@redsouth2715",
        "text": "They explained themselves clearly. Lots of people gripe over the dinner table about this or that problem, sure, there might be some random people who, as you put it, just happened to not like communism for completely obscure reasons, but that kind of abstract individualism, itself, lacks nuance. When you take all the people who resented communism so much that they believed the State should be overthrown, the people who were motivated to political action at a scale that’s relevant historically, the actual anti-Communists, and put them all together, you get the Organisation of Ukrainian Nationalists. In reality, the OUN is the political force that emerged as the expression of anti-communism within Ukraine.\n\nThe caller just dismissed Bandera as a boogie man (which alone demonstrates a high degree of indoctrination, or bad faith), but if his anti-Communist nationalism is not rooted in Banderist mythology, then why could he not simply articulate a different political tradition to which he aligns? One separate, distinct and critical of Banderism and the OUN. How can a Ukrainian make a case against communism without addressing the issue that fascism was the historical alternative.",
        "like_count": 13,
        "published_at": "2024-12-31T05:58:41Z",
        "is_reply": true
      },
      {
        "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg.ACh2H-hKY3FACh_t3vN1D7",
        "author": "@OlgaRykov",
        "text": "@therollerlollerman Strangely, I don't see my reply that you replied to. Do you see it?",
        "like_count": 0,
        "published_at": "2024-12-31T08:12:43Z",
        "is_reply": true
      },
      {
        "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg.ACh2H-hKY3FAChrjfbhYRO",
        "author": "@itsnony77",
        "text": "​@redsouth2715 I am starting to think you were on the panel because you are making the exact same mistake again.  The caller never \"dismissed Bandera as a boogie man\".  Listen to what he said, you didn't listen then and you are not listening now.  He said \"We were talking about one period (being the Ukrainian state in 1918).  For some reason you're focused on the Banderites which I never even mentioned.If it fits your boogie man go for it!\" The caller was speaking about the events of 1918 and you guys start ranting about Bandera.  Totally anachronistic.  The caller was indicating this and pointing out your anachronism being a strawman/boogie man.  At least this is how I understood it.  Maybe if he wasn't interrupted and talked over so much this could have been cleared up.  This would also have cleared up the invalidity of your other argument.  Trying to explain away the Tsentralna Rada issuing its Fourth Universal (dated 22 January 1918) as a fascist movement is just ridiculous.  I'm sure caller would have cleared this up to you if you let him talk. Historically they were by majority socialists.  Not obscurely anti-communist individuals, nor fascists. Patriotic Ukrainian socialists.  I'm surprised you're doubling down on this instead of accepting the fact calling anyone with an opposing view towards communism either in a historical or actual context fascist - just because they're Ukrainian - is a rather silly argument,  Not to mention patronizing af.  Maybe he is a Banderite or indoctrinated by it, I don't know to be fair.  But you could have asked him instead of throwing these accusations in an anachronistic context.  Even in modern context this \"all anti-communist sentiment is fascist in nature\" is nonsensical.  I could give you a long list of European countries which have resentment towards communism expressed within socialist movements.  Both historical and today.  The 1918 Ukrainian independence movement was initiated by a patriotic Ukrainian SOCIALIST movement.  This is a historical fact.  So yes,  despite what Noah says you can discuss this topic without addressing Bandera.  The original opposition towards Russian communism was socialist not fascist.  In my opinion communism wasn't the reason for the opposition rather than it being perceived as invasive and going against their nationalist feelings. Now, you can try to forcibly retro-project Banderism onto it as much as you want it doesn't make you sound any more intelligent.  It only further proves the historical lack of understanding of events in that specific timeframe.  Sure we can debate whether these socialist movements with a communist allergy within Europe are truly socialist in nature.  We might even agree on some points I'm sure but this is beside the topic raised here.  Outside of this topic I admit I chuckled a bit when Noah depicted China as an illustration of communist success.  China today is as far removed from communism as it is from neo-liberalism.  Yes it's successful looking at GDP growth but the (semii--)proletariat in China is still suffering under a neo-liberal policy of blind pursuit of capitalist gain.",
        "like_count": 2,
        "published_at": "2024-12-31T10:48:44Z",
        "is_reply": true
      },
      {
        "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg.ACh2H-hKY3FAChuNzyjgew",
        "author": "@itsnony77",
        "text": "@OlgaRykov I am not seeing your reply",
        "like_count": 1,
        "published_at": "2024-12-31T11:11:51Z",
        "is_reply": true
      },
      {
        "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg.ACh2H-hKY3FACkyGXWbI8Y",
        "author": "@linusmayden8465",
        "text": "Reality is that there were different competing factions in Ukraine, Socialist, Anarchists, Bolsheviks, the Communist Ukrainians already existed in Odessa and Kharkov at municipal levels before the USSR invaded.",
        "like_count": 0,
        "published_at": "2025-01-01T15:43:30Z",
        "is_reply": true
      },
      {
        "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg.ACh2H-hKY3FAClIx0UyGZ_",
        "author": "@itsnony77",
        "text": "@linusmayden8465 Thank you for sharing the detailed account of events . You seem very knowledgeable I think this would be a great topic on this show.",
        "like_count": 0,
        "published_at": "2025-01-01T18:52:56Z",
        "is_reply": true
      },
      {
        "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg.ACh2H-hKY3FACmBqftUE6K",
        "author": "@redsouth2715",
        "text": "@itsnony77 Short lived, unstable attempts to build a state, in the midst of a power vacuum and subsequent civil War, never had any prospect of leading to Ukrainian sovereignty. This patriotic Ukrainian socialist blah blah blah is all fantasy. Yes, there were a number of factions/gangs, just as there were in Russia, but they had only two options, align with the Bolsheviks and engage in a genuine socialist project or become proxies of imperialist reaction. And, just as in Russia, those who were serious about popular power and land reform simply joined the Bolsheviks, the rest became reactionary. It was in fact the Soviet Union that gave the Ukraine people a nation and it was the Soviet economy that gave them the sovereignty from Western imperialism necessary for rapid economic development, up to manufacturing gas turbines, rocket motors and other the cutting edge technology. Without it, Ukraine would’ve been completely cucked, exporting raw commodities to the West.\n\nNo idea if this guy is a fascist or not, a lot of people are just very naive.",
        "like_count": 1,
        "published_at": "2025-01-02T03:10:09Z",
        "is_reply": true
      },
      {
        "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg.ACh2H-hKY3FACmDPKen9xu",
        "author": "@itsnony77",
        "text": "@redsouth2715 I agree there was no chance for the socialist Ukrainian state to succeed given the forces at play at that time.  Where I disagree is the very one-sided perspective you apply.  Not only the Western forces at play in that era were imperialistic, so was the bolshevik force. The tactics used were no different from the colonialism applied by the West.  The Ukrainians weren't exactly given sovereignty they became part of the Soviet project with any remnants of Ukrainian nationalism getting crushed by force.",
        "like_count": 0,
        "published_at": "2025-01-02T03:23:45Z",
        "is_reply": true
      },
      {
        "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg.ACh2H-hKY3FACmFhVIC6M4",
        "author": "@redsouth2715",
        "text": "@itsnony77 The Soviet Union was qualitatively different to the colonial powers. They didn’t crush Ukrainian nationalism, they compromise with it, hence the granting of additional territories and massive economic investment. They did crushed forces opposed to the revolution, who were all receiving support from foreign powers.\n\nTry to name a Western colony that could produce rocket motors, if they were so similar?",
        "like_count": 0,
        "published_at": "2025-01-02T03:43:51Z",
        "is_reply": true
      },
      {
        "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg.ACh2H-hKY3FACmGSjAwM8f",
        "author": "@itsnony77",
        "text": "@redsouth2715 Economic growth is no argument whatsoever in deciding whether this was colonialism or not.  It was clearly a colonialist project.  Once the bolsheviks figured out these Ukrainian socialists in the Rada were unwilling to align with Bolshevism they took Kharkiv.  If they had no colonial intention they could have backed that early socialist state despite non-alignment.  As history shows, a non-aligned alliance was simply not negotiable and force was applied to gain complete political control.",
        "like_count": 0,
        "published_at": "2025-01-02T03:50:26Z",
        "is_reply": true
      },
      {
        "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg.ACh2H-hKY3FACmJGHqxmNr",
        "author": "@redsouth2715",
        "text": "@itsnony77 You said the Bolsheviks were no different from the colonial powers in the West. Name a Western colony that produced rocket motors, or accept that there is a profound difference.\n\nA ‘non-aligned social state’ would’ve had no path to industrial development, and therefore, no way to defend it sovereignty. It would have been thoroughly cucked by France and UK, much like the Ukrainian of today.\n\nUkraine is nothing without Russia",
        "like_count": 0,
        "published_at": "2025-01-02T04:14:57Z",
        "is_reply": true
      },
      {
        "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg.ACh2H-hKY3FADArlzrqKGZ",
        "author": "@ilyamuromets317",
        "text": "@itsnony77 which Socialist State 'despite non-alignment'? There wasn't one. Petlyura was crushed by the Poles and then agreed to become a proxy for them. Makhno never stood a chance. The Hetman was with the Whites, and the UkSSR was aligned with the Bolsheviks. There were no other major players. Were the Bolsheviks supposed to just hand Kiev over to the Poles? It's absurd.",
        "like_count": 0,
        "published_at": "2025-01-12T02:26:16Z",
        "is_reply": true
      },
      {
        "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg.ACh2H-hKY3FAFg-pi3g9gp",
        "author": "@OlgaRykov",
        "text": "​@itsnony77yeah, been happening to me for about 3 years now: my replies won't post. They're not offensive nor do they have any triggering words. They just won't post. Sometimes I post the same reply 5 times and one of them will go through. Anyways, the rollerlollerman is absolutely correct In his reply.",
        "like_count": 0,
        "published_at": "2025-03-15T07:03:54Z",
        "is_reply": true
      },
      {
        "id": "Ugz5C3GcqcwaQ_Wjp7x4AaABAg.ACh2H-hKY3FAFg-uzQ34JO",
        "author": "@OlgaRykov",
        "text": "​@itsnony77 yeah, been happening to me for about 3 years now: my replies won't post. They're not offensive nor do they have any triggering words. They just won't post. Sometimes I post the same reply 5 times and one of them will go through. Anyways, the rollerlollerman is absolutely correct In his reply.",
        "like_count": 0,
        "published_at": "2025-03-15T07:04:37Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw-Nkwm6687Wm2VFLJ4AaABAg",
    "author": "@franplmb",
    "author_channel_id": "UCQoGZfL_dlLFsHVNH0yhmuA",
    "text": "I ve watched 0:44 of it and i already feel i have seen this: the dude dont distinguish marxism from stalinism. To make it simple: is like someone says he doesnt belive in democracy becouse hillary clinton is democrat and therefor what democracy is ( when she has been litteraly undemocratic). This is the same. He is gonna critic imperialistic and capitalist consecuenses but call them communism becouse the flag he sees. For example...north corea..they never suported a workers strike anywhere. Comunsts most famos frase is worker of the world unite. Why is not northcore just nasionalist? What makes them comunist? Nothing. But thes SAY they are...   so. The problem is the levelmof the debat. Is just too low to be a debate for real. Sad\n Im watching 5:00 ( i feel i have to remember everybody that putin is rightwing and very fascist) .....Ok...dudes are making an eford to pull the invited up in the level of debate distinguishin burocrasy ..uuu but they think china is comunist!! No dudes. China , and mao has always been Not a marxist. I can make everyone read the progtam of gotha, the 18th brumario and all the marxist bibliografy. Is painfull. Let me put this in a nutshell ¿ who is gonna stop polluting in the industries if not the workers there ignoring the bosses? ....11:20...  ok... well. I like and follow. 🖤✊️",
    "like_count": 0,
    "published_at": "2024-12-31T02:50:44Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugw-Nkwm6687Wm2VFLJ4AaABAg.ACh01m9RpeFAChwefti9WI",
        "author": "@seedee3d",
        "text": "I like cocaine too",
        "like_count": 0,
        "published_at": "2024-12-31T11:31:44Z",
        "is_reply": true
      },
      {
        "id": "Ugw-Nkwm6687Wm2VFLJ4AaABAg.ACh01m9RpeFACjCwrQ41DK",
        "author": "@lorsheckmolseh3345",
        "text": "Somehow Stalin (and Lenin) created the 1. Communist state on Earth by the principles of Marxism, not some blue haired baristas. Is this an extract from your application at the State Dept.?",
        "like_count": 0,
        "published_at": "2024-12-31T23:22:00Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugyln2IBvMrQTM2GGD14AaABAg",
    "author": "@ntskl",
    "author_channel_id": "UC3N5h9bzFox5W1qPGiUvq1g",
    "text": "The steamer communists criticise late USSR leadership for betraying the original ideals of the revolution where the Party became a way to climb the social hierarchy and see no contradiction in what they're saying when they call modern day China communist. 😂😅",
    "like_count": 1,
    "published_at": "2024-12-31T10:46:32Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "Ugyln2IBvMrQTM2GGD14AaABAg.AChrUYoU6oYACibxuauINf",
        "author": "@Lawns-Are-Fun",
        "text": "Bad comment. If for argument’s sake if we take your position as true that China=Late USSR—the main difference is that China is excelling and growing at an unbelievable rate—the later USSR did not.",
        "like_count": 6,
        "published_at": "2024-12-31T17:50:06Z",
        "is_reply": true
      },
      {
        "id": "Ugyln2IBvMrQTM2GGD14AaABAg.AChrUYoU6oYACjC7upMO7D",
        "author": "@lorsheckmolseh3345",
        "text": "Ole propaganda tool of Trotsky to call out Stalin for \"betraying the revolution\", used by even the most reactionary elements like Tsarists or William Randolph Hearst. The \"hero\" Trotsky who called out Hitler in 1938 to invade Soviet Union, bc Stalin woud capitulate after a few weeks.",
        "like_count": 0,
        "published_at": "2024-12-31T23:14:55Z",
        "is_reply": true
      },
      {
        "id": "Ugyln2IBvMrQTM2GGD14AaABAg.AChrUYoU6oYACjF9pwSyKr",
        "author": "@frolicsomgaiety",
        "text": "They did establish a distinction between Stalinism and the Khrushchevite Revisionists. China’s communism is directly linked to ML/Stalinism and emphatically not anything to do with Trotskyism or anything in the SU after Stalin’s death- there was Sino-Soviet schism in fact. So pack up your crying laughing emojis sir",
        "like_count": 4,
        "published_at": "2024-12-31T23:41:23Z",
        "is_reply": true
      },
      {
        "id": "Ugyln2IBvMrQTM2GGD14AaABAg.AChrUYoU6oYACyxWKl3-_s",
        "author": "@the_NZH",
        "text": "@frolicsomgaiety Well said. That ntskl has a comprehension problem",
        "like_count": 0,
        "published_at": "2025-01-07T02:06:17Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwHF8jmBj33brPaFSh4AaABAg",
    "author": "@myzu6731",
    "author_channel_id": "UCvM36bCWUgfCufUZU4eBkvQ",
    "text": "You should do a lot more research into communism, its shocking how naive you are💀 you want to move to a communist country feel free to do so and experience it at your own peril, but spreading this naive massage is ignorant and could cost mass graves. Like it did before. Like it did every time. \"For the greater good\"",
    "like_count": 2,
    "published_at": "2025-01-01T14:04:55Z",
    "is_reply": false,
    "reply_count": 5,
    "replies": [
      {
        "id": "UgwHF8jmBj33brPaFSh4AaABAg.ACkmzVkZuHNAClDgks7doa",
        "author": "@MohammedAli-hl4mr",
        "text": "@myzu6731 they’ve researched into what you want is for them to research into atrocities committed by communist regimes but that’s not what you’re asking",
        "like_count": 2,
        "published_at": "2025-01-01T18:07:02Z",
        "is_reply": true
      },
      {
        "id": "UgwHF8jmBj33brPaFSh4AaABAg.ACkmzVkZuHNACyyd91nAVt",
        "author": "@the_NZH",
        "text": "@MohammedAli-hl4mr \"Atrocities commited by communist regimes\" according to whom? The black book of communism?",
        "like_count": 1,
        "published_at": "2025-01-07T02:16:05Z",
        "is_reply": true
      },
      {
        "id": "UgwHF8jmBj33brPaFSh4AaABAg.ACkmzVkZuHNACyylhhc2U4",
        "author": "@the_NZH",
        "text": "It sounds like you are new to Midwestern Marx and you are the one that actually needs to do research into communism, without using biased anti-communist sources.",
        "like_count": 1,
        "published_at": "2025-01-07T02:17:16Z",
        "is_reply": true
      },
      {
        "id": "UgwHF8jmBj33brPaFSh4AaABAg.ACkmzVkZuHNACzzLqyGh7U",
        "author": "@MohammedAli-hl4mr",
        "text": "@the_NZH no just that they weren't perfect and their leaders weren't blameless during the cold war",
        "like_count": 0,
        "published_at": "2025-01-07T11:41:34Z",
        "is_reply": true
      },
      {
        "id": "UgwHF8jmBj33brPaFSh4AaABAg.ACkmzVkZuHNAD--wvI5FEw",
        "author": "@the_NZH",
        "text": "@MohammedAli-hl4mr nobody said they were perfect. There is so much anti communist bullshit, that just stating neutral facts or debunking the crap, suddenly we are accused of holding these leaders on a pedestal of perfection. No. They were not perfect but they were also not the so called evil authoritarian genocidal dictators painted by anti communist propaganda.",
        "like_count": 0,
        "published_at": "2025-01-07T11:55:30Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwuU1Hh2k3mj07mjoZ4AaABAg",
    "author": "@3chordGrifter-et4qe",
    "author_channel_id": "UC6g6VoSQIiKlZHb5KIBMROQ",
    "text": "These are spoiled children who have never had to work for anything",
    "like_count": 0,
    "published_at": "2025-02-16T22:05:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  }
]