[
  {
    "id": "UgxQDz_jBr0IQiy_8e14AaABAg",
    "author": "@HighAsHeckPriestess",
    "author_channel_id": "UCAKRQTLUVoGFxPPPhAs_2FQ",
    "text": "'I dont want anymore allies. Where are the accomplices?' Is powerful.",
    "like_count": 324,
    "published_at": "2023-08-06T18:32:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxlZrorLLcrqRjtmDN4AaABAg",
    "author": "@LBYRNTH_",
    "author_channel_id": "UC8-Ho7quOpq5zxntuUSZGGw",
    "text": "\"They love the ability to be able to seperate the idea of your Blackness because then it gives them the right to treat you the way they would treat White people if they could.\" The power of this statement. Hope was tearing that shit up. Another amazing episode full of amazing voices.",
    "like_count": 26,
    "published_at": "2024-10-11T03:36:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw4YiESA394TSdIr9l4AaABAg",
    "author": "@kikibean2024",
    "author_channel_id": "UCJjsGZlxeeySwa32-zn-Kfw",
    "text": "The way the church has weaponised religion is spot on. Thanks for speaking on this. Keep the conversation going as education is the beginning of awareness.",
    "like_count": 343,
    "published_at": "2023-08-06T15:45:45Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugw4YiESA394TSdIr9l4AaABAg.9t4SwH0A2uO9t4jjicsvWR",
        "author": "@Cnichal",
        "text": "The demanding of forgiveness, always makes me sick. We never hold people who harm us accountable. Everyone wants to push for immediate forgiveness without any true consequences. I think about that man who was a bird watcher in New York, and how he for gave that vampire, and she turned around and did it to him again. 🤦🏾‍♀️",
        "like_count": 34,
        "published_at": "2023-08-06T18:21:19Z",
        "is_reply": true
      },
      {
        "id": "Ugw4YiESA394TSdIr9l4AaABAg.9t4SwH0A2uO9t4mRoIl6KC",
        "author": "@o_o8203",
        "text": "The Abrahamic religions, as far as I know, are the only organized religions that specifically encourage their followers to conquer and subjugate others. Conquest of other groups is a consistent theme in the Bible, Koran, and Torah.",
        "like_count": 0,
        "published_at": "2023-08-06T18:44:57Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx44t4uxLL2AEgxuXl4AaABAg",
    "author": "@nitogorostizo16",
    "author_channel_id": "UCWgvmJaMKaint43lmJyxL0A",
    "text": "Trans/queer people literally saved my life, I'll keep putting my life in the line for you whenever you need it, it's the least I can do.",
    "like_count": 101,
    "published_at": "2023-08-06T23:47:09Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzrRhUWOfNjjUfGXKl4AaABAg",
    "author": "@mariapaula3376",
    "author_channel_id": "UCgu1pCVGORxKNYyeOngGfrw",
    "text": "I'm a queer Latin-American immigrant (Colombo-Mexican) living in Toronto, Canada. I'm in the endeavour of wanting to understand multiple perspectives of what it means to be black in the world. Your views on blackness, history, political analysis and more have expanded my understanding of blackness and have made me a better and more profound person. Thank you for the work you do, Olay :)",
    "like_count": 263,
    "published_at": "2023-08-06T13:28:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyCPkYbPgP7zl_V6jZ4AaABAg",
    "author": "@banonKING",
    "author_channel_id": "UCqjZ14oxenWnBsU0ATaDT2w",
    "text": "110% with Da'Shaun... these religious structures have to go.  They're our true shackles on the black mind in America",
    "like_count": 423,
    "published_at": "2023-08-06T17:11:39Z",
    "is_reply": false,
    "reply_count": 11,
    "replies": [
      {
        "id": "UgyCPkYbPgP7zl_V6jZ4AaABAg.9t4blS-Sup49t4yhyLpCMW",
        "author": "@ohubigmad",
        "text": "is liberation theology in the conversation? or is there a conversation about liberation theology",
        "like_count": 18,
        "published_at": "2023-08-06T20:32:09Z",
        "is_reply": true
      },
      {
        "id": "UgyCPkYbPgP7zl_V6jZ4AaABAg.9t4blS-Sup49t7Altrw6Ea",
        "author": "@Firebird00500",
        "text": "I was raised conservative Christian and I also 110% agree. These people are the reason for this. I had to learn about the Tulsa Massacre from a FUCKING TV SHOW, decades after I should have been taught about this. We were taught about the systematic destruction of Native Americans, the Trail of Tears, Chinese immigrants being mistreated, Irish immigrants being mistreated. What we learned about black people? Slavery -> Civil War -> Reconstruction -> Segregation -> MLK and now all racism is solved. There was no mention of the hundreds of white mobs burning down black cities and driving black Americans out of their own neighborhoods. I remember slavery was also massively sugar-coated. What's ironic is if you said the same thing about human trafficking victims now that people say about them then, you'd be absolutely hated by most people. Imagine hearing a story about a child trafficked for sex and hard labor and saying \"Well maybe they picked up some useful skills! It's not ALL bad\". Like WHAT THE FUCK.\n\nI'll give them one thing though. They more than anyone else taught me that Jesus is a lie. How could he be real if the people who wanted to drone-strike migrants say he answers their prayers? Doesn't sound like the NT Jesus I read about.\n\nThank you guys for this discussion. I'm obviously cis and white, found out I was bi a couple years ago, but I am so far away from people who have actually been punished or targeted because of LGBTQ+ hatred. I love hearing about this from a community who has had to deal with it.",
        "like_count": 1,
        "published_at": "2023-08-07T17:04:46Z",
        "is_reply": true
      },
      {
        "id": "UgyCPkYbPgP7zl_V6jZ4AaABAg.9t4blS-Sup49t7MUG8rlXR",
        "author": "@Empathy_is_Logical",
        "text": "So true. We need new ideas, not old bullshit baggage holding everyone back",
        "like_count": 20,
        "published_at": "2023-08-07T18:47:05Z",
        "is_reply": true
      },
      {
        "id": "UgyCPkYbPgP7zl_V6jZ4AaABAg.9t4blS-Sup49tC4JKDlCXM",
        "author": "@nojusticenetwork9309",
        "text": "I don't agree with this take. I agree that religious institutions are very much a real problem but religion itself is not a problem. Spiritual guidance and well being can and does have a major impact for many  people and always have. Religion and spirituality has helped shaped cultures to what they are and the beauty and uniqueness of all these cultures is due in part to these people's faiths. \n\nThere are many valid criticisms that can be laid on religion writ large, but many of them in actually really targeting the institutions formed around them and the people who abuse their impact and importance for personal power and gain.",
        "like_count": 11,
        "published_at": "2023-08-09T14:44:30Z",
        "is_reply": true
      },
      {
        "id": "UgyCPkYbPgP7zl_V6jZ4AaABAg.9t4blS-Sup49tC4qtfEv44",
        "author": "@Firebird00500",
        "text": "@nojusticenetwork9309 Religion and spirituality have shaped cultures, and our appendix kept us alive when we were eating raw meat. But that doesn't mean either is useful now. In fact, both can turn toxic and deadly.",
        "like_count": 36,
        "published_at": "2023-08-09T14:49:13Z",
        "is_reply": true
      },
      {
        "id": "UgyCPkYbPgP7zl_V6jZ4AaABAg.9t4blS-Sup49tCU86JpSOh",
        "author": "@kaikaibee",
        "text": "To paraphrase that old saying: When they came to Africa we had land and riches and they had Bibles. When they asked us to bow our heads in prayer and we opened our eyes they had the land and we had the Bibles",
        "like_count": 40,
        "published_at": "2023-08-09T18:30:09Z",
        "is_reply": true
      },
      {
        "id": "UgyCPkYbPgP7zl_V6jZ4AaABAg.9t4blS-Sup49tMLCJ-dlRd",
        "author": "@Brookejon3695",
        "text": "​@ohubigmadIt's a small part to my mind. That's just a tiny shot of lemonade made out of the mountains of lemons force-fed to the enslaved. Part of the suppression of revolt, revolution, and disobedience is forcing the people under your boot to adopt your religion. A religion that says we get our eternal reward in death, and the greater we suffer in life the greater our reward.\n\nShackles go beyond cold iron. These are mental.",
        "like_count": 14,
        "published_at": "2023-08-13T14:24:29Z",
        "is_reply": true
      },
      {
        "id": "UgyCPkYbPgP7zl_V6jZ4AaABAg.9t4blS-Sup49tMLIICdiAN",
        "author": "@Brookejon3695",
        "text": "​@kaikaibeedamn that's killer. What's that from?",
        "like_count": 6,
        "published_at": "2023-08-13T14:25:19Z",
        "is_reply": true
      },
      {
        "id": "UgyCPkYbPgP7zl_V6jZ4AaABAg.9t4blS-Sup49tPxQwQKUxw",
        "author": "@kaikaibee",
        "text": "@Brookejon3695 \nActual quote: \"When the missionaries came to Africa they had the Bible and we had the land. They said 'Let us pray.' We closed our eyes. When we opened them we had the Bible and they had the land.\n\nDesmond Tutu\" ❤🤎",
        "like_count": 21,
        "published_at": "2023-08-15T00:05:00Z",
        "is_reply": true
      },
      {
        "id": "UgyCPkYbPgP7zl_V6jZ4AaABAg.9t4blS-Sup49yIcVyBxggY",
        "author": "@zakai-kaz",
        "text": "Straight up please Christianity here is so gaslighty and such a cope here in south Africa you have no idea. I straight up can't have any accomplishments and random bouts of good luck without having some nebulous God always taking some of  the credit. 😭😭😭",
        "like_count": 12,
        "published_at": "2023-12-14T10:24:29Z",
        "is_reply": true
      },
      {
        "id": "UgyCPkYbPgP7zl_V6jZ4AaABAg.9t4blS-Sup4A2T3ct2bhDr",
        "author": "@choicesii1",
        "text": "Think more so you all are getting at aspects of religion that have nothing to do with religion. The king james Bible does not preach hate, yet a lot of preachers do. King James Bible doesn't say anything about sexuality, yet many preachers and priests do. It's more to be against people who spew hate and reinforce actual religiousness in religions.",
        "like_count": 3,
        "published_at": "2024-04-20T18:19:36Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwLSjqVgjkAPahj6hh4AaABAg",
    "author": "@20xx-mm-dd",
    "author_channel_id": "UCe1Hy4_S4I3ZG_XShz5gTqQ",
    "text": "\"Queer joy is important\" PREACH!!",
    "like_count": 57,
    "published_at": "2023-08-07T14:38:33Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyQen0PHloIZXa63yF4AaABAg",
    "author": "@untitledanarchistseagullch1237",
    "author_channel_id": "UCKccuEV51trJg_UOVIJQn0A",
    "text": "Glad to see the bourgie white-cisness of the gay marriage campaign called out from the start. It was such telling juxtaposition how, at the same time as the marriage campaign went from strength to strength, the Democrats refused to pass the Employment Non-Discrimination Act because a lot of them were worried it might also require trans people (gasp, pearl-clutch) to be treated like human beings.",
    "like_count": 171,
    "published_at": "2023-08-07T04:26:30Z",
    "is_reply": false,
    "reply_count": 12,
    "replies": [
      {
        "id": "UgyQen0PHloIZXa63yF4AaABAg.9t5p-8whbSO9vXydPnXu2i",
        "author": "@jhlfsc",
        "text": "Gay issues are not trans issues any more than they are black issues specifically.  They are all completely different things which is weird why the T in LGBT is lumped in there to begin with as if they were the same thing.",
        "like_count": 2,
        "published_at": "2023-10-06T19:52:18Z",
        "is_reply": true
      },
      {
        "id": "UgyQen0PHloIZXa63yF4AaABAg.9t5p-8whbSO9vY1zpDI3r3",
        "author": "@untitledanarchistseagullch1237",
        "text": "@jhlfsc That's a really odd take. The whole reason that the T has its own letter is that it's not actually the same thing, though there is massive overlap between them, since there are trans people within every one of the other categories represented in the term.\nThe idea of separating the T from LGBT, it's worth noting, was floated as a strategy by the far-right Values Voter Summit some years ago in order to attack LGBT rights more generally.",
        "like_count": 25,
        "published_at": "2023-10-06T20:30:19Z",
        "is_reply": true
      },
      {
        "id": "UgyQen0PHloIZXa63yF4AaABAg.9t5p-8whbSO9vY6nox0kTJ",
        "author": "@jhlfsc",
        "text": "@untitledanarchistseagullch1237  \nI'm genuinely not sure what's so odd about this?  I can't begin to get into the minds of why any right-wing organization does anything they do, but just because they were allegedly saying that trans issues should be separate from gay issues does not mean that the reasoning behind it is the same.\nIn my opinion, it's strange and honestly  less meaningful to lump two completely separate issues together.  \nSo far, it has only served to help people confuse and conflate issues of sexuality, sex and gender.\nAs I said....the fact that African-American, Jewish, Islamic, Latino, women (or any other at risk group) are specific groups with specific issues onto themselves does NOT mean they cannot individually stand in solidarity with other marginalized groups.  It just means that they are separate groups due to the specific nature of the issues each group faces individually.    Trying to force gay and trans issues together as if they were the same thing only serves to weaken those groups by enabling the general population to not recognize either as  individual people with individual issues at play in our society.",
        "like_count": 3,
        "published_at": "2023-10-06T21:12:22Z",
        "is_reply": true
      },
      {
        "id": "UgyQen0PHloIZXa63yF4AaABAg.9t5p-8whbSO9vYn3JvRJXO",
        "author": "@untitledanarchistseagullch1237",
        "text": "@jhlfscThe point is that attempting to exclude trans people from the LGBT community objectively harms both trans people and the LGBT community as a whole. That's why reactionaries have decided it's a good idea, and why your rationalisation really doesn't matter, except to help determine whether it comes from naivety or malice.\nAlso, it's not 'alleged'. Trying to get trans people excluded from the LGBT community is the explicit strategy of the far right at this point. That's why there are astroturf groups like the British 'LGB Alliance' (made up of media people, Tory politicians, and basically no LGBT people). That's why fascists were trying to get 'LGBwithoutTheT' trending a while back. \nIt turns out that attempting to undermine solidarity between marginalised people who share common enemies is bad, actually.",
        "like_count": 0,
        "published_at": "2023-10-07T03:30:21Z",
        "is_reply": true
      },
      {
        "id": "UgyQen0PHloIZXa63yF4AaABAg.9t5p-8whbSO9vYr_9JcOVp",
        "author": "@untitledanarchistseagullch1237",
        "text": "@ogBINARYGODThe point is that it got results for some people (easily the least marginalised segment of the LGBT community), whilst leaving everyone else high and dry, and it was promoted by people who constantly told working-class LGBT people, particularly trans people, that they'd eventually come back and help out, but actually threw the rest of the community under the bus at the first opportunity.",
        "like_count": 14,
        "published_at": "2023-10-07T04:09:48Z",
        "is_reply": true
      },
      {
        "id": "UgyQen0PHloIZXa63yF4AaABAg.9t5p-8whbSO9vZzuI5Ta5V",
        "author": "@jhlfsc",
        "text": "@untitledanarchistseagullch1237  \nSo explain to me how either gay or trans people are weaker because they aren't lumped in with African Americans??\nThe right will have zero qualms attacking gay and/or trans people regardless of which other groups we attempt to hide them behind no matter what. \nThe question isn't for fascists, it's for everyone else who cannot understand how or why these two groups are spoken about as one entity despite being completely different people with completely different issues.  \nJust look at how many potential or actual allies still conflate and confuse sexuality with gender.  This is a direct result of having both groups together as if they were completely interchangeable.\nI'm not sure how this is even remotely controversial?",
        "like_count": 0,
        "published_at": "2023-10-07T14:41:49Z",
        "is_reply": true
      },
      {
        "id": "UgyQen0PHloIZXa63yF4AaABAg.9t5p-8whbSO9v_bgrEroi6",
        "author": "@jhlfsc",
        "text": "@xBINARYGODx  \nThis guy is just being a flame thrower for the sake of being contrarian.  As if \"white\" people were the only ones in committed relationships who were left with no heath insurance, no inheritance, and virtually no legal rights as any other heterosexual couple of any class or background were afforded at baseline. 🙄",
        "like_count": 0,
        "published_at": "2023-10-07T20:29:31Z",
        "is_reply": true
      },
      {
        "id": "UgyQen0PHloIZXa63yF4AaABAg.9t5p-8whbSOA1okbcVJjvB",
        "author": "@JuguAbus",
        "text": "​@jhlfsc Obviously the LGB and the T can be completely different issues, but you cannot completely seperate something that can merge together somehow. Yes, there are straight trans people, but not every single trans person is going to be straight. I'm an example of that. Same as not every gay person being trans, but there are  gay people that are trans. When we're talking about the LGB or the T it is important to merge them in together cause they can overlap for people.\n\nI do not understand why you would say forcing gay and trans issues together would weaken those groups. People know that the T is not the same thing as the G, but that doesn't mean we can't have the T with everything else.",
        "like_count": 12,
        "published_at": "2024-04-04T17:15:49Z",
        "is_reply": true
      },
      {
        "id": "UgyQen0PHloIZXa63yF4AaABAg.9t5p-8whbSOA1pnX9aQwze",
        "author": "@jhlfsc",
        "text": "@JuguAbus \nFirst of all...I think you are way off base in your opinion about most people \"obviously knowing the difference between gay and trans\".  It does seem unvelievably ludicrious that anyone would confuse or conflate the two concepts, and yet people in our society do it CONSTANTLY.🤦\nI also do not understand what you mean by saying \"you cannot completely seperate something that can merge together somehow.\"?\nBeing black can \"merge\" with being gay, trans or both.  Being Jewish or Muslim can \"merge\" with being gay, trans or both.  Being Latino can \"merge\" with being gay, trans or both and yet all of these other identities are not lumped in with the LGBT acronym. That is why it is odd that those two distinct groups (which of course could overlap with each other, but no more so than with any other oppressed group) would be catagorized together under the same umbrella.\nIt's misleading and because they ARE all catagorized together as the same group, it is one of the main reasons why many people are still so ignorant about the specifics and obvious differences between them.",
        "like_count": 2,
        "published_at": "2024-04-05T03:00:31Z",
        "is_reply": true
      },
      {
        "id": "UgyQen0PHloIZXa63yF4AaABAg.9t5p-8whbSOA1ythoaJ8kj",
        "author": "@prozierozie5692",
        "text": "You dint speak for us ​@jhlfsc",
        "like_count": 10,
        "published_at": "2024-04-08T15:47:42Z",
        "is_reply": true
      },
      {
        "id": "UgyQen0PHloIZXa63yF4AaABAg.9t5p-8whbSOA1z1yDKKspC",
        "author": "@jhlfsc",
        "text": "@prozierozie5692 \nWho is \"us\"?",
        "like_count": 0,
        "published_at": "2024-04-08T17:08:35Z",
        "is_reply": true
      },
      {
        "id": "UgyQen0PHloIZXa63yF4AaABAg.9t5p-8whbSOA1z3WFqMua4",
        "author": "@prozierozie5692",
        "text": "@jhlfsc Queer people",
        "like_count": 0,
        "published_at": "2024-04-08T17:22:06Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwCt768-q5unvoPvv14AaABAg",
    "author": "@squisherking",
    "author_channel_id": "UChT2qhD-7EFRNEKKuLgrUtA",
    "text": "Its hard for me to not see the similarities in many of todays anti queer and anti trans laws to jim crow laws that used to exist.\n\nThanks Olay this convo was special. Youre doing amazing work!",
    "like_count": 49,
    "published_at": "2023-08-07T02:39:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzv6Qe0jn3eK-w3Rgl4AaABAg",
    "author": "@Jiminy-do-999",
    "author_channel_id": "UCtPJ7v09WSvkuG670nOe7jQ",
    "text": "So interesting what Hope said about conversations with other black people where they're going \"auntie\" and \"yes sister,\" then realizing she is trans and suddenly \"reneging on her Blackness and centering her queerness\" in order to dismiss the fact they were openly showing solidarity and agreement with her a moment before.",
    "like_count": 32,
    "published_at": "2023-10-06T16:37:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwrWChTOc4SN6OVNHd4AaABAg",
    "author": "@peacenllamas",
    "author_channel_id": "UCEbzfaMr5_tSwGJr0xSmPcQ",
    "text": "Yes yes yes!! people more upset with their placement in all these systems rather than upset with the systems themselves! 👏🏾",
    "like_count": 69,
    "published_at": "2023-08-06T16:02:24Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwrWChTOc4SN6OVNHd4AaABAg.9t4UqGsb9bh9t6XRrDjMWI",
        "author": "@moustik31",
        "text": "Some folks dont want to destroy the system, they are just upset, they personally dont have the same rights as a wm. I didnt have the words to describe this phenomenon but I have been trying to distance myself from this kind of limited activism.",
        "like_count": 12,
        "published_at": "2023-08-07T11:03:37Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugy6diOYFjbfst5MqC94AaABAg",
    "author": "@riddlorecvemipre",
    "author_channel_id": "UC5RF0nsAtI81Njs2_t1R5sQ",
    "text": "Thank you for having these important conversations. I am a 54 year old cis straight male, and most of my peers don’t get it. I have like 4 friends who will agree with you all. I’m trying my best to be a good ally, because I know as black people we are all in the same boat. And we need each other to survive in this hell hole. ✊🏿👊🏿💪🏿",
    "like_count": 50,
    "published_at": "2023-08-06T21:07:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwWnaFXZ2WF2RG8CyR4AaABAg",
    "author": "@moustik31",
    "author_channel_id": "UCs3hrOMRE6xz5vub68Lx0ww",
    "text": "I also \"laughed\" when Roe v Wade was repelled bec. I remember campaigning in 2015-16 around this very specific point but I was told, I was an \"alarmist\". \n\nIt has been my experience, that ww/w. queer people live in la-la-land, in terms of acknowledging how tenuous a civil rights legal gain is. Have they learned anything? I dont believe so.",
    "like_count": 36,
    "published_at": "2023-08-07T10:31:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyMkySsZUAsYT36D7F4AaABAg",
    "author": "@coreygot9818",
    "author_channel_id": "UC8W7pdY7E_gETFbJtRNN-gw",
    "text": "Sometimes I look at black ppl like wtf yall but this shit restores my faith.",
    "like_count": 18,
    "published_at": "2023-08-06T20:57:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy4cVDCd_TI5-2zQa54AaABAg",
    "author": "@darylgichui8908",
    "author_channel_id": "UCFKOQcMhT_i5czpgsxnf7Ew",
    "text": "This platform is so important",
    "like_count": 170,
    "published_at": "2023-08-06T08:11:53Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugy4cVDCd_TI5-2zQa54AaABAg.9t3e-1JxwJc9t4qah9xySv",
        "author": "@unclegumbald989",
        "text": "She hasn’t been in this space very long, and her presence & her contributions have already been **monumental** .  Can’t wait to see what she does next.",
        "like_count": 14,
        "published_at": "2023-08-06T19:21:15Z",
        "is_reply": true
      },
      {
        "id": "Ugy4cVDCd_TI5-2zQa54AaABAg.9t3e-1JxwJcA1ytrqPew4I",
        "author": "@prozierozie5692",
        "text": "@unclegumbald989 hiya there old friend",
        "like_count": 0,
        "published_at": "2024-04-08T15:49:04Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyFRkGq5CYPTKRgLOF4AaABAg",
    "author": "@CMDR_Lani",
    "author_channel_id": "UCuBZw8o0cb_9F0fsoZNzt-Q",
    "text": "Easily the best series of videos on YouTube right now. I can’t wait to see what you bring next, Olay! Thank you for this conversation and for introducing us to more queer Black voices.",
    "like_count": 38,
    "published_at": "2023-08-06T17:20:38Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzLYqHayGt6d8DtNUB4AaABAg",
    "author": "@lynnhettrick7588",
    "author_channel_id": "UCMcJxuzY1rtY5mlUIIqBO0w",
    "text": "My heart goes out to O'Shea's family and friends.",
    "like_count": 33,
    "published_at": "2023-08-06T21:13:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwVDJ80JoeKL7H9vNR4AaABAg",
    "author": "@lowtech42",
    "author_channel_id": "UCg8HeDYNAdvqB8--etqqtwg",
    "text": "I disagree!!! This was very revolutionary!!! I'm headed to Home Depot to buy a 6-pack of bricks right now!!!",
    "like_count": 25,
    "published_at": "2023-08-06T16:29:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwPwDWK7bREUwXY3rh4AaABAg",
    "author": "@sebastianmartinez-yc9tv",
    "author_channel_id": "UC5xb5olbdgf8vPj3HhPlFrw",
    "text": "\"A lawyer is a harm reductionist at best.\" And that's from the lawyer. 🎤",
    "like_count": 19,
    "published_at": "2023-08-06T20:13:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy0cR5qE-7TThXVfwd4AaABAg",
    "author": "@CCFelton94",
    "author_channel_id": "UCej0JH8aajP3KKFJpV2bCTA",
    "text": "Olay's wall of nerdness is the very best, most vibrant thing outside of her delivery 😂",
    "like_count": 26,
    "published_at": "2023-08-06T23:48:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwOb_dsM4y7Bdz1HTd4AaABAg",
    "author": "@YouTubeTeacherRemote",
    "author_channel_id": "UCTTPKPWchiOEfEL6zJ1MJQg",
    "text": "The Stonewell Riots was the beginning of the lgbtq movement in the 60s and not one black or brown person has been given credit for the movement when that is where it began.",
    "like_count": 5,
    "published_at": "2025-04-13T23:54:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyXgj7ZvzobIyg8dMt4AaABAg",
    "author": "@Jezabellebby",
    "author_channel_id": "UCBmvgKxaDzUdmUhWxvkTuyQ",
    "text": "The gay avengers LMAOOO",
    "like_count": 15,
    "published_at": "2023-08-06T17:44:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyOZ_0Gbo8pSop8y_h4AaABAg",
    "author": "@SuthernHippie",
    "author_channel_id": "UCqMfuuZgIOB6KzJj6YEkNAA",
    "text": "I can vividly remember in my early 20's being welcomed into the queer community through my co-worker and friend(I'm hetero). I loved that man, loved his partner, loved the love the community showed me. I never felt safer and more seen than I did when hanging with them and turning up in the club. Literally was given history lessons and dancing at the same time. Opened my mind to soooo much I never thought about. It shocks me that folks within the queer community ask me if I'm in the queer community. Just because I'm kind to them, and want to know them, know their humanity,  and genuinely ask questions to gain more perspective. I'm very much still and will always be learning, I'm checking anyone who talks crazy about the queer community. Especially my black queer fam, nahhhh because I'm definitely going toe to toe with that as*. Thank you for this convo!!",
    "like_count": 59,
    "published_at": "2023-08-06T16:11:28Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgyOZ_0Gbo8pSop8y_h4AaABAg.9t4VsZPlzW19t4fyzgukqU",
        "author": "@Indyawillis85",
        "text": "That's beautiful.",
        "like_count": 13,
        "published_at": "2023-08-06T17:48:27Z",
        "is_reply": true
      },
      {
        "id": "UgyOZ_0Gbo8pSop8y_h4AaABAg.9t4VsZPlzW19t5JS1tdYF3",
        "author": "@nitogorostizo16",
        "text": "I had literally the same experience, I'm not queer, but their community (specially trans people) always welcomed me with open arms and showed me empathy when no one elese would, they saved my life a couple of times too. \nAmigos pues.",
        "like_count": 13,
        "published_at": "2023-08-06T23:42:05Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugzv0XzgpksBQpCMJ-x4AaABAg",
    "author": "@taban6795",
    "author_channel_id": "UCs_tXRO369sDsmQ92l88wtw",
    "text": "Shahem… you predicted it right about citizenship",
    "like_count": 3,
    "published_at": "2025-01-31T12:42:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw5KA27qkRwUh5UsT94AaABAg",
    "author": "@Num1Rob23",
    "author_channel_id": "UCI8Iw5pIgczUmJJFMwafkKg",
    "text": "6 very beautiful souls that are speaking the truth! I appreciate you all! ❤",
    "like_count": 45,
    "published_at": "2023-08-06T16:14:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzdYIrE6IXMBegwx7B4AaABAg",
    "author": "@Rambithagr8",
    "author_channel_id": "UCin55jJrzsq_Lppzlk5pl7w",
    "text": "All rights are conditional under capitalism",
    "like_count": 26,
    "published_at": "2023-08-06T18:01:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzEm0_RntAh6PATj9h4AaABAg",
    "author": "@benjaminpeters6729",
    "author_channel_id": "UC2dEflvAXo4WlClm9XpJpkg",
    "text": "I had a terf quote maya angelou at me",
    "like_count": 11,
    "published_at": "2023-08-06T17:23:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwuJHD-olELyrzIjM94AaABAg",
    "author": "@Oh_ELCapitan",
    "author_channel_id": "UCC7fMnD4aXuQs_EiA5_giMg",
    "text": "\"I dont need anymore allys. I need an accomplice\"  i felt that cause we need people a wiling to bleed in the trenches rather then showing up at the partys doing their little performative dance",
    "like_count": 19,
    "published_at": "2023-08-06T16:52:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxe8GVnZOV5T518N7t4AaABAg",
    "author": "@bluegraypalette",
    "author_channel_id": "UCPREr6hCdLSQwn1l3Qaif_Q",
    "text": "\"Teaching people to oppose their place in the system rather than to oppose the system\" WOW. Less than 20 mins in and this panel is blowing my mind.  THANK YOU 🙏 The avengers we NEED!",
    "like_count": 23,
    "published_at": "2023-08-07T01:44:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyY1znJS0aowdU1Rzx4AaABAg",
    "author": "@coss1",
    "author_channel_id": "UCsQTy2NvND5JOFWFY4V4tdg",
    "text": "I’m a rapper and I constantly preach this from the hip-hop perspective. This entire discussion is incredibly refreshing to hear.",
    "like_count": 124,
    "published_at": "2023-08-06T15:29:46Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgyY1znJS0aowdU1Rzx4AaABAg.9t4R69b2suq9tCxeUUcr0J",
        "author": "@ErikWithBrain",
        "text": "Hell yeah, I love queer representation in hip hop. Le1f is one of my favs!",
        "like_count": 9,
        "published_at": "2023-08-09T22:56:52Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx5TbWm3de-8YiJKRN4AaABAg",
    "author": "@nirvanaheights",
    "author_channel_id": "UCcIbzizUzCtzJE8IxPgMOyA",
    "text": "‘I don’t need allies, I need accomplices’ 🔥 🔥 🔥 💯",
    "like_count": 18,
    "published_at": "2023-08-06T18:52:26Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz01YuwFa-X7ZPK1Y94AaABAg",
    "author": "@sebastianmartinez-yc9tv",
    "author_channel_id": "UC5xb5olbdgf8vPj3HhPlFrw",
    "text": "This conversation was so brilliant and wouldn't take place anywhere else.",
    "like_count": 21,
    "published_at": "2023-08-06T19:44:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzymgy5l24UhXD5QqR4AaABAg",
    "author": "@PxsDD",
    "author_channel_id": "UCgN-tsjz08MfSGOMXgACSVQ",
    "text": "This conversation about how to show up as very necessary and refreshing. I feel often that I’m not doing enough, but at the same time I have a family that I’m trying to support and raise up and teach and be a part of. The work that I do is in my every day life. My work is in being authentically and unabashedly me, and in learning what I can from spaces like this, staying up-to-date in the discourse, and bringing that knowledge to the people around me in my real life and calling out issues as I see them and letting people know where I stand. I think we do best to view ourselves as part of an ecosystem of revolution where all niches are valuable, from the each-one-teach-ones to the brick throwers. Great panel!",
    "like_count": 25,
    "published_at": "2023-08-06T22:25:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz0P4Ph4ZG560dtR6B4AaABAg",
    "author": "@famuns",
    "author_channel_id": "UCfe1l_hpBzamiChB0k_WTtg",
    "text": "\"I'm committed to the undoing of these desires so we can get to the revolution\". Whew! Da'shaun is so brilliant. This was an amazing panel.",
    "like_count": 21,
    "published_at": "2023-08-07T05:38:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxe8wgKe5HdQxP0UDt4AaABAg",
    "author": "@Prophet6000",
    "author_channel_id": "UCAkUmmw-JnJaPTzSEupxdbA",
    "text": "This was a good episode. Black Liberation includes everyone. I do think tons of other people's homophobia still comes being brought up in church.",
    "like_count": 19,
    "published_at": "2023-08-08T15:10:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzUSqUcMZGVw1iSEUZ4AaABAg",
    "author": "@Born-Liberated_EmpatheticWorld",
    "author_channel_id": "UCcEmb73iAq0Jpr1hW3ibKrA",
    "text": "Revolution is a process not a moment.",
    "like_count": 13,
    "published_at": "2023-08-06T17:57:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyAowmDjWbrQ_m4m1B4AaABAg",
    "author": "@daryljohnson6738",
    "author_channel_id": "UC4U6o_mCeGdFD7X-l_dSHbw",
    "text": "Love the idea of being an accomplice, not an ally.   Thank you for another great show.",
    "like_count": 75,
    "published_at": "2023-08-06T17:21:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz17qbQt1kirD9ML2R4AaABAg",
    "author": "@kemicollective4243",
    "author_channel_id": "UCO3HGKIAhBzw8YRTubMaiIQ",
    "text": "Wow! This was a sermon! Thank you for this tonic of a convo. Too many gems to list. Grateful for all the wonderful trans and queer people on here fighting for and as per usual leading our collective liberation, in this lifetime and the next. Thank you Olayemi for holding this space for this conversation, which I hope will spur action.\nEspecially the action of a mindset shift toward liberation. ✊🏾",
    "like_count": 25,
    "published_at": "2023-08-06T19:05:26Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy4EZhRf6HgNENbpHB4AaABAg",
    "author": "@unclegumbald989",
    "author_channel_id": "UC8BItNMXQYj_L8tje2vmh3A",
    "text": "What Shahem was saying in the beginning…. Kinda, YEAH.",
    "like_count": 8,
    "published_at": "2023-08-06T19:23:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyOp5Xyy3hnjCtYsDR4AaABAg",
    "author": "@Pyroarsonists",
    "author_channel_id": "UCuszelN_cQsk0aXF5J92MOA",
    "text": "\"the real revolutionaries are dead or political prisoners\" so powerful, but thank you to you all for doing the work that you do too. Very informative discussion",
    "like_count": 14,
    "published_at": "2023-08-08T23:50:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx8wJG4E3g_LSbafSF4AaABAg",
    "author": "@PxsDD",
    "author_channel_id": "UCgN-tsjz08MfSGOMXgACSVQ",
    "text": "To the conversation about phobia: They ARE afraid. They’re afraid of a world where queerness and transness are normalized. They’re afraid that their kids will be queer or trans. They’re afraid about what their proximity to queer and trans people says about them. And they’re too dense to realize that those feelings are rooted in fear.",
    "like_count": 514,
    "published_at": "2023-08-06T21:22:16Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "Ugx8wJG4E3g_LSbafSF4AaABAg.9t53S1RdNfo9t5o_Bq6fjw",
        "author": "@untitledanarchistseagullch1237",
        "text": "So much of the far-right shit loss that's been going on over the past few decades amounts to the fact that, in the US, they've gone from controlling basically 100 % of the ideological institutions to controlling 95 % and they're terrified that maybe, in ten years' time, they might lose another 5 %. It's an all-or-nothing mentality. If they don't control everything, they feel like they control nothing at all (if only)",
        "like_count": 0,
        "published_at": "2023-08-07T04:22:49Z",
        "is_reply": true
      },
      {
        "id": "Ugx8wJG4E3g_LSbafSF4AaABAg.9t53S1RdNfo9tccN5AQXnL",
        "author": "@draco_nyxxie",
        "text": "FACTS 💯💯💯",
        "like_count": 26,
        "published_at": "2023-08-20T07:30:20Z",
        "is_reply": true
      },
      {
        "id": "Ugx8wJG4E3g_LSbafSF4AaABAg.9t53S1RdNfoA2KFCrvTbOh",
        "author": "@kojoyamoah414",
        "text": "This is the root of all of it. Younhot the nail right on the head.",
        "like_count": 18,
        "published_at": "2024-04-17T08:07:37Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx3L48ra0ZjPRa5VrJ4AaABAg",
    "author": "@sunyavadin",
    "author_channel_id": "UCt7XwiQe5y-cnqGC8-ATf1Q",
    "text": "Their tactics never really change, just look at King Mwanga II and how white christian missionaries used homophobia to undermine him and establish their colonial power in the region.",
    "like_count": 19,
    "published_at": "2023-08-06T13:25:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwm4Q41lOvnfXt3ZWR4AaABAg",
    "author": "@RblastonYT",
    "author_channel_id": "UCbNRzVNCOyrR-c_41p5XaqA",
    "text": "As someone who deals with ADHD, I needed this talk because it makes me feel good when I call out ableism around me. The queer community is important to me because of how it made it easier to speak up for myself in a non-toxic way. \n\nSo I’ll stand up for other folk who are also suffering in silence and spread creativity. Inflammatory I know but I know the topics are worthwhile to spread.",
    "like_count": 53,
    "published_at": "2023-08-06T16:52:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx6J39dtfGFNvH_Ukt4AaABAg",
    "author": "@Gedi3000",
    "author_channel_id": "UCYL11O-lFiwbHsIyqQkqWDA",
    "text": "Great conversation. I like that you made the point that we’re taught to; “not oppose the system, but oppose our place in the system.” And that ideology coupled with policy is what allows queer lives to be othered and therefore deemed valueless.",
    "like_count": 39,
    "published_at": "2023-08-06T19:10:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxUd9YoLnILIU6U3Zh4AaABAg",
    "author": "@feistygheisty",
    "author_channel_id": "UCADBP_EvI184j2XsNfDpOpA",
    "text": "Oh my god when you said \"living visibly as queer is revolutionary in and of itself\" I almost cried. I know it's partly cope but it is also partially true. I've had that feeling since I came to terms with being trans that the most basic revolutionary act i can do is live as long as possible. To outlive the hateful SOBs who want me to kill myself. Every day I don't is a blow against them.",
    "like_count": 18,
    "published_at": "2023-08-08T00:41:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwUCoxZy8FRPkIa-cR4AaABAg",
    "author": "@rudetuesday",
    "author_channel_id": "UCof66rvb8qukotHzgoabweA",
    "text": "This conversation fed me. I really do feel like listening to everyone helped me put some things together. Appreciative, as always.",
    "like_count": 15,
    "published_at": "2023-08-06T17:43:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzQhvapZ3e8JE4vGgZ4AaABAg",
    "author": "@islash09",
    "author_channel_id": "UCIIPjIUkrbZnx1AsRk009mg",
    "text": "this was soo good as  mexican trans man like a lot of what you said really touched me and there was a lot of things like really was talked about and i learned a ton and feel like a lot of wisdom was shared that i had not been exposed too. I hope to see more of this panel!",
    "like_count": 24,
    "published_at": "2023-08-06T18:03:48Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzQhvapZ3e8JE4vGgZ4AaABAg.9t4hjKTDbt39t5JcIpjE_H",
        "author": "@nitogorostizo16",
        "text": "Mexican trans man?, hey, bien ahí carnal, ojalá estés bien",
        "like_count": 5,
        "published_at": "2023-08-06T23:43:37Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzONaiOOrNUA7_PbGR4AaABAg",
    "author": "@ForeignManinaForeignLand",
    "author_channel_id": "UC1qBXNO9sM4xV0wKC0_SlYQ",
    "text": "YT did me dirty! A whole two videos drop and ain a notification or nuttin smt. As I watch!",
    "like_count": 22,
    "published_at": "2023-08-07T21:27:42Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzONaiOOrNUA7_PbGR4AaABAg.9t7drc3R2T39t8VsmUL0H_",
        "author": "@olurinatti",
        "text": "YouTube be tryna play us 😂",
        "like_count": 10,
        "published_at": "2023-08-08T05:28:27Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw7nZun_aQWP9_naEJ4AaABAg",
    "author": "@EastWindCommunity1973",
    "author_channel_id": "UCuDxOs6jXvH63pinOVpypHA",
    "text": "Wow, I don't think I've seen a quality panel online ... ever, until now?!",
    "like_count": 9,
    "published_at": "2023-08-06T16:31:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzsXzjBxRJpgDsDLOt4AaABAg",
    "author": "@Ade_are_you_ok",
    "author_channel_id": "UCkgivNiaD1mdtB0AVprhfdg",
    "text": "29:00 everything Hope said is so true, as a black queer man living in the uk, I have to deal with that all the time.",
    "like_count": 9,
    "published_at": "2023-08-07T14:55:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwtlbDbnW2JbDmPQ0d4AaABAg",
    "author": "@JessieGender1",
    "author_channel_id": "UChBcQ24GbjS5xCXm3K4e8-A",
    "text": "Thank you all for this convo and thank you Olay for giving me new folks tonfollowb",
    "like_count": 24,
    "published_at": "2023-08-08T20:08:35Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwtlbDbnW2JbDmPQ0d4AaABAg.9tA4b3ap_BI9tA62S0onMa",
        "author": "@olurinatti",
        "text": "💗",
        "like_count": 8,
        "published_at": "2023-08-08T20:21:11Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwiRNz-pjEHD6zfnh94AaABAg",
    "author": "@ThePublicHealthHarlot",
    "author_channel_id": "UCW-fRNWsr0t3j01xgTI69vg",
    "text": "\"...rather than be Othered, they'd rather fall in line with something they don't even agree with.\"  --Hope     !!!",
    "like_count": 9,
    "published_at": "2023-08-09T19:55:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugya-tVDac5vWOOl4FV4AaABAg",
    "author": "@AE1P",
    "author_channel_id": "UCX4ZRK3BJBnNI_r0cksuxoQ",
    "text": "This conversation is everything. And the last third or so was so wholesome I cried 😂💞",
    "like_count": 11,
    "published_at": "2023-08-06T17:55:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyJboDVklw9U8tGvIh4AaABAg",
    "author": "@finnmccool7543",
    "author_channel_id": "UCN_X-ch545hlBN_0omtSatA",
    "text": "So much information... TOO much information for just one episode. The world needs a part II to this. \nHope unleashed! 🧨💥🔥",
    "like_count": 13,
    "published_at": "2023-08-06T20:54:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz7lpqp1oF-SUSkMWx4AaABAg",
    "author": "@Ashy_Feet",
    "author_channel_id": "UCoITaCuVOCwdKhBV--YrFfQ",
    "text": "\"People hate they're place in the system... but they cool with the system \" everybody wanna shit on somebody.",
    "like_count": 6,
    "published_at": "2023-08-07T21:39:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzk9MyKx5jlyFMvUA14AaABAg",
    "author": "@Dimi374",
    "author_channel_id": "UCn6oYs-pBTiiZ_HyCw0asPQ",
    "text": "Every time a black channel  or it’s commentators display homophobia, transphobia, etc.\nI copy and paste this video to their comments \nThank you!❤🙏🏽",
    "like_count": 19,
    "published_at": "2023-08-11T22:30:09Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy0zcAIK2Z1mIVM2Ip4AaABAg",
    "author": "@Mariposa-11-2007",
    "author_channel_id": "UCzSx3HJg7jSy1uVcQJ9YuEw",
    "text": "Thank you, again, Olay and Friends! This panel is EVERYTHING. I need to follow all y'all. I've been following Hope 🦋💕",
    "like_count": 12,
    "published_at": "2023-08-07T02:02:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwyYCqvYZ2hh2lF8i94AaABAg",
    "author": "@Lordofthefliess",
    "author_channel_id": "UCjX8A6m5VTbEsAeHqAYkTbw",
    "text": "I’m throwing the brick at the churches. \n\nI literally fist pumped so hard. I’ve been feeling this since childhood and am so happy to hear another black person saying this. ❤❤❤❤",
    "like_count": 83,
    "published_at": "2023-08-07T13:05:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxzIaQMVq5zPqc8oal4AaABAg",
    "author": "@WolvMedia_",
    "author_channel_id": "UCQ_HZkVq3RTGLMlFpGF75YQ",
    "text": "Holy shit I’m on fire inside after this discussion 🔥🔥🔥🔥 \nThis was such an amazing conversation thank you so much for hosting Olay",
    "like_count": 13,
    "published_at": "2023-08-06T21:48:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxBsGNSg4A3rztgmM94AaABAg",
    "author": "@mjolden",
    "author_channel_id": "UC_Wa1qqDte2fXN0fYd5QT2w",
    "text": "This video is a year old as I’m watching this, and as I’m scrolling on FB on company time, I see a post that Dr. Umar Johnson is against his daughter being “drafted into the Rainbow Army”… 🤦🏾‍♂️",
    "like_count": 3,
    "published_at": "2025-04-01T15:24:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyBJWh0EU5M5MZ86i94AaABAg",
    "author": "@jonnielgreenidge4739",
    "author_channel_id": "UCwyMrBXycLad_aQbuGuObyQ",
    "text": "One thing that Dashaun will do is make me really think out of my comfort zone and that speech he said at the end really opened my eyes",
    "like_count": 4,
    "published_at": "2024-05-22T00:01:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzRER5kbAvbxvtRsyV4AaABAg",
    "author": "@PxsDD",
    "author_channel_id": "UCgN-tsjz08MfSGOMXgACSVQ",
    "text": "Christina said it ALL at 18 minutes!",
    "like_count": 11,
    "published_at": "2023-08-06T21:08:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzz8m5Y0pjL1WgWY8V4AaABAg",
    "author": "@tylerhackner9731",
    "author_channel_id": "UCbwlrgLNVjnejJT6NKWfzMQ",
    "text": "Thank you for these discussions",
    "like_count": 13,
    "published_at": "2023-08-06T15:22:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz4oRklQe-nDqaJ4iR4AaABAg",
    "author": "@varg6663",
    "author_channel_id": "UCGeVg7bXD4gx_YcS_G-nhWA",
    "text": "OMG SHAHEM!!! I love them, so excited to see them on the show!",
    "like_count": 13,
    "published_at": "2023-08-06T04:38:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxV4yYJWhOs-eunPeN4AaABAg",
    "author": "@raymond8807",
    "author_channel_id": "UCWH6giqLDPgdKM8RB_lQ34g",
    "text": "THIS is the type of conversation you don’t hear on “other” progressive platforms…and no shade because I love everyone but it’s the truth. That’s why black/brown leftist spaces are so important. Thank you for this beautifully illuminating discussion. 👏🏽👏🏽",
    "like_count": 15,
    "published_at": "2023-08-07T21:20:25Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz3yJe-736Qp3dmi_p4AaABAg",
    "author": "@Autistic_Goblin",
    "author_channel_id": "UCm24nWUFZQB8aXbUmzXDivg",
    "text": "I'm just doing my part to amplify y'all's voices by engaging. Continue to spread the gospel of revolution. Another great conversation with six beautiful souls, thank you, Olay. You are a priceless pillar of your community. ❤",
    "like_count": 15,
    "published_at": "2023-08-07T02:16:33Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx41lTXABMI6zW_0BR4AaABAg",
    "author": "@sr-xv4hi",
    "author_channel_id": "UCwjytN0vxk4ZaWK8QIpdRmw",
    "text": "Great show Olay and friends.😍❤🌈Miss you so much in Leftist Mafia but understand you. Your perspective is always on point and needed it. ❤❤❤",
    "like_count": 16,
    "published_at": "2023-08-06T18:32:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzd8GtQuJ56_2X2M-Z4AaABAg",
    "author": "@jessicamartone5345",
    "author_channel_id": "UCxh_Jje6zjWcoTUEcuTa8NA",
    "text": "Thank you for all of the discussions you are facilitating . I have “ wow “ moments every time.",
    "like_count": 8,
    "published_at": "2023-08-06T22:27:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxChLyf2JoDCwEaDCt4AaABAg",
    "author": "@chronosi",
    "author_channel_id": "UCNA4zwKrSbYucAhtKPLYl1w",
    "text": "Thanks for the thoughtful discussion, as always :)",
    "like_count": 13,
    "published_at": "2023-08-06T15:14:34Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwbsYRuIg8sp2gWni54AaABAg",
    "author": "@human_plant",
    "author_channel_id": "UCOshuh4pRMSxbC37UQYor_A",
    "text": "Shahem!!! Cool to see them in a long form video. They always have such smart and insightful things to say on TikTok.",
    "like_count": 9,
    "published_at": "2023-08-06T16:55:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxfJZR79fmK5AlOLEd4AaABAg",
    "author": "@RobertSpitzer",
    "author_channel_id": "UCNxRI9YJi4jVhDuTHnSCqeA",
    "text": "What a fantastic way to start off my Sunday!!!",
    "like_count": 11,
    "published_at": "2023-08-06T15:02:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw-NpJuNjj-Z81GZbp4AaABAg",
    "author": "@idigamstudios7463",
    "author_channel_id": "UCmAD6A2kw7xo6-tYgWSJcqA",
    "text": "The pure joy and good humor here is so refreshing. None of you make light of the fight we're in, but this is the most I've laughed watching a video I feel like I've learned something in what feels like so long. Thank you for your work and thank you to your guests!",
    "like_count": 11,
    "published_at": "2023-08-06T18:02:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyVrWcFDS6QEKkIE0B4AaABAg",
    "author": "@AsterInDis",
    "author_channel_id": "UCRkNEmaSP0yztFy9vO-_wGQ",
    "text": "Queer people & black people need to be in community with each other, absolutely. We need to have each others' backs.",
    "like_count": 131,
    "published_at": "2023-08-06T22:04:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx52r5iId50wKW-R5B4AaABAg",
    "author": "@fixieroy",
    "author_channel_id": "UCHrN4SvloUOtgl2gkmhxsgQ",
    "text": "I never thought the idea of a Black Queer person being a revolutionary.",
    "like_count": 6,
    "published_at": "2023-08-24T06:41:20Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzFjuWbVOBTr89b-NV4AaABAg",
    "author": "@AuntyKsTarot",
    "author_channel_id": "UCXqUSMxGp_vJCPvGzzwVH1g",
    "text": "I missed the live but this was so amazing.",
    "like_count": 6,
    "published_at": "2023-08-06T18:20:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxLccgdTfL8-zlVjyR4AaABAg",
    "author": "@bell_knight",
    "author_channel_id": "UCVp_1vVhq8v6S-PxGdbQs0A",
    "text": "Olay always curates my favorite crossover events",
    "like_count": 3,
    "published_at": "2024-06-19T18:50:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxMSc4aEtx3H2s59cZ4AaABAg",
    "author": "@briany2456",
    "author_channel_id": "UCltrfIHBbOkPc_SyxS1hA3A",
    "text": "As a white cis lghtbqia person I have been feeling the way the panel was speaking about since I was a baby queer person. Mind you I am now 49yo and there is still a lot of work that needs to be done. BTW I was raised by three women.",
    "like_count": 12,
    "published_at": "2023-08-06T18:04:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxNlc03ENh2BoLTrAB4AaABAg",
    "author": "@JothanGurr",
    "author_channel_id": "UCQGR5s-kZilxITlP5I3jlqg",
    "text": "This discussion was everything I needed and more! You all are so brilliant!!! I’ve never been so enraged and informed at the same from how stark this group laid bare the horror we are living in. \nCould I ask if there is any plans to have a black disabled panel at some point. Just because that’s another topic that I think could benifit from this kind of platform",
    "like_count": 10,
    "published_at": "2023-08-06T18:20:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxVkrtffyJkFvLAsUR4AaABAg",
    "author": "@cydwoq1234",
    "author_channel_id": "UCOmpIUPLjpOcsRf7avKqu8A",
    "text": "So enjoyed this conversation. 🫶🏾💯",
    "like_count": 4,
    "published_at": "2023-11-21T01:32:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwb5ZFwjqTLUzdvyQ14AaABAg",
    "author": "@kuyahdaemon",
    "author_channel_id": "UCbZ7cRyUJxrGGBXCCzJKm9w",
    "text": "Olay you're so incredible at moderating this conversation. I've always acknowledged that the freedoms I can experience as a gay Asian man have a through line that goes all the way back to black trans liberation. They have been fighting for freedom for ALL LGBTQIA+ folks. \n\nGreat conversation, you guys really put out all out on the line. Also Hope's words are so powerful, she was spitting absolute truth! Thank you for extending this conversation past a singular Pride month. Much love!",
    "like_count": 10,
    "published_at": "2023-08-13T06:27:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzYpOOjA7THVrAKrYF4AaABAg",
    "author": "@ongwehias7580",
    "author_channel_id": "UCeg8kimKkvQNUtiwFvuu4Tw",
    "text": "hearing affirmation of observations of our mutual oppressors and colonizers is valuable emotionally and confirmation of its veracity when our paths to the same conclusions were experienced in isolation from one another. its like how science works because you can replicate the results of the experiment in multiple places, changing hypothesis to theory.",
    "like_count": 7,
    "published_at": "2023-08-06T21:57:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxJ5QTsZl5gF_Fmsc54AaABAg",
    "author": "@Bunnie707",
    "author_channel_id": "UCvEUih-u2SBEQ24ux05hMxQ",
    "text": "I just wanna add that JC's work has helped me feel connected to community in a time in which I would otherwise feel disconnected. BLACK QUEER STORYTELLING CHANGES LIVES FOR THE BETTER 😊❤",
    "like_count": 11,
    "published_at": "2023-08-07T14:58:59Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwtiHZ42hjFpNZ2y-x4AaABAg",
    "author": "@mrbubbies_",
    "author_channel_id": "UCTZWmmR79UzaNwp32ToLJmA",
    "text": "This is stuff I been tryna tell other caribbean people, we are queer by default and we’re treated as such, there isn’t a candles hope in the 9th ring of hell that we ever get to assimilate into ytness in any way",
    "like_count": 67,
    "published_at": "2023-08-06T17:34:38Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwtiHZ42hjFpNZ2y-x4AaABAg.9t4eOlhbvTPA40uXpmhlq5",
        "author": "@roamakes",
        "text": "😂",
        "like_count": 2,
        "published_at": "2024-05-29T12:55:27Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwMR7W2DLdtgONpJDx4AaABAg",
    "author": "@proanuubis2546",
    "author_channel_id": "UCpbtnjtq4auufeKPX6Z7cww",
    "text": "This was honestly just on my mind, was arguing with my mother(religious progressive) about the importance of supporting trans rights in that it is tied to equal rights.\n I hope Conservatism/Anti-woke isn't taking hold with her age and comfort; have to share this discussion it was powerful and informative.",
    "like_count": 11,
    "published_at": "2023-08-06T21:39:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwaxLMT1bNVU_9MutV4AaABAg",
    "author": "@shawndomenico5830",
    "author_channel_id": "UCaHPq4HiwG8SjKkfDvGBc-g",
    "text": "Thanks Olay for bringing this panel together.  Great to hear from these Black queer & trans voices.",
    "like_count": 8,
    "published_at": "2023-08-07T00:22:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzwNagCgsngq_Hj9q54AaABAg",
    "author": "@AddiRockART",
    "author_channel_id": "UC8SO0vPYLOVtqDFxmjC0Ffw",
    "text": "As a Latino, queer, trans artist, I’ve been called hyperbolic and insane and crazy for having severe concerns since Obamas term was going to end. And now years later, people who had acquired privilege and are now being attacked are so shocked and disappointed— as a Latino, the attacks never stopped. The black community in Baltimore where I’m from, never stopped working, and sure as heck never stopped being barraged.",
    "like_count": 70,
    "published_at": "2023-08-26T00:37:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzgYZPhbTIj9zk8Uhh4AaABAg",
    "author": "@hypnoamber3248",
    "author_channel_id": "UCon-5xZrx95P0jzq1l2BM-g",
    "text": "Olay & Friends thank you!  This was such an amazing episode, so very important. I was happy to see Hope and Da'Shaun on the panel today. And what Da'Shaun said about revolutionary preparation stage at the end really got me thinking and I needed that. \n\nAgain thank you to everyone on the panel today.",
    "like_count": 10,
    "published_at": "2023-08-06T22:10:20Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxYsYMIKkSgr8Y0JU14AaABAg",
    "author": "@StAmander",
    "author_channel_id": "UCh15hBacswkPiOwB03vLlmw",
    "text": "I’m white, trans, queer and disabled. There’s so many truths within this, not just the dynamic between queerness and blackness, especially for those of us who do not live in that intersection, but a lot of these themes in these many truths can be found in other marginalized groups and the dynamics between them. Like when the white cis queers were celebrating marriage equality or whatever, those of us who are disabled and low income were like, “Thats nice you can get married, but we cannot if we don’t want to fall deeper into poverty, lose our homes, our medical care and subsequently our lives.”  Like I don’t need Allies who demand cookies and to be coddled (looking at specific media group who went centrist lately), I need accomplices who will not only do the work by putting their bodies on the line but to ultimately listen to us (or whatever marginalized group) and to ask us and listen to us (or whichever marginalized group) first and above others. I don’t want to be lectured by an ally about “optics” when they cannot understand the “optics” of when an ally repeatedly speaks over the majority of the marginalized people and attack them and those who are putting the work. Like I know what the optics are, I live it every fucking day; I just want to have equal rights and have Justice for all of the injustices we have faced, not to win some political bullshit. I’m glad I watched it, because even though this is more towards POC, it does help reaffirm my need to be in solidarity with POC and to work harder. The work isn’t done, we just started.",
    "like_count": 118,
    "published_at": "2023-08-07T01:20:49Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgxYsYMIKkSgr8Y0JU14AaABAg.9t5Uk9e4MDo9t6_U7We0gY",
        "author": "@Robstafarian",
        "text": "I feel you; I am disabled, white, and nonbinary (in chronological order). I am nearly 40, and I am beyond done with people asking me: \"Don't you want to get married?\"  All I have left is: \"What makes you think I am allowed?\"  Shout out to my brother a few years ago saying to me: \"You sound like a minority.\" 💀",
        "like_count": 18,
        "published_at": "2023-08-07T11:30:09Z",
        "is_reply": true
      },
      {
        "id": "UgxYsYMIKkSgr8Y0JU14AaABAg.9t5Uk9e4MDo9t6k-8q3YW2",
        "author": "@StAmander",
        "text": "@Robstafarian  yeah it’s ridiculous. I deal with multiple disabilities, and right now the most debilitating one is the chronic pain I deal with. I didn’t have an actual choice on whether or not I will have back surgery, because if I didn’t comply pain management wouldn’t help me, and now I live with that fear since they want me to get a Neuro stimulation implant because the back surgery didn’t help with the pain. So now, I deal with the judgement addicts face on top of being denied medical treatment for the pain. It was easy in the beginning for me to be furious at the addicts, but I’ve come to realize they are also dealing with chronic pain, it’s just a psychological pain rather than a physical or neurological pain, but it’s still pain, nonetheless and like chronic pain patient like myself, pharmaceutical grade medications like methadone and other opioids prescribed under the care of a physician is necessary, it is our medical treatment. They deserve to be humanized just as much as I do. I have to be in solidarity with them, because we are both throwing the bricks at the same people to borrow an analogy in this video. It just sucks to be a minority or sound like a minority, nobody wants to be like that.",
        "like_count": 11,
        "published_at": "2023-08-07T13:02:02Z",
        "is_reply": true
      },
      {
        "id": "UgxYsYMIKkSgr8Y0JU14AaABAg.9t5Uk9e4MDo9t7hXQxu4OD",
        "author": "@Robstafarian",
        "text": "@StAmander I do not mind being a minority: the oppression is the problem.",
        "like_count": 17,
        "published_at": "2023-08-07T21:59:45Z",
        "is_reply": true
      },
      {
        "id": "UgxYsYMIKkSgr8Y0JU14AaABAg.9t5Uk9e4MDo9t8_IWk90E_",
        "author": "@StAmander",
        "text": "@Robstafarian  that is it. That is exactly it.",
        "like_count": 12,
        "published_at": "2023-08-08T06:07:03Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyXab0emgNkBaNoGBp4AaABAg",
    "author": "@Elena-gj6ow",
    "author_channel_id": "UCDEutOtsfCWe_YYFq9EcXzg",
    "text": "Thank all of you for being you!(:",
    "like_count": 8,
    "published_at": "2023-08-07T06:04:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxQ86cfk8QnQ2JRMaB4AaABAg",
    "author": "@fakename1656",
    "author_channel_id": "UCm5V2f0NtxICfuXWUp3eIvA",
    "text": "Dunno how your vidoes keep getting more deep and deep. Loving it",
    "like_count": 7,
    "published_at": "2023-08-06T23:21:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyqRwbVgp-ZlbgTwLh4AaABAg",
    "author": "@Dimi374",
    "author_channel_id": "UCn6oYs-pBTiiZ_HyCw0asPQ",
    "text": "This platform should be three times a week at specific time.\nThere are so many people who are on the same page but can’t find y’all.❤\n\nPlease please this is so important!!❤🙏🏽",
    "like_count": 6,
    "published_at": "2023-08-09T19:49:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzTFf5iLHQ5f8YdTYd4AaABAg",
    "author": "@bagelwbutter9605",
    "author_channel_id": "UCyO3xtHwxpLLUbX-lpAtiWA",
    "text": "Another thing. To those that are hesitant to say that homophobia is an anti-black institution, how can you be homophobic when the religious doctrine you’re using to justify homophobia isn’t the religion of your ancestors?? \n\nSure native religions and religions in Africa may not have been objectively queer inclusive but contemporary homophobia is rooted in Christianity.",
    "like_count": 24,
    "published_at": "2023-08-07T15:55:27Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzTFf5iLHQ5f8YdTYd4AaABAg.9t72qAyOWYbA1piBZ0UldN",
        "author": "@JLeezy95",
        "text": "What about Islam as many descendants of West Africa were",
        "like_count": 2,
        "published_at": "2024-04-05T02:13:53Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxXeSzxpN5Zs6gFaIB4AaABAg",
    "author": "@KwesiRaphael",
    "author_channel_id": "UCxKs2GYKHGrwC5w4jtNJOvA",
    "text": "Oh wow. I loved this conversation.\nThanks for having it on camera.",
    "like_count": 6,
    "published_at": "2023-08-07T17:49:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz3X7UrMfo_OTqJJyJ4AaABAg",
    "author": "@GalihadVancouver",
    "author_channel_id": "UCamBDiWbJnRszxTr3kOePZA",
    "text": "This has to be my favorite video of yours so far! As a queer person, I also wasn't surprised when the ruling came down because I knew they were trying to do this from day one, and now they're finally succeeding. Still, hearing other queer people discuss this issue made me feel less alone in this fight. Hearing you all talk has also solidified in my mind, the importance of lifting up black queer voices as they are the first ones to fight, and they are the first to die, unfortunately. It is time we change that. Thank you for all you do Olay ❤\n\nP.s. thank you for giving a tribute to O'Shae Sibley, I haven't seen nearly enough people talk about it. Also, to my knowledge, his name was spelled O'Shae, but I could be wrong.",
    "like_count": 15,
    "published_at": "2023-08-07T00:24:02Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugz3X7UrMfo_OTqJJyJ4AaABAg.9t5OFEWVqZi9t6XtK84QAy",
        "author": "@moustik31",
        "text": "Yes. It's not like they were hiding anything. \n🙃",
        "like_count": 2,
        "published_at": "2023-08-07T11:07:31Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwoTAx3SUNa3LHEC1h4AaABAg",
    "author": "@Ancusohm",
    "author_channel_id": "UCJjHt-oBdwfmRgQZblSA_yw",
    "text": "Great discussion! Thank you for making this video.",
    "like_count": 9,
    "published_at": "2023-08-06T16:16:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw6UIPp3Ssh6jyPExJ4AaABAg",
    "author": "@Kadazia",
    "author_channel_id": "UCgsGULV1CRSEqwDV7wdMY1A",
    "text": "I sometimes feel how JC expressed he feels. But as a Black, queer, disabled as fuck non-binary womxn, who struggles with depression, anxiety, and past suicide attempts my ability and willingness to keep on living is revolutionary. And I appreciate the work y’all do on the ground and online on the behalf of people like myself! Y’all the illest fr fr",
    "like_count": 2,
    "published_at": "2024-06-24T08:57:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw_vUu4d7S_yINGN_14AaABAg",
    "author": "@valentinasoundoutloud2538",
    "author_channel_id": "UCITx4RPNPFH_uh933hdWETw",
    "text": "Thank you for the discourse",
    "like_count": 4,
    "published_at": "2023-08-07T00:44:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxh9XYvX74l3Ms5WpV4AaABAg",
    "author": "@seafx",
    "author_channel_id": "UCGtGRK-8cAk8PlJzOhBYBzQ",
    "text": "Straight cis black man here. Hope was COOKING.",
    "like_count": 123,
    "published_at": "2023-08-06T17:59:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx4Qblwf79wl-aU6N54AaABAg",
    "author": "@adamschilling7140",
    "author_channel_id": "UCmlndejFYlCRvN0ftKX9T0g",
    "text": "I love your channel so much. I wish this is what public discourse looked like in general...",
    "like_count": 3,
    "published_at": "2024-04-25T10:42:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx7cyXBNW-MpRBspup4AaABAg",
    "author": "@FloridaQueer",
    "author_channel_id": "UC8Zw7nfNGF_IjAWc60T-orA",
    "text": "Listening, thanks y'all for the analysis.",
    "like_count": 4,
    "published_at": "2023-08-06T19:14:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz371Hzw6dd-0CsdP54AaABAg",
    "author": "@SSDJ816",
    "author_channel_id": "UCQU_31ilctpjgdK6-LeOftQ",
    "text": "Jahad!!!",
    "like_count": 12,
    "published_at": "2023-08-06T04:42:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwxUjZiRNaN0NE0dth4AaABAg",
    "author": "@javawatson",
    "author_channel_id": "UCL_zjSLHUKOK16-USUtm79Q",
    "text": "Omgosh thank you so much for this Olay.This was a boisterous,blunt,brilliant and bombastic conversation ❤",
    "like_count": 5,
    "published_at": "2023-08-07T08:42:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxNZV2nmEj1S0w7Pht4AaABAg",
    "author": "@angiem6383",
    "author_channel_id": "UC-IHLDAa2Xzy5WmujT1jfGg",
    "text": "Thank you Olay for gathering together this lovely panel. I first saw u on the Leftist Mafia & subscribed to you channel & eagerly await your videos. I'm sorry for all the psychic pain u had to endure while dealing w/ the crappy, (incorrectly) judgement BS that maliciously came (& comes) your way. Thank u for all the knowledge & experiences u shared w/us. Do u know if there's a clip of your experience of dealing our immigration system? I would like to share it. You are sorely missed.\nThanks to the panelists for sharing their experience and expertise in this topic.\nRIP O'shea Sibley. I'm sorry our culture /.   Society couldn't let you and your message flourish, a message you should have never had to take on as a burden. Thank you for your work and your joy.",
    "like_count": 7,
    "published_at": "2023-08-06T20:58:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxvNry-ERGKCYL36lB4AaABAg",
    "author": "@jackiemorris3750",
    "author_channel_id": "UC_NMn8eqVFWDxGiaZicsXUw",
    "text": "I love the conversation towards the end on how you show up. As someone who is in a town that believes heavily in black people showing up for movements in one kind of way(Charlottesville VA) I have always felt inadequate in how I move. Some avenues for me, don’t feel organic. Aug 11, 12th 2017 (look up what happened in cville that day if you don’t know) were regular work days for me. But I carry a guilt that I didn’t show up enough. That I wasn’t outside. That I carried fear to be outside. Even when I necessarily didn’t need to be.\n\nI say all this to say, Hope spoke so passionately and eloquently to the fact that work has been done, and sustaining work is now the move. I’m still young and I have to remind myself I am still acquiring skills to contribute to the work. But also, I believe that everyone has a role they can play that suits them in this movement. When playing mafia, everybody can’t be mafia members. Somebody has to be a mayor, and a doctor, and so forth. \n\nSo thank you for saying that part too. Cause that cripples the black folks that are acknowledging realities, having difficult conversations, aaannnddd trying to maintain a sense of joy in their lives. All while dealing with the bullshit.",
    "like_count": 7,
    "published_at": "2023-08-15T18:48:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyIu-c5wjFa6JVGm514AaABAg",
    "author": "@imanih.8970",
    "author_channel_id": "UC3UAhmKtT_29DPutJCXbc5w",
    "text": "Love love love this conversation!💕👏🏾",
    "like_count": 5,
    "published_at": "2023-08-07T09:14:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwbzqOzRQ1qfglwaPJ4AaABAg",
    "author": "@regan2010",
    "author_channel_id": "UCXBMQkqwVKcLwU4MCZTMJOg",
    "text": "Thank you for presenting this discussion. Peace",
    "like_count": 7,
    "published_at": "2023-08-06T15:25:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyC6CUeF7QIdVRc8sB4AaABAg",
    "author": "@writtenbyiyanna",
    "author_channel_id": "UCQSMzfnX4JLD0Ar0SnfoFSQ",
    "text": "When Hope said \"We decide it was not our problem.\" this helped to hard to home because I and probably other Black queer people felt that nothing to do with it or the problem is bigger than ourselves or also feeding into individualism, etc... we are bushing off the problem itself. Like what Christina said this is all made up. We as Black people (collective) have a choice. Black queer ppl really have the choice to throw the brick at anytime.",
    "like_count": 9,
    "published_at": "2023-08-07T02:38:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzMnOTTRM2_xyWJOzd4AaABAg",
    "author": "@UncleKeith567",
    "author_channel_id": "UCv09yNfc7opLjeLWjZeB4mQ",
    "text": "All of the emotions! So much to take in, hold in my heart, and give water. \nStay powerful. We just need to flame the flames, the fire is growing, stay woke (the real Woke). 💓",
    "like_count": 7,
    "published_at": "2023-08-07T15:14:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyucMIPEGwzQxJbYqh4AaABAg",
    "author": "@Dork2099",
    "author_channel_id": "UCrIA_u0cNuLB8px-i-nQ2Eg",
    "text": "Always love these conversations- thank you!",
    "like_count": 6,
    "published_at": "2023-08-06T16:32:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzp7FaYBDH97HkT81N4AaABAg",
    "author": "@syabelman",
    "author_channel_id": "UCkmTBe4iSYXfQff6AUd70Xg",
    "text": "One of the most interesting conversations I've heard in a long time. Thanks for doing this Olay.    Also Hope is the best!!",
    "like_count": 5,
    "published_at": "2023-08-08T13:35:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwN17fLMnao3-bJnjB4AaABAg",
    "author": "@The_Mighty_Red",
    "author_channel_id": "UC0uig_vafqEVdAU3MWSDZig",
    "text": "Thank you for bringing us this great panel <3",
    "like_count": 6,
    "published_at": "2023-08-06T17:04:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyPGuwAr-_FpP10QQp4AaABAg",
    "author": "@ZJB138",
    "author_channel_id": "UCGYzdqFj6cUwSE1mf_JDBJA",
    "text": "I love this conversation and the way everyone got right to the heart of the interrelatedness of the dominant structures that effect our lives. That's my favorite thing about all of your vids, Olay -- you're doing the real shit,  and hosting a lot of wonderful people doing the same. Much respect to all involved.",
    "like_count": 5,
    "published_at": "2023-08-07T00:05:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyVMdwpUiUGmbTqbTt4AaABAg",
    "author": "@April_B.",
    "author_channel_id": "UCnBmfl9Bq-xgZWAh8h0Zk0A",
    "text": "The amount of times I shouted during this discussion!!!",
    "like_count": 4,
    "published_at": "2023-08-13T18:14:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwQyzFYbKZ2TlxBhAB4AaABAg",
    "author": "@delaneybeckman5248",
    "author_channel_id": "UCs8Ct8I41dweTf7vYrvm4fQ",
    "text": "This panel is amazing! You have quickly become one of my favorite creators. Your fiery heart, sharp wit, and perfectly adorable laugh are all a huge breath of fresh air. Thanks for doing good work that can keep me engaged without being constantly despondent. 💜",
    "like_count": 8,
    "published_at": "2023-08-06T19:07:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxHeB2HSWi9HlzBK7B4AaABAg",
    "author": "@garlicfries85",
    "author_channel_id": "UCE9ZbHYbm4Bf_EzQbErdkgQ",
    "text": "This is legit one of the best episodes of your show or any podcast i have heard! Loved it ✊️🏳️‍⚧️🏳️‍🌈",
    "like_count": 10,
    "published_at": "2023-08-06T22:15:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwD_jiWOH9ZNRY2b7x4AaABAg",
    "author": "@piplupz1586",
    "author_channel_id": "UCunOiPX3Q9ewZNppfTYRDWA",
    "text": "Love these discussions ❤👏 🙌",
    "like_count": 6,
    "published_at": "2023-08-06T16:20:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzEIRZXrkoylxcitfJ4AaABAg",
    "author": "@glutenfreesnark",
    "author_channel_id": "UChjOQKtQ3mSj9M1k91nkQMA",
    "text": "This was so important for me as a white queer person to hear. I want to leave a long comment, but it all boils down to the fact that my education in the queer and Black experience is always lacking, so I'm grateful for this episode ❤",
    "like_count": 9,
    "published_at": "2023-08-07T17:49:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy1Tc01EEUciY425x54AaABAg",
    "author": "@moif_velocita",
    "author_channel_id": "UCy0yA8fODI-5PqqcwYs_43g",
    "text": "Thank you all for speaking up ❤",
    "like_count": 8,
    "published_at": "2023-08-07T10:55:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzAcp8yCD130allfWt4AaABAg",
    "author": "@jamietf",
    "author_channel_id": "UC26bHJHrwGxT7D4518H8tsQ",
    "text": "We love you Gay Avengers!",
    "like_count": 35,
    "published_at": "2023-08-06T16:24:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyg01Mb13wIyCTk3p94AaABAg",
    "author": "@onelove2230",
    "author_channel_id": "UCP7iR435Co512wjwxLZzTdA",
    "text": "There is so much information to breakdown in this episode!! Thank you to everyone involved for putting this together 💕",
    "like_count": 4,
    "published_at": "2023-08-11T08:31:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwon3ee74Bg-Sj-4fR4AaABAg",
    "author": "@lilaoliva793",
    "author_channel_id": "UC9tEE3WdC60VEcDBQtDz6YA",
    "text": "Hopeless Romantic Society in the house. Yes! Gotta love it when the accounts you follow collide.",
    "like_count": 5,
    "published_at": "2023-08-06T18:32:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxbIXjXiUdOkgJwm6R4AaABAg",
    "author": "@advisorywarning",
    "author_channel_id": "UCI_9XC5L0RABXv0VeLfhXGw",
    "text": "Very moving conversation. Loved this panel!💕",
    "like_count": 3,
    "published_at": "2023-08-10T07:41:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwxLND-yGxnUXyx5Sh4AaABAg",
    "author": "@LifeisJuicy2112",
    "author_channel_id": "UCmAFYKuVqhLCWevqj1YwOZA",
    "text": "DA’SHAUN IM LIVING TO HEAR YOU SPEAK",
    "like_count": 5,
    "published_at": "2023-08-10T21:02:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwLW1_8Cva_aZCTIOZ4AaABAg",
    "author": "@sammyvictors2603",
    "author_channel_id": "UCLk_3wbEsL9L4hT-rM_VbzA",
    "text": "I'm glad to have found this video. Queer people are suffering but its a million times worse for Queer BIPOC, as it combines racism with queerphobia. Thank you Olayemi. \n\nIs it alright that I can share this video on FB?",
    "like_count": 13,
    "published_at": "2023-08-10T15:29:49Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwLW1_8Cva_aZCTIOZ4AaABAg.9tEjI3w-lF09tEoGjqEUZ7",
        "author": "@olurinatti",
        "text": "Thank you, of course you can share!",
        "like_count": 7,
        "published_at": "2023-08-10T16:13:20Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxINgppebbexwP7UBN4AaABAg",
    "author": "@Karla-May",
    "author_channel_id": "UCiz8YRh9WwNSD0j3r2BAUdg",
    "text": "I'm here for the \"best most apt takes.\"  Thank you so much!",
    "like_count": 4,
    "published_at": "2023-08-06T17:05:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzsd0ZMIl1H0ybP9jd4AaABAg",
    "author": "@hustler3of4culture3",
    "author_channel_id": "UClUvZy4Tiuw9mIUXDjdR7JA",
    "text": "Agreed",
    "like_count": 12,
    "published_at": "2023-08-06T04:09:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgywjOLN-l1v4YA6RtJ4AaABAg",
    "author": "@ijeoma.dominique",
    "author_channel_id": "UChdcZuPvWlSae2cJcTeyRfQ",
    "text": "Hope gave a whole word about hypervisibility!! My gawd👏🏾🔥",
    "like_count": 3,
    "published_at": "2023-08-26T03:57:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxr8DcqpyYowONWyMt4AaABAg",
    "author": "@feistygheisty",
    "author_channel_id": "UCADBP_EvI184j2XsNfDpOpA",
    "text": "Great talk. The Dr. Umar story was hilarious but also sad as fuck and the way you guys described his attitude was really interesting. As a white trans person I was never been able to parse why the Dr. Umar style of anti LGBT rhetoric felt so strange. Like it both is and isn't directed at me. But that made it make a lot more sense.",
    "like_count": 7,
    "published_at": "2023-08-07T23:41:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzFB-CrbfnORcBPeyN4AaABAg",
    "author": "@ijeoma.dominique",
    "author_channel_id": "UChdcZuPvWlSae2cJcTeyRfQ",
    "text": "This whole discussion is top tier!!!",
    "like_count": 3,
    "published_at": "2023-08-26T04:07:20Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx4r51tbna-dzbmZwB4AaABAg",
    "author": "@kaistephenson6729",
    "author_channel_id": "UCSuCqP7IkbkFfeDnbjyL-jw",
    "text": "Hope brought tears to my eyes",
    "like_count": 0,
    "published_at": "2025-02-03T19:33:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzaQttVp4l27_rvlC54AaABAg",
    "author": "@ijeoma.dominique",
    "author_channel_id": "UChdcZuPvWlSae2cJcTeyRfQ",
    "text": "I missed the scotus ruling. i am horrified but not surprised",
    "like_count": 2,
    "published_at": "2023-08-25T21:27:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzzs3lZtNkf0hNoTpF4AaABAg",
    "author": "@dinopalz",
    "author_channel_id": "UCRmR9EZOaPF4ZzKM4wlZbsw",
    "text": "Olay with the best background on YouTube! 🎉🎉",
    "like_count": 3,
    "published_at": "2023-08-06T18:33:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwDyFMcaPE4gU_0Ky54AaABAg",
    "author": "@craonbox",
    "author_channel_id": "UCNsw-06LQbuwk6LjyTtB9gw",
    "text": "19:37 FACTS",
    "like_count": 6,
    "published_at": "2023-08-06T19:38:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx-8oefo5ydB3aTi114AaABAg",
    "author": "@JothanGurr",
    "author_channel_id": "UCQGR5s-kZilxITlP5I3jlqg",
    "text": "Fascists rarely hate just one group of people and a discussion of anti blackness in the current anti trans onslaught is just the thing I need right now! \nAlso don’t know if this is an angle you all are going to cover but there has been talk of white trans folks online not doing the best they can to make sure that lefty trans spaces are actually black and brown people friendly. \nI’m looking at you Keffals!!",
    "like_count": 59,
    "published_at": "2023-08-06T06:25:23Z",
    "is_reply": false,
    "reply_count": 8,
    "replies": [
      {
        "id": "Ugx-8oefo5ydB3aTi114AaABAg.9t3So0bM7f09t4ekUsk2Ws",
        "author": "@Indyawillis85",
        "text": "Damn, I love when people get called out by name. Fuck Keffals!",
        "like_count": 1,
        "published_at": "2023-08-06T17:37:44Z",
        "is_reply": true
      },
      {
        "id": "Ugx-8oefo5ydB3aTi114AaABAg.9t3So0bM7f09t4kLjQvICP",
        "author": "@charisma-hornum-fries",
        "text": "Have Blair White and her Ilk not always tried to keep lefty transpeople down? I think it's openly happening in front of our eyes.",
        "like_count": 1,
        "published_at": "2023-08-06T18:26:38Z",
        "is_reply": true
      },
      {
        "id": "Ugx-8oefo5ydB3aTi114AaABAg.9t3So0bM7f09t5_XhCpmwz",
        "author": "@tobeme1987",
        "text": "Keffals is more or less racist or obliviously racist.",
        "like_count": 6,
        "published_at": "2023-08-07T02:11:24Z",
        "is_reply": true
      },
      {
        "id": "Ugx-8oefo5ydB3aTi114AaABAg.9t3So0bM7f09t6Zl3TNhRr",
        "author": "@Robstafarian",
        "text": "Keffals is a racist who organized a harassment campaign, the aim of which either does or should qualify it as a hate campaign.",
        "like_count": 1,
        "published_at": "2023-08-07T11:23:52Z",
        "is_reply": true
      },
      {
        "id": "Ugx-8oefo5ydB3aTi114AaABAg.9t3So0bM7f09t6nERCuYTf",
        "author": "@20xx-mm-dd",
        "text": "What did keffals do",
        "like_count": 1,
        "published_at": "2023-08-07T13:30:20Z",
        "is_reply": true
      },
      {
        "id": "Ugx-8oefo5ydB3aTi114AaABAg.9t3So0bM7f09t6nPhmolFh",
        "author": "@20xx-mm-dd",
        "text": "I watch demon mama from time to time and hadn't heard anything other than the goofy noodles nonsense",
        "like_count": 1,
        "published_at": "2023-08-07T13:31:53Z",
        "is_reply": true
      },
      {
        "id": "Ugx-8oefo5ydB3aTi114AaABAg.9t3So0bM7f09t7zH_dhy18",
        "author": "@JothanGurr",
        "text": "@20xx-mm-dd Please google Keffals and racism and you can draw your own conclusions.",
        "like_count": 1,
        "published_at": "2023-08-08T00:34:52Z",
        "is_reply": true
      },
      {
        "id": "Ugx-8oefo5ydB3aTi114AaABAg.9t3So0bM7f09t7zcM_SXeA",
        "author": "@JothanGurr",
        "text": "@20xx-mm-dd Also her unrepentant use of the R slur is ablest as all hell",
        "like_count": 6,
        "published_at": "2023-08-08T00:37:51Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxyhNR1_uPHdQUVfV14AaABAg",
    "author": "@celeste_xo",
    "author_channel_id": "UCGaKS0eMJNdPYqc1nE7D2CA",
    "text": "Wow this is so interesting thank you Olayemi and everyone who contributed in this important conversation ❤",
    "like_count": 4,
    "published_at": "2023-08-09T17:48:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw55jPAcnGWEBt337J4AaABAg",
    "author": "@carolinemenosky2550",
    "author_channel_id": "UCEhyED9NI9M_jz1nUCK2nTA",
    "text": "I cannot thank y’all enough for making this video, this is the conversation that has been missing from the media. Poignant and powerful, keep it up.",
    "like_count": 2,
    "published_at": "2024-04-17T20:00:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyUItwD6WN38zs8hPp4AaABAg",
    "author": "@Jewel_Dropper",
    "author_channel_id": "UCV4aEe6JnVaEsEfJ0oSshNw",
    "text": "Appreciate the insightful conversation 🙏🏾😌. 1:18:59",
    "like_count": 4,
    "published_at": "2023-08-07T04:37:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgylXDdYaOLN0XahJB94AaABAg",
    "author": "@lynnhettrick7588",
    "author_channel_id": "UCMcJxuzY1rtY5mlUIIqBO0w",
    "text": "Thank you, Hope, for teaching me new words!",
    "like_count": 3,
    "published_at": "2023-08-06T23:27:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzbU8cwg_s3KpFcfQN4AaABAg",
    "author": "@travisabr1294",
    "author_channel_id": "UC0WvXxX8NjGz50mDNNKptmA",
    "text": "You are all beautiful. I love you all! ❤️",
    "like_count": 7,
    "published_at": "2023-10-05T23:38:34Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwFMDV-i0N0q76cWut4AaABAg",
    "author": "@BantuOtaku",
    "author_channel_id": "UCOTarO7PMaHPXL9eq0AdbZQ",
    "text": "🔥 🔥🔥🔥 Discussion I hope there is more to come!  \nAlot of Big Thinkers and Giants in one room.\nYou got a sub from me...💖",
    "like_count": 3,
    "published_at": "2023-08-07T00:55:09Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxIwc_tQueuSyCWTx94AaABAg",
    "author": "@totoroblack3728",
    "author_channel_id": "UC8-EEr_cBrKQS1R4FiaxIZQ",
    "text": "I'm really sorry xD extremely sorry Olay but that one tit was FIGHTING to come out, love the work y'all doing though, keep it up ❤️",
    "like_count": 4,
    "published_at": "2023-08-07T02:38:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzH6j3Owi0dt3Q4QqZ4AaABAg",
    "author": "@Indyawillis85",
    "author_channel_id": "UC1FoDWOiUcCLAtT-pu7aZlQ",
    "text": "I loved this panel. I love every Olay video.",
    "like_count": 3,
    "published_at": "2023-08-06T17:54:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw7A1-Fu3IfqhTNbBB4AaABAg",
    "author": "@WallebyDamned",
    "author_channel_id": "UCB_2gXc5wjpSlOJSUzUhLIA",
    "text": "Y'all are doing good work and I hope the rhythmic algae keeps promoting it",
    "like_count": 2,
    "published_at": "2023-08-06T23:06:31Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwv2Z91bthq5xT09md4AaABAg",
    "author": "@illpa",
    "author_channel_id": "UCwXcfs_qPiIzDXH6ClJxnDQ",
    "text": "We never married because I fully expect the day when they start rounding people up. The easiest ones to find to round up will be the ones who registered for a license to marry someone of the same sex",
    "like_count": 7,
    "published_at": "2023-08-13T04:06:05Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugwv2Z91bthq5xT09md4AaABAg.9tLEQtK6FJP9tLPzc_BQUr",
        "author": "@olurinatti",
        "text": "Wow, I never considered that before 😨",
        "like_count": 5,
        "published_at": "2023-08-13T05:47:05Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwHIfvBuPYzIf8ifiJ4AaABAg",
    "author": "@scerrygross",
    "author_channel_id": "UC0u9eNoXJ2fqg7lj_evOv3Q",
    "text": "i just want to say Shahem is gorgeous.",
    "like_count": 4,
    "published_at": "2023-08-06T22:54:31Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzw27vnDeKEVt0GOyJ4AaABAg",
    "author": "@regan2010",
    "author_channel_id": "UCXBMQkqwVKcLwU4MCZTMJOg",
    "text": "It's not accidental that they first set out with the bible and alcohol.",
    "like_count": 9,
    "published_at": "2023-08-06T15:41:04Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugzw27vnDeKEVt0GOyJ4AaABAg.9t4SOxdAipbABcKcPYlwcm",
        "author": "@weare9770",
        "text": "the most homophobic countries are ISLAMIC. Y'all are pretty silent when it comes to talk about that raggedy religion that is islam.",
        "like_count": 0,
        "published_at": "2024-12-04T10:43:03Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwTekf_4JQSAxTo24N4AaABAg",
    "author": "@simonappel2599",
    "author_channel_id": "UC5-VC0_zBFsYx9mg9b5MeVA",
    "text": "Thank you Olay for your incredible work and content and thank you Hope for informing me of the term -misia!! So clearly put about how it's not fear, it's hate. So much love!",
    "like_count": 3,
    "published_at": "2023-08-08T23:55:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxKgZVXfagiKdUrao54AaABAg",
    "author": "@danceteanadance",
    "author_channel_id": "UC9DpSRLSTXfQQWtJOGjt5MQ",
    "text": "I love Olay and Friends! 💝",
    "like_count": 4,
    "published_at": "2024-05-23T18:49:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxmy9-5cAho5Aw-etN4AaABAg",
    "author": "@ivandejour9806",
    "author_channel_id": "UCSeEzLw3skh2dd2V3gRk06A",
    "text": "Yallll betttttaaaa tell Da fuckin truth and let them hear it",
    "like_count": 2,
    "published_at": "2023-08-06T22:12:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyVC3gwvMwMofDkcA54AaABAg",
    "author": "@wordscapes5690",
    "author_channel_id": "UC8uBGbw66DF6c703XQcoh-g",
    "text": "Dear God , this channel’s content is GOLD!",
    "like_count": 3,
    "published_at": "2023-08-21T16:50:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyccSZ5gClob9vOYet4AaABAg",
    "author": "@MaddyClifford",
    "author_channel_id": "UCdpvtOjg7MSFJaU3w071rfA",
    "text": "That was so informative and uplifting to watch.",
    "like_count": 4,
    "published_at": "2023-08-07T23:59:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwjZP64w16arNZbESh4AaABAg",
    "author": "@fixieroy",
    "author_channel_id": "UCHrN4SvloUOtgl2gkmhxsgQ",
    "text": "This was an Amazing episode.",
    "like_count": 4,
    "published_at": "2023-08-25T00:18:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwffzqWk_SLZTy3WYp4AaABAg",
    "author": "@pbbbtttt8185",
    "author_channel_id": "UCwb8cy3KrjPTxGhf62UwQZw",
    "text": "acknowledging the ways that race + gender interact is a MAJOR part of changing how we see gender as a whole. so many transphobes act like there's a Universal Female Experience that's required to be a woman and it's absurd.\n\nbeing white, i'm gonna experience womanhood differently than a black woman, but we're both still women. being autistic, i'm gonna experience womanhood differently than a neurotypical woman, but we're both STILL WOMEN.\n\nour current concepts of gender are very narrow. if we uphold that and pretend there's only one way to be, all for the sake of excluding trans people, we are excluding EVERYONE ELSE that falls outside of that.\n\nanyways. had to get that off my chest. love the video.",
    "like_count": 10,
    "published_at": "2023-08-07T07:03:09Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwffzqWk_SLZTy3WYp4AaABAg.9t65vV5F3m7A3XDxnXyuRP",
        "author": "@fulanicarter2328",
        "text": "BULLSHIT!",
        "like_count": 0,
        "published_at": "2024-05-17T05:38:12Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzQWyL-96UTdOd7gpN4AaABAg",
    "author": "@PrivateDncr86",
    "author_channel_id": "UCRNj3ZsoCS01XfBwR4cU9kw",
    "text": "My goodness this needs way more views!!",
    "like_count": 1,
    "published_at": "2024-04-12T16:54:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwHzcFdh_Q5fFGZFZd4AaABAg",
    "author": "@purplxed1519",
    "author_channel_id": "UCPLGkH6IOgyyXcrb3zeBzcA",
    "text": "Amazing discussion 👏",
    "like_count": 4,
    "published_at": "2023-08-07T06:43:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxsOBz0OnfTaDqcC0N4AaABAg",
    "author": "@itscheap",
    "author_channel_id": "UCmwqO9Gt7kztCbOxzDUG4Cw",
    "text": "Thank you for this",
    "like_count": 3,
    "published_at": "2023-10-19T01:51:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwU0m9m7Gxf-EmXjT14AaABAg",
    "author": "@darenstephens6437",
    "author_channel_id": "UCIaIiqgk3CWYDuqXn3txNrQ",
    "text": "Amazing conversation!",
    "like_count": 2,
    "published_at": "2023-08-14T15:53:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwHt9Uu9MvK4iVPNep4AaABAg",
    "author": "@friendlydesktop3440",
    "author_channel_id": "UC_dSv6DtN2i1DMoTX7OcUtA",
    "text": "❤ so pumped to watch this",
    "like_count": 7,
    "published_at": "2023-08-06T12:10:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwHrCVt0CwUwrIXnQV4AaABAg",
    "author": "@ListenToChristians",
    "author_channel_id": "UCKCcaFMk7l_4_z6O2DDWG4Q",
    "text": "SOME OF MY FAVORITE PEOPLE ONLINE LITERALLY!!!",
    "like_count": 2,
    "published_at": "2023-08-07T04:46:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw0AI1g58IgzBBnf0l4AaABAg",
    "author": "@sigilsmistakes5000",
    "author_channel_id": "UC4j03vEzalHkN-a7RFX5Byw",
    "text": "So excited to be watching this, I love Hope! Next time please try and get black queer people from Africa and the diaspora it's such a necessary discussion<3",
    "like_count": 5,
    "published_at": "2023-08-06T16:58:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzI6lB5rPRgFUzNbY94AaABAg",
    "author": "@juni8664",
    "author_channel_id": "UCHptp2rBwewB3jI6koaiYjg",
    "text": "Thank you for crating this platform!",
    "like_count": 0,
    "published_at": "2024-06-24T22:51:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxi7BrLzspLvBuArDx4AaABAg",
    "author": "@unclegumbald989",
    "author_channel_id": "UC8BItNMXQYj_L8tje2vmh3A",
    "text": "Love ya, Olay!  Keep fighting that good fight!  ❤",
    "like_count": 5,
    "published_at": "2023-08-06T19:21:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx8KCKqngyNEQHnS2N4AaABAg",
    "author": "@luzelenaserrano1236",
    "author_channel_id": "UCs36i7hwyJhfjQ6bh18tWvA",
    "text": "I'm Mexican and live in Mexico, so our struggles look quite different. But, for the standards of my country, I'm white. So I'm grateful for the conversations that you're having so that, hopefully, they give me some kind of insight towards the dynamics around me.\n\nI'm queer and disabled, but my whiteness and my class give me unimaginable privilege. I love the look of intersectionality that you guys provide.",
    "like_count": 2,
    "published_at": "2024-01-29T03:42:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxQ1C-L8ZRrE82EDQ14AaABAg",
    "author": "@Steamboat04",
    "author_channel_id": "UClweKNtlAaC2vFRsdcVK2iw",
    "text": "This conversation is amazing now how do we break the foundations of our dehumanization of each other?",
    "like_count": 1,
    "published_at": "2024-06-12T19:24:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy_3DujdCVs0y_RDAZ4AaABAg",
    "author": "@enter4none",
    "author_channel_id": "UCnQXHkQwdGKLWPLpusTt4Pw",
    "text": "I've listened to this episode at least twice, everyone is so on point, I'm a latino PoC and really I feel it.",
    "like_count": 1,
    "published_at": "2024-04-15T22:16:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxhS0mcaud9pGnjePx4AaABAg",
    "author": "@Empathy_is_Logical",
    "author_channel_id": "UC-0RySAtWL5L7Y3KKr8TcTA",
    "text": "❤ Hope bringing the new terms. Such an engaging, thoughtful, and beautiful group\n\nEdit: also, Olay I love that you are emphasizing the positive effects of visible queerness. Been hearing a lot of doomerism from leftist YouTubers about the efficacy of making content and advocating for yourself online. Obv it's not enough by itself, but it is still powerful and good for the world",
    "like_count": 4,
    "published_at": "2023-08-07T17:00:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwh0HC6EMEByekAcaB4AaABAg",
    "author": "@moustik31",
    "author_channel_id": "UCs3hrOMRE6xz5vub68Lx0ww",
    "text": "When Da'Shaun gave the names!!!\n🔥🔥🔥",
    "like_count": 1,
    "published_at": "2023-08-07T11:11:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw99TV8AR1zuqGPBW94AaABAg",
    "author": "@penabler",
    "author_channel_id": "UCT5VmjWM7U1cTYaIVJSze5Q",
    "text": "This content rules. Top tier stuff.",
    "like_count": 4,
    "published_at": "2023-08-06T18:24:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyrTOrXvlpLPHUV0ft4AaABAg",
    "author": "@lisele39",
    "author_channel_id": "UCD2ZYQk9jyWbSyG6to8F-0g",
    "text": "35:48 👏🏾👏🏾👏🏾🫴🏾 🧱🧱🧱🧱🧱",
    "like_count": 4,
    "published_at": "2023-08-08T06:09:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzKdpuheXi9y6wO0ux4AaABAg",
    "author": "@EnigmaFox-qr2fw",
    "author_channel_id": "UCMxVnM299hO7OsqjXesTE8A",
    "text": "One's personhood is a conditional state , depending on what conditions the state uses to define personhood.. and our constitutional rights are based on this conditional personhood ..",
    "like_count": 1,
    "published_at": "2024-04-20T03:13:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx-mmkCaTYmj5C9XPh4AaABAg",
    "author": "@scarlet423",
    "author_channel_id": "UCyhR7J1qE4qErVTLmexUp3g",
    "text": "I really appreciate this convo and appreciate you taking the time to put this out so I can learn more about others experiences as I’m just a white trans woman who doesn’t experience the same issues most others do. Mainly because I hide my trans was in public, but I want to change that in a way that I can work with others and hopefully positive improve our society. Lol I’m rambling at this point but I love hear what you all have to say!",
    "like_count": 3,
    "published_at": "2023-08-09T06:34:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw35JnL2h3QPnatwBR4AaABAg",
    "author": "@necrotic9433",
    "author_channel_id": "UCJjqTP_fMmasOiETgE13Hjg",
    "text": "So, a little bit about brazillian political landscape right now. We are seeing religious conservatives pushing a the same agenda that trans/gay people are groomers (and trying to get rid of same-sex marriage), cus everything here its a parody of america. We have 2 trans woman in office, one of them is Erika Hilton. Im just so glad to have her in there. Shes so intelligent and wellspoken, and shes not only armed with studies but with personal experiance living in a very transphobic country. It also gives a very clear image of who has the most to lose here.\n\nSorry for any errors, not a english native speaker",
    "like_count": 5,
    "published_at": "2023-09-28T20:55:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwQzRFNsUwz7JPCeDd4AaABAg",
    "author": "@michaelharris5959",
    "author_channel_id": "UCmWgmXAIJUm1ChyIUCN0KYg",
    "text": "Football season starting ,Being the hegemonic heteronormative itual",
    "like_count": 1,
    "published_at": "2023-08-13T17:25:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwXyqDwiXBNfsADhgN4AaABAg",
    "author": "@eddyvldez14",
    "author_channel_id": "UC6WaNUCreVu6kqU2a_o-r6g",
    "text": "Olay is killing it like always great info",
    "like_count": 3,
    "published_at": "2023-08-11T15:19:59Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy2STZvl-8LJeq-w854AaABAg",
    "author": "@thetitsarefree",
    "author_channel_id": "UCS9J_pX8-3CQK023hzMnQWg",
    "text": "That part about someone coming along to normalize queerness for black men (besides Frank Ocean) stuck out to me because Tyler’s queerness is normal now, but it’s explicitly for white attraction",
    "like_count": 1,
    "published_at": "2024-10-04T12:17:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxGcHPibn9RgmB109p4AaABAg",
    "author": "@jessicaflemister4825",
    "author_channel_id": "UCyzrI8imkkDMvdm1E2hnO4w",
    "text": "The way hope eats!!!! 🙌🏽",
    "like_count": 0,
    "published_at": "2025-10-27T15:29:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxW2QQ2fBoHLRCPftV4AaABAg",
    "author": "@therightpodcast6403",
    "author_channel_id": "UCapt53Z4ShOl3PjcgeoJ3yw",
    "text": "Where are the accomplices? I largely agree with this and admit that I could be included in the critique. The idea of \"elevate\" is problematic. As stated, it frames things in such a way as to suggest there is a need for help from allies. I think help is always welcome but in a way it reminded me of the white savior trope. Not everyone who engages in this is white but it's the power dynamic. I also feel like in these dynamics there is a role of \"translator\" as well. As if the people listening couldn't possibly understand what the people doing the work are saying. There's a lot to dissect in that observation.\r\n\r\nWhiteness is an ideology. I thought this critique was so spot on. The intersectional critique of power dynamics (or lack of them) relating to the script. I might argue that black men and women have been included in masculine and feminine definitions but only in a negative, pejorative way to compare white purity/supremacy against. Perhaps that's another way of saying the same thing.\r\n\r\nTo allow homophobia, they make it white. Another awesome critique. I think of this in a global perspective as well. Instead of white it is western (implied regardless.) So, hatred, repressive laws, institutionalized homophobia etc. is justified by it being \"western\" which could be seen as simply making it an \"other\" within the false framework of anti-imperialism.\r\n\r\nThis video was all excellent. The inclusion of \"How you show up\" is so important. I feel like there are many great critiques available but that some of them don't directly communicate things that are actionable. The fact this was done in an introspective way was enlightening.",
    "like_count": 4,
    "published_at": "2023-08-07T16:32:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxXzU2X7qAg-HCeP-14AaABAg",
    "author": "@gtrprincess1",
    "author_channel_id": "UCBUU2TR1Kz8akdXyJ0RD7Gg",
    "text": "I love me some hope🙌🏿",
    "like_count": 1,
    "published_at": "2024-11-23T23:48:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw-mSqn1e0QOa1D3h54AaABAg",
    "author": "@Nathankapayakalilombe2000",
    "author_channel_id": "UC8-X9lk8wu1ugxK0Kla3nZA",
    "text": "42:33...pause(imma b back)\nThis conversation♥",
    "like_count": 1,
    "published_at": "2025-08-19T00:01:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwV23Jm3fxGYx5B-Jh4AaABAg",
    "author": "@Cnichal",
    "author_channel_id": "UCMNDKCrHCFjgPnBQ7NYoxwg",
    "text": "Oh I love Hope! 🥰",
    "like_count": 5,
    "published_at": "2023-08-06T18:55:01Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgwV23Jm3fxGYx5B-Jh4AaABAg.9t4naUwwsf89t4noB6OsjO",
        "author": "@Cnichal",
        "text": "26:00",
        "like_count": 1,
        "published_at": "2023-08-06T18:56:53Z",
        "is_reply": true
      },
      {
        "id": "UgwV23Jm3fxGYx5B-Jh4AaABAg.9t4naUwwsf89t4o90je2OM",
        "author": "@Cnichal",
        "text": "28:50 oh points were made",
        "like_count": 0,
        "published_at": "2023-08-06T18:59:52Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyGxDv-gar8mLfpNCV4AaABAg",
    "author": "@vividao4123",
    "author_channel_id": "UCZz1fauaiftFqderDvh3pRA",
    "text": "Christofascism really has us staying believing that white men have a monopoly on religion and it's history. Decolonizing faith and decoupling spiritual practice from religious institutions is so important in the discussion about religion and religious oppression.",
    "like_count": 5,
    "published_at": "2023-08-10T00:19:34Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzr5qZJ9O_U6izITkJ4AaABAg",
    "author": "@bwolff7364",
    "author_channel_id": "UCcVV3YLfnTS0-RaH_0ABvVg",
    "text": "Amazing thank you❤",
    "like_count": 4,
    "published_at": "2023-08-08T14:13:59Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzwFa9ysGrpq5ceOXR4AaABAg",
    "author": "@satyasyasatyasya5746",
    "author_channel_id": "UCoCB28eBwZJMQwiKvrqwkjQ",
    "text": "Really excellent show. Loved it y'all!\n\nAnd somewhat unrelated, I was sad to see you leave TLM but also, I'm kinda happy you did after seeing this because TLM is giving me huge lib vibes. The conversations are IMHO so dull and they never say anything new. There's no fire there and feels very low energy.",
    "like_count": 7,
    "published_at": "2023-08-06T16:40:28Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgzwFa9ysGrpq5ceOXR4AaABAg.9t4ZC-_Rehw9t4ka2KZsmV",
        "author": "@HighAsHeckPriestess",
        "text": "Rebecca has brilliant stuff to say, but remember too that when they talk about the same stuff it's because those same issues are a problem (like COSA and other stuff happening to queer people).",
        "like_count": 2,
        "published_at": "2023-08-06T18:28:44Z",
        "is_reply": true
      },
      {
        "id": "UgzwFa9ysGrpq5ceOXR4AaABAg.9t4ZC-_Rehw9t5OUWHOmT8",
        "author": "@satyasyasatyasya5746",
        "text": "@HighAsHeckPriestess What I mean is, if you watch David, Mike and Matt on their own channels, and then watch TLM, the topics discussed have already been covered on their own shows and then they just say what they already said again. It seems a little tedious. \nThat, and they don't seem to go into much depth or bring anything new to the show like say, taking turns to research something and present it to the group or something.\n\nAlso, I find the conversation often decends into \"yeh being a content creator is hard but its ok to take breaks/self care/block people etc.\" and I'm like, sure, ok, but they way y'all keep bringing it up its like you're just soothing eachother and dealing with some impostor syndrome which... should maybe be a little private?\n\nJust my thoughts. They do them, its fine.",
        "like_count": 1,
        "published_at": "2023-08-07T00:26:06Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwbfC1bYjaG33pHop14AaABAg",
    "author": "@starberrysweetee1495",
    "author_channel_id": "UCSZV88-KaMIiK0wut9-RVXQ",
    "text": "19:18 “Three out of five times” 💀💀💀",
    "like_count": 0,
    "published_at": "2024-05-18T19:09:09Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy86HST4aVgsnJaR-94AaABAg",
    "author": "@wendyflores1092",
    "author_channel_id": "UCrxPI7mHLzQ884lxLLl7QTA",
    "text": "👏👏👏👏👏👏👏👏",
    "like_count": 3,
    "published_at": "2023-08-06T21:17:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxhm2thnz0L-69JfsN4AaABAg",
    "author": "@kateg6281",
    "author_channel_id": "UCWJt1mdp20RcVMmCxpqe5Mg",
    "text": "as a white lesbian I regularly listen to talks about how important it is to include blackness in the queer conversation, so it’s really interesting to hear this perspective",
    "like_count": 8,
    "published_at": "2023-10-25T19:26:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwwjaHu-Hdwcg5EdPV4AaABAg",
    "author": "@HoodooSpice",
    "author_channel_id": "UCxYn-SY-GbgnvWhQe45dPzA",
    "text": "Yes ma'am,  Hope!",
    "like_count": 2,
    "published_at": "2024-04-22T19:17:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz4askh0ktXPQbIhwt4AaABAg",
    "author": "@thhe5859",
    "author_channel_id": "UCnunuPH5inySQStW7zJeFYg",
    "text": "This was a great discussion wow!",
    "like_count": 0,
    "published_at": "2024-04-18T03:49:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzKX6IegKgs8qHSLwh4AaABAg",
    "author": "@Born-Liberated_EmpatheticWorld",
    "author_channel_id": "UCcEmb73iAq0Jpr1hW3ibKrA",
    "text": "Kyriarchy. That’s what your alluding to. They hate their position within the system not the system itself. 🥴",
    "like_count": 3,
    "published_at": "2023-08-06T16:48:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxNIMXnEfaunkcEExp4AaABAg",
    "author": "@change2spare",
    "author_channel_id": "UCPAdv2jPmS63hOBXExZBJOA",
    "text": "A lot of great truth",
    "like_count": 3,
    "published_at": "2023-08-06T18:43:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxwTu53K5KGHjK_LMt4AaABAg",
    "author": "@nicklindsay3418",
    "author_channel_id": "UCfbvLDfEHJdc8g-ov9NTXTg",
    "text": "I'm from MA. I moved to SC in 2018. I moved back to MA this past month.  I wanted to be back before the 2024 election. Easier to get to Canada if shit pops off",
    "like_count": 1,
    "published_at": "2024-03-29T22:42:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxRACsNtUPuBBQLD714AaABAg",
    "author": "@jhlfsc",
    "author_channel_id": "UCg_dJWGFOWItwgVyqJc8BWw",
    "text": "DeSantis IS Latin American.  Why don't more people remind him of that fact to highlight his blatant hypocrisy and untreated mental illness?!",
    "like_count": 3,
    "published_at": "2023-08-06T23:58:26Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx68W7aS5y7eMHhxKF4AaABAg",
    "author": "@laexploradoraaaXD",
    "author_channel_id": "UCzPD_yXPELRJIlm22gibVYg",
    "text": "Thinking of information as an indictment is incredibly astute. It really highlights the push back against pronouns. Everyone uses pronouns it's a part of speech but having to be consciously aware of how you use your own pronouns and also which pronouns are acceptably applied to strangers had way too many people screaming and crying. Thanks for sharing.",
    "like_count": 2,
    "published_at": "2024-04-17T18:06:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxS4oT4VKOn6AcXjKV4AaABAg",
    "author": "@xNiiRUx",
    "author_channel_id": "UC73RZKMTxWEQui6MHcdTZ_g",
    "text": "💜",
    "like_count": 5,
    "published_at": "2023-08-06T16:12:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxhvwI3x-5HeMc5rKt4AaABAg",
    "author": "@nonbinarybeauty",
    "author_channel_id": "UC-48huJJN55urCUcVqI0axw",
    "text": "I loved this 💐💖",
    "like_count": 3,
    "published_at": "2023-08-07T04:42:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz3juYqa2WUzfJO3od4AaABAg",
    "author": "@Juciwaters",
    "author_channel_id": "UCuFaMJNsPUCB0whIxZAC5Ng",
    "text": "OMG hopeless romantic up in here!",
    "like_count": 1,
    "published_at": "2023-11-28T21:35:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxFVHNUI1YiiG4OJ_h4AaABAg",
    "author": "@th3awakened111",
    "author_channel_id": "UCj8MxLKqYSvEE8yLSmAvSsQ",
    "text": "👏🏾👏🏾👏🏾👏🏾",
    "like_count": 1,
    "published_at": "2025-07-14T17:13:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzW_1pcO2ih-gZ71Lt4AaABAg",
    "author": "@quorraquar2677",
    "author_channel_id": "UCQT03RLgRA8dOa8OIq2K9lQ",
    "text": "🌿💜💜💜💜💜💜🌿",
    "like_count": 3,
    "published_at": "2023-08-09T18:14:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzubId_EE8LIEUbrs94AaABAg",
    "author": "@TheeBrandonCarter211",
    "author_channel_id": "UCzHmvHApt22DgUMCcncAhaA",
    "text": "Great conversations",
    "like_count": 0,
    "published_at": "2023-12-20T03:10:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy_xMmO_a0kJS7zHUF4AaABAg",
    "author": "@sadie1606",
    "author_channel_id": "UCPEV0lky0NIpAZ1_zZ_QGPA",
    "text": "I think Deshuan would like this one punk band called Fever 333. They have a song where they talk about dismantling the structures of Christianity because its a huge part of oppression in the black community.",
    "like_count": 2,
    "published_at": "2025-01-13T22:21:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  }
]