[
  {
    "id": "UgwePRZbghlcNnNCcrt4AaABAg",
    "author": "@aquapendulum",
    "author_channel_id": "UC0ITu6Q33AfMMG15BGwgVYA",
    "text": "Can you imagine the balls of DSA supporters saying the ACP is a bunch of right-wingers pretending to be left in the same breath as they make excuses for Zohran Mamdani?",
    "like_count": 32,
    "published_at": "2025-10-09T18:28:06Z",
    "is_reply": false,
    "reply_count": 8,
    "replies": [
      {
        "id": "UgwePRZbghlcNnNCcrt4AaABAg.AO3oU2kjTCwAO69B4gRYgV",
        "author": "@comradehogan7636",
        "text": "Yes both are right opportunist",
        "like_count": 2,
        "published_at": "2025-10-10T16:16:14Z",
        "is_reply": true
      },
      {
        "id": "UgwePRZbghlcNnNCcrt4AaABAg.AO3oU2kjTCwAO6qKNuHk6U",
        "author": "@brycehmr",
        "text": "@comradehogan7636 words have meanings",
        "like_count": 3,
        "published_at": "2025-10-10T22:42:01Z",
        "is_reply": true
      },
      {
        "id": "UgwePRZbghlcNnNCcrt4AaABAg.AO3oU2kjTCwAO8Mu4q9RB7",
        "author": "@comradehogan7636",
        "text": "​@brycehmr Yes both include bourgeois policy",
        "like_count": 2,
        "published_at": "2025-10-11T12:54:36Z",
        "is_reply": true
      },
      {
        "id": "UgwePRZbghlcNnNCcrt4AaABAg.AO3oU2kjTCwAOOSwiwZZZx",
        "author": "@DrMJS",
        "text": "I asked about such accusations on a recent MWM post - people saying ACP is an alt-right psy-op. MWM said they were false and baseless. I realize that, but would like to know more about where these accusations come from. This makes sense: DSA and probably Dems telling lies.",
        "like_count": 0,
        "published_at": "2025-10-17T18:55:14Z",
        "is_reply": true
      },
      {
        "id": "UgwePRZbghlcNnNCcrt4AaABAg.AO3oU2kjTCwAOOX6OdvnNt",
        "author": "@comradehogan7636",
        "text": "​@DrMJS You shouldn't listen to sophists and people who tail behind maga or liberals",
        "like_count": 1,
        "published_at": "2025-10-17T19:31:39Z",
        "is_reply": true
      },
      {
        "id": "UgwePRZbghlcNnNCcrt4AaABAg.AO3oU2kjTCwAOOXORXVXKr",
        "author": "@comradehogan7636",
        "text": "​@DrMJS Last time I heard about ACP they absolutely butchered international workers day. Find it on their website but they changed it to international working men's day and flown the flags of modern Bourgeois nation states because they side with imperialist camps",
        "like_count": 1,
        "published_at": "2025-10-17T19:34:06Z",
        "is_reply": true
      },
      {
        "id": "UgwePRZbghlcNnNCcrt4AaABAg.AO3oU2kjTCwAOOYIldGLHf",
        "author": "@comradehogan7636",
        "text": "​@DrMJS also they refuse to combat racism, the biggest Bourgeois divider of the working class",
        "like_count": 2,
        "published_at": "2025-10-17T19:42:04Z",
        "is_reply": true
      },
      {
        "id": "UgwePRZbghlcNnNCcrt4AaABAg.AO3oU2kjTCwAOyoBVUntHL",
        "author": "@RockerAntisystemAntiwoke",
        "text": "Zohran Mamdani is a Keynesian who fancies himself a socialist, just like Bernie Sanders. I don't read the replies.",
        "like_count": 0,
        "published_at": "2025-11-01T07:01:32Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyfOKTNsjAB4avftVh4AaABAg",
    "author": "@frolicsomgaiety",
    "author_channel_id": "UCXOdQHjsIJPODDdkdLZdT1Q",
    "text": "So glad you mentioned Roland Boer!",
    "like_count": 5,
    "published_at": "2025-10-11T00:43:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzntKqcEr0Z1UOHUGl4AaABAg",
    "author": "@rahulshah2568",
    "author_channel_id": "UCKGdPvueuLDwtdJ0dyxbOHQ",
    "text": "“Show us one time we missed “ got me cracking up. Very true though.",
    "like_count": 4,
    "published_at": "2025-10-09T18:48:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgywKHGih_Z4CtJE0y94AaABAg",
    "author": "@oo6505",
    "author_channel_id": "UCkRpI4u010KkpvpUdy_vIPA",
    "text": "Hell yeah a Carlos stream, we’re not often blessed with these",
    "like_count": 4,
    "published_at": "2025-10-10T00:16:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw3lNY9kNxMnnhyfEV4AaABAg",
    "author": "@runeskyttsing9089",
    "author_channel_id": "UCoE_IlF9vLcS5GqPEyU1x0g",
    "text": "I am not a communist or a radical socialist but I enjoy listening to Midwestern Marx. Some of your analysis is spot on. Especially what you said regarding occupy Wall street and what happened after that with identity politics and tribalism. Things where more class based back then.",
    "like_count": 10,
    "published_at": "2025-10-10T20:55:52Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugw3lNY9kNxMnnhyfEV4AaABAg.AO6eB3SLYCKAO8N8m_drPe",
        "author": "@comradehogan7636",
        "text": "Class is the answer, you should be a communist",
        "like_count": 1,
        "published_at": "2025-10-11T12:56:44Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxiQGzjHOFo79m4YOp4AaABAg",
    "author": "@ProleDaddy",
    "author_channel_id": "UCDHAPLcabieBJBoU-W8mCeA",
    "text": "The audio from your microphone was fantastic, Carlos. Thank you for speaking for us.",
    "like_count": 3,
    "published_at": "2025-10-09T17:12:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgylZFTdl34H2ILQCdx4AaABAg",
    "author": "@mauricioamezcua9081",
    "author_channel_id": "UCZx2j4s2QOGPi_7lLtzSbYQ",
    "text": "Gran contenido camaradas",
    "like_count": 8,
    "published_at": "2025-10-09T17:46:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzWrL6xw0WJQpzexjB4AaABAg",
    "author": "@LordTamer12",
    "author_channel_id": "UCT7kSBq27lZuSC0CFaNKXvA",
    "text": "Carlos goes crazy every time",
    "like_count": 2,
    "published_at": "2025-10-09T18:38:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgweTzebqMESknNRz354AaABAg",
    "author": "@mauricio9869",
    "author_channel_id": "UC8LaAtS0l9hpQezjAzXcGZw",
    "text": "Great knowledge Carlos thank you",
    "like_count": 0,
    "published_at": "2025-11-15T23:14:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzK3lCN1Jt0wX0CN4B4AaABAg",
    "author": "@JamesHarper-v9f",
    "author_channel_id": "UCcuu1AOwmIGo58SQJfhFRuw",
    "text": "I am a realist. A Democratic Communist. We need to become extremely proficient capitalists, and convert our endeavors into worker-self-directed-enterprises. You know? Like the Soviets that once existed before Lenin disbanded them and murdered all of the Mensheviks.. we need our cooperative networks to be able to take over local governments, and to grow from there. We need not take on this dying carcass of an empire in war. Rather we must be well prepared with a network of interconnected collaborations that are ready to spring into action so save society the day after it implodes…. This is the only road to socialism here in the United States",
    "like_count": 3,
    "published_at": "2025-10-10T18:00:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzl2G0WYqYTWJv9wf14AaABAg",
    "author": "@1991Aski",
    "author_channel_id": "UC4C6cpoiu_cgCHxhKFdwPLw",
    "text": "Great chat, thoroughly enjoyed 🙌 \nIs there any author/book you would recommend for psychoanalysis through a Socialist/Marxist perspective?\nOr maybe something like practicing psychotherapy using socialist/Marxist principles?\nI'm a counsellor/psychotherapist trying to integrate socialist/Marxist principles into helping clients understand the roots of the trauma they experience.",
    "like_count": 1,
    "published_at": "2025-10-11T13:18:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwwzrw24Vl13a855BV4AaABAg",
    "author": "@jancoil4886",
    "author_channel_id": "UCu9vtSX7-lxWrdibZ1wa5Dg",
    "text": "Social Democracy was once seen as a way station to socialism: end of capitalism.  Now, they are an obstacle and a half-hearted ally or straight up opponent.  AOC and the Mamdanster are just different variations of the politically well connected hustler.  They speak of solidarity and justice but they are about cashing in.  Keep speaking the truth Carlos.",
    "like_count": 4,
    "published_at": "2025-10-10T00:14:41Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugwwzrw24Vl13a855BV4AaABAg.AO4R8UDO90AAO69Tuz-Hwd",
        "author": "@comradehogan7636",
        "text": "So was nationalism, now we can reflect on the failures",
        "like_count": 1,
        "published_at": "2025-10-10T16:18:50Z",
        "is_reply": true
      },
      {
        "id": "Ugwwzrw24Vl13a855BV4AaABAg.AO4R8UDO90AAPJcI5pdrrz",
        "author": "@dannyzee4",
        "text": "@jancoil4886 you speak of fantasy. Mamdani has some chance of helping people today, in a life that isn't infinite. While you wait for the perfect change, people suffer. And if it goes well it can open more people's minds to socialist ideas.",
        "like_count": 1,
        "published_at": "2025-11-09T18:20:52Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzRCp4wmJp4_zPOdLp4AaABAg",
    "author": "@Marx_Markets_TV",
    "author_channel_id": "UCgXo15u5PDnO2ub3Yua2Uyw",
    "text": "Ron Paul was a huge hero of mine years ago & I truly believe we need to unite Libertarians & Socialists. We also need to ditch emphasis on \"isms\" & unite against terror that runs our Western society. Many liberals & MAGA type are complaining about same things I see here. Same for Libertarians.",
    "like_count": 2,
    "published_at": "2025-10-09T18:14:26Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw1tTuxhMmsYnHJL3h4AaABAg",
    "author": "@MikeDavis-n3s",
    "author_channel_id": "UCXeyf-4f2tDUAn4lOW1BeMw",
    "text": "Thank you so very much Carlos for making that point about European Democratic Socialism using the bank robber analogy.  I am constantly correcting YT commentators when they use the MI6 phrase, \"U.S. Empire.\"   I tell them:  Calling it the \"US Empire\" is like going to Apple headquarters, seeing a security guard and saying, \"look, it's the owner of the Apple Computers Corporation!\"",
    "like_count": 0,
    "published_at": "2025-10-09T17:39:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwuyP2DzRRwaC6oMJR4AaABAg",
    "author": "@haraldisdead",
    "author_channel_id": "UCPteErbOLSFlnwTKLRc9zug",
    "text": "I'm sure your Spanish is fine, dude. \nYou're smart af",
    "like_count": 1,
    "published_at": "2025-10-09T17:53:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwoXAtYnYZ67vd8AyB4AaABAg",
    "author": "@danielvera7390",
    "author_channel_id": "UCCSjCkQMAYSSZ9ttneXiFxA",
    "text": "Armesilla is white washing the atrocities spanish crown did in the americas... He's a troyan horse... I'd recommend much more Christian Nader... He has a yt channel: exosapiens",
    "like_count": 1,
    "published_at": "2025-10-10T12:51:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyZ6UhUl9s6wH6q7114AaABAg",
    "author": "@Vogel-j7p",
    "author_channel_id": "UCP2d2MtYLvPluEDIVWWWRmA",
    "text": "Hi I'm a former capitalist here and I'm looking to get into Marxism and was just wondering if there is any books that you guys would recommend personally and yes I realize I'm coming off as a little on the nose but It'd be very much appreciated thank you.",
    "like_count": 2,
    "published_at": "2025-10-10T18:38:34Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgyZ6UhUl9s6wH6q7114AaABAg.AO6PTYMgn3pAO9g8wYJwjJ",
        "author": "@Karl-is-Honest",
        "text": "I personally like Capital by Marx but some people find it a little heavy handed to start with. Yet it really is one of the best debunkers of Capitalism out there (without even trying and at the same time trying way harder than it needs to in order to discredit Capitalism into oblivion and beyond)",
        "like_count": 1,
        "published_at": "2025-10-12T01:10:46Z",
        "is_reply": true
      },
      {
        "id": "UgyZ6UhUl9s6wH6q7114AaABAg.AO6PTYMgn3pAOACf16Xojc",
        "author": "@Hardie_Boi",
        "text": "@Vogel-j7p Hello bro,you should check the communist manifesto from marx and engels .And second book should be Lenin's imperialism the final stage of capitalism.\nCheck also Che Guevara's biography if you are not familiar.",
        "like_count": 1,
        "published_at": "2025-10-12T06:03:38Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzHl-d3KjXPaZxLr6J4AaABAg",
    "author": "@AustinKelch-i2x",
    "author_channel_id": "UC2eIcY4GYCofXEBLYYT-SPw",
    "text": "Democratic-Socialism is not a real with Actual Socialism, Democratic-Socialism is a real issue!!",
    "like_count": 2,
    "published_at": "2025-10-09T16:43:08Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzHl-d3KjXPaZxLr6J4AaABAg.AO3cTDYGFo6AO69x_zw8Vk",
        "author": "@comradehogan7636",
        "text": "Both retain aspects that lead to capitalism",
        "like_count": 1,
        "published_at": "2025-10-10T16:23:00Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugxks8qBYgZSU-H05AZ4AaABAg",
    "author": "@locuraromantica",
    "author_channel_id": "UCFm1loNxuphESaAA-XweyIw",
    "text": "Don't worry about your spanish Carlos, and I am very curious about your gueto spanish...Hahahah! It is going to be fine, what you don't know you'll learn it by experience. I've read your book  by the way, it was useful, I've touched the subject in the past reading books from Losurdo and others, also Fisher, but nobody as far as I can tell, have aimed for the mechanism that allows purity fetish to develop and where it orginated. I have for sure disagreements with you about the hispanic world and also about the independence movements in hispanic america but i consider your ideas and standpoints good,  and disagreements are not about the necessity of independence and revolution but about the real role liberals like Martí and Bolívar I do have my dfferences with you, even Bolívar at the end understood how he was played by the british and I think he could grasp how the power dynamics would go in hispanic america. I do think that the Spanish Empire was less cruel so toi speak than the british or the french, but not only out of principles or values but also because it was closes to the empires of ancient times...Meaning the development of capitalism, it was closer to the feudal world than the british empire later on, that influenced it, in this case for the good, since some production relations were not there. But at the end capitalism developed anyway but in the middle of a process of decay.",
    "like_count": 0,
    "published_at": "2025-10-09T18:04:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgybbmVSBVOpu-RaPl54AaABAg",
    "author": "@RockerAntisystemAntiwoke",
    "author_channel_id": "UCkVHs7NW_tPk4OFeTejF-hg",
    "text": "What? Socialism through \"democratic\" means (bourgeois elections) is impossible, but socialism is democratic because it is workers' democracy.\n I don't read the answers.",
    "like_count": 0,
    "published_at": "2025-11-01T06:56:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxewnjPGLNEt05YOFR4AaABAg",
    "author": "@redlion45",
    "author_channel_id": "UCsJ5JFXo54fdHRrjOqkVi8w",
    "text": "\"Democratic\" socialism does exist. It's called Socialism.",
    "like_count": 0,
    "published_at": "2025-10-18T22:03:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyemrYu7l8XtWHyDdJ4AaABAg",
    "author": "@AntiRojosSonBasura-u9s",
    "author_channel_id": "UCGhMhjqRUMGnpzdBNfCod_Q",
    "text": "What? Of course democratic socialism is Real and possible and also necessary to correct the mistakes of the last century. What isn't possible is building socialism from the false democracies of the capitalist system. But that's different. \nI don't read replies. Insults? You are what you say about other people.",
    "like_count": 0,
    "published_at": "2025-12-20T05:32:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz_fdp9ucMZ37z1L4N4AaABAg",
    "author": "@comradehogan7636",
    "author_channel_id": "UCxeKSStVRek10nQbzEdsWAA",
    "text": "There is no \"anti-imperialism\" without anti-capitalism. Acp believes there is. Like a Trot supporting a struggle even if it's Bourgeois funded",
    "like_count": 4,
    "published_at": "2025-10-10T16:15:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyfHARKkcJBbXuqrDV4AaABAg",
    "author": "@servusprotervus6463",
    "author_channel_id": "UCFsvG5fyLU5zQqjGCZL4WkA",
    "text": "Let me tell you something about the modern Russian state and society—since I am part of it.\n\nRussian society is deeply sick, and it’s been this way for a long time—starting with the bourgeois counter-revolution of 1991, followed by the fascist coup of 1993. The country is still reeling from the plunder of the early ’90s, when the so-called “gentlemen” in charge emptied people’s savings accounts, exchanged them for dollars, stuffed them into their own pockets, and crashed the ruble by more than 200 times overnight—blocking access to accounts in the process. Later, they printed more of this worthless currency, added it back into those accounts to cover up the theft, but of course by then the damage had already been done. \n\nThe people are also still hurting from the so-called “privatization” of public property. They watched as the factories and plants they had built with their own hands were looted—new “owners” sold the equipment, pocketed the proceeds in foreign accounts, laid off the workers, and either rented out the premises as shopping centers or abandoned them entirely. Many of those buildings are now overgrown with moss. Around 80,000 such enterprises have vanished this way. \n\nThen the looting became societal. A new breed of scammers emerged, mimicking the oligarchs, and began seizing privatized apartments and other property from working people through all kinds of legal and semi-legal schemes. The theft of labor and time continued through a million mechanisms: price hikes in natural monopolies, budget cuts to social rights won by earlier generations, dismantling of public institutions, elimination of vocational schools, slashing of free university placements—effectively ending free higher education. A massive number of medical facilities were shut down. Maternity benefits were reduced, pension ages raised, subsidies eliminated. In rural areas alone (not counting towns), over the last 30 years they’ve closed: 15,600 cultural centers, 4,300 libraries, 22,000 kindergartens, and 14,000 schools. All of this is labor—value created by the hands of working people, their time—wasted. \n\nNo wonder people became hardened. They stopped trusting one another and themselves. Then they raised children in this atmosphere of bitterness. Any society, anywhere in the world, would start to fall apart under such trauma. And that’s the kind of society we live in now. That’s the kind of individuals who make it up. People resentful of everyone around them because of their own misfortunes. Uneducated—because they lack access to quality education. They don’t understand the reasons they’re in this situation, and so they direct their anger outward. I think the scale of trauma that society inflicted on itself—out of laziness and refusal to grow when the opportunity existed—can hardly be overstated. That’s the root of the illness. People are angry at each other. They can’t reach the real culprits—the elites—because they lack the means and, more importantly, class consciousness. So they take it out on their neighbors, who are just as destitute. Instead of uniting and giving the ruling class a proper kick, they lash out sideways.  \n\nAs for the war in Ukraine, it’s important to distinguish between the fascist propaganda of the Russian ruling class and their actual motives. The propaganda says Russia is fighting against Western imperialism. Fine. But if we’re Marxists, can we really afford to talk about good versus bad imperialisms? Power in Russia belongs to imperialists too—arguably the most chauvinistic kind. They may be economically weaker than their Western counterparts, but that doesn’t make them any less imperialist. \n\nThis war is imperialist in nature, like all wars of this kind—waged over markets. In our case, it’s about Ukraine’s hydrocarbon transit market, through which Europe once relied on Russian gas. The second goal—which reflects the specifics of post-Soviet capitalist states—is to grab hold of the Soviet-era means of production in Ukraine that survived privatization and still generate significant profits. Just ask Russian oligarchs Yurchenko and Tkachev—they’re not shy about it. Look them up. Check what assets they hold in Ukraine.\n\nOur goal as Marxists is to help the working class unite and struggle, to prepare for the next socialist revolution — not to support one imperialist against another. In this war, as in any other imperialist war, only the ruling class profits, while workers are killed and lose their health. The war must be stopped, and the only way to stop it is to overthrow the masters’ rule in the aggressor country. That is the direction our propaganda should take.",
    "like_count": 5,
    "published_at": "2025-10-09T21:11:55Z",
    "is_reply": false,
    "reply_count": 12,
    "replies": [
      {
        "id": "UgyfHARKkcJBbXuqrDV4AaABAg.AO46DqmmFk8AO49gTqfPpJ",
        "author": "@WhatsThePointOfIt",
        "text": "As long as the masses let the psychopaths loot, pillage, and genocide them it will continue. It is not a Russian problem, it is a psychopathy problem and it is on both sides. Power everywhere is psychopathic. Power is innately psychopathic. Doesn't matter where it comes from. Unfortunately there will always be 100's of millions humans willing to brutalize good people because their masters tell them to and give them the monopoly money. Always been that way since the scam was invented. People don't have good solutions and neither communism nor socialism are solutions but just part of the problem. As long as the parasites exist the host will suffer and the host will suffer as long as he refuses to get rid of the parasites.",
        "like_count": 0,
        "published_at": "2025-10-09T21:42:11Z",
        "is_reply": true
      },
      {
        "id": "UgyfHARKkcJBbXuqrDV4AaABAg.AO46DqmmFk8AO4FHy09o68",
        "author": "@jimmytimmy3680",
        "text": "Russia is Capitalist, not Imperialist.",
        "like_count": 4,
        "published_at": "2025-10-09T22:31:08Z",
        "is_reply": true
      },
      {
        "id": "UgyfHARKkcJBbXuqrDV4AaABAg.AO46DqmmFk8AO4XzeIK6H0",
        "author": "@isedairi",
        "text": "Mira Carlos deberias entrevistar al indispensable, Ruben Zardoya! Tengo varias diferencias con ustedes pero un elemento en comun es el reconocimiento de la importancia de muchas cosas que fiene Ruben que decir. El y Eliades Acosta, ambos haciendo su trabajo desde afuera de Cuba, son baluartes de la revolucion cubana!",
        "like_count": 0,
        "published_at": "2025-10-10T01:14:31Z",
        "is_reply": true
      },
      {
        "id": "UgyfHARKkcJBbXuqrDV4AaABAg.AO46DqmmFk8AO55ve_HQap",
        "author": "@servusprotervus6463",
        "text": "​@jimmytimmy3680 It's imperialist by Lenin's criteria of imperialism. Just small, but still imperialist. I's trying to be bigger, but can't",
        "like_count": 1,
        "published_at": "2025-10-10T06:28:33Z",
        "is_reply": true
      },
      {
        "id": "UgyfHARKkcJBbXuqrDV4AaABAg.AO46DqmmFk8AO5MLCz022Z",
        "author": "@mikemurray2027",
        "text": "@servusprotervus6463 It's being targeted by imperialism, so was the USSR, so is the PRC.",
        "like_count": 1,
        "published_at": "2025-10-10T08:51:59Z",
        "is_reply": true
      },
      {
        "id": "UgyfHARKkcJBbXuqrDV4AaABAg.AO46DqmmFk8AO5moxoRhN3",
        "author": "@alistairpage-mcgill2723",
        "text": "Even if you hate the ruling elites in Russia, I think it's important to make the distinction that Russia was forced to fight the SMO in self defence. They weren't trying to expand west, the Minsk agreements even betrayed the wishes of the donbass republics to join Russia. If the Russia leadership were to be considered imperialist, one would have to concede that they're not very good at being imperialists",
        "like_count": 1,
        "published_at": "2025-10-10T12:52:06Z",
        "is_reply": true
      },
      {
        "id": "UgyfHARKkcJBbXuqrDV4AaABAg.AO46DqmmFk8AO6ADff4OBx",
        "author": "@comradehogan7636",
        "text": "​@mikemurray2027 China is  imperialist",
        "like_count": 1,
        "published_at": "2025-10-10T16:25:20Z",
        "is_reply": true
      },
      {
        "id": "UgyfHARKkcJBbXuqrDV4AaABAg.AO46DqmmFk8AO6ATg4lWYw",
        "author": "@comradehogan7636",
        "text": "​@alistairpage-mcgill2723Capitalists always expand. That's what capital means",
        "like_count": 1,
        "published_at": "2025-10-10T16:27:31Z",
        "is_reply": true
      },
      {
        "id": "UgyfHARKkcJBbXuqrDV4AaABAg.AO46DqmmFk8AO6RM-b5fLE",
        "author": "@servusprotervus6463",
        "text": "​@alistairpage-mcgill2723I don’t feel hatred toward the Russian elites, nor toward any other elites. There’s no place for hate here. The bourgeois world runs on agreements between elites — and they keep deceiving each other anyway. What do these agreements mean for the working class? Nothing.\nElites live off our labor. Our task is to remove them.\n\nIn this conflict, only working people die and lose their health, while the elites on both sides grow richer. This war isn’t against Western imperialism — it was made by imperialists themselves, because they need new orders for their production. Construction companies get contracts to rebuild destroyed cities. Medical equipment and pharmaceutical industries are thriving. Even outdoor gear production grows thanks to war. And of course, the military industry faces no competition at all.",
        "like_count": 0,
        "published_at": "2025-10-10T18:55:01Z",
        "is_reply": true
      },
      {
        "id": "UgyfHARKkcJBbXuqrDV4AaABAg.AO46DqmmFk8AO6ZCu1XgzM",
        "author": "@servusprotervus6463",
        "text": "@mikemurray2027 You should learn what imperialism is. Start from \"Imperialism, the Highest Stage of Capitalism\"",
        "like_count": 0,
        "published_at": "2025-10-10T20:03:41Z",
        "is_reply": true
      },
      {
        "id": "UgyfHARKkcJBbXuqrDV4AaABAg.AO46DqmmFk8AO7HZCR9r9W",
        "author": "@chombers",
        "text": "uses the em dash frequently because it's a common punctuation mark in its vast training data, where it serves as a way to simulate natural speech, add emphasis, or insert a parenthetical thought. This pattern stems from the many human writers who utilized the em dash in the texts AI was trained on, leading the AI to adopt it as a default stylistic choice to mimic human expression and add a sense of flow and rhythm.",
        "like_count": 0,
        "published_at": "2025-10-11T02:48:41Z",
        "is_reply": true
      },
      {
        "id": "UgyfHARKkcJBbXuqrDV4AaABAg.AO46DqmmFk8AO7a448fjS4",
        "author": "@servusprotervus6463",
        "text": "​@chombersI use gpt chat because English is not my native lang and more of that youtube algorithm blocking my own texts so i redacting them with gpt",
        "like_count": 0,
        "published_at": "2025-10-11T05:39:11Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxG3Sdu-dT5FVHsgcl4AaABAg",
    "author": "@RetroGaming_07",
    "author_channel_id": "UCcpk4DMUL77bDwnugsEEHwQ",
    "text": "I admit i was willing to give Zohran a chance but not anymore and he is just another aoc 2.0 and people should not vote for him at all because he was never legit to begin with. Zohran is a total op and a shill for the dems in general. Democratic socialism is not real socialism at all and democratic socialism is the same as being a sheep dem voter. I'm still uneducated about communism but I'm interested to learn more about it. Good show yesterday Carlos and take care.",
    "like_count": 2,
    "published_at": "2025-10-10T11:07:11Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxG3Sdu-dT5FVHsgcl4AaABAg.AO5aoSHj1t7AQY9n0rUkjy",
        "author": "@kylehenderson5964",
        "text": "You thought not voting was the best option😂 Glad you do the thinking for only yourself",
        "like_count": 0,
        "published_at": "2025-12-10T06:23:05Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugxh5riST8ZbNQedk-V4AaABAg",
    "author": "@Braziliancouncilist-d9z",
    "author_channel_id": "UCidr1HWEXmjCACfZzf-Dvmg",
    "text": "Rare ACP W",
    "like_count": 0,
    "published_at": "2025-12-09T14:41:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  }
]