[
  {
    "id": "Ugzj3RRFzEI6PXMoBPN4AaABAg",
    "author": "@Darfail",
    "author_channel_id": "UCxLWlOGKkxWCjsma_faMzmA",
    "text": "Honestly I am loving these intellectual discussions",
    "like_count": 41,
    "published_at": "2021-02-21T13:43:12Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugzj3RRFzEI6PXMoBPN4AaABAg.9K16efEGNNL9K17GUb3TX3",
        "author": "@jakell99",
        "text": "Yeah, it's what I was hoping Lotus Eaters was going to be about. I'm less keen on the weekday stuff..",
        "like_count": 7,
        "published_at": "2021-02-21T13:48:29Z",
        "is_reply": true
      },
      {
        "id": "Ugzj3RRFzEI6PXMoBPN4AaABAg.9K16efEGNNL9KByQF-UOTJ",
        "author": "@cornbreadisbetterthanpizza6866",
        "text": "@jakell99 To be fair when you are reporting the daily news it's pretty hard to give a genuine intellectual discussion on the topic, but yeah this weekend stuff is much better.",
        "like_count": 0,
        "published_at": "2021-02-25T18:54:05Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyxLG3jdD2FweY02ax4AaABAg",
    "author": "@doctorbritain9632",
    "author_channel_id": "UCgZntwKRdy-7UYz6cUEKvZw",
    "text": "I've always thought that Marx is one of the most easily debunked philosophers / economists that there is.  My feeling is that because his utopian goals are on the face of it \"attractive\" people blind themselves to the absurdities.",
    "like_count": 59,
    "published_at": "2021-02-21T16:02:45Z",
    "is_reply": false,
    "reply_count": 10,
    "replies": [
      {
        "id": "UgyxLG3jdD2FweY02ax4AaABAg.9K1McrTd47p9K1WF1CT9oF",
        "author": "@catdogfishdogcats",
        "text": "It's because utopian means a dream, something to aspire to even though it is inherently unlikely or impossible.  It's the same as the dream of the lottery.  \"If I work to earn this dollar, and spend it on a ticket, it might become 1 million dollars, and I will no longer have to work (Or be on welfare). It is based on emotional, not rationale, that's why it's successful.  The people who follow Marx don't have to critically analyze whether it would work, or where it's endpoints lead, they just have to believe in it, like a god, and work for it's ends in hope that like the Lotto Ticket it will give them what they want.",
        "like_count": 9,
        "published_at": "2021-02-21T17:26:45Z",
        "is_reply": true
      },
      {
        "id": "UgyxLG3jdD2FweY02ax4AaABAg.9K1McrTd47p9K1kJRlB0ep",
        "author": "@Dude0000",
        "text": "@catdogfishdogcats the Lottery’s a tax on stupidity so I agree.\nEdit for grammar a & spelling.",
        "like_count": 1,
        "published_at": "2021-02-21T19:38:25Z",
        "is_reply": true
      },
      {
        "id": "UgyxLG3jdD2FweY02ax4AaABAg.9K1McrTd47p9K1qExHbPkY",
        "author": "@anthonylipira9526",
        "text": "Marxism persists because it appeals to every generation's talentless, resentful losers.",
        "like_count": 9,
        "published_at": "2021-02-21T20:30:14Z",
        "is_reply": true
      },
      {
        "id": "UgyxLG3jdD2FweY02ax4AaABAg.9K1McrTd47p9K2TAdMQuzT",
        "author": "@badlaamaurukehu",
        "text": "Woman thinking.  It's completely useless once the kids can think for themselves.",
        "like_count": 0,
        "published_at": "2021-02-22T02:19:10Z",
        "is_reply": true
      },
      {
        "id": "UgyxLG3jdD2FweY02ax4AaABAg.9K1McrTd47p9K3PjWMe77h",
        "author": "@SomeCanine",
        "text": "Marx didn't start a political movement. He started a religion.",
        "like_count": 2,
        "published_at": "2021-02-22T11:08:21Z",
        "is_reply": true
      },
      {
        "id": "UgyxLG3jdD2FweY02ax4AaABAg.9K1McrTd47p9K45neIVG5t",
        "author": "@MrKago1",
        "text": "@anthonylipira9526 mmm,  yeah, but they aren't the problem.  the are losers.  they don't make any noise, not successfully any way.  too lazy.  who it attracts that become the problem are the narcissists.  they DO make a lot of noise.  every narcissist sees Marxism and thinks to themselves, \"If I was in charge of that, I could make the perfect world because I would make the world about me.\"",
        "like_count": 1,
        "published_at": "2021-02-22T17:33:24Z",
        "is_reply": true
      },
      {
        "id": "UgyxLG3jdD2FweY02ax4AaABAg.9K1McrTd47p9K6PgmHpVgw",
        "author": "@anthonylipira9526",
        "text": "@MrKago1 That's a good point.",
        "like_count": 0,
        "published_at": "2021-02-23T15:05:42Z",
        "is_reply": true
      },
      {
        "id": "UgyxLG3jdD2FweY02ax4AaABAg.9K1McrTd47p9KBR86ZjJ5Z",
        "author": "@michaelsorensen7567",
        "text": "@MrKago1 narcissists without followers aren't going to have the power to achieve.\n\nI think it's a chicken/egg sort of situation, and you need both the narcissists to lead and the losers to support or it will fizzle. Narcissists can think they'll do great with power all they want, and if no one gives it to them they're ineffective. Lazy people can want someone to gibs all they want, but they're too apathetic to implement it.",
        "like_count": 0,
        "published_at": "2021-02-25T13:54:31Z",
        "is_reply": true
      },
      {
        "id": "UgyxLG3jdD2FweY02ax4AaABAg.9K1McrTd47p9KFY_k6aThX",
        "author": "@Dude0000",
        "text": "@michaelsorensen7567 Thomas Sowel said he was a Marxist in his youth as it was the only game in town that pushed boundaries. Why did he change “FACTS” 🤜🏻⬇️🎤 👍🏼",
        "like_count": 1,
        "published_at": "2021-02-27T04:16:33Z",
        "is_reply": true
      },
      {
        "id": "UgyxLG3jdD2FweY02ax4AaABAg.9K1McrTd47p9KszIfxvgq_",
        "author": "@mfbias4048",
        "text": "How many Marxists have a deep understanding of Marx? Or do they just run with a few slogans? \n\nAll they talk about is the ‘means of production’ as if that is enough. How do you implement the takeover without death and destruction and keep production running and innovating to provide for society. Their answer ‘but the means of production!’",
        "like_count": 1,
        "published_at": "2021-03-14T21:08:22Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugyr6Q0CxVqw_kK4auF4AaABAg",
    "author": "@sik3xploit",
    "author_channel_id": "UCvIm4FTjAG9owGoXn3nr4Bg",
    "text": "Marx was just another kid at Starbucks who would tweet about how hard life is while his rich parents pay off his debts.",
    "like_count": 21,
    "published_at": "2021-02-21T17:53:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgweUlW9S6p18x5Qzs94AaABAg",
    "author": "@CoffeeConnected",
    "author_channel_id": "UCAqHaVmucXejiMavEp3BWHg",
    "text": "When the collective becomes the most important objective then individual human lives become so undervalued that it gets to the point where their lives are disposable.\nIt would stand to reason that individuals who oppose the collective become a threat to its existence and therefore would likely be 'removed' to ensure its own survival.",
    "like_count": 14,
    "published_at": "2021-02-21T16:13:35Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgweUlW9S6p18x5Qzs94AaABAg.9K1NsBpk1qC9K1hr-6MFHA",
        "author": "@jellytroid",
        "text": "Ussr in a nutshell",
        "like_count": 1,
        "published_at": "2021-02-21T19:16:55Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwTGoe0vAAHjIQQQfJ4AaABAg",
    "author": "@CoffeeConnected",
    "author_channel_id": "UCAqHaVmucXejiMavEp3BWHg",
    "text": "I noticed that this was in 2 parts, but as interesting as it was I got the feeling that you were only getting started and merely scratched the surface. You only covered about 4 points of discussion over the 2 videos and I felt that there was a lot more to cover.\nI enjoyed the videos but can't help the feeling that the topic was cut short before you really got started.",
    "like_count": 15,
    "published_at": "2021-02-21T15:45:26Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwcyzyFpvWJve-_Ao94AaABAg",
    "author": "@clintonknight9798",
    "author_channel_id": "UCwXI5WUp7171ZLxbFEGH1CA",
    "text": "Maslow's Hierarchy of needs would love to have a word with Marx's view on our base instincts.",
    "like_count": 52,
    "published_at": "2021-02-21T13:05:46Z",
    "is_reply": false,
    "reply_count": 5,
    "replies": [
      {
        "id": "UgwcyzyFpvWJve-_Ao94AaABAg.9K12Na9v52o9K12guIRaUY",
        "author": "@clintonknight9798",
        "text": "LMAO! I literally wrote my comment above a minute afore he goes into it. :)",
        "like_count": 6,
        "published_at": "2021-02-21T13:08:33Z",
        "is_reply": true
      },
      {
        "id": "UgwcyzyFpvWJve-_Ao94AaABAg.9K12Na9v52o9K1ANvr3IKp",
        "author": "@cymes82",
        "text": "Figures that a filthy commie wouldn't consider food as one of the priorities. That's the defining feature of all communist regimes , the fact that you'll not have enough food.",
        "like_count": 14,
        "published_at": "2021-02-21T14:15:43Z",
        "is_reply": true
      },
      {
        "id": "UgwcyzyFpvWJve-_Ao94AaABAg.9K12Na9v52o9K1nnCxRtm5",
        "author": "@magisterrleth3129",
        "text": "To be fair, Karl Marx had been dead for 60 years by the time Maslow's Hierarchy of Needs was established.",
        "like_count": 1,
        "published_at": "2021-02-21T20:08:50Z",
        "is_reply": true
      },
      {
        "id": "UgwcyzyFpvWJve-_Ao94AaABAg.9K12Na9v52o9K2UIv8wb9v",
        "author": "@badlaamaurukehu",
        "text": "@magisterrleth3129 It's not rocket science.",
        "like_count": 0,
        "published_at": "2021-02-22T02:29:02Z",
        "is_reply": true
      },
      {
        "id": "UgwcyzyFpvWJve-_Ao94AaABAg.9K12Na9v52o9KC-r7CPAFQ",
        "author": "@cornbreadisbetterthanpizza6866",
        "text": "@magisterrleth3129 Yes, I don't think that it's accurate even to say that Marx wouldn't have been appalled to see the results of his theories. He was just a writer from Germany with some extreme ideas not the guys who actually hurt people to force some dumb ideas into reality.",
        "like_count": 0,
        "published_at": "2021-02-25T19:15:22Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzdLFkD7pW4vDIitHt4AaABAg",
    "author": "@pRopaaNS",
    "author_channel_id": "UCsA_S4qfDrGeS4ZA5M_ulnw",
    "text": "Sounds like Marx rejects foundations of human nature as \"animalistic\", while having vision on some utopian humanistic characteristics, that are completely detached from such roots. Definetly not something that can ever lead to disaster.",
    "like_count": 51,
    "published_at": "2021-02-21T15:21:13Z",
    "is_reply": false,
    "reply_count": 9,
    "replies": [
      {
        "id": "UgzdLFkD7pW4vDIitHt4AaABAg.9K1HsdR1_ao9K1LfmXrTzo",
        "author": "@CoffeeConnected",
        "text": "He seemed to believe that the human proclivity to want to achieve something as an individual and perhaps learn about yourself and become a better person by progressively bettering yourself had to be suppressed in favour of forcing people to be a slave to the collective.\n\nHe suggests that this is better for people but I never hear demonstrable evidence for why that would be. He just asserts that it is.\nThe only concrete evidence we have accumulated since Marx demonstrates the very worst outcomes for people imaginable.",
        "like_count": 8,
        "published_at": "2021-02-21T15:54:25Z",
        "is_reply": true
      },
      {
        "id": "UgzdLFkD7pW4vDIitHt4AaABAg.9K1HsdR1_ao9K1okyLovqu",
        "author": "@magisterrleth3129",
        "text": "It seems to me, Karl Marx was something of a hopeless optimist. I can't imagine being an atheist and simultaneously having a positive opinion of the human animal. I guess it goes to show Marx was wrong. Operating on the assumption that selfishness can be eliminated, communism could work. Unfortunately, humans are selfish, and the result is always a despotic autocrat.",
        "like_count": 1,
        "published_at": "2021-02-21T20:17:16Z",
        "is_reply": true
      },
      {
        "id": "UgzdLFkD7pW4vDIitHt4AaABAg.9K1HsdR1_ao9K1w4d9yRby",
        "author": "@pRopaaNS",
        "text": "@magisterrleth3129  I think that Idea that humans are selfish by itself is a misunderstanding of human nature. \"Selfishness\" by itself is a loaded term, it assumes malicious intent.",
        "like_count": 5,
        "published_at": "2021-02-21T21:21:15Z",
        "is_reply": true
      },
      {
        "id": "UgzdLFkD7pW4vDIitHt4AaABAg.9K1HsdR1_ao9K2-Yc5T8nc",
        "author": "@magisterrleth3129",
        "text": "@pRopaaNS I don't assume malicious intent, people are always acting in their self-interest in one way or another.",
        "like_count": 1,
        "published_at": "2021-02-21T22:00:18Z",
        "is_reply": true
      },
      {
        "id": "UgzdLFkD7pW4vDIitHt4AaABAg.9K1HsdR1_ao9K2VwsBjTcC",
        "author": "@pRopaaNS",
        "text": "@magisterrleth3129 Then why did Marx attempt to eliminate it, what's the reason to get rid of it? Why unfortunate that humans are selfish?",
        "like_count": 0,
        "published_at": "2021-02-22T02:43:22Z",
        "is_reply": true
      },
      {
        "id": "UgzdLFkD7pW4vDIitHt4AaABAg.9K1HsdR1_ao9K2cHMtnDFV",
        "author": "@magisterrleth3129",
        "text": "@pRopaaNS It's unfortunate that humans are selfish, because if they weren't, communism would have probably succeeded, and all the deaths it caused would not have happened. Marx wanted an end to selfishness in pursuit of a utopian dream, undoubtedly shaped by the time line of his life, where industrialization kicked off, and unionization hadn't by the time he died. He wanted to eliminate selfishness because that's the only way communism could work. I don't think selfishness is possible or even desirable to completely remove from the human equation, personally.",
        "like_count": 0,
        "published_at": "2021-02-22T03:47:28Z",
        "is_reply": true
      },
      {
        "id": "UgzdLFkD7pW4vDIitHt4AaABAg.9K1HsdR1_ao9K58dPG8DCY",
        "author": "@doochicka",
        "text": "The thing I've come to understand is that ideologies that's aim is separate \"Human\" from \"Animal\" in the vain of finding some sort of Post-Animal human characteristics always end in Horrible disaster. Whether it's Fascism, Religious extremism, Socialism/Communism, Monarchy etc. Ideologies that try to see Human beings as anything other than just another animal tends to result in some of the most horrible atrocities committed in achieving those ends.",
        "like_count": 0,
        "published_at": "2021-02-23T03:17:27Z",
        "is_reply": true
      },
      {
        "id": "UgzdLFkD7pW4vDIitHt4AaABAg.9K1HsdR1_ao9K62txvJ0ju",
        "author": "@pRopaaNS",
        "text": "@magisterrleth3129 If humans weren't selfish, then maybe it would have never come to this and we'd have gone extinct long time ago. The crux of what makes humanity prosper is that each of us are capable of taking care of themselves, which greatly reduces amount of problems for collective to work together to solve. Like Jordan Peterson says, first sort out your own room, before thinking about correcting the world. It is because so many of us have our lives in order that there is luxury of having spare resources to work on higher level problems.",
        "like_count": 0,
        "published_at": "2021-02-23T11:46:32Z",
        "is_reply": true
      },
      {
        "id": "UgzdLFkD7pW4vDIitHt4AaABAg.9K1HsdR1_ao9KBwLvCl7sQ",
        "author": "@cornbreadisbetterthanpizza6866",
        "text": "@CoffeeConnected Yes, and also he seems to suggest one of the worst parts of the economy is that the \"capitalist\" as he calls it runs the economy without the consent of the workers (and therefore steals the labor of the workers). His solution is for workers to create one giant collective governing force. The problem is that capitalists gain their place in the economy through voluntary interaction with workers (via free trade), and thus this collective government will become the new \"capitalists\".\n\nTherefore, if Marx's dream of a dictatorship of the proletariat then it would result in what we have seen all throughout history. The economy is being controlled by the \"capitalist\" (using Marx's definition of a tyrant he controls the economy without the consent of the governed) he claims to hate. If the governing force is the same as the industrial force (Marx's dictatorship of the proletariat, or Mussolini's fascism) then that means there is no accountability, and thus it results in what was seen all throughout the history of Communism and fascism.",
        "like_count": 0,
        "published_at": "2021-02-25T18:36:01Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx0k9uis7BI8fG9EFt4AaABAg",
    "author": "@azrasashima",
    "author_channel_id": "UCDCo5NA3pJlG8M0R7LzGqAQ",
    "text": "i hate how having to say \"theres always an exception.\" has become a literal disclaimer in modern day.",
    "like_count": 16,
    "published_at": "2021-02-21T16:33:23Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "Ugx0k9uis7BI8fG9EFt4AaABAg.9K1Q88LJNsW9K23hsya1X2",
        "author": "@jackburgin9067",
        "text": "#NotAll is a depressing factor on todays discourse. It fundamentally comes from lazy low context but high attention drawing bombastic politics that usually crops up on the left and the right have to admit the pedantic argument is valid because of the desire to stay fact based. \nThere's a video of an Israeli woman that rings a bell where she emphasises the point that the peacefull majority is irrelevant in the case of dangerous regeimes of the past and present, such as germans during ww2, Muslims today, Russians in the USSR and the present day.",
        "like_count": 2,
        "published_at": "2021-02-21T22:36:39Z",
        "is_reply": true
      },
      {
        "id": "Ugx0k9uis7BI8fG9EFt4AaABAg.9K1Q88LJNsW9K3mEtB2IH4",
        "author": "@RichardHardslab",
        "text": "I’ve had a bunch of folks come at statistics with personal anecdotes and have had to reply with “and yet despite it not being like that for you it was still like that in general.”",
        "like_count": 1,
        "published_at": "2021-02-22T14:33:45Z",
        "is_reply": true
      },
      {
        "id": "Ugx0k9uis7BI8fG9EFt4AaABAg.9K1Q88LJNsW9K4KWrfl54E",
        "author": "@strangeboy904",
        "text": "Tis because leftists always jump to hyperbolic conclusions",
        "like_count": 1,
        "published_at": "2021-02-22T19:42:03Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxdXeBNsqDw4f1UmdZ4AaABAg",
    "author": "@M4dM4n96",
    "author_channel_id": "UC9oIYe-JIzVid0HM0oZb_pA",
    "text": "I like Josh.\nEspecially because, to be able to listen to him, it has to be in 1.25× and it makes Hugo looknsound like he's just hit that point of the sesh where you have the most intense conversations",
    "like_count": 9,
    "published_at": "2021-02-21T18:41:26Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgxdXeBNsqDw4f1UmdZ4AaABAg.9K1dn-lhPYr9K1jriSML2v",
        "author": "@generalgrievousxxx",
        "text": "yeah he's a really good speaker Josh. Top draw stuff.",
        "like_count": 5,
        "published_at": "2021-02-21T19:34:30Z",
        "is_reply": true
      },
      {
        "id": "UgxdXeBNsqDw4f1UmdZ4AaABAg.9K1dn-lhPYr9K200hxc7ah",
        "author": "@NZAnimeManga",
        "text": "@generalgrievousxxx agreed on both counts 😂",
        "like_count": 0,
        "published_at": "2021-02-21T22:04:24Z",
        "is_reply": true
      },
      {
        "id": "UgxdXeBNsqDw4f1UmdZ4AaABAg.9K1dn-lhPYr9K754f-JuEk",
        "author": "@M4dM4n96",
        "text": "All jokes aside, he is a great addition to the team.\nExquisitely British.",
        "like_count": 1,
        "published_at": "2021-02-23T21:24:51Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzoUTLYjb7dZ8cVcRx4AaABAg",
    "author": "@bryanb.386",
    "author_channel_id": "UCke3is7UrWTyjoib5l3Ir8Q",
    "text": "No need to watch, I will save everyone time.  Marx on the individual: \"you give to me, and I take from you.\"",
    "like_count": 44,
    "published_at": "2021-02-19T23:48:00Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgzoUTLYjb7dZ8cVcRx4AaABAg.9Jy2HiOSyWE9K18gMrj8lA",
        "author": "@tunacracker1",
        "text": "you forgot \"and you will be happy\"",
        "like_count": 11,
        "published_at": "2021-02-21T14:00:54Z",
        "is_reply": true
      },
      {
        "id": "UgzoUTLYjb7dZ8cVcRx4AaABAg.9Jy2HiOSyWE9K1q9d4nUfj",
        "author": "@coralld1163",
        "text": "\"Whats yours is mine and whats mine is mine\" Marx",
        "like_count": 2,
        "published_at": "2021-02-21T20:29:31Z",
        "is_reply": true
      },
      {
        "id": "UgzoUTLYjb7dZ8cVcRx4AaABAg.9Jy2HiOSyWE9K4TnJyw6xW",
        "author": "@tunacracker1",
        "text": "@coralld1163 all for one and more for me",
        "like_count": 1,
        "published_at": "2021-02-22T21:03:04Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugz2YeH5nkzFQu9NFC94AaABAg",
    "author": "@bmorehobo",
    "author_channel_id": "UCyYzeBh1sii4u3FeXW4fgQQ",
    "text": "Marx should have gotten a job if his children were starving.",
    "like_count": 59,
    "published_at": "2021-02-21T13:41:32Z",
    "is_reply": false,
    "reply_count": 6,
    "replies": [
      {
        "id": "Ugz2YeH5nkzFQu9NFC94AaABAg.9K16TTxNqIL9K1AMkruZWX",
        "author": "@mrbigglezworth42",
        "text": "He did, and would routinely get fired due to his incompetence then would eventually get stipends from his rich parents in the hopes that he would invest it and live in a more modest home to support his wife and children. He didn't invest any of it, and would regularly spend it to live a decadent lifestyle as he thought he deserved. When his parents sent a maid to him to help care for the children, he got her pregnant then had his friend Fredrich Engels take the blame for it.\n\nMarx was an asshole.",
        "like_count": 54,
        "published_at": "2021-02-21T14:15:33Z",
        "is_reply": true
      },
      {
        "id": "Ugz2YeH5nkzFQu9NFC94AaABAg.9K16TTxNqIL9K1cIWoOdP0",
        "author": "@jerrodbates8480",
        "text": "@mrbigglezworth42 \nWhaaaat",
        "like_count": 3,
        "published_at": "2021-02-21T18:28:23Z",
        "is_reply": true
      },
      {
        "id": "Ugz2YeH5nkzFQu9NFC94AaABAg.9K16TTxNqIL9K1dFN-h3Bj",
        "author": "@evensgrey",
        "text": "@jerrodbates8480 This is some famous events, here.  Marx not only got (and lost) a number of jobs, he actually had a base income of something like a thousand pounds a year from his portion of his family's FACTORIES.  His increasingly heavy debts eventually left him, his wife, their four children, and the previously mentioned maid living in a 2-room apartment.  It was at this point he started having sex with the maid (the degree to which this was voluntary on the part of the maid is unclear, but technically from a Marxist point of view he DIDN'T have an economic hold on her, as he NEVER PAID HER ANYTHING), got her pregnant, and then insisted he wasn't the father and threw her out on the street with nothing but the clothes on her back.",
        "like_count": 15,
        "published_at": "2021-02-21T18:36:42Z",
        "is_reply": true
      },
      {
        "id": "Ugz2YeH5nkzFQu9NFC94AaABAg.9K16TTxNqIL9K1sYip3FGK",
        "author": "@Ocasio-CortezPrez",
        "text": "@jerrodbates8480 makes it more apparent why the left idolizes him, right? He was livin the leftist dream....",
        "like_count": 8,
        "published_at": "2021-02-21T20:50:25Z",
        "is_reply": true
      },
      {
        "id": "Ugz2YeH5nkzFQu9NFC94AaABAg.9K16TTxNqIL9K26qnEk4vg",
        "author": "@ChuckSteak1",
        "text": "@evensgrey What a surprise that the brains behind one of the most destructive ideologies in recent memory was a total piece of shit.",
        "like_count": 6,
        "published_at": "2021-02-21T23:04:05Z",
        "is_reply": true
      },
      {
        "id": "Ugz2YeH5nkzFQu9NFC94AaABAg.9K16TTxNqIL9KByaTqQt8-",
        "author": "@cornbreadisbetterthanpizza6866",
        "text": "I don't like Marx as much as the next guy, but writing is a job.",
        "like_count": 0,
        "published_at": "2021-02-25T18:55:37Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyXruZp0A-jW5_84gZ4AaABAg",
    "author": "@Purwapada",
    "author_channel_id": "UCb_v0CVpTD2TPQnAvIBaT8g",
    "text": ".\nThis weekend podcast with hugo is great because I'm currently doing my psych degree",
    "like_count": 10,
    "published_at": "2021-02-21T13:58:20Z",
    "is_reply": false,
    "reply_count": 5,
    "replies": [
      {
        "id": "UgyXruZp0A-jW5_84gZ4AaABAg.9K18OYqnUgm9K19Jv2PF8F",
        "author": "@jakell99",
        "text": "So like me, I presume you are always wanting more. I think Josh needs to work a bit more on bridging topics though, here the politics and psychology (theory) were a little too distinct for my taste.\n\nPsychology is my own major interest too, and more often than not I find myself reaching for evolutionary psychology to create the bridge with real world behaviour..",
        "like_count": 0,
        "published_at": "2021-02-21T14:06:26Z",
        "is_reply": true
      },
      {
        "id": "UgyXruZp0A-jW5_84gZ4AaABAg.9K18OYqnUgm9K1Ag4t2ADQ",
        "author": "@Purwapada",
        "text": ".\n@jakell99 yeh, it's good, but I am satisfied tbh. Although I agreewith the points you made, so yeh",
        "like_count": 1,
        "published_at": "2021-02-21T14:18:20Z",
        "is_reply": true
      },
      {
        "id": "UgyXruZp0A-jW5_84gZ4AaABAg.9K18OYqnUgm9K1BhwtmaUn",
        "author": "@jakell99",
        "text": "@Purwapada I'm always wanting more though, which is why I was a crap student at University and didn't finish my degree, always wanting to study related subjects rather than the one in front of me.\n\n Regarding that 'related' thing though, I once made an observation that you may like:\nThe question of whether psychology is a science or a humanity comes up fairly regularly, and I eventually concluded that the answer is 'neither and both' - that it is its _own_ subject and additionally is broad enough to speak to most other subjects - I compress this last into 'Man is the measure of all things\" if I want to make it more accessible..",
        "like_count": 0,
        "published_at": "2021-02-21T14:27:20Z",
        "is_reply": true
      },
      {
        "id": "UgyXruZp0A-jW5_84gZ4AaABAg.9K18OYqnUgm9K1HIGghxkT",
        "author": "@differous01",
        "text": "The Marxian presupposition that history leads inevitably towards Communism is derived from Hegel and called Dialectic Materialism. It is a bowdlerised take on the Biblical tradition.\r\n\"To understand Marx psychologically one should use the following dictionary:\r\nYahweh = Dialectical Materialism \r\nThe Messiah = Marx \r\nThe elect = the proletariat\r\nThe Church = the Communist Party \r\nThe second coming = the revolution \r\nHell = punishment of the capitalist \r\nThe millennium = the Communist Commonwealth.\r\n\r\nThe terms on the left give the emotional content of the terms on the right, and it is this emotional content, familiar to those who have had a Jewish or a Christian upbringing, that makes Marx’s eschatology credible.\r\n\r\nA similar dictionary could be made for the Nazis, but their conceptions are more purely Old Testament, and less Christian than those of Marx and their Messiah is more analogous to the Macabees than to Christ.”\r\n[Bertrand Russell’s ‘A History of Western Philosophy’]",
        "like_count": 0,
        "published_at": "2021-02-21T15:16:07Z",
        "is_reply": true
      },
      {
        "id": "UgyXruZp0A-jW5_84gZ4AaABAg.9K18OYqnUgm9K2UahijqhX",
        "author": "@badlaamaurukehu",
        "text": "@jakell99 Check out Gad Saad.",
        "like_count": 0,
        "published_at": "2021-02-22T02:31:36Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugy0L61p5wW231YEsx14AaABAg",
    "author": "@contradeception7100",
    "author_channel_id": "UCuOrUQow4_JqWxybBJjJo5A",
    "text": "Even plants feel the desire to shoot their sticky sweet pollen all over the world. These mega coomers provide a view at self-interest from a different perspective from mammalian or reptilian creatures. If nature deems it necessary we have a self interest in survival, why does a man deny another their natural right to desire and achieve freedom to fail? Power and insecurity. If you are so confident in your ideas let them be judged and by that be judged on your actions and desires. \nEdit: Spelling",
    "like_count": 19,
    "published_at": "2021-02-21T14:15:15Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugy0L61p5wW231YEsx14AaABAg.9K1AKU0tByZ9K1MkuWnKh8",
        "author": "@CoffeeConnected",
        "text": "It relies on people becoming completely dependent on the whoever controls the system.\nWhen it fails at the top then it's a catastrophe for everybody held hostage by this centralized system of power.\nNot only would people have been taught to depend on the system for their material needs they would also be dependent on it psychologically. Thus ensuring that people are less likely to be adaptive in order to survive outside of that system.",
        "like_count": 2,
        "published_at": "2021-02-21T16:03:51Z",
        "is_reply": true
      },
      {
        "id": "Ugy0L61p5wW231YEsx14AaABAg.9K1AKU0tByZ9K2AsY7ZnUS",
        "author": "@iguess2739",
        "text": "@CoffeeConnected And as Nietzsche  would agree, such a way of operating yourself is stagnation.",
        "like_count": 1,
        "published_at": "2021-02-21T23:39:17Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxyEosseYiNF_YYDeF4AaABAg",
    "author": "@greyvoice7949",
    "author_channel_id": "UC5LzH0RQQ1QmkvkekL4e3iA",
    "text": "Human Nature will always get in the way of anything that can be thought up as to any 'system' of living. Corruption will always grow , abuses of any power etc. etc. That old proverb is true 'absolute power corrupts absolutely'.",
    "like_count": 3,
    "published_at": "2021-02-22T11:12:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxJqgOaMkjB4_FeFB54AaABAg",
    "author": "@jamieoconnor8692",
    "author_channel_id": "UCtlFZ_aH_IxXvh9neXUM0Aw",
    "text": "Very interesting. Many thanks guys.",
    "like_count": 3,
    "published_at": "2021-02-21T13:32:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxZWAciHdnrw50nN4R4AaABAg",
    "author": "@YinglisTheYinglet",
    "author_channel_id": "UC0EGt-pvKtg-07AAWma1VCA",
    "text": "@LotusEaters\n...there’s no cultural difference between the need to eat and drink before achieving security. it’s hard to be secure if you’re starving  or freezing...that’s a fact, what do you mean discredited?\n\nthe heirarchy of needs spilts the needs into 3 major groups, \n\nbase needs: eat drink, warm, safety, ...\n\npsychological needs: love, belonging, sense of self, prestige, esteem, ...\n\nthan the last one self accuallization, content that you were the best you could be.\n\nMaslow’s heirarchy is a key area of study and widely used even outside of the sciences.\n\nnor is it culturally specific to the west, Maslow wrote his heirarchy of needs after studying and engaging with the BlackFoot Nation.\n\nhe was criticized for misrepresenting the blackfoot world view and studying an exceedingly exceptional portion of the population outside of his study of the blackfoot. and for putting s3x too low on the heirarchy.\n\nit has also been criticized for being somehow wacist.\n\nand for degrading humanity by suggesting that human’s lower nature must be satisfied before the higher nature of humans can be achieved to make them distinct from animals.\n\nin modern era the only real adjustment that was actually made was saying that the heirarchy is more flexible than full filling every last requirement before moving up a level.\n\nyou are objectively not safe if you’re starving, freezing, and... so not at least full filling some of these things does in fact make it objectively harder to reach anything from the level above it.",
    "like_count": 4,
    "published_at": "2021-02-21T22:11:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyUk_RdR18hgLO7OhJ4AaABAg",
    "author": "@loosemoose5217",
    "author_channel_id": "UCh7h7zGLASZcVdjUAfLub_A",
    "text": "5:07 yup marx jumped from apartment to apartment skimping on rent if I believe correctly with his wife, he had money, but he and his wife decided to spend it on fur coats and luxury items instead, causing his kids to suffer greatly",
    "like_count": 2,
    "published_at": "2021-02-22T19:44:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwDiVC9XGWe2APn0MZ4AaABAg",
    "author": "@TheInstinctWithinV2",
    "author_channel_id": "UCiNATM1LRKCXJr3-nFhSl6A",
    "text": "I like how they're both constantly grinning",
    "like_count": 1,
    "published_at": "2021-02-22T01:57:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz8ShQE7H9YyOUwicl4AaABAg",
    "author": "@NZAnimeManga",
    "author_channel_id": "UCTiJwH41dhxVOlBwgK96Zyg",
    "text": "Love the dynamic between you two. Great two-parter!",
    "like_count": 1,
    "published_at": "2021-02-21T22:06:33Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxcAIbvaQsrj3z59Hh4AaABAg",
    "author": "@nick8292",
    "author_channel_id": "UCZ3B68VxwgxiO_nvYqEcFQg",
    "text": "More like this, please. \nThanks!",
    "like_count": 0,
    "published_at": "2021-02-23T00:10:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwW2JZHpBClnvXVLA54AaABAg",
    "author": "@ReasonAboveEverything",
    "author_channel_id": "UCtdXR3EIGlv-ZHzdh0R0vZg",
    "text": "This is why I subbed.",
    "like_count": 3,
    "published_at": "2021-02-21T14:47:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwv5ZmT3weuiUnajbB4AaABAg",
    "author": "@RexNicolaus",
    "author_channel_id": "UCADwK95W2e5INhKpmHhb5Gw",
    "text": "Irony that Marx spent money on himself with the cost of his children’s lives. Goes on to preach about the cruxes of capitalism.",
    "like_count": 7,
    "published_at": "2021-02-21T23:50:37Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugwv5ZmT3weuiUnajbB4AaABAg.9K2CAchIpdQ9K3NP1oqiz0",
        "author": "@BigBroTejano",
        "text": "Marx’s flagrant inability to properly manage the money that friends and family gave to him, and his own adamant position that he never work a job and earn his own money cost the lives of both of his young sons according to Marx’s own wife. Marx’s daughters though they would live to adult hood... ya... they didn’t have much better(and some not much longer) lives thanks in many ways to their father’s horrid behavior and unyielding control over their lives.",
        "like_count": 1,
        "published_at": "2021-02-22T10:47:57Z",
        "is_reply": true
      },
      {
        "id": "Ugwv5ZmT3weuiUnajbB4AaABAg.9K2CAchIpdQ9K3OagiXji1",
        "author": "@RexNicolaus",
        "text": "@BigBroTejano it’s a shame that people who idolize his ideology don’t even know who the man really is. I’m willing to bet this man created this ideology to watch the world burn because he ain’t practicing what he preaches.",
        "like_count": 3,
        "published_at": "2021-02-22T10:58:25Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyZcnhFHFFBfv5BSC14AaABAg",
    "author": "@catdogfishdogcats",
    "author_channel_id": "UChzCQryshwJZUxV179P3eeQ",
    "text": "Need for Achievement- Armament Haki\n\nNeed for Affiliation- Observation Haki\n\nNeed for Power- Conquer's Haki",
    "like_count": 5,
    "published_at": "2021-02-21T17:20:26Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgyZcnhFHFFBfv5BSC14AaABAg.9K1VWpqtFCT9K206Q6ANJJ",
        "author": "@NZAnimeManga",
        "text": "Nice.",
        "like_count": 1,
        "published_at": "2021-02-21T22:05:11Z",
        "is_reply": true
      },
      {
        "id": "UgyZcnhFHFFBfv5BSC14AaABAg.9K1VWpqtFCT9K27bolwWhR",
        "author": "@catdogfishdogcats",
        "text": "@NZAnimeManga when u making your next video",
        "like_count": 0,
        "published_at": "2021-02-21T23:10:47Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugyf3-QZRFlLf9wxleV4AaABAg",
    "author": "@canolathra6865",
    "author_channel_id": "UCHCGE1mO4zdzYVIU02Dyidg",
    "text": "I don't know how things work in Britain, but here in the States the only reason most people can retire at 65 is because of federal welfare in the form of Social Security.\nAnd as small businesses fail and the job market becomes more and more dominated by mega-corporations, the more and more Marx's evaluation of employment becomes true. And this isn't the first time such a thing has happened. Look up \"Company Store\" to see a system from the 1800s that nearly matches Marx's employment critique.",
    "like_count": 1,
    "published_at": "2021-02-22T07:11:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy3ylPpqr8O3RV46rF4AaABAg",
    "author": "@albertchurchill4845",
    "author_channel_id": "UCI0bAHIkrR2Gd-I-dZVqHxA",
    "text": "Marx was Quite taken with his own intellect. A legend in his own mind as it were.",
    "like_count": 0,
    "published_at": "2021-10-26T19:06:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwgViNZISRI2-2wk1h4AaABAg",
    "author": "@bug5654",
    "author_channel_id": "UCtExFJBGxUwG9qMi3D7LHOw",
    "text": "12:14 We've been found out, boys.",
    "like_count": 2,
    "published_at": "2021-02-22T04:08:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxk97KOMpkWHtEigv14AaABAg",
    "author": "@110gotrek",
    "author_channel_id": "UCRG1rC1_cm4sW-SbV7R7_Vg",
    "text": "I need a part 3",
    "like_count": 1,
    "published_at": "2021-02-21T14:51:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxTRmiccJ2nV_OM0GJ4AaABAg",
    "author": "@shosugino6716",
    "author_channel_id": "UCaBdLda7m5h5Ss_EzHXraCA",
    "text": "In competitive behavior there is always a loser. -Nash",
    "like_count": 1,
    "published_at": "2021-02-21T17:36:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyeJ9llqx9hVSwhNdh4AaABAg",
    "author": "@lemonlime9073",
    "author_channel_id": "UClEaOOzpasH6EdY8jMUoZ2g",
    "text": "I enjoyed this content",
    "like_count": 2,
    "published_at": "2021-02-21T14:06:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw3JvUVoKUvi_8Mb2x4AaABAg",
    "author": "@Fredman5551",
    "author_channel_id": "UCVlnp7pTFiMUhu2Y62Xhmmg",
    "text": "Loved part one. Can’t wait for this!",
    "like_count": 8,
    "published_at": "2021-02-20T18:23:48Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugw3JvUVoKUvi_8Mb2x4AaABAg.9K-1z1QCkG79K1F1kyqZoz",
        "author": "@Fredman5551",
        "text": "@sixT4T thanks for the notification!",
        "like_count": 1,
        "published_at": "2021-02-21T14:56:23Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugz-4LHwD1X62ttbDwd4AaABAg",
    "author": "@abrahamlincoln9758",
    "author_channel_id": "UCiOESjWXGnITs9QqVMd3ErQ",
    "text": "I think the mug should say \"BETTER\" but on fire.",
    "like_count": 12,
    "published_at": "2021-02-21T13:36:24Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugz-4LHwD1X62ttbDwd4AaABAg.9K15swdfH7p9K1gZ8hNUtK",
        "author": "@Ekim-Aulthar",
        "text": "merchandise idea for the website maybe?",
        "like_count": 1,
        "published_at": "2021-02-21T19:05:37Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugy4Em8hw5LfbgnVvsN4AaABAg",
    "author": "@warney91warne44",
    "author_channel_id": "UCL9aQmZfgsY_dYMzkA63L7w",
    "text": "Great videos.",
    "like_count": 1,
    "published_at": "2021-02-21T20:35:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyrYgGwODqXGDYkylV4AaABAg",
    "author": "@maltahighjacker9842",
    "author_channel_id": "UCdttkhmaiy0Gjhujxb1wmYA",
    "text": "The collective *would not exist* without the individual.",
    "like_count": 0,
    "published_at": "2021-12-18T23:02:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgweYsoA6kwarWVGHoB4AaABAg",
    "author": "@twominuteshate7885",
    "author_channel_id": "UCGNWiHdyaWKBLJGR18o2EIw",
    "text": "WAAAAAAAAAAAAAAAAAAAAAGH!",
    "like_count": 6,
    "published_at": "2021-02-21T14:10:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxAU4stWQlJWeTJe-R4AaABAg",
    "author": "@SomeCanine",
    "author_channel_id": "UCxt2cm2ZiReNm9Ysy1O0eZg",
    "text": "\"Why Everything Cost Money?\" -Karl Marx",
    "like_count": 22,
    "published_at": "2021-02-21T17:01:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxZ9oAkdlKwZQlimyZ4AaABAg",
    "author": "@dcurmudgeon6564",
    "author_channel_id": "UCww92VwKxOyYlhtgbwy2XLw",
    "text": "I wonder if by observing the upheaval from US  civil war  if he was pointing out the slavery by another name the (immigrant) sweat shops of the North vs the actual slavery of the South. Was there any stats on mortality rates & life expectancy between the two regions? One Suppressor had noble oblige to one set as they were his property while the former were not afforded any oblige other than wages?",
    "like_count": 0,
    "published_at": "2021-02-22T01:46:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzk0eEY1hAJtDj6arJ4AaABAg",
    "author": "@vde1846",
    "author_channel_id": "UC8jauTm7SrSE5Kk4Hj8-84A",
    "text": "Interesting stuff",
    "like_count": 0,
    "published_at": "2021-02-21T16:50:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyNHJiNZ8Wt6VrLJXt4AaABAg",
    "author": "@martinm3474",
    "author_channel_id": "UCVegVXGFMzedtr6AjHphm9A",
    "text": "Not as a slave, I think more like a serf.  West Europe moved away from that class of peasantry, while Russia held on to that level of class systems.  Many farm communities would work the land until the soil was spent, then pack up and move to unfarmed areas.  Catherine the Great brought in German farm communities with their improved soil management practices.  Once those German Russians left Russia worked to hold the farmers to the land, still with the land belonging to the crown.  Yes there is more to this conversation, just something to think about.",
    "like_count": 1,
    "published_at": "2021-02-21T16:17:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxXTZPiV8PkYd162ZR4AaABAg",
    "author": "@lumeronswift",
    "author_channel_id": "UC_I6N3WxpqHEHmXC5lvkaww",
    "text": "I wouldn't say that the Soviet Union collapsed very cleanly - the morality and morale of the USSR was collapsing for decades, resulting in a state of pseudo-anarchy for its final years, and while the actual topple of the system was perhaps less messy than other revolutions, that is because it was more of a resignation than a revolution. It also left massive power gaps that were very quickly filled by various mafias and shadow organizations... and Russia is still trying to overcome that transition (as are some of its child states, such as Belarus).",
    "like_count": 1,
    "published_at": "2021-02-21T22:43:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwZtY_3dY0nXMxS0RB4AaABAg",
    "author": "@Mzaleyao",
    "author_channel_id": "UCt2_eQvQ26DA2fA4pdDahXw",
    "text": "Never have I seen such amazing o-faces. True satisfaction is at hand, bois!",
    "like_count": 13,
    "published_at": "2021-02-19T17:42:08Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgwZtY_3dY0nXMxS0RB4AaABAg.9JxOQ-BbjoY9K1Km30kbo-",
        "author": "@mclatchyt",
        "text": "#TeamHugo",
        "like_count": 2,
        "published_at": "2021-02-21T15:46:32Z",
        "is_reply": true
      },
      {
        "id": "UgwZtY_3dY0nXMxS0RB4AaABAg.9JxOQ-BbjoY9K1Lpks-Azp",
        "author": "@Mzaleyao",
        "text": "@mclatchyt yes, #TeamHugoForever",
        "like_count": 1,
        "published_at": "2021-02-21T15:55:46Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxnYBDxAcicsYgKeZJ4AaABAg",
    "author": "@zerotolerance2679",
    "author_channel_id": "UCW5OhxBKooU34jyrwlT8JJg",
    "text": "I enjoy hugo. Did we find out where he's from yet?",
    "like_count": 0,
    "published_at": "2021-02-22T04:26:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzyt348Z5sTH6f82v94AaABAg",
    "author": "@trajanfidelis",
    "author_channel_id": "UCjKFIqIdL2gC1goxIsBDqgw",
    "text": "Supportive comment",
    "like_count": 2,
    "published_at": "2021-02-21T16:14:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwos51scmvKdEwOCbV4AaABAg",
    "author": "@starfire118",
    "author_channel_id": "UCmE5BATKklbWrcuRGgKiWUg",
    "text": "Essentially",
    "like_count": 0,
    "published_at": "2021-02-21T15:28:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz35Uhwc9ijk_a1yQp4AaABAg",
    "author": "@dog__backwards9547",
    "author_channel_id": "UCvc1EZPD7eqf1WhADp_ZBFA",
    "text": "There for out thy naval...",
    "like_count": 0,
    "published_at": "2021-02-21T16:16:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyN9S6uPylVigEFiQJ4AaABAg",
    "author": "@lukeskirenko",
    "author_channel_id": "UCAQxlAa6RqlzRb5IljUhO9Q",
    "text": "To my understanding, the idea of history having a trajectory was interwoven with his economic analysis whereby capitalists, in an effort to out-compete each other, would replace human labour with machinery, which would create a growing underclass who were unable to afford the goods produced, leading to a 'crisis of capital', and in these circumstances a revolution would be inevitable. One would observe that this turned out not to be true, but also the current concern about technological unemployment actually concurs with the thesis. And this raises the question as to whether technological unemployment is actually likely to happen. I tend to think not, but I get the impression that many/most commentators regardless of political leaning tend to think it is a likely scenario/a real concern. But note, it wasn't simply a weird conviction that individuals generally aren't effectual in the unfolding of history in general, but rather that the economic structure of capitalism would lead to a falling profit for capitalists and an increase in the number of workers whose skills were outmoded by a replacement my machinery, which would lead to an unsustainable downwards pressure on wages for the proletariat. There was indeed a teleological supposition of a utopian replacement for the capitalist system, and utopianism at this juncture generally looks shonky.",
    "like_count": 1,
    "published_at": "2021-02-21T20:09:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyiMqdoiQhsA7GYFIB4AaABAg",
    "author": "@CygnusEight",
    "author_channel_id": "UC6l8gKswzfvPE7lzq1dI6fQ",
    "text": "More.",
    "like_count": 0,
    "published_at": "2021-02-22T00:50:25Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxNRuxGcJF2L1Z79fJ4AaABAg",
    "author": "@cb-gz1vl",
    "author_channel_id": "UCeMRLkeGxN1wSqbmxJr-iHA",
    "text": "Marx was right about one thing that most social struggle is a class struggle. Racism is just a form of classism.",
    "like_count": 0,
    "published_at": "2021-02-22T01:39:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxeiuojZk6Bzwl9roB4AaABAg",
    "author": "@iambob6590",
    "author_channel_id": "UC-mjz7WPeC11GMiX20rzyUA",
    "text": "Big question.\nDefine Capitalism.",
    "like_count": 1,
    "published_at": "2021-02-21T20:53:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzgIgrK-LFQxfE5ISx4AaABAg",
    "author": "@baybarsedturner2",
    "author_channel_id": "UCJvkBZKiFXIxV5qbrSSlu9g",
    "text": "17:05 This doesn't sound terribly different from what Carl might say when he compares the fall of the Roman Republic with what's happening in the modern US. Ceasar in this case plays the role of the would be 'dictator' who can only come to power once the Republic has shown itself to be utterly corrupt. I'm not saying that Great Men play no role but there is merit in saying that the conditions have to be there for them to play those roles.",
    "like_count": 0,
    "published_at": "2021-02-21T16:03:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx0aPmCsB4vJzLj3HB4AaABAg",
    "author": "@paulbarns5422",
    "author_channel_id": "UCe15bJN0HRkO65sycsEhbxA",
    "text": "Check out nucypher!",
    "like_count": 0,
    "published_at": "2021-02-21T17:35:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwusn0r02RG556ObW94AaABAg",
    "author": "@wyattburke1837",
    "author_channel_id": "UCe4E2_5PmfFj2AolBsDjFHA",
    "text": "Comment",
    "like_count": 1,
    "published_at": "2021-02-21T15:31:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxdgfMAQ5YhFT0pHUV4AaABAg",
    "author": "@pagerthemacaquemonkey3248",
    "author_channel_id": "UCrFS1-IuR9cHk-dckb2Ee8A",
    "text": "If you poop in your dreams, you shit yourself irl. Be careful.",
    "like_count": 0,
    "published_at": "2021-02-21T13:30:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz3SlbH15L-4vKMwj94AaABAg",
    "author": "@thepuzzlebox6620",
    "author_channel_id": "UCWhJE0GuMs-12f6XLfmy5sg",
    "text": "Competing for resources is the nature of all things. Marx treads rather carefully around this by waffling about the fact that we are superior to other lifeforms. Strictly controlling the distribution of luxury items is seen as the easiest means of establishing a heirachy that produces efficient collectivisation; one without dissent. This enables the state to organise large scale mobilisation projects near instantly by herding people around like cattle. \n\nNot taking advantage of humanities personality flaws leads to one thing: a socio-economic system that is more oppressive than Capitalism, not less.",
    "like_count": 0,
    "published_at": "2021-02-22T15:26:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwctfqwKoZNX5P8I_R4AaABAg",
    "author": "@jakell99",
    "author_channel_id": "UCkblOcOyukS1E41GWMQop4w",
    "text": "I think you two have good chemistry for this sort of stuff, the occasional slide would be nice though, especially at the start of a new 'section', these can be easily derived from Josh's laptop notes.\n I assume it has his notes on and it's not something completely different (the imagination can run wild here)..\n\nETA: Please swap out that ear-piercing intro music, Academic Agent has something far more mellow, so I'm sure it can be done",
    "like_count": 5,
    "published_at": "2021-02-21T13:35:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwjjkK7OSeJ24IaJC54AaABAg",
    "author": "@catdogfishdogcats",
    "author_channel_id": "UChzCQryshwJZUxV179P3eeQ",
    "text": "It's because utopian means a dream, something to aspire to even though it is inherently unlikely or impossible.  It's the same as the dream of the lottery.  \"If I work to earn this dollar, and spend it on a ticket, it might become 1 million dollars, and I will no longer have to work (Or be on welfare). It is based on emotional, not rationale, that's why it's successful.  The people who follow Marx don't have to critically analyze whether it would work, or where it's endpoints lead, they just have to believe in it, like a god, and work for it's ends in hope that like the Lotto Ticket it will give them what they want.",
    "like_count": 0,
    "published_at": "2021-02-21T17:26:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx5E37TO_pAmnZC7UR4AaABAg",
    "author": "@MajDjinn",
    "author_channel_id": "UCMHkoYkvLSIZr9j5mNpsKPg",
    "text": "...but your head is biology. I don't see this Ascension of human mind beyond our biology",
    "like_count": 0,
    "published_at": "2021-02-21T16:00:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwltNORCzxdpINioap4AaABAg",
    "author": "@Schrödingers_Gaffney",
    "author_channel_id": "UCMgwVJ-SSRWc6gVM-tbKO1g",
    "text": "These guys are very polite and very effeminate. Stop smiling all the time girls.",
    "like_count": 0,
    "published_at": "2021-02-22T09:08:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxuCBJrRx-NbzFBTvd4AaABAg",
    "author": "@stevewatt7542",
    "author_channel_id": "UCkQqpdQS_rOEKjMGhzq9Fyg",
    "text": "Is Josh nervous?...He sounds like even he doesn't believe in what he is saying...RELAX Josh!, you're an intelligent guy...Forget the camera and speak to Hugo like you're in a private setting.",
    "like_count": 0,
    "published_at": "2021-02-21T22:03:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwzil9006VuIjjp2sJ4AaABAg",
    "author": "@kOfTheQ",
    "author_channel_id": "UC-6b6r5rSLv51jMoDfa0hgQ",
    "text": "Marx was an immoral sophist.",
    "like_count": 0,
    "published_at": "2021-02-21T21:56:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxYRziHQKUn7T6GwK94AaABAg",
    "author": "@5Zelath",
    "author_channel_id": "UC_KiMJZe5FU2o2eMzvRFjQA",
    "text": "gish - this guy speaks so fkn slow - and not realized that if gonna talk slow - better be succinct and keep the points coming. his shifting looks into cam n so is a bit like Justin Treaduae that keep like posing for the cameras. and the giggles from both? ffs can´t ya be Funnier and actually Laugh?",
    "like_count": 0,
    "published_at": "2021-02-21T14:51:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  }
]