[
  {
    "id": "UgwVpjB5LNaPq4kWrRd4AaABAg",
    "author": "@okwaleedpoetry",
    "author_channel_id": "UCaSjgt4ddaSWaFKbVfScJAA",
    "text": "no politician should be safe from criticism",
    "like_count": 272,
    "published_at": "2024-01-01T05:38:57Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwVpjB5LNaPq4kWrRd4AaABAg.9z0T8MG21t_9zscmICLz1d",
        "author": "@BrianSzymczak-d2n",
        "text": "thats true but unfortunately biden is greenlighting a genocide by israel on palestinians. so that comment is wishful thinking on your part. he kind of is safe from criticism in reality. again i wish this wasnt the case.",
        "like_count": 0,
        "published_at": "2024-01-22T15:50:09Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugz6YDye_ijYM3RUIMt4AaABAg",
    "author": "@justsaychloe1060",
    "author_channel_id": "UCozzErzlWWpLevH3L28RNQw",
    "text": "My roommate and I were at the Seattle Space Needle shutdown for Palestine when this video went up. She's been a semi-frequent volunteer at Food Not Bombs since she was fourteen, and I have been a member of the DSA for nearly two years. I sat with this video for awhile. If I can rant candidly, then I want you and others in this comment section to know how valuable this has been for me.\r\n\r\nI am an Asian-Pacific Islander mixed, dual-citizenship immigrant, a Jewish convert, and a transgender woman. I turn twenty into three months. I consider myself well-read, yet I dropped out of college to better support my family. Infinite indescribable things inform my worldview, but I have taken the last year (especially the last eighty-seven days) to relearn my real, tangible socio-political impact, and your video was like a breath of fresh air. Particularly the section on revolution versus civic engagement, for I have always struggled with my desire to be a \"burn it all down\" martyr while surrounded by frustrating people that claim this mantle without actually risking anything. Your video made me realise that there's a reason I'm frustrated; we (including myself) have not been honest with ourselves on how my circle is better suited for civic engagement roles, and it may be more productive to lean into that rather than constantly fighting myself to perform (key word) revolutionary acts. This conclusion comes after a lot of introspection taking from lots of reading, but you put it best. It's a surprisingly-targeted, relieving insight to take away from a stranger on the Internet. Thank you for your lived experience and your effort in being understanding and direct.\r\n\r\nAlso, while many other commenters have already espoused it, the later sections on how our fight is a forever-struggle for the people against the government and how it is useful to think about the Democrats and Republicans as differing opponents rather than bettering proponents of change has provided me with the words to better explain my burgeoning perspective on voting and running for offices. The elections are very quiet in Washington state, which is paradoxically both densely urban and also devoid of community (some call it the Seattle Freeze, others call it the aftershocks of racial residential segregation), so heaps of our reliably-blue candidates run largely unopposed. Also, I'm young and couldn't vote for a long time. Nevertheless, I distinctively remember us nearly turning red in the 2016 Presidential election, and I remember my brother's white fiancée complaining about the election being stolen even then. And Trump won anyway. It has since been a long debate between my colleagues and I on the \"Democrats and Republicans are the same\" point, and it is refreshing to be able to pull from F.D. Signifier, Marc Lamont Hill, and others' words here as well. You have brought together a respectable consideration for \"vote blue no matter who\", and it is something I am excited to share with my friends.\r\n\r\nRecently, I have quietly come to extreme altruism in hopes of building a better, interlocked community. I have been houseless, starved, and criminalised before; I cannot be scared of that anymore, so I consider myself still willing to risk everything to be \"that\" militant-revolutionary. Further, I cannot compromise my beliefs in shouting from rooftops \"Genocide Joe has got to go\" and \"Biden, Biden, you're a liar\" until my body collapses, just to turn around and vote for him without witnessing a tangible acquiescence to ending U.S. aid to Israel. Yet this video (and many others) has grounded me in being realistic with my abilities and goals, and it reminds me that the world is in constant genocide whether U.S. funding is publicly involved or not. And, as an immigrant privileged with citizenship and considerable proximity to whiteness, the amount of time spent on immigration as a life-or-death struggle was extremely appreciated. This video is inspiring, valuable, and respectable. Thank you again.\r\n\r\nFree Palestine, free all colonised people. Peace upon us all in the new year and forever onwards. Cheers, Olly!",
    "like_count": 295,
    "published_at": "2024-01-02T17:00:16Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugz6YDye_ijYM3RUIMt4AaABAg.9z4FuNJs__Z9z5gw4Zvkly",
        "author": "@olurinatti",
        "text": "I'm so glad I took the time to read this entire comment, it really made me glad I made this. Thank You, Happy New Year to you too boo!",
        "like_count": 78,
        "published_at": "2024-01-03T06:24:24Z",
        "is_reply": true
      },
      {
        "id": "Ugz6YDye_ijYM3RUIMt4AaABAg.9z4FuNJs__Z9zl_JdKdikN",
        "author": "@ElektricSkeptic",
        "text": "What an amazing comment!!!❤❤❤❤",
        "like_count": 6,
        "published_at": "2024-01-19T22:05:12Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzJ33nzomP99iG1jat4AaABAg",
    "author": "@connerblank5069",
    "author_channel_id": "UC0mK94JHwpSkJQmpk_frY5g",
    "text": "You know, I don't think I've ever heard an endorsement of voting blue _remotely close_ to the power of \"I just want the weakest politician possible in office because I'm fighting them regardless.\"",
    "like_count": 928,
    "published_at": "2024-01-01T05:21:40Z",
    "is_reply": false,
    "reply_count": 34,
    "replies": [
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z0T0NHIzIf",
        "author": "@olurinatti",
        "text": "🙏🏾🙏🏾🙏🏾",
        "like_count": 123,
        "published_at": "2024-01-01T05:37:51Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z0k6m_RDDx",
        "author": "@ianneal7667",
        "text": "i am 14 and it so hard to be a left wing person because i can't go out and fight for rights because my parents are right wing. and i can't vote. what do you think? @olurinatti",
        "like_count": 43,
        "published_at": "2024-01-01T08:16:01Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z1P8uug0Io",
        "author": "@LightHalcyon",
        "text": "@ianneal7667keep reading and learning and pay attention to local politics. When I was in high school I got involved in keeping one of our library branches open. We were successful and even got the local Eagle Scouts to build a playground there and it really improved the community. That kind of stuff is a wedge you can use to nudge people towards progressivism. It takes it out of the realm of left vs right and into the realm of tangible changes they can see locally.",
        "like_count": 0,
        "published_at": "2024-01-01T14:23:18Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z1TP8LuLe1",
        "author": "@sophiophile",
        "text": "​​@ianneal7667 You can have your own identity. Start small and build your confidence. Write in your school paper about things you care about. If you are genuinely worried about your parents reaction, write under a pseudonym?",
        "like_count": 99,
        "published_at": "2024-01-01T15:00:28Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z1idbrL2WJ",
        "author": "@potatothings7223",
        "text": "@ianneal7667as a teacher, I advise you to talk to your peers about your values and beliefs. Making other youngsters curious is the best action you can take against the status quo 🫶🏻🫶🏻",
        "like_count": 0,
        "published_at": "2024-01-01T17:22:24Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z1kdE7ThtZ",
        "author": "@bitchywoman",
        "text": "@ianneal7667when my boomer mom was about your age she joined a protest against a nuclear power plant being built in Manhattan and her dad (my grandfather) freaked out because he worked at Long Island lighting CO at the time.. she still to this day refuses to vote and be active in politics because of it.. don’t let your parents (who usually vote on financial interests they perceive to benefit them) stop you from holding your own beliefs and fighting for what’s right.. every good change has come from the youth. When you are young and have no money interests you are purely driven by what’s in your heart and what feels right morally. The hard part is staying true to those values and learning a strong foundation of exactly why you believe them so you can’t be shaken by some contrived media crap or some fool pushing right wing bullshit. You are already on a good path because you are clearly not just parroting your parents talking points and following in their foot steps.",
        "like_count": 4,
        "published_at": "2024-01-01T17:39:49Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z1lxujpcPk",
        "author": "@6dragondaddy913",
        "text": "That's the argument I make with all the centrists (who are GLOBAL centrists not American centrists ) that are actually left of the Democrats. I ask them which is easier to fight a wish-washy shit lib who says they believe one thing but does the opposite or a committed jackboot who tells you what they want and it's terrible. I argue they should let the Republicans fall off the cliff so that we have oxygen for a center-left to left party to actually fight the real conservative party, the Dems....",
        "like_count": 0,
        "published_at": "2024-01-01T17:51:23Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z1nj2CRp-t",
        "author": "@apersonouthere",
        "text": "@ianneal7667attending protests if you can safely is a really good entry point into joining your community and learning from peers and elders - plus, the joy and power of marching with your people is really useful in getting the confidence we all need to organize and resist",
        "like_count": 64,
        "published_at": "2024-01-01T18:06:50Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z2zR_8N4t2",
        "author": "@TheTroutyness",
        "text": "Y’all are left enough",
        "like_count": 2,
        "published_at": "2024-01-02T05:08:24Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z39vebo55C",
        "author": "@jdubmac",
        "text": "​@ianneal7667 if you can do so safely, you can write your local reps, Congressman and Senators. Tell them the things you're concerned about and what responses you'd like to see from them.\n\nIf you can find a candidate you would vote for, see if there is a group you can work with to help get them elected. If you can write, you can blog, post social media, make zines, or work for the school newspaper.",
        "like_count": 16,
        "published_at": "2024-01-02T06:48:46Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z3HPN-nmlt",
        "author": "@horadric3",
        "text": "Voting for the weaker of two evils",
        "like_count": 5,
        "published_at": "2024-01-02T07:54:08Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z3QdM-Wx2-",
        "author": "@literofcola",
        "text": "I love it. This has been the message and I'm glad to see it's spreading and more people are getting on board - especially if we can implement during primaries. Last election it was enough to vote for Biden so we could fight his ass, but what happened was the left went after each other so hard. Let's get it right this time.",
        "like_count": 2,
        "published_at": "2024-01-02T09:14:49Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z3lYZjoETb",
        "author": "@MachilaWilson-ii3qm",
        "text": "@horadric3 Why vote for evil in the first place? That phrase never sat right with me! We need politicians to stand up for justice!",
        "like_count": 9,
        "published_at": "2024-01-02T12:26:16Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z5dcpCzOwi",
        "author": "@wizzytalksalot",
        "text": "@ianneal7667you’re engagement in politics is already a beautiful thing. Keep learning, do some of the things other ppl said maybe, but most importantly talk to your people when and where it’s save for you to do so. You’re a star ⭐️ I remember being politically engaged so young and feeling so helpless. But your impact on your community members does matter. I’ve had ppl from high school tell me that they’ve evolved their views based on the things they heard me say in class years after we graduated. So just keep being amazing bestie. 🎉",
        "like_count": 5,
        "published_at": "2024-01-03T05:55:34Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z5qAgb7_ol",
        "author": "@ianneal7667",
        "text": "@wizzytalksalot  thank you 😃",
        "like_count": 3,
        "published_at": "2024-01-03T07:45:11Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z5qWJ-nn3T",
        "author": "@ianneal7667",
        "text": "@apersonouthere thank you 😃",
        "like_count": 1,
        "published_at": "2024-01-03T07:48:08Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z5r-UbgNJ3",
        "author": "@ianneal7667",
        "text": "@bitchywoman thank you 😃",
        "like_count": 0,
        "published_at": "2024-01-03T07:52:23Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z6R-vd3L3E",
        "author": "@SNESpool",
        "text": "Damage mitigation. We live in a system where theres only two parties in power, both are bad in their own ways, but one party is easier for we the people to exert our influence over. The Dems haven't done nearly enough, but they've shown at least that they're willing to make concessions to the left, if they believe the decision will be popular (and that's something we, as citizens, have a lot of power to influence. \n\nThe GOP, on the other hand, has understood for decades already that their goals and views are unpopular, and they are going to pursue them anyway, at any cost, regardless of what the public wants. \n\nSo that's the choice: a party that is hesitant to wield state power (even when it should) and, for all its flaws, has proven that it is at least _open_ to changing with the tides of public opinion... \n\nand then a party that actively, vehemently opposes the will of the people, and has shown nothing but contempt for the people it means to govern, and has proven beyond a shadow of a doubt that it will use ANY means necessary to achieve its incredibly _un_popular goals. \n\nMorally righteous politicians don't exist. The best possibility under this system, is to elect politicians who find it to be _in their own best interests_ to listen to the will of the people. \n@MachilaWilson-ii3qm",
        "like_count": 5,
        "published_at": "2024-01-03T13:15:46Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z6ReSNYtSg",
        "author": "@SNESpool",
        "text": "It's something I've been trying to articulate for years, only spoken more eloquently than I could ever hope to.",
        "like_count": 0,
        "published_at": "2024-01-03T13:21:26Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z6WzZ5Q2u2",
        "author": "@MachilaWilson-ii3qm",
        "text": "@SNESpool You say that the Dems hardly did enough. Exactly what have they specifically done that exclusively helped Black Americans as a collective like they have for the Jews, LGBT, illegal immigrants, Native Americans, Ukraine and Afghanistan?",
        "like_count": 0,
        "published_at": "2024-01-03T14:08:00Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9z6y5_qvray",
        "author": "@slashwilliams888",
        "text": "learn learn learn .. be prepared for anything n know what you're signing up for.. im 20 now but I started posturing left when I was ab your age.. death threats all type of shit. be safe and keep love in your heart, but above all else read read read, listen and LEARN.. I LOVE YOU FIGHT THE GOOD FIGHT@ianneal7667",
        "like_count": 0,
        "published_at": "2024-01-03T18:13:38Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9zCup5-bZvS",
        "author": "@n4ttyyy",
        "text": "Republicans are most definitely the weaker party. The biggest losses of wealth and life have happened under Democrats and Democrats are the ones funded by the richest corporations.",
        "like_count": 0,
        "published_at": "2024-01-06T01:40:28Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9zSpqp0HHk_",
        "author": "@unktheunk1428",
        "text": "The way I've formulated it is \"Democrats are a lot less likely to use live rounds\"",
        "like_count": 0,
        "published_at": "2024-01-12T06:04:52Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9zTeyiiQYLI",
        "author": "@AnEntropyFan",
        "text": "@olurinatti \nIn general and in principle an agreeable video and a noble motivation. However one, although very passing quote, is bad enough that it ought to be corrected and the source taken as highly suspicious in your future research. Specifically, the source you are reading out about US imperialism is straight lying to people who might not know the details. \n\nThe cited part that I do know quite about is the Kosovo War. The bombing of Yugoslavia did not kill 8000 civilians nor did it displace a million people. The bombing killed few hundred civilians (and 2-3 times military personnel, the civilians were killed mostly as collateral damage tho there were isolated cases, quite literally a handful, where civilians were targeted), while displacing practically no one. The misrepresented numbers you are quoting are the casualties of the Kosovo War in its entirety, also not quite right for whichever reason since the estimates of the casualties are more like in the 10000-15000 ballpark (depending on how we treat the \"missing\", I'd confidently argue they're gone gone, and the discrepancies in sources). \n\nThe war, starting in 1998, was a culmination of non-militarised state oppression of the Albanian minority in Serbia, quite similar to what Israel is doing right now to the Palestinians (the one difference is that Milosevic stripped regional autonomy and tried to create apartheid conditions in the then Serbian province and now the Republic of Kosovo, while Israel escalated from apartheid conditions). Under the auspices of fighting an Albanian nationalist insurgency, which formed in responce to the aforementioned state oppression, the Milosevic regime took it as an opportunity to launch a large scale genocidal campaign. The campaign ramped up as the US bombing started since Milosevic had to do it quickly at that point (and hope he'd get to get away with it and keep the territorial gains, just like his Bosnian Christian proxies did at the end of the Bosnian War, a war which the US could've stopped but Bill Clinton decided he wanted a second term instead and let 200K people die as the UN watched and clutched pearls), but the intent and the methods have been there from the start. The bulk of the killed and exiled (and the bulk of the Albanian population was displaced at one point, sot the cited number is in the correct ballpark) are the victims of Milosevic's forces, most notably victims of a terror campaign conducted by elite police paramilitaries directly tied to the regime that included things like summary exctns. \n\nBe careful when quoting \"socialist\" sources, because there are socialists and then there are \"socialists\"; there are anti-imperialists and then there are \"anti-imperialists\". Of course it's not reasonable to expect that you'd hold the details on a random conflict from decades ago in your head, however when a source is pointed out as dishonest it should be dropped with extreme prejudice and better care taken from now on.",
        "like_count": 1,
        "published_at": "2024-01-12T13:49:04Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9zo7b0tVjrL",
        "author": "@user-gz9hl7rz5j",
        "text": "@ianneal7667 really try to spend time reading on topics and listening to interviews.  there is a lot to un-learn and learn. follow your local government. spend time listening, forming questions, contemplating questions, researching questions, and writing what you learn. Work with the people around you. Observe.  Make nutritious eating choices. Sleep consistently. Be calm.  Remember your humanity. Good luck.",
        "like_count": 1,
        "published_at": "2024-01-20T21:52:01Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9zo8FuYH_So",
        "author": "@ianneal7667",
        "text": "@sophiophile  think you😃",
        "like_count": 0,
        "published_at": "2024-01-20T21:57:44Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9zo8JhVb2E-",
        "author": "@ianneal7667",
        "text": "@TheTroutyness  think you 😃",
        "like_count": 0,
        "published_at": "2024-01-20T21:58:15Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9zo8PGF0Caz",
        "author": "@ianneal7667",
        "text": "@jdubmac  think you",
        "like_count": 1,
        "published_at": "2024-01-20T21:59:01Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9zo8QpZJV2T",
        "author": "@ianneal7667",
        "text": "@horadric3  think you",
        "like_count": 0,
        "published_at": "2024-01-20T21:59:14Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9zoIMKv_H53",
        "author": "@andrebighach",
        "text": "politicians don't matter, it's the population that is doing the wrong thing to you, and it's wrong that you and everybody else won't accept that as truth, but it is. you are not fighting anything.",
        "like_count": 0,
        "published_at": "2024-01-20T23:26:00Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5b9zqQCCEJ4cv",
        "author": "@Dyejob01",
        "text": "You all know that the leaders in control of our government are the 2 houses of CONGRESS, right? \nCurrently, we have a House of Representatives run by crazy right-wing conspirest. They are the people who live where WE live. And THEY matter more than the president.",
        "like_count": 0,
        "published_at": "2024-01-21T19:13:00Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5bA02utoPSfTM",
        "author": "@AltroseSenar",
        "text": "Hearing it is, honestly such a paradigm shifting view. I was getting worn down with \"harm reduction\" and \"lesser of two evils\" and struggling to care at times. This view really helps me and also refocuses how I should be looking at electoralism.",
        "like_count": 0,
        "published_at": "2024-02-20T21:31:30Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5bA178eUdE04m",
        "author": "@ConejitoPequenito",
        "text": "The idea that you can influence the dems is a myth. Roe v wade and the gaza gen/cide were both greenlit under a democrat",
        "like_count": 1,
        "published_at": "2024-03-18T09:28:50Z",
        "is_reply": true
      },
      {
        "id": "UgzJ33nzomP99iG1jat4AaABAg.9z0R9qksk5bA19FxcIf1Dd",
        "author": "@wiiqii6346",
        "text": "​@ianneal7667 were in the same boat lol",
        "like_count": 0,
        "published_at": "2024-03-19T05:11:05Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwaSJJsQI_MbG-vKJd4AaABAg",
    "author": "@emilybenson6399",
    "author_channel_id": "UC5z8JW8O9zskhmwq4-1SGCQ",
    "text": "I just need you to know no matter how hard it gets with the toxicity on social media, that your voice and perspective is very much appreciated and necessary. I don’t know how exhausting it can be to churn out videos like this one, but I can’t thank you enough. Thank you for taking the time to do this. I’m glad to have access to this information in light of everything that’s going on. I hope you’re doing well and have a happy new year 🎉. I can only hope things get better. It’s been rough for a while",
    "like_count": 234,
    "published_at": "2024-01-01T05:12:56Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwaSJJsQI_MbG-vKJd4AaABAg.9z0Q9vEe1ZC9z0QU73Wy5k",
        "author": "@olurinatti",
        "text": "I truly appreciate this message, will keep it in mind, Happy New Year!!💜💚",
        "like_count": 38,
        "published_at": "2024-01-01T05:15:42Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgykFCeoOCoyPGZ2uox4AaABAg",
    "author": "@1fareast14",
    "author_channel_id": "UCHo9IHpBv3CV8rlXlVukeFQ",
    "text": "For all the performativity put on blast in this video, non-voters do a lot of this too. When they say that both parties are the same, they often mean \"I dont have to care about other people\", or \"Disengaged learned helplessness is more comfortable than conscious terror at the news\" or \"Im voting Trump but I know I can't defend it\". People have gotten way harder to talk to over my lifetime because they don't say what they mean.",
    "like_count": 22,
    "published_at": "2024-01-03T00:09:33Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyBShmVwTJqmiebyb54AaABAg",
    "author": "@LivingMonae",
    "author_channel_id": "UCZjl5tsxcFjaZ4ikt_bgqqQ",
    "text": "Bravo on a truly phenomenal piece of work. As a Black Woman who was so proud to vote when I turned 18 and now 36 have descended into complete dissolution with the 2 party system and gave up on voting. I can truly say you’ve reminded me of why I was proud to vote in the first place. Why my right to vote is so important and why it’s imperative that I participate in, not only federal elections, but my local ones as well. I am committing to participating in the political process and doing so in an informed way. It’s the least I can do for myself and all Americans. Thank you",
    "like_count": 27,
    "published_at": "2024-01-08T04:56:59Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyVkDklcO_AbISpPNR4AaABAg",
    "author": "@snowshows9973",
    "author_channel_id": "UCb5imiK56_I6SjZcVXznZPg",
    "text": "It’s so interesting to be watching this again right now. It’s definitely accelerating now, and there has been so much death, destruction and violence. Hopefully those accelerationists are out there willing to die for this.",
    "like_count": 1,
    "published_at": "2026-02-03T19:14:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwudSXFUoCzeKTtxpF4AaABAg",
    "author": "@Anti-AntiAintI",
    "author_channel_id": "UCVZ5N1dkaHZmzQbQpflI9EA",
    "text": "The Internet is not serious. \n\nKeep doing you. As a Illinoisian, there's proof you winning. \n\nProgress is slow as Hell, but progress is still occurring.",
    "like_count": 44,
    "published_at": "2024-01-02T00:57:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwaxdRoH7-pSLv5-DJ4AaABAg",
    "author": "@lish4045",
    "author_channel_id": "UCw9dBgXFmCEXB6gYpzYLw8w",
    "text": "Thank you for video, I am black woman living in London and I have been struggling with the idea of voting for the Labour Party. I have voted in every election since I turned 18, and I was just being so disheartened by their behaviour that I have seriously considering not voting. In my opinion, Starmer is a disgrace  and is very similar to Biden a corporate stooge but your points validating the other side of me, which understands the importance of voting, regardless of these crackheads.. it just made realised I need to find a way to no be passive. Great video and keep up the work. ❤🎉🎉",
    "like_count": 76,
    "published_at": "2024-01-01T18:45:22Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgwaxdRoH7-pSLv5-DJ4AaABAg.9z1s8Fx-13Z9z1zfbWk39U",
        "author": "@aristotleasparaguspodcast1129",
        "text": "As an American, I'll tell you that Starmer is so, so much worse than Biden. Biden's foreign policy, specifically on Israel, is downright diabolical, but on domestic matters he's been somewhat willing to distance himself from the neoliberalism of Obama and Clinton, such as him being the first president to cross a picket line.\n\nStarmer is what a lot of whiny anti-voting \"leftists\" in America think Biden is. He is a straight up Red Tory who makes Tony Blair look like Tony Benn.",
        "like_count": 0,
        "published_at": "2024-01-01T19:51:13Z",
        "is_reply": true
      },
      {
        "id": "UgwaxdRoH7-pSLv5-DJ4AaABAg.9z1s8Fx-13Z9zMAtJFIqzQ",
        "author": "@awrebyawe",
        "text": "I'm also from the UK and the Labour party under Starmer is a massive disappointment, Tory-lite. No party in the UK represents me right now, but I still renewed my rights on the electoral roll and will for sure be voting to get the Tories out.",
        "like_count": 4,
        "published_at": "2024-01-09T16:02:46Z",
        "is_reply": true
      },
      {
        "id": "UgwaxdRoH7-pSLv5-DJ4AaABAg.9z1s8Fx-13ZAFUZ6ImS93u",
        "author": "@avrilrandle5576",
        "text": "As much as I hate starmer, Farage getting as much support as he is now really scares me.",
        "like_count": 0,
        "published_at": "2025-03-10T11:02:00Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwW7YmOyurTNv6HPux4AaABAg",
    "author": "@StylusShade",
    "author_channel_id": "UC2ATW00QS5x68F1p4QlbK9g",
    "text": "Thanks for talking about this. The issue of voting is a disheartening one when it seems like nothing we do has any impact, but it really needs to sink in that voting isn't even half the battle.",
    "like_count": 38,
    "published_at": "2024-01-01T20:41:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugycy0PHcV4Y1vGSC2F4AaABAg",
    "author": "@amandaw9958",
    "author_channel_id": "UCm2tRtzaU3NtBE2tOV1iTiw",
    "text": "Amazing deep dive! Its a fine line to walk between vote shaming and expressing the importance of voting. I think you did it masterfully. No notes.",
    "like_count": 153,
    "published_at": "2024-01-01T14:51:05Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugycy0PHcV4Y1vGSC2F4AaABAg.9z1SKNxlMhQ9z1V6_3V_hr",
        "author": "@olurinatti",
        "text": "🙏🏾💚💜",
        "like_count": 15,
        "published_at": "2024-01-01T15:15:25Z",
        "is_reply": true
      },
      {
        "id": "Ugycy0PHcV4Y1vGSC2F4AaABAg.9z1SKNxlMhQ9z9jG5ZNb57",
        "author": "@themoops4006",
        "text": "there is no such thing as \"vote shaming\" your vote has very real material consequences for millions of people",
        "like_count": 5,
        "published_at": "2024-01-04T20:01:43Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx-9eodXBTuuLP_vtl4AaABAg",
    "author": "@DragonsEatTofu",
    "author_channel_id": "UC5Rrn0ezlaYyINEqVqWvCPg",
    "text": "I really appreciate what you said about Twitter! It really is the opposite of what I learned in academia. I’ve rarely seen anyone quote tweet something like “I have some critiques of this person’s thread but this one idea reality inspired me to think.” The internet interferes with critical thinking in so many ways it’s is easy to lose track. I really need to keep reminding myself that I am in the pursuit of knowledge, not the pursuit of building up rage or sad facts that confirm my despair or feeling smarter than other people. The way the everyday commercial internet is set up is really the opposite of what is useful or enriching.",
    "like_count": 33,
    "published_at": "2024-01-01T13:37:00Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugx-9eodXBTuuLP_vtl4AaABAg.9z1Jqn89JbV9z3E0CbFeXY",
        "author": "@Gaa1jan1",
        "text": "\"I'm in pursuit of knowledge not rage or sad facts\" is an amazing comment thanks for writing it",
        "like_count": 3,
        "published_at": "2024-01-02T07:24:29Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwwD43oHjZDmALqcP54AaABAg",
    "author": "@DMLoosey",
    "author_channel_id": "UCFnTSQqQJ8C-tou0SYdKFzw",
    "text": "I am binging your material after your debate with that mayor from NY. WOW. I've been sleeping on your content for a minute now. I am so glad, as a Black professional, to see we have a voice like yours in this space. Your voice is so valuable, and I appreciate your patience and diligence in talking about these issues. All love ❤️",
    "like_count": 89,
    "published_at": "2024-03-31T18:50:22Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgwwD43oHjZDmALqcP54AaABAg.A1ecFer9eG1A1efE3mQ8he",
        "author": "@olurinatti",
        "text": "Thank you so much🙏🏾💜",
        "like_count": 7,
        "published_at": "2024-03-31T19:16:22Z",
        "is_reply": true
      },
      {
        "id": "UgwwD43oHjZDmALqcP54AaABAg.A1ecFer9eG1A2HubfLsrCx",
        "author": "@adrianonline69",
        "text": "Yep I’ve been binging too.  A great liberal yet pragmatic voice that is needed at this time.  I’m also over TYT especially Ana and Cenk",
        "like_count": 1,
        "published_at": "2024-04-16T10:20:25Z",
        "is_reply": true
      },
      {
        "id": "UgwwD43oHjZDmALqcP54AaABAg.A1ecFer9eG1A2HusCvmrsl",
        "author": "@adrianonline69",
        "text": "Did I meet the moment ?  Very important question at the moment!",
        "like_count": 0,
        "published_at": "2024-04-16T10:22:40Z",
        "is_reply": true
      },
      {
        "id": "UgwwD43oHjZDmALqcP54AaABAg.A1ecFer9eG1A2PCY1V3QyC",
        "author": "@vdavid9395",
        "text": "Same ✔️",
        "like_count": 0,
        "published_at": "2024-04-19T06:20:29Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugwzhd1eJgv4OhSCXEJ4AaABAg",
    "author": "@susanbradleyskov9179",
    "author_channel_id": "UCNIb7iUMK5z7pgsNi_itedw",
    "text": "Political Sanctuary! Never thought I’d find that on YT. Should have known it would be here.",
    "like_count": 4,
    "published_at": "2024-03-08T11:44:34Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwD_FILbmZbSiUOYmB4AaABAg",
    "author": "@felvid123",
    "author_channel_id": "UCF4HsVAXUUd0rRPqHCEidkQ",
    "text": "In the spirit of taking what I need & discarding the rest, while I'm still undecided on voting, even though it may be an important tool in the toolbox, it is not the only one. Joining worker unions, joining or supporting advocacy groups, giving money to causes that help the marginalized like myself; these are all tools in the toolbox I can also use. Thank you & your guests for reminding me about my options",
    "like_count": 81,
    "published_at": "2024-01-01T02:38:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwf8L6_sIWHUb4KRex4AaABAg",
    "author": "@f.d.5173",
    "author_channel_id": "UCNd20_0kAkAx2opDQUBQZlw",
    "text": "This was a great watch/listen during a wash day. I especially appreciate the nuanced takes on immigration that I - as a citizen who underwent the naturalization process with my parents - often take for granted, especially as a Haitian",
    "like_count": 37,
    "published_at": "2024-01-01T19:27:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxDYQOX_xts6_TZ2gh4AaABAg",
    "author": "@yellowbutterfly6796",
    "author_channel_id": "UCy5Z87W1CZOFEeJFTEY1h9A",
    "text": "3 hour video in 3 months?? :O omg Olay did not sleep. I hope you take a well deserved rest Olay and I hope this video does well and reaches people. happy new year everyone ❤🎉",
    "like_count": 42,
    "published_at": "2024-01-01T01:15:38Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzZjmwsYo9AT-IQaqZ4AaABAg",
    "author": "@NinjaxPrime",
    "author_channel_id": "UCRymRgDw0TmvgSHHIyz1mLA",
    "text": "At this point my view is simply this: voting does not win you the fight, but it does determine what terrain you fight on and what weather you fight in.",
    "like_count": 106,
    "published_at": "2024-01-02T15:17:16Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzZjmwsYo9AT-IQaqZ4AaABAg.9z447-ZoFEV9z4fVznABfs",
        "author": "@mikey-wl2jt",
        "text": "💯",
        "like_count": 0,
        "published_at": "2024-01-02T20:52:44Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwoJYP2O8rMaN2vQWV4AaABAg",
    "author": "@okwaleedpoetry",
    "author_channel_id": "UCaSjgt4ddaSWaFKbVfScJAA",
    "text": "48:45 the formerly enslaved congressmen... that alone is one of the most inspiring things I've seen in a long time",
    "like_count": 14,
    "published_at": "2024-01-01T04:11:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyP1xP3n-70UUzxkXl4AaABAg",
    "author": "@SystemFailing",
    "author_channel_id": "UCseoXLmzvloYQ-WeK5A3dpQ",
    "text": "I really needed this vid, I’ve been so disparaged by the complete rejection of voting. At the same time, I’m as frustrated with Biden as anyone. I just can’t imagine how anyone can think that a revolution can thrive under Trump, where in all likelihood we’ll never have another election again (not one he or a Republican can lose, anyway). \n\nVoting for the weaker adversary is a REALLY smart way of framing things. \n\nWhat a great vid.",
    "like_count": 11,
    "published_at": "2024-01-07T16:22:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy2wON55Gs6xg0Jg6Z4AaABAg",
    "author": "@valentinasoundoutloud2538",
    "author_channel_id": "UCITx4RPNPFH_uh933hdWETw",
    "text": "Accessible information in this day is radical. 1000%",
    "like_count": 31,
    "published_at": "2023-12-31T22:33:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyOp0oUZtH0CWJierN4AaABAg",
    "author": "@ej3281",
    "author_channel_id": "UC1sQjaWpzU6lkRMQxkAnsCA",
    "text": "disclaimers and framing 00:00\nthe realities of revolution 23:30\nrevolution vs civic engagement 32:00\nnot voting and disengagement 35:00\nracism and the stakes of (not) voting ~ 41:00\nwhat choice do black people have? 52:00\nsolidarity and tactics 55:00\naccelerationism didn't work in 2016 58:00\ncorporate duopolies 1:05:00\nfd signifier wants you to wash your hands 1:07:00\neconomic realities (?) 1:09:00\nrevolution (again) and Stop Being Terminally Online 1:10:30\nChapter 2: Government VS The People (gives momentum to status quo) 1:12:50\nThe government doesn't create change, **people** do 1:14:30\nVoting is one tactical tool in your change toolbox 1:15:00\nvote to pick the government you can change 1:17:00\nfd signifier (really really) wants you to wash your hands 1:20:00\nthere is no perfect candidate 1:22:00\nuse the other tools in your toolbox to make up for the candidate's shortcomings 1:25:00\nvoting is a tool which may not always be useful 1:27:00\nthird party \"spoiler\" candidates and the right to vote 3rd party 1:33:00\nthird party candidates could push mainstream candidates? 1:37:20\nChapter 3: \"Democrats and Republicans are the same\" 1:42:00\nDemocrats and Palestine and the argument for moral equivalence 1:43:00 (until 2:05:00)\nJoe Biden kinda sucks at politics 1:47:00\nBiden does have a specific appeal though (nostalgia for Obama and stability) but it might not be enough 1:49:00\ngovernment is a reflection of national interests, for better or for worse, so parties will share a lot of messed up platforms anyway 1:55:00\nModern US empire & imperialism (we *are* genocide) 1:58:00\nWhat the material differences between the parties actually are (trump has 95 felony charges) 2:05:00\nfreeing people from prison is hard. It's hard under democrats a\nbut it's impossible under republicans. 2:07:00 (until 2:34:00)\ntheocratic fascism and cruelty vs status quo (suffering is the point with the Republicans) 2:12:00\nTrump made the US immigration system so much worse. If you're pro immigration it should matter to you. 2:21:00\nspiderman 02:30:00\nimmigration is a black issue 2:31:00\nrepublicans are fascists (it gets pretty animated here) 2:34:00\nbiden's track record 2:36:00\ntrump vs desantis 2:38:00\ndefinition of fascism and differences 2:41:00",
    "like_count": 14,
    "published_at": "2024-04-01T09:01:40Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgyOp0oUZtH0CWJierN4AaABAg.A1g8fiwm1_uA9HkDznKKtw",
        "author": "@green-k5f2w",
        "text": "THANK YOU!! Gah damn! 🩵🤍",
        "like_count": 1,
        "published_at": "2024-10-07T08:29:25Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugwyic-XJy62_KYiguF4AaABAg",
    "author": "@SortofUnpleasant",
    "author_channel_id": "UCCWBw1-RVH9wa079hedlzRA",
    "text": "I absolutely LOVE Lee. He's so intuitive and I absolutely agreed with his push for how we utilize the classroom! Education is EVERYTHING!",
    "like_count": 21,
    "published_at": "2024-01-05T22:30:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyUjwPvaADHTE57irN4AaABAg",
    "author": "@thefollowingisatest4579",
    "author_channel_id": "UCZIhXzzYoHNhBibo1P0xSFA",
    "text": "\"Vote for the weakest adversary\" is probably the best endorsement of voting I've ever heard. Awesome vid, definitely gave me a little clarity going into this year.",
    "like_count": 7,
    "published_at": "2024-01-02T09:32:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwTgWgjri8uvRMFRK14AaABAg",
    "author": "@HoneyESQ",
    "author_channel_id": "UCy-8FkFXnxbJvlwLaA2ZGRQ",
    "text": "Wow. Incredible work ! This is so in-depth, well thought out and executed excellently. Thank you for the information! Please keep this going. Society needs it !!!",
    "like_count": 6,
    "published_at": "2024-05-29T21:13:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyXJxcfQOPAlHduz_t4AaABAg",
    "author": "@julianbluefeather8491",
    "author_channel_id": "UCr6fFzpMi9R4wqq7Ku5FnAg",
    "text": "Thank you Olay for discussing this. We always appreciate you ❤️",
    "like_count": 54,
    "published_at": "2024-01-01T05:17:53Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgyXJxcfQOPAlHduz_t4AaABAg.9z0Qj3zZtxI9z0SzfKkBEV",
        "author": "@olurinatti",
        "text": "💚💜",
        "like_count": 9,
        "published_at": "2024-01-01T05:37:37Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzhJBf0Pbjzd7rSXWN4AaABAg",
    "author": "@jamesbelcher9588",
    "author_channel_id": "UCMc1axuWaGaHm6f-k-KuCnQ",
    "text": "Level-headed and well-contextualized. Thanks for flashing your bylines as well. \"Democrats need to listen to the left\" is excellent.",
    "like_count": 95,
    "published_at": "2024-01-01T15:51:24Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzhJBf0Pbjzd7rSXWN4AaABAg.9z1ZE8oAyxq9z1ZO0C2Dq-",
        "author": "@olurinatti",
        "text": "Thank you!!",
        "like_count": 13,
        "published_at": "2024-01-01T15:52:45Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwijKc_fqNoBe6L25p4AaABAg",
    "author": "@brooklenfarley8062",
    "author_channel_id": "UC83I7cQRtkNRURIA5uE71dA",
    "text": "love your note about how twitter has fried our brains in regards to how we consume information and other people’s perspectives. this vid is def about voting and the american political system—but it ALSO reminds us to think critically IRL and online and how to listen/read to LEARN from a new vantage point",
    "like_count": 10,
    "published_at": "2024-01-02T15:57:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwG-NSUk89c7PtzO4B4AaABAg",
    "author": "@frostedflower2032",
    "author_channel_id": "UCeCeCyzpMhAHzq_T53oLdfg",
    "text": "I've been thinking a lot about how to use my time lately. This video was a beautiful roadmap that helped me process a lot of my feelings on politics and if/how I want to be involved. Thanks for creating this!",
    "like_count": 2,
    "published_at": "2024-08-06T23:40:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxzm4S_trtBcrf-6_l4AaABAg",
    "author": "@sharonbaker3007",
    "author_channel_id": "UC5ocwF8R1vHRv5zLsj-7vgA",
    "text": "Excellent work!!! So much important information, so many great perspectives…well done!👏🏽👏🏽👏🏽",
    "like_count": 38,
    "published_at": "2023-12-31T23:39:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxM3lsLKWBWgII9BaR4AaABAg",
    "author": "@MMiel-mv2pt",
    "author_channel_id": "UCOkWuU-P3UZB-JPG_a-Q3ww",
    "text": "Olay looking like the Goddess of Fire 🔥😍",
    "like_count": 12,
    "published_at": "2024-01-01T02:27:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwAciDWZiq6BQa6nr14AaABAg",
    "author": "@WolfsDE",
    "author_channel_id": "UCd8g1a0th044r3wno0NxMCA",
    "text": "I am glad that you did address the vote shaming aspect. To me, the reason vote shaming does not work is for the same reason telling a 13 year old kid not to be on an adult website doesn't actually work. \n\nThat kid is going to be like....hey...I was told no. I want to see why even more now. Just natural curiosity goes up when told no. \n\nSame effect happens with movies and TV shows and video games and music. If a bunch of people are screaming no about it...everyone else is going to want to take part, even if for no other reason than to Troll the ones saying no. \n\nA vote is earned. It is not something that can or should ever be thought of as a given. \n\nI am not black. I am sure the way I am writing this will give it away. I am transgender. Yes, there are real consequences for if I vote, if I don't vote or who I vote for. \n\nI have had a hard time with voting because of feeling disenfranchised a lot, having my name tossed off the register 3 times, being told that I am some horrible monster because how dare I not bow down and support X person and I don't deserve the right to vote because of it. \n\nIt gets insane. To the point where I honestly have no hope for this world. Not just the USA, but the entire world. \n\nI am watching as we went from fighting the goose steppers in my grandparents generation to our country wanting to be them. \n\nI honest worry that no matter what happens this year,  if Trump ends up in prison, as POTUS or P.I.P. (President in Prison) or loses in November,  the outcome is going to be really damn bad. \n\nBecause I fully believe any outcome starts a civil war.  \n\nI also believe if we continue down this path we are on, we might be seeing World War 3 as well. So, any hope for peace, pretty much is gone in my books. \n\nI wish I knew the answer. \n\nI hate the notion of vote blue no matter who though. I think vote for a label first is dangerous.  Now, granted, I would never want to vote for any of these jackals trying to claim the party of Lincoln.  They stopped being the party of Lincoln a hell of a long time ago. \n\nMy point is only that if my choices are vote for Charles Manson or Jeffrey Dahmer, then the only vote should be for what gun to use on them both at that point. It can't ever be a \"no matter who\" situation.  \n\nWe always have to be mindful of who is running is my point. \n\nBut I do agree. Trump more than anyone else represents a clear and present danger to the USA and to the World.  To not stand up and try to stop him would be a moral failing.  I don't know how much it might be the right thing to vote for Biden it really is, but I do know to not vote Trump down especially,  could be the end of the country.  \n\nIt could be that no matter what happens, it is the end of the country. \n\n\n\nI haven't finished this video and may add more in, might not.",
    "like_count": 12,
    "published_at": "2024-01-03T13:28:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxZyg1r05CcnX8HSeV4AaABAg",
    "author": "@thisisnotrani",
    "author_channel_id": "UCm6NTHm1ypmV_hEe2WLPycg",
    "text": "i was hesitant in watching this from my set viewpoint and i am astounded by the amount of work gone into this video. i am grateful for these videos for this kind of accessibly. the only meaning i have to vote is to vote out of power. i’m not voting for anyone facilitating the gen.ocide of my people. i cant morally justify essentially a high five after doing the most evil of all evils. c&k seem like the way out of this. hard year. gratitude",
    "like_count": 2,
    "published_at": "2024-01-25T08:33:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxNOIvy36WZUrbq17t4AaABAg",
    "author": "@tylerreyes9446",
    "author_channel_id": "UCEWfnvvgT97KVDGwP8zQfqg",
    "text": "Loved the video beginning to end. Subbed",
    "like_count": 2,
    "published_at": "2024-03-31T06:43:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy_0KHpQyk0toKqnHt4AaABAg",
    "author": "@Momo-oz4ek",
    "author_channel_id": "UCCwyPrEOV4T1WmVGvMAdBQQ",
    "text": "thanks for opening my mind. I have expressed \"both sides are bad\" sentiment in the past, being ignorant of the fact that I can survive under a republican in office while others cannot.\nMy current opinion is: vote 3rd party when democrats are strong, but vote democrat when they are at risk of losing to fascists.",
    "like_count": 7,
    "published_at": "2024-01-03T05:10:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz8Tn65JTGPoOOn_yF4AaABAg",
    "author": "@1927su",
    "author_channel_id": "UCbMmknKn8lFEULJTw7l-plQ",
    "text": "I think protecting Democracy is what’s most important. If one knows history, dictatorships never end well. Vote accordingly.",
    "like_count": 2,
    "published_at": "2024-01-02T17:53:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwJrYM3LbdGEEPMFwh4AaABAg",
    "author": "@RideThruSpace",
    "author_channel_id": "UCkwXfOf-ow4QehcbLUJbEcQ",
    "text": "I’ve watched this video 5 to 6 times now. As I further educate myself due to recent experiences that have made me question my entire existence, I continue to encounter more questions. \n\nThis video is impactful. I’m amazed by it in truth. Partially because I don’t see myself being able to do the things you do; Also because I don’t know if what you do is the best way for me to accomplish the lofty goals you aim to achieve. \n\nThank you",
    "like_count": 20,
    "published_at": "2024-01-06T14:33:52Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwJrYM3LbdGEEPMFwh4AaABAg.9zEIKd8me_T9zGFtBl1w-9",
        "author": "@olurinatti",
        "text": "🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾",
        "like_count": 2,
        "published_at": "2024-01-07T08:50:59Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxEDAGiB4EFIqzF4qJ4AaABAg",
    "author": "@Antanese2Real",
    "author_channel_id": "UCw5HPWwFIecuDzeOqs_QJEg",
    "text": "So happy I was able to make this!",
    "like_count": 17,
    "published_at": "2024-01-01T00:50:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxTjaq64d0kenMbq0d4AaABAg",
    "author": "@dl-zf9dj",
    "author_channel_id": "UC6Nrxq8_oL_5QgjmXXxE5rA",
    "text": "Wow. Thought provoking already... Damn. Good shit right here.",
    "like_count": 3,
    "published_at": "2024-03-17T16:48:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzlE9u7o0dszauHd0J4AaABAg",
    "author": "@kikibean2024",
    "author_channel_id": "UCJjsGZlxeeySwa32-zn-Kfw",
    "text": "Such an impassioned and inspirational voice. Thank you for bringing me past my anger and reminding me why it is so important to make an unemotional choice when voting.",
    "like_count": 42,
    "published_at": "2024-01-01T00:16:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzbqeYX-xnCgq5k8tl4AaABAg",
    "author": "@DjinnandTonik",
    "author_channel_id": "UCRcoeireYh5qML2iQJqDbqQ",
    "text": "I Cant think about this question without thinking about Palestine. But i cant even vote in the states anyways. Good discussions all around.",
    "like_count": 2,
    "published_at": "2024-04-05T11:20:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz3nPQav_5GlgYyuzl4AaABAg",
    "author": "@okwaleedpoetry",
    "author_channel_id": "UCaSjgt4ddaSWaFKbVfScJAA",
    "text": "I loved your Eric Adams documentary, that's what made me a fan today!",
    "like_count": 12,
    "published_at": "2024-01-01T06:44:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwb6t1Xiq3YUQb53nZ4AaABAg",
    "author": "@MiriamClairify",
    "author_channel_id": "UCGrBrFFrS4WnhgPFFs06qvQ",
    "text": "The genocide in Palestine really has changed the math for me, although it's really the same math but the numbers are way higher. The position we're in when it comes to the top of the ticket next year is atrocious. My partner is trans, I'm genuinely really persinally scared for a Republican presidency. I'm also not sure how I'm supposed to sleep at night helping someone who's been aiding and abetting a months long genocidal massacre keep power. Nyquill maybe. All I know is, this is going to be a hellish election year.",
    "like_count": 18,
    "published_at": "2024-01-02T01:56:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwO1wKLRblHnNi8vEp4AaABAg",
    "author": "@spinninglovelies314",
    "author_channel_id": "UCBrdc8lyB22TZvb-40NqbeQ",
    "text": "I work in politics in Missouri. I am in a red area that is slowly changing. Watching this just made me wanna work harder. We have a republican supermajority in the state and if we can get 3 seats to flip we can actually stop running defense and start building a stronger offense. Our dems can be frustrating but because they don't even have to be in the building for a vote to pass we are always just trying to stop the worst. It is exhausting.",
    "like_count": 6,
    "published_at": "2024-01-03T15:02:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyatKFBRRwepWj_43p4AaABAg",
    "author": "@okwaleedpoetry",
    "author_channel_id": "UCaSjgt4ddaSWaFKbVfScJAA",
    "text": "31:31 Ahhhhh... romanticizing revolution is an incredible way to put it",
    "like_count": 5,
    "published_at": "2024-01-01T03:50:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzMSba33QbHw_5DXj14AaABAg",
    "author": "@VWNaturalView",
    "author_channel_id": "UC-kHrOV8NnGCoZk0rLSXqHw",
    "text": "Thank you for your time, views and explanations! Thank you!",
    "like_count": 10,
    "published_at": "2024-01-01T18:41:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxNW_HPtdKQ-LxFs8R4AaABAg",
    "author": "@Mark_zist_Anonoymous",
    "author_channel_id": "UCYNsY5XLG8HfgeL91lpAqgw",
    "text": "You need more subs! Your content is 🔥 I appreciate you.",
    "like_count": 2,
    "published_at": "2024-04-01T00:59:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgywmATWV86bhVMk3xJ4AaABAg",
    "author": "@nathanisaacs76",
    "author_channel_id": "UCy4wAZjyUzj15IGu4ZttE9w",
    "text": "This is the best video i have seen in all of 2023. A unifying message which the left DESPERATELY needs. Id love a video about how to get involved on the ground 101. I work non-union retail full time. Right at the poverty line. It feels overwhelming and impossible to get involved and mobolize on the ground outside of campaigning for a candidate im not excited about in the bible belt.",
    "like_count": 4,
    "published_at": "2024-01-20T16:15:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyqiLd1ha8rB5BDvZZ4AaABAg",
    "author": "@YahyaSellars",
    "author_channel_id": "UCVaYy9WGaSqagKzTDATqdCw",
    "text": "putting this video on my website for my college assignment. thank you",
    "like_count": 3,
    "published_at": "2024-03-03T21:02:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzobXqxAH98vkrxS3l4AaABAg",
    "author": "@wizzytalksalot",
    "author_channel_id": "UCl13fDczUFNX2hn4Ljni93A",
    "text": "Congratulations on creating such a comprehensive masterpiece on voting. Literally encompassed my thoughts, people I’m in conversation with, people I disagree with BUT RESPECT. And it’s such a public good. I’m sharing this video everywhere. ❤❤❤",
    "like_count": 10,
    "published_at": "2024-01-03T05:49:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxrOWouA1WfabewcaJ4AaABAg",
    "author": "@majorp32",
    "author_channel_id": "UC_AmE1z7v-3PWwJFj9O5NyQ",
    "text": "New subscribers. I’m loving this!!!",
    "like_count": 1,
    "published_at": "2024-03-29T23:02:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwMmNhOYdInC3nT4z54AaABAg",
    "author": "@mirithilrose54",
    "author_channel_id": "UCjQmOLEtw0vEVGsj7Ak0dog",
    "text": "Happy New Year Olay! 💖\nAs someone who is not from the U.S., this video was so very informative and I can see how much time you put into it.\nI can understand that the people who subscribe to the 'letting things burn' philosophy might think they're sending a message to the Democrats. But in reality this will only harm the people with the least power and resources. You really did a great job explaining that.",
    "like_count": 25,
    "published_at": "2024-01-01T21:30:52Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwMmNhOYdInC3nT4z54AaABAg.9z2A4QtepEY9z3asTbqDVE",
        "author": "@WriterMarkusRegius",
        "text": "I also watch what happens in the US from a distance, and I agree, this video gave me a lot of details I needed to understand what's going on over there better.",
        "like_count": 2,
        "published_at": "2024-01-02T10:53:00Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw8Wall5JKkhFaXnFt4AaABAg",
    "author": "@turboking1",
    "author_channel_id": "UC3XiAVJ4_oGUMGfru82Z-fg",
    "text": "I'm only about an hour in but it's so refreshing to hear someone say the same talking points I feel instead of the insane black and white thinking of the online left. I felt like I was crazy for a while because nobody seems to share this sentiment online, and it absolutely boggles my mind. I'm not a black POC, but a white trans man in a progressive blue state, but i still fear for the outcome of the 2024 elections. I had to cut ties with some friends because they were going down the larpy anarchist route AND ARENT EVEN LIVING IN AMERICA, trying to tell me who to vote for. I know from the outside looking in, everything just looks the same to them, but I genuinely just couldn't take it. I'm glad I'm not crazy in my own beliefs hearing other people with similar sentiments. 😅",
    "like_count": 4,
    "published_at": "2024-01-04T19:52:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx9LX6Z1PS8HepPcRl4AaABAg",
    "author": "@absolutelycitron1580",
    "author_channel_id": "UCBpsygv_9e6eYw_m6o4Fkcw",
    "text": "Tysm Olay (and her editor) for once again delivering a very professional and real breakdown. Damage control isn't a small aspect of voting, it is the core. I get having no faith in the state, but i dont need faith to know the state can come after people and will do so more often depending on who controls it. Also, just want to say it made me so happy to see Ben Dixon in the vido",
    "like_count": 2,
    "published_at": "2024-01-14T21:51:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzz_n_wjSy9afbDIhB4AaABAg",
    "author": "@SlopeDudeNiiice",
    "author_channel_id": "UCw8DiRRkdg8IwCkjG5c-2Hg",
    "text": "Inspiring work you have done in my home state of Illinois. Thank you!!",
    "like_count": 2,
    "published_at": "2024-02-26T08:36:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx1Xs6U2INuh-tknkN4AaABAg",
    "author": "@1fareast14",
    "author_channel_id": "UCHo9IHpBv3CV8rlXlVukeFQ",
    "text": "34:10 \"pick the best slave master you can find\"",
    "like_count": 2,
    "published_at": "2024-01-02T19:47:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxXJAiC1Mqj6MuCXWx4AaABAg",
    "author": "@Eunacis",
    "author_channel_id": "UC2pi8Xh_edQ8_j2_3LN-pmg",
    "text": "Greetings from Vaush's Praxis Emporium!",
    "like_count": 3,
    "published_at": "2024-01-11T17:59:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxhE6_FsYkB1QEpBP14AaABAg",
    "author": "@cerumen",
    "author_channel_id": "UCaogMDhR0FK9gVkjQb-VBQw",
    "text": "This is the first video of yours I’ve seen, not even halfway through, and while I don’t agree with absolutely everything everyone said, it’s…frankly incredibly refreshing\n\nIt’s not a critical analysis of a niche pop culture artefact, there are no oblique references to obscure revolutionary history, it’s a not a “and that’s why capitalism bad!”. I didn’t get the familiar feeling of being patronised, judged, talked down to, or manipulated. There was no indulgent cruelty or malice toward anyone or anything. No staring into the miserable bowels of the abyss for the purpose of dunk farming. No giant deep dive into a dispiriting doomhole only to conclude “I don’t have any answers, but…” No poorly researched, sloppily scripted, lazily delivered high school video essay content. No in-jokes, no confusing metanarrative framing device. No vague utopian fantasy.\n\nJust people passionately advocating things that make practical pragmatic sense, in a way that makes a person feel empowered. Why does that feel so new?",
    "like_count": 8,
    "published_at": "2024-01-17T10:46:38Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxhE6_FsYkB1QEpBP14AaABAg.9zfD3x18UUr9zj9WfjaDMl",
        "author": "@PhantasmalBlast",
        "text": "I feel the same way, too much YouTube I think",
        "like_count": 4,
        "published_at": "2024-01-18T23:32:34Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxZ1KGKMfX0yFzf6y94AaABAg",
    "author": "@llh1000",
    "author_channel_id": "UC8ml9DDUKfTDx6KHdsdNO2w",
    "text": "Love this video! Had to watch this is multiple sessions, but we got there! Gave me a lot to think about in terms of my actual involvement on the ground",
    "like_count": 2,
    "published_at": "2024-06-25T14:19:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz_hJsPgmnuTlk44H94AaABAg",
    "author": "@PackRatManiac",
    "author_channel_id": "UC_ME9g4vx0BTLIiJ4LqX4aA",
    "text": "This was such a good video. It was insightful and informative. I'm glad it popped up in my feed again because I missed the premiere. I loved getting the perspective of all the guests. I also needed that kick in the pants to get over my butthurt feelings over the Democratic party. I'm frustrated with them but they aren't the ones actively working to destroy whatever small part of democracy we have left.",
    "like_count": 14,
    "published_at": "2024-01-01T23:08:09Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwxYufNdWXdt5ysyuN4AaABAg",
    "author": "@dinopalz",
    "author_channel_id": "UCRmR9EZOaPF4ZzKM4wlZbsw",
    "text": "All blessings to Raheem🎉 \nwet, dry, and gravy🎉",
    "like_count": 7,
    "published_at": "2024-01-01T05:34:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxvzsI4xbtKVXXpv1V4AaABAg",
    "author": "@AnyahEMB",
    "author_channel_id": "UCWeeZ3qlY02_dKVs65Kcg5A",
    "text": "You are the lawyer I have been hoping for! Subbed!",
    "like_count": 10,
    "published_at": "2024-01-01T04:13:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxjOGebeK6xY5OfErZ4AaABAg",
    "author": "@turtle4llama",
    "author_channel_id": "UCu1K0ZgQi1fb-9Tnklcoj7A",
    "text": "The more local the election, the more powerful your voice.",
    "like_count": 3,
    "published_at": "2024-06-06T16:44:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwCz9kKdQbm5jE1lfB4AaABAg",
    "author": "@ZJB138",
    "author_channel_id": "UCGYzdqFj6cUwSE1mf_JDBJA",
    "text": "❤ this video so much. had so many heated discussions with friends for whom voting is some kinda vanity project or exercise identity construction. i try suggesting they're aren't voting for a person but for a set of policies and appointments (in executive sense) that affect more than just them...with some success. i'm gonna link them to your vid. maybe they'll listen to a voice who isn't me! sadly many have the privilege to not. anyways, much love and blessings to you, olay ❤",
    "like_count": 21,
    "published_at": "2024-01-01T01:26:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz3DfUqE7JurFhCyr14AaABAg",
    "author": "@dhatroit",
    "author_channel_id": "UCPPhdmDDHpfUK5WoLiiPkVA",
    "text": "1:03:00 - 1:05:00 on realizing that not voting isn't radical is huge !!!!",
    "like_count": 1,
    "published_at": "2024-01-02T15:35:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzSiZfGEaDspxLaiTV4AaABAg",
    "author": "@KermitDominicano",
    "author_channel_id": "UCWuzHi7vNTeRKI_V2eFSt3A",
    "text": "1:07:44 TRUUUUUUU 😂\n\nWASH YO DAMN HANDS 🗳️😉",
    "like_count": 3,
    "published_at": "2024-01-02T19:51:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxoiexHHZdxjaR5fKx4AaABAg",
    "author": "@Sophia54681",
    "author_channel_id": "UCi2j3lFftTMpLD1-6Zv3hXg",
    "text": "great video and amazing to hear from so many guests and their perspectives - thank you for putting this very thorough video together, I have been struggling with my frustrations with the democrats but this video was immensely helpful 💖 thank you for all that you do",
    "like_count": 2,
    "published_at": "2024-03-29T00:25:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwCVLOlrLDw5i9N5094AaABAg",
    "author": "@ericapivko",
    "author_channel_id": "UC8jZD8PbLEJX1gbz-uazsyQ",
    "text": "Incredible and informative video. Thank you! ❤❤❤",
    "like_count": 18,
    "published_at": "2023-12-31T22:55:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz6zMG7xyhlUoikvTB4AaABAg",
    "author": "@noa9125",
    "author_channel_id": "UCVUa646NBGGqO8ojS-TWbmQ",
    "text": "Wow, this video is really well made. Thank you.",
    "like_count": 9,
    "published_at": "2024-01-01T17:38:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyK6DMfCX22HkDf2dR4AaABAg",
    "author": "@tommasofogli8845",
    "author_channel_id": "UCARbVP3H7Sc2tcojawt07LQ",
    "text": "I'm from Italy where i have been engaged in left-wing movements and electoral politics for a while and what you said around minute 26 on people cosplaing as revolutionary really resonated with me a lot! Its so fucking true, if you say revolution is the answer become a freedom fighteer, meanwhile i'll be here tring to change something in the present, tring most of all to create class and political consciuousness",
    "like_count": 3,
    "published_at": "2024-01-24T08:36:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyrgjzvShVPzY7dDmJ4AaABAg",
    "author": "@okwaleedpoetry",
    "author_channel_id": "UCaSjgt4ddaSWaFKbVfScJAA",
    "text": "This comment is for FD Signifier on 28:01. Words do more damage than bricks (as a poet I maybe a little bias haha), a revolutionary to me is someone who is trying to bring change to anything that does not mutually benefit the person or their environment. You guys are revolutionaries just for being educators...the first radical revolutionary I ever met was a teacher, that teacher never displayed any violence and never passed on pain. Sigh...fuck the labels deadass.",
    "like_count": 8,
    "published_at": "2024-01-01T03:45:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzuFY5UeycpMYSy-_l4AaABAg",
    "author": "@GeorgePatterson-om9dv",
    "author_channel_id": "UCJ7hgNJOZp0vPtBWtayhz-Q",
    "text": "You are one of the best debaters I have ever seen. Keep doing what you do.",
    "like_count": 1,
    "published_at": "2024-10-15T19:31:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxTh090ltT2qC-E4i54AaABAg",
    "author": "@edwardlegend1564",
    "author_channel_id": "UChr6dwHv3nGnsqmNuN9_hFQ",
    "text": "amazing video, by the way, i'm a taiwanese, our presidential election is also coming up, thank u for your thoughts on this topic, really educate me in many ways.",
    "like_count": 9,
    "published_at": "2024-01-01T08:31:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyIyYy6XuHiP52Aw8d4AaABAg",
    "author": "@aliyah8926",
    "author_channel_id": "UC9kbwTed_9LMvPylH4-IxIQ",
    "text": "LOVED",
    "like_count": 4,
    "published_at": "2024-01-01T07:43:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz6zlfiwclsljtlCRp4AaABAg",
    "author": "@shrmpchps",
    "author_channel_id": "UClvzgIS6KXF_edrwSbm0QqQ",
    "text": "What a great video! In chapter one you mentioned Marcus Garvey and being honest with ourselves. I am not a revolutionary but there are things i CAN do to help try and change what i with the tools at my disposal. \nI really appreciate all of the sources and voices you bring on in each chapter! Thanks for making thoughtful content 💗",
    "like_count": 5,
    "published_at": "2024-01-03T02:15:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwrCQ_HvTTBOQugcAZ4AaABAg",
    "author": "@tmcd5049",
    "author_channel_id": "UCshgr9sRzvjLAZK3E97aO5g",
    "text": "Sent here by Sam Sedar (the Majority Report) who recommended watching this clip!!!",
    "like_count": 3,
    "published_at": "2024-01-12T11:54:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzP40glgwVVQdGwUvh4AaABAg",
    "author": "@FlightlessSaucer",
    "author_channel_id": "UCCjVAD0w8AsJPXOIALOHRGg",
    "text": "Your videos are the only ones I don’t watch at 2x speed, I’ve realized. And they also happen to be some of the longer videos I watch",
    "like_count": 7,
    "published_at": "2024-01-01T18:16:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgznbDYfj0Rv41rK9lZ4AaABAg",
    "author": "@akotski",
    "author_channel_id": "UCAmqs5-48EaLbWbyb_uRDfQ",
    "text": "“take it away old me” 😂",
    "like_count": 2,
    "published_at": "2024-01-09T23:45:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy_y0vu_AJrbdyR6aB4AaABAg",
    "author": "@1fareast14",
    "author_channel_id": "UCHo9IHpBv3CV8rlXlVukeFQ",
    "text": "1:19:22 For example, I and other Arizonans are not to blame for Sinema shilling away her campaign promises. The fact that we voted for something is what gives us the right to complain when it is not delivered.",
    "like_count": 9,
    "published_at": "2024-01-02T20:54:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyh_uU9Pec649AIBYd4AaABAg",
    "author": "@runcaz7802",
    "author_channel_id": "UCtkbbtTZpgkbkhYCidBcLVQ",
    "text": "Just heard and saw you on Indisputable with your superb handling of Mayor Adams. That's why I found and subscribed to your channel.💙  💘",
    "like_count": 1,
    "published_at": "2024-04-03T05:14:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx8aOcUWZ3Yhh0sbCR4AaABAg",
    "author": "@okwaleedpoetry",
    "author_channel_id": "UCaSjgt4ddaSWaFKbVfScJAA",
    "text": "3:09:09 Thank you for making this video, happy new years love.",
    "like_count": 5,
    "published_at": "2024-01-01T07:41:36Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzGpNKObKUZn2_XvMV4AaABAg",
    "author": "@leah_dragonfly",
    "author_channel_id": "UC1UrRogxMdnKfUJkfu_ELzQ",
    "text": "I always learn so much from your stuff. I was in the \"not going to vote\" camp, but yea I get the harm reduction thing. It is a valid reason and I will *yet again* hold my nose and vote for the Dems. Thanks for the work you put into this content, it really makes a difference and you are one of my favorites!",
    "like_count": 30,
    "published_at": "2024-01-02T00:52:22Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzGpNKObKUZn2_XvMV4AaABAg.9z2X8GJ97DN9z2gq6qX1jk",
        "author": "@olurinatti",
        "text": "love reading this, thank you",
        "like_count": 11,
        "published_at": "2024-01-02T02:25:52Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzAKmsrpx8X8tK5nXh4AaABAg",
    "author": "@nekonesto5601",
    "author_channel_id": "UCoqbr5uVFWFySsAwB8BQhOg",
    "text": "Commenting to thank you, THANK-YOU for this amazing video, and also to boost algorithm, people need to see this.",
    "like_count": 2,
    "published_at": "2024-01-13T11:20:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxItr0xIGERa9X57oZ4AaABAg",
    "author": "@triofan9",
    "author_channel_id": "UCV1nEpgW3x80o-ctztQW0NQ",
    "text": "Thank you! So beautifully put together ❤ well done",
    "like_count": 14,
    "published_at": "2024-01-01T04:43:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyfGoV6W1E-f-lcZjZ4AaABAg",
    "author": "@etspiritus",
    "author_channel_id": "UC3ZnT5ITBPw13h_Y-iWN6HQ",
    "text": "I knew whatever it was you were doin was gon be 💯 ✊✊✊",
    "like_count": 5,
    "published_at": "2024-01-01T07:44:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwXmwd7jR0Nlreq1A94AaABAg",
    "author": "@okwaleedpoetry",
    "author_channel_id": "UCaSjgt4ddaSWaFKbVfScJAA",
    "text": "I love how passionate Imani is",
    "like_count": 8,
    "published_at": "2024-01-01T06:36:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz79K3LggPcHWDx7aR4AaABAg",
    "author": "@Zennitube",
    "author_channel_id": "UCvVPnACbGYNwP8PnBParBeg",
    "text": "Another great video, Olay!",
    "like_count": 6,
    "published_at": "2024-01-01T16:10:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwEgLMrZ8gE5kbROut4AaABAg",
    "author": "@doodelay",
    "author_channel_id": "UCNooR1Iv0goz3mATwUiOR7g",
    "text": "I appreciate all the work you put into the video, my friend sent this to me and we discussed. There's a variety of issues I had with some of the points made here but I think my thoughts can be summarized by saying that if one acknowledges that the Democrats are getting more conservative with every election cycle, on all issues but social issues, then it is obvious that voting blue no matter who will inevitably bring us to the same place that the Republicans have brought us to now. \n\nAnd why? \n\nYou touched very lightly on the fact that both parties work for the same corporate interests although this should've been at the forefront of the discussion imo. And clearly corporate America doesn't care either way if we remain an oligarchy or transition to authoritarianism, and they certainly don't care if that transition takes place quickly under Republicans or slowly under Democrats. \n\nAnd that is what's going on, if you ignore the interests of Corporate America you will continue to think that there's at least one party fighting to keep democracy, which is the crux of the entire debate. \nAnd the Democrats have made it abundantly clear to everyone watching that \"saving democracy\" isn't their top priority, otherwise they'd open the primaries up and allow a challenge to a deeply unpopular Biden. \n\nBut they don't, and this shows that they're already exhibiting strong elements of authoritarianism as it is, thus, threatening to withhold the vote unless we get a real and vibrant primary is the only civic strategy worth having at this time, along with popularizing rank choice voting.\n\nAt 2:19:50 you present the boulder analogy of liberation at the top of a hill. My question to you is if Republicans symbolize gravity, pulling against our efforts, which direction do you think the democratic party is pushing? Is it up the hill with us, or are they assisting gravity pushing against us? And somewhat separately, do you believe that genocide isn't fascism?\n\nFinally, to respond to your latter comments on why do we do activism at all if we truly believe the two parties are the same. \n\nI do feel that both establishment parties are the same under the union of corporate interests, but there is a tiny but growing faction of the democratic party since Bernie Sanders that is actively working with us. And that's the element in American politics that makes civic engagement like withholding the vote worth pursuing, for now, imo.",
    "like_count": 3,
    "published_at": "2024-01-13T02:48:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxoY8tmYjWjGD97cZl4AaABAg",
    "author": "@dsfarthing",
    "author_channel_id": "UCDzWm8FaDeWJSr7t4f4PvxQ",
    "text": "olay is a national treasure. this video is deeply thorough & makes some critically important points that i’m not hearing anywhere else. thank you for your work!!",
    "like_count": 0,
    "published_at": "2024-07-17T20:22:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyd_dRH3mg3V-Q52VR4AaABAg",
    "author": "@AfroKrieger",
    "author_channel_id": "UCgjkUbZMfQmtyHy4qYT9Cww",
    "text": "Thank you for doing this!",
    "like_count": 5,
    "published_at": "2024-01-01T16:52:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyKBPg1dpXVeF_GlKh4AaABAg",
    "author": "@davidmendis1820",
    "author_channel_id": "UCHUX4bjVaJfJTzAaz2m44Zw",
    "text": "Thank you. Much love.",
    "like_count": 2,
    "published_at": "2024-01-10T20:13:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy4EU5-zJMmr2X4m4x4AaABAg",
    "author": "@leewhiting3834",
    "author_channel_id": "UCZshRRGMLXWU6E8eQ8cvd5Q",
    "text": "Thank you for this video Olay! I feel much better equipped to talk to family and friends about the importance of voting!",
    "like_count": 8,
    "published_at": "2024-01-02T00:19:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxMTkeDM8FC6jiPZ7h4AaABAg",
    "author": "@AndeB1209",
    "author_channel_id": "UCOAglXXAWyIju3z_AbsAKBw",
    "text": "Youtube is really fucked up for showing me this FIVE fucking days after it was posted! I swear I have notification turned on, but I digress. Great video! Incredibly informative, I love the content. Please keep doing what you're doing. I shared this with my family because some of them really need to hear this shit from people who look like them. Much love to you ❤",
    "like_count": 2,
    "published_at": "2024-01-06T22:29:34Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxZmgJU1bTlFSp0TGF4AaABAg",
    "author": "@markparker8054",
    "author_channel_id": "UCmixn1_vv6gp4Soid1svDsw",
    "text": "Thanks you make us smarter and hopeful!\nVery happy we met you and the \"Leftists\"\nHappy New Year please don't stop what you do! ❤",
    "like_count": 20,
    "published_at": "2024-01-01T11:15:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz0cT1r2cIObY-EIKZ4AaABAg",
    "author": "@DDoogg97",
    "author_channel_id": "UClKDQKza6bpgr8pQEQQQ0TQ",
    "text": "Yea I’m 26 year old black man technically the first gen z . And I am from the Mississippi delta . I hold a degree in economics . So my perspective is just all over the place .  \n\nI loved this video as I found myself falling into some of the traps when I was younger even the revolution vs civic engagement , I just heard my moms voice saying “ you scare me sometimes “.\n\nAs I kind of  trying to shape what I can bring the table for black people as a lawyer or as an engineer or both without endangering or harming my loved ones .  But I don’t wanna be just a nigga talking in a mic . \n\nI wanna be involved but it’s pretty hard fr. While still deep down feeling as a young black man I need to be prepared to die or commit a serious act of violence . \n\nIt gave me a lot to think about , especially as I decide my next career path .",
    "like_count": 30,
    "published_at": "2024-01-01T18:14:57Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugz0cT1r2cIObY-EIKZ4AaABAg.9z1oeY6J8d3ASmEZOvAAwe",
        "author": "@M4RI4TIGER",
        "text": "Hello, given our new political climate- do you have an update for us.",
        "like_count": 0,
        "published_at": "2026-02-03T19:56:10Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugxq_5QigBGsZmK4Tyt4AaABAg",
    "author": "@jennyxx3y",
    "author_channel_id": "UCQ73hlJbpDW-oC5jW92F-xQ",
    "text": "57 min in so far and this is hitting hard!",
    "like_count": 6,
    "published_at": "2024-01-01T13:18:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx4He2I2BHLJ7Gcy1B4AaABAg",
    "author": "@willpotter22",
    "author_channel_id": "UCCC-yySBFXP9EftqUqs2Prg",
    "text": "Queen indeed….mmm!!❤❤❤",
    "like_count": 2,
    "published_at": "2024-01-13T19:41:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwqzu0q6TqwvH3juId4AaABAg",
    "author": "@joanthebigboat",
    "author_channel_id": "UCM8mzKnU2uzMuqi8qrjIdVQ",
    "text": "thank you for all your work and advocacy you make the world a better place. I'm proud to live in IL",
    "like_count": 5,
    "published_at": "2024-01-01T18:29:27Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxANaDnDPpUqrQedXR4AaABAg",
    "author": "@dearyvettetn4489",
    "author_channel_id": "UConqRuNt82_1nnbd5QHZo6A",
    "text": "My YouTube feed has been dry as f🤬 but if half the people I sub to are as busy as you’ve been then maybe the drought isn’t all that bad.  Thank you and all who contributed to this, it was worth every minute.",
    "like_count": 2,
    "published_at": "2024-01-06T02:31:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx14-2dXWLoXuHiBbd4AaABAg",
    "author": "@C0MRAD_NAp_B0ULE",
    "author_channel_id": "UCrgbJlD0IriEx3-67BRKJJA",
    "text": "Vote Blue, No Matter Who: The Movie. \n\nGood video, I have to say I have soften my views on voting in the federal elections just because of FD signifies idea behind it. And thank you for highlighting my Haitian people and our immigration struggles!",
    "like_count": 2,
    "published_at": "2024-01-03T07:27:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzxvDaMiSUmKq9AkY54AaABAg",
    "author": "@pslam2302",
    "author_channel_id": "UCcVTc-vA9aB1UbGMpZmIlcQ",
    "text": "i came from hasanabi!! love the video. totally agree that there are multiple right answers. E.g., the \"harm reduction\" mentality AND the \"neither option is acceptable\" mentality both align w/ my values",
    "like_count": 18,
    "published_at": "2024-04-24T00:56:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzhEDUPX5jv9bJvkCV4AaABAg",
    "author": "@mynameisalexandershamilton",
    "author_channel_id": "UCzResnBMmrj7WNk0NZlte7g",
    "text": "Such a good video!",
    "like_count": 5,
    "published_at": "2024-01-01T17:22:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwr0xJfwpRzIVUnr9x4AaABAg",
    "author": "@derickdondiva",
    "author_channel_id": "UCCA2NGBMvXkBgh40M9TIMkQ",
    "text": "Thank you so much for making this video. This has been incredibly insightful and thought provoking for me. I wish you and everyone you love a wonderful year full of love and light.",
    "like_count": 10,
    "published_at": "2024-01-01T17:24:31Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugwr0xJfwpRzIVUnr9x4AaABAg.9z1it6ExQ2U9z1mplpjRD9",
        "author": "@olurinatti",
        "text": "💚💜💚",
        "like_count": 2,
        "published_at": "2024-01-01T17:59:00Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyMhyqHQPtW4WvrHoF4AaABAg",
    "author": "@maashmedia8958",
    "author_channel_id": "UCuWNFuFNI32PwGocaJ6W8xQ",
    "text": "Outstanding work. I hope share this as much as possible and start the talks amongst my circles. Thank you. This was wildly insightful in some ways and affirming in others. Your video deserves every share. Excellent work.",
    "like_count": 1,
    "published_at": "2024-01-29T09:24:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyKbz9AD_6jVP3iR0N4AaABAg",
    "author": "@celeste_xo",
    "author_channel_id": "UCGaKS0eMJNdPYqc1nE7D2CA",
    "text": "Oh this’ll be interesting 🤔 I’m not sure if I should vote or not tbh. Anyway, Olay, I haven’t seen you active on Twitter I thought something was wrong, I hope you’re doing well ❤ happy new year girl 🎉🥳",
    "like_count": 12,
    "published_at": "2023-12-31T21:35:04Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxp_X2nunKc29krHsp4AaABAg",
    "author": "@ynat2198",
    "author_channel_id": "UCja-tn0bThbQzA8EaVjUWzg",
    "text": "First off OKAY! thank you for putting in so much in to this simply so that we as the viewer could make informed decisions. Thank you to you, to those that gave their voices and input and time and energy solely to put information out in to the world during this election year. \nI'm a first gen immigrant, voting was always something that the family was divided on. We come from a country that has been and continues to be directly affected by US elections. Why should i vote here when my own country, Pakistan, has been denied fair and open elections by this very system? Where the only viable option was jailed at the behest of this govt with a carrot of aide dangling in front?  I struggle every time the word “voting” comes up. \n  My father, who SO believes in the act of voting regardless of outcome, continues to hold out hope (for what, i don't think even he knows). I am going to be honest i don't know if i care enough to vote simply to have to then drum up enough energy AGAIN to fight a weak mentally immobile president and his/ her ilk. \nRegardless thank you for your work. 🙏🏽",
    "like_count": 2,
    "published_at": "2024-01-02T14:20:31Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx5A0DVWwtAN85vGQh4AaABAg",
    "author": "@shmackydoo",
    "author_channel_id": "UCrNat40abddBuy5d9SH6fuw",
    "text": "Best video of 2024. So many need to see and hear this",
    "like_count": 2,
    "published_at": "2024-01-03T17:51:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwif3PElJ4nayLHCXd4AaABAg",
    "author": "@codedoe2469",
    "author_channel_id": "UCO7j7b112NSdEMI1_AjCwpQ",
    "text": "This really taught me a whole ton of new ideas and ways of thinking, which is something ytube video hasn't made me do in years. Thanks so much!",
    "like_count": 4,
    "published_at": "2024-01-01T23:16:38Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxqMu42TBW3o1JLAAR4AaABAg",
    "author": "@heyhey3603",
    "author_channel_id": "UCMOGchSJJiV-SbEi3GLx2YA",
    "text": "Thanx Olay for the informative video, haven’t had the chance to watch it but I did listen to it twice. Once on the 3 n a half hour drive to Atlantic City and the 3 hour drive back.",
    "like_count": 1,
    "published_at": "2024-05-22T17:15:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy-XhN-1bVYfSKiBCp4AaABAg",
    "author": "@Pashanny824",
    "author_channel_id": "UCB1I-hbV4lzXNfKaDZ8E76A",
    "text": "Much love Olay. Thank you.",
    "like_count": 2,
    "published_at": "2024-01-09T23:18:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxiyXhol7FCe1459lB4AaABAg",
    "author": "@HUeducator2011",
    "author_channel_id": "UCscPVBODk0rDh7YNnpBYJxQ",
    "text": "You have verbalized everything that I’ve thought. This is amazingggggg. I used to work in Title I  schools with first gen students and LIFE dramatically changed for them after 2016. \n\nBabies afraid to go to school in fear of putting their parents/selves at risk for deportation. \n\nWe see what happened to childhood poverty once the GOP stripped away funding.\n\nWe see what happened when book bans happened.\n\nWe see what happened to LGBTQIA teachers after the GOP embraced Moms for Liberty/Libs of TikTok \n\nMy heart is so gleeful for this 🫶🏿\n\n“Voting doesn’t matter”to a person of privilege- especially if you’re NOT Black. (Not including apathy)\n\n42:34 I love thisssss 😂. I’m weakkkk",
    "like_count": 1,
    "published_at": "2024-01-02T19:26:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyL26MJ7l7dwLtr3Dp4AaABAg",
    "author": "@sergiosaavedra9161",
    "author_channel_id": "UCEqJNckIoNbklqVxjBi_HMg",
    "text": "Awesome Breakfast Club stance. All I want is to be informed and make an educated decision for myself. You have amazing insight and make this such a great channel to listen to with a neutral approach.",
    "like_count": 2,
    "published_at": "2024-04-03T17:31:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz0gbQqGKgnVqppVp54AaABAg",
    "author": "@jaykaybrew",
    "author_channel_id": "UCowoWSjy_w1sl7HQ-9HVN7Q",
    "text": "Thanks for the WORK.",
    "like_count": 2,
    "published_at": "2024-01-13T03:54:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx7AkILN9Cp3Yx_CgZ4AaABAg",
    "author": "@majidemami4626",
    "author_channel_id": "UCIRl08j_NNBEQ7BC-z26-KA",
    "text": "Wow!  This is one of the highest quality videos in terms of content that I have watched!  Thank you.",
    "like_count": 2,
    "published_at": "2024-01-12T04:47:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgygamAa-MSF8m-ltd14AaABAg",
    "author": "@AwsmNix",
    "author_channel_id": "UCQCTJ-gn75JAKg9EtfnyhRQ",
    "text": "I learn so much from every single video. I used to be a big Marianne fan and I now see her as a fairly insidious, or at least distrustful, figure at her core and no longer speak in favor of her. Ive been trying to solidify my ideas on the topics of electoralism in this scenario in which so many are saying no to voting for Biden which is the blue no matter who people screaming from the rooftops and has me reflecting on my stance. You are a thought leader and the leftist YouTube ecosystem in so lucky to have you here to hold peoples feet to the fire as they do deeply need. And DEEP respect for seeing you with Jessie Gender, she is similarly such an important thought leader. The two of you (and many of the other featured people, most of who I’ve followed for years) have deeply shaped my views and given me confidence to stand for them fiercely and ready to advocate for.",
    "like_count": 20,
    "published_at": "2024-01-01T17:19:59Z",
    "is_reply": false,
    "reply_count": 5,
    "replies": [
      {
        "id": "UgygamAa-MSF8m-ltd14AaABAg.9z1iMwdU1kC9z1ms-72Oou",
        "author": "@olurinatti",
        "text": "🥹💚💚💚💜💜💜",
        "like_count": 6,
        "published_at": "2024-01-01T17:59:19Z",
        "is_reply": true
      },
      {
        "id": "UgygamAa-MSF8m-ltd14AaABAg.9z1iMwdU1kC9z2YmbKqbNQ",
        "author": "@quincyquincy4764",
        "text": "What did marianne do or say that made you distrust her?",
        "like_count": 3,
        "published_at": "2024-01-02T01:06:45Z",
        "is_reply": true
      },
      {
        "id": "UgygamAa-MSF8m-ltd14AaABAg.9z1iMwdU1kC9z2nFcgd3BZ",
        "author": "@AwsmNix",
        "text": "@quincyquincy4764 Olurinatti’s interview. It’s a must watch. Her former staffers law suit I find very damning and her excuse for it doesn’t express the humanity she claims to stand for. She’s deeply a capitalist and knows more hyperbolic quotes from former presidents (who were not people that should be glamorized), then she does economics. And anyone coming from the Oprah new age stratosphere I generally distrust as they were almost all across the board con artists. The left media does soft ball her, and the mainstream media smears her falsely when there are so many issues (as seen in the interview, it’s a MUST WATCH), that she’s never been held to the fire and doesn’t handle it well or demonstrate plans or deeper thinking.",
        "like_count": 0,
        "published_at": "2024-01-02T03:21:55Z",
        "is_reply": true
      },
      {
        "id": "UgygamAa-MSF8m-ltd14AaABAg.9z1iMwdU1kC9z3yzwM7u8O",
        "author": "@norwoodsstokes3883",
        "text": "You find Marianne....insidious...explained....👉👂🧐🤔⏳",
        "like_count": 0,
        "published_at": "2024-01-02T14:23:44Z",
        "is_reply": true
      },
      {
        "id": "UgygamAa-MSF8m-ltd14AaABAg.9z1iMwdU1kC9zLIUiisFpB",
        "author": "@pjihae",
        "text": "@quincyquincy4764she doesn't acknowledge that Gaza is under occupation. Also just listening to her it's exactly like listening to every other white liberal woman I've ever known who says what she thinks is the right thing to say but will throw marginalized people under the bus as soon as it's convenient. I've dealt with enough of them to clock them quick.",
        "like_count": 0,
        "published_at": "2024-01-09T07:49:56Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzaVBB0EI-kHgX580N4AaABAg",
    "author": "@alfredbaeumer3643",
    "author_channel_id": "UCi3qOuDI5ULAjCeAXQgM8Bg",
    "text": "Great effort!",
    "like_count": 1,
    "published_at": "2024-01-24T18:28:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzEUjHWS8-tZ-o3fIx4AaABAg",
    "author": "@tely101",
    "author_channel_id": "UCz3LmLHV12EQ4tebC09-9HA",
    "text": "black man from the Caribbean here, voices like yours are appreciated. Thank you for all the work you do",
    "like_count": 1,
    "published_at": "2024-01-02T22:34:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgylHygeuDHC2PuOuwl4AaABAg",
    "author": "@Hikesoup",
    "author_channel_id": "UCvx8s4OLEJMAWjvGfKRMlSA",
    "text": "I feel challenged in the best way possible",
    "like_count": 3,
    "published_at": "2024-01-01T22:36:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwnmLYe4MqHPEVg1wt4AaABAg",
    "author": "@mm_mela4816",
    "author_channel_id": "UCTWbOFXPPr81XMLh4cL45Dg",
    "text": "I finished this video as I was drawing. You inspired me to write a essay for my communication class based on why some people dont vote. So many good quotes and talking points from the video, that i may have to go back to watch again",
    "like_count": 2,
    "published_at": "2024-01-11T20:33:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwi8KgNGp1cyYgHJLt4AaABAg",
    "author": "@elluchadork",
    "author_channel_id": "UCAlH0Pbriaw9HBe3QY90Jvw",
    "text": "2:12:16 perfectly said and how l have felt for along time",
    "like_count": 1,
    "published_at": "2024-01-03T15:55:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgysWR_JU5u8OIy9_Nl4AaABAg",
    "author": "@FriedFreezer",
    "author_channel_id": "UCW0VMOtpAsvYUeqp75SXnDQ",
    "text": "Thank you for this.",
    "like_count": 0,
    "published_at": "2024-07-31T07:45:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwtZz8NWRwFuFg1OJ14AaABAg",
    "author": "@phillipjohnson8903",
    "author_channel_id": "UC3-58WVsRrwG8dfoTSYmFnQ",
    "text": "VERY happy I found your channel",
    "like_count": 1,
    "published_at": "2024-05-20T22:44:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy3WSwzmrw-fxt1G614AaABAg",
    "author": "@chreeess",
    "author_channel_id": "UCz_rlzQxPrIMC4VVwWjA4LA",
    "text": "God I love MLH and his nuances, I feel the same towards the Green Party and Stein 😊 also struggled in 2020..",
    "like_count": 2,
    "published_at": "2024-01-04T22:30:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz6jC4u46jKLP4p9xV4AaABAg",
    "author": "@yashaouchan",
    "author_channel_id": "UCSq4DfGuoqr-cM2CFu3GfLw",
    "text": "I strongly suggest voting uncommitted.",
    "like_count": 3,
    "published_at": "2024-04-08T04:51:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyh4gEtBQwderXUEyF4AaABAg",
    "author": "@emptyheat25",
    "author_channel_id": "UC2Ynq6laAdifs6kjblPE5gg",
    "text": "zaid tabani got me here. Glad he did.",
    "like_count": 1,
    "published_at": "2024-01-22T23:48:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyaTQaLYpQbuzWvg1Z4AaABAg",
    "author": "@Deviantacademia",
    "author_channel_id": "UCBLLOZdg5m32PWk_24U7Vzw",
    "text": "Thank you for making this video. I can imagine how taxing it must have been. As a nonbinary black femme who is very pro Palestine I was not convinced into voting for Kamala. This video changed my mind, not through guilt but through all of these really thoughtful conversations (and F.D's hand washing metaphor. I'm not gon hold you that one got me). Anyways. Thanks!",
    "like_count": 2,
    "published_at": "2024-09-28T03:24:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxAdWxENoz2X7gqY3h4AaABAg",
    "author": "@Derodek",
    "author_channel_id": "UCIXsZOuD3EAEFeNRuvLr3NQ",
    "text": "Before I start the video i just wanted to say thank you. With everything that's been happening of late, I've been feeling hopeless that change can happen, or even keeping what we already have is nigh impossible. Watching your videos is the first time in a while that anyone's made sense on the matters of the world. You're funny, kind, and focus on the real shit.\n Thanks for giving me hope and the information I need to try and better the world around me",
    "like_count": 2,
    "published_at": "2024-01-03T20:18:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyLdPnoorMAodSEAM14AaABAg",
    "author": "@danielthomas9843",
    "author_channel_id": "UCubs9xOEfJMWl9XJGek_t_A",
    "text": "I fully agree with everything you said in this video. Thanks so much!",
    "like_count": 1,
    "published_at": "2024-01-02T18:02:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxEWcmKL-bWY9iHb1N4AaABAg",
    "author": "@JohnMHerrera",
    "author_channel_id": "UC4Tmihsy8A1mWgmVL8BHG8A",
    "text": "2:24:00 in. I’m enjoying this so far. Thanks Olayemi",
    "like_count": 1,
    "published_at": "2024-01-09T18:51:20Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzUatnqUL9QeAaKh_x4AaABAg",
    "author": "@woopitywoo",
    "author_channel_id": "UCGAYOCoJwPya4CqVUa-kU1g",
    "text": "Thank you so much! This was pact with info! I will be rewatching many times!",
    "like_count": 3,
    "published_at": "2024-01-01T22:57:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyD6VjY0aWnZlI9iKh4AaABAg",
    "author": "@coilyqueen312",
    "author_channel_id": "UCAElMvzj4dpPVg7RJsuDaJQ",
    "text": "This was amazing and clearly a lot of work, thank you!!! 👏🏾👏🏾👏🏾",
    "like_count": 7,
    "published_at": "2024-01-01T03:06:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy7KCbNK0KoB3uQ_EZ4AaABAg",
    "author": "@vinamacias7546",
    "author_channel_id": "UCDRchvjpOshCf7tZ9q83rhg",
    "text": "posted on the new year and already one of the most important youtube videos of 2024. I'll be pointing back to this video anytime folks mention not voting",
    "like_count": 1,
    "published_at": "2024-01-05T23:42:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx5rE5SHhYsdXs8MSZ4AaABAg",
    "author": "@JinnJayy",
    "author_channel_id": "UCCpHgyq-2y1MDPGAaoEbDhw",
    "text": "This need more views 😊",
    "like_count": 1,
    "published_at": "2024-01-29T02:53:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzaSFRb0qpumvBZ4X14AaABAg",
    "author": "@cwillott",
    "author_channel_id": "UCAI1rxUhPtHlWwJO3RtM4ow",
    "text": "Thank you for making this video. I'm one of your white fan base. First saw you on The Leftist Mafia, then subscribed to your YouTube & Twitter accounts. As a result of having campaigned for Bernie in 2016 & 2020, I became a delegate to the California Democratic Party and have invested much time & energy into local elections in my politically conservative community to move our leadership leftward. It's a slow brutal process that we have to work on repeatedly. \nIt's great that you included Nina Turner here. She's been inspirational to me. It was heartbreaking to campaign for her House run in 2021 only to see it stolen away at the last minute by dark money smears.",
    "like_count": 2,
    "published_at": "2024-01-14T11:57:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwwP2EMzAQbDcav9gp4AaABAg",
    "author": "@RebelWithoutABoss",
    "author_channel_id": "UCu8qH3Dc_C4gZ820a0S_cqA",
    "text": "I'm most definitely voting, it's a duty. I'm probably voting third party though",
    "like_count": 3,
    "published_at": "2024-01-01T16:11:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwhv7hjmXAGujUEoQB4AaABAg",
    "author": "@EvanSmith1000",
    "author_channel_id": "UCjB8cXFdazhuFTTdyyoJADw",
    "text": "Sent here from the Majority Report, thanks so much for your hard work and clarity!",
    "like_count": 1,
    "published_at": "2024-01-12T07:18:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzbvO-hsN13-mfgQ5l4AaABAg",
    "author": "@danaslitlist1",
    "author_channel_id": "UCUIRIRh_8FQJBkojkn3dsiw",
    "text": "Olu I can’t thank you enough for your videos and the work you do on your channel! You have impacted my opinions and way of thinking so much. I cannot wait to sit and listen to this deep dive!",
    "like_count": 7,
    "published_at": "2024-01-01T16:49:23Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzbvO-hsN13-mfgQ5l4AaABAg.9z1erlDUUgX9z1mtRZNyL4",
        "author": "@olurinatti",
        "text": "💚💜",
        "like_count": 1,
        "published_at": "2024-01-01T17:59:31Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwrxWrMzK0rqayj_VZ4AaABAg",
    "author": "@K12345ab",
    "author_channel_id": "UC4Nb8FlD43tl3ok-OJn-8hQ",
    "text": "This video was very impactful to me. You are someone I look up to and I felt like you were giving me a firm and necessary correction. I’m sharing this and hope to tell everyone about it in preparation for the election!",
    "like_count": 5,
    "published_at": "2024-01-12T01:42:31Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwrxWrMzK0rqayj_VZ4AaABAg.9zSMpOGTOaP9zUyfQyU37H",
        "author": "@olurinatti",
        "text": "💚💚💚🙏🏾",
        "like_count": 0,
        "published_at": "2024-01-13T02:00:26Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxrwPsqCmUBVx9mpXB4AaABAg",
    "author": "@denrico777",
    "author_channel_id": "UCGAy_A3ogDm9PZG0ocYsbKA",
    "text": "THANK YOU. I don't agree with everything said here. But I don't see how people don't realize how important it is to take this relatively small portion of your time to vote.",
    "like_count": 4,
    "published_at": "2024-01-01T21:04:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyUsnHwDT5oVkp_HyN4AaABAg",
    "author": "@saininj",
    "author_channel_id": "UCiPGNnRiR6CRRg0E21Kfhhg",
    "text": "Been a busy several days for me, but now I have time to watch this feature film.",
    "like_count": 1,
    "published_at": "2024-01-10T23:12:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxC60QPtA3OwYRlH_14AaABAg",
    "author": "@terriej123",
    "author_channel_id": "UCEPcUggkOldHNxMNIUEFuiw",
    "text": "Great one. Watched it all!",
    "like_count": 5,
    "published_at": "2024-01-01T13:21:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyF37Z30B6CgfC1XRh4AaABAg",
    "author": "@lanegeorgeton8266",
    "author_channel_id": "UCgF5Z3zuBIkO_to9on5Ymtg",
    "text": "Thank you .  Many blessings and appreciation for your works",
    "like_count": 6,
    "published_at": "2024-01-01T00:30:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyB95sW5HCcjFDWBpF4AaABAg",
    "author": "@K12345ab",
    "author_channel_id": "UC4Nb8FlD43tl3ok-OJn-8hQ",
    "text": "I keep coming back to continue watching this because it’s that good",
    "like_count": 1,
    "published_at": "2024-01-10T05:35:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyhZTtA8kHpO2s9d_N4AaABAg",
    "author": "@jeteper5530",
    "author_channel_id": "UCgqLJpF4HvP7e0axH6KnJ7A",
    "text": "This is awesome!\n\nThank you for all the time and energy that you put into this.",
    "like_count": 1,
    "published_at": "2024-02-08T11:27:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzdoITaA_sFPC_8iAZ4AaABAg",
    "author": "@nothing298",
    "author_channel_id": "UCfvBfDtwCZsmBQRdGUrt-yQ",
    "text": "Alright auntie, I'll go vote",
    "like_count": 0,
    "published_at": "2024-08-26T20:29:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzjCPmY6k_R0w6RFNp4AaABAg",
    "author": "@dannymarie",
    "author_channel_id": "UC2JoOFxOXCm61kaNmGADQSw",
    "text": "Commenting for engagement to get this great video into more eyeballs and ear canals 🙌",
    "like_count": 1,
    "published_at": "2024-01-02T19:10:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzk4PrRTVn8qm4HZ4Z4AaABAg",
    "author": "@archerbluth",
    "author_channel_id": "UCKdCDTyIhtQpTE_fKNwWFYA",
    "text": "LAWWWDDD!!! Another banger!!!!!!!",
    "like_count": 4,
    "published_at": "2024-01-01T00:15:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxTUoZ-HP4-fU0YHYt4AaABAg",
    "author": "@okwaleedpoetry",
    "author_channel_id": "UCaSjgt4ddaSWaFKbVfScJAA",
    "text": "Nina Turner what a incredible quote 51:40",
    "like_count": 3,
    "published_at": "2024-01-01T04:21:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx6EP9Bk--V8_ILn2Z4AaABAg",
    "author": "@laymayrosey",
    "author_channel_id": "UClnH4FCgp60_Rtu5Bd12xYQ",
    "text": "This entire video was worth watching and really encompasses our political state right now. It’s clear it took months to create.",
    "like_count": 1,
    "published_at": "2024-01-15T03:53:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzSsfqx3zBlxJGBxqR4AaABAg",
    "author": "@CentralCityCivics",
    "author_channel_id": "UC8jvITxrdAiG1zf_lpAo7qA",
    "text": "Hi Olu! Big fan of your work and I actually was making a video about 2024 based on the last election in November, but I’m excited to listen to what you have to say and hopefully that will translate into a better video :) Keep up the awesome work!!!",
    "like_count": 8,
    "published_at": "2024-01-01T01:16:31Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwBXToifYnMSjoMsAl4AaABAg",
    "author": "@thomasswords6837",
    "author_channel_id": "UCreEWfW1A8VPbCjSbn1LnrA",
    "text": "Really can't tell you how much I appreciate this video. I've had so many conflicting feelings and thoughts about this topic and you helped me understand why that is, and what I could do about it. I will be sharing this one widely!",
    "like_count": 2,
    "published_at": "2024-01-02T16:18:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzgh4wiIjdHOMlLQWx4AaABAg",
    "author": "@Praisethesunson",
    "author_channel_id": "UCdU4hcjOezTfmlCduOkNRtw",
    "text": "Wow the algorithm showed me an actually good video. A rare YouTube W. \n\nThis slapped. Well done.",
    "like_count": 1,
    "published_at": "2024-01-03T07:07:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy-HUMOmZmWN4Qy_Kp4AaABAg",
    "author": "@Newmansos",
    "author_channel_id": "UC4Y7B6HGjsUU8KXf46nCmew",
    "text": "I'm here from Zaid Tabani",
    "like_count": 1,
    "published_at": "2024-01-22T06:58:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwDsecGR2m3yvJl8kN4AaABAg",
    "author": "@jimmyrrpage",
    "author_channel_id": "UCog-WfyBqHyAs1hH6-6B_sA",
    "text": "YOU GOT IMANI GANDY HOLY CRAP! I *love* Imani! Was introduced to her by TWiB and been following her ever since. She's a treasure and a scholar.",
    "like_count": 2,
    "published_at": "2024-01-03T23:39:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz91MR6VnpKhCRm0b94AaABAg",
    "author": "@HannahSmith-hk4ms",
    "author_channel_id": "UCgRJwzmrkmkKT3k1uD46Mlw",
    "text": "I LOVE YOUR VIDEOS SO MUCH THANK YOU",
    "like_count": 1,
    "published_at": "2024-05-20T16:56:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwQvS_cyDDhcLc1w1Z4AaABAg",
    "author": "@June-pg9is",
    "author_channel_id": "UCrpqQGiAAqeL8Hm2ajg2D-g",
    "text": "It took a while but thank you so much for this - I might be able to cheer up my hubby and win the why you should vote discussion with this",
    "like_count": 1,
    "published_at": "2024-01-17T01:24:38Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz8OpX117ivt48ptVN4AaABAg",
    "author": "@JosephKerr27",
    "author_channel_id": "UCQrdqGABt_sKdShub99Dh9w",
    "text": "Got through the whole thing, and I gotta say this may be the single best overview on voting I've ever seen! You're empathetic yet don't pull punches. We've all got choices to make, and it's about acknowledging the inherent compromise of voting rather than thinking any candidate will be the end all be all solution.\n\nI'm gonna use that \"weakest adversary\" point in my own advocacy and share this in my organizing. Love again!",
    "like_count": 3,
    "published_at": "2024-01-02T19:53:26Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugz8OpX117ivt48ptVN4AaABAg.9z4Zigemifj9z4_SjJ73Ur",
        "author": "@olurinatti",
        "text": "😭😭🙏🏾🙏🏾thank you soo much truly",
        "like_count": 1,
        "published_at": "2024-01-02T19:59:51Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugxu4mqWq8t46HhiVzF4AaABAg",
    "author": "@dhatroit",
    "author_channel_id": "UCPPhdmDDHpfUK5WoLiiPkVA",
    "text": "2:19:00 is a difficult but needed imagery for us black ppl....",
    "like_count": 0,
    "published_at": "2024-01-02T19:20:36Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwe8b2_k6WiZPyQ_dV4AaABAg",
    "author": "@leorahgad",
    "author_channel_id": "UCT8AeChB-tITKky0FiIIlng",
    "text": "I thoroughly enjoyed this video.  Thank you for sharing",
    "like_count": 1,
    "published_at": "2024-01-02T18:38:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxlIn0jWwP16_sGpmt4AaABAg",
    "author": "@1fareast14",
    "author_channel_id": "UCHo9IHpBv3CV8rlXlVukeFQ",
    "text": "1:54:42-1:57:40 best part of the video right here",
    "like_count": 1,
    "published_at": "2024-01-02T22:01:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzE-bwJsTakuzc5iph4AaABAg",
    "author": "@ivandejour9806",
    "author_channel_id": "UCSeEzLw3skh2dd2V3gRk06A",
    "text": "Great informative vid Olay",
    "like_count": 5,
    "published_at": "2024-01-01T03:12:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwZPmPZ-G9HdHQJWzN4AaABAg",
    "author": "@doublej7293",
    "author_channel_id": "UC_H2QaQ9xVLLa1sG92AJnug",
    "text": "Incredible vid!!! I canvassed for Nina turner in her last run against shontel brown (establishment dem) and she was polling great w a fired up voter base but over a million dollars lobbied (from pro Israel pacs and other conservative and establishment dem pacs) behind shontel in the last month or so leading to her victory. That just really broke my heart honestly me and some friends put in the work for her grass roots campaign just for the system to rip her victory away. It’s been hard for me to get back into canvassing since then even tho I support Nina fully and don’t regret putting in that work having all that ripped away by the establishment has made me feel less hopeful to this. Awesome that you had Nina on :’(",
    "like_count": 0,
    "published_at": "2024-08-16T14:21:26Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgycdO95scOzzeUBctx4AaABAg",
    "author": "@Sleepyvolf",
    "author_channel_id": "UCFbagpyOGx_txUG_isupMFw",
    "text": "Honestly this is one of the best pieces of media I have seen on this subject. Thank you for posting.",
    "like_count": 1,
    "published_at": "2024-01-02T13:52:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy2bvUm2Bbldu7cFZx4AaABAg",
    "author": "@jeffh.6107",
    "author_channel_id": "UC0eZ8vu7N6LTKs2W__PhuwQ",
    "text": "Thx",
    "like_count": 0,
    "published_at": "2024-01-26T03:57:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzt6-zxaLB6eZG3TIt4AaABAg",
    "author": "@yeahokay1051",
    "author_channel_id": "UCq-wknp79KeOrMURr3GlOVw",
    "text": "I am gonna need a couple 3 sittings to soak this in but am excited to start this journey of s video, can tell 15 mins in its gonna be brain foods",
    "like_count": 1,
    "published_at": "2024-01-02T12:35:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwC4vcF97MNpVT0hUN4AaABAg",
    "author": "@mayroque5296",
    "author_channel_id": "UCIP-EWAK8bn2rAVOraiXUNQ",
    "text": "I vote because if by the slimmest margin we can bring about change without violent revolution then I prefer that. However in my heart of hearts and just my reading of history and looking at the situation in America I believe that as soon as progress truly threatens capitalism, the facade of democracy will be discarded.\n\nBut hope is not lost, vote if you want to but do contribute to your community, help form the bonds that can bring about the change for progress that we believe in outside of the structure.",
    "like_count": 0,
    "published_at": "2024-06-26T17:27:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzsNfC6bHz3vbRWFYx4AaABAg",
    "author": "@lindoyes",
    "author_channel_id": "UCvVcZ4Wm3Xq0agVPOoyf1fA",
    "text": "On point!",
    "like_count": 4,
    "published_at": "2024-01-01T02:44:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxChpXAP3IN2rkm1jx4AaABAg",
    "author": "@joeg4589",
    "author_channel_id": "UC0J2IA98lpIpZ5aV9P5h0AQ",
    "text": "Sent here by Sam Seder Majority Report",
    "like_count": 2,
    "published_at": "2024-01-12T15:05:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyQHXrJAUhQmj0vFWF4AaABAg",
    "author": "@tommylow143",
    "author_channel_id": "UCO8__Dx1arAdDbX_FE5ig9Q",
    "text": "just found your channel your content is awesome!",
    "like_count": 2,
    "published_at": "2024-01-05T02:08:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwIjHCpoxNL4EemAAR4AaABAg",
    "author": "@indianguy2276",
    "author_channel_id": "UCCh--jaxLr-9twzPaDmUcbw",
    "text": "Phenomenal video, love all the different perspectives, really glad i found you again because i swear i already subscribed to you.",
    "like_count": 1,
    "published_at": "2024-04-08T04:17:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw9NoQALfpFOJa_3xl4AaABAg",
    "author": "@cathybruce8692",
    "author_channel_id": "UCNaN9b5UC4EYW7DMSjjBVEw",
    "text": "Thank You!  It's worth watching and listening to every minute.  I feel more educated!",
    "like_count": 0,
    "published_at": "2024-01-02T13:08:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzO9n19H8f5TkNx28J4AaABAg",
    "author": "@anthonyponcex",
    "author_channel_id": "UCrW2lKgAWoEqbWYr_ttG8vQ",
    "text": "Whew... this one got me THINKING",
    "like_count": 1,
    "published_at": "2024-01-10T04:08:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwWEqCo2Ij8RltT77J4AaABAg",
    "author": "@JosephKerr27",
    "author_channel_id": "UCQrdqGABt_sKdShub99Dh9w",
    "text": "Love ya and look forward to getting through this whole video! Eventually... In bits and pieces lol... Your thoughts and labor are true public service and very much appreciated!",
    "like_count": 2,
    "published_at": "2024-01-01T20:34:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgygqD8SfrOEzUJtXqB4AaABAg",
    "author": "@grandpafalkenrath2988",
    "author_channel_id": "UC3DgpSXlbOjYsl4QB8JjTqA",
    "text": "Olay, your hair looks Fantastic Love You",
    "like_count": 1,
    "published_at": "2024-01-06T03:54:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyhOhPSEcWpJHQijMt4AaABAg",
    "author": "@esmeralda4297",
    "author_channel_id": "UCXMg7MMMZb71Wk0-h3MkCYw",
    "text": "Insightful!",
    "like_count": 1,
    "published_at": "2024-01-21T10:59:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxIX-RkB1HxgCR_Bhl4AaABAg",
    "author": "@Erinestrella71310",
    "author_channel_id": "UCN7td9x6uG9roqyvBhvDg0Q",
    "text": "This video is so important ❤❤❤ thanks Olay",
    "like_count": 1,
    "published_at": "2024-04-26T20:52:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwQFg8CsAUwy3yjPLF4AaABAg",
    "author": "@MissEliza99",
    "author_channel_id": "UCikewnIsJ-HPinfNVK5NJVQ",
    "text": "Thank you for this.  I really needed to hear what folks had to say in this video.  I had been really struggling with the idea of voting for Biden because of the support for genocide issue, but you laid out a cogent and compelling argument.  My husband is very relieved that you were able to succeed where he was having difficulty.  Lol.\n\nMy heart goes out to you with your immigration struggles, and I wish you all the best.  I hate how flippant and dismissive this country is about people's lives.  And I heard recently Biden and the Dems are negotiating shittier immigration policy in exchange for Ukraine funding?  What the actual fuck?  But, as you say, bad as they are, the alternative is worse.\n\nThank you for all your hard work, and I look forward to seeing what you have for 2024!",
    "like_count": 2,
    "published_at": "2024-01-05T16:36:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxMhbPlgBuSxoftN4t4AaABAg",
    "author": "@woopwoopswoop",
    "author_channel_id": "UC0vPhxtLU8LUeb1LiyVNXWg",
    "text": "thanks for sharing your thoughts 😊",
    "like_count": 1,
    "published_at": "2024-01-14T19:55:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw3BBrGAV924Whs2hp4AaABAg",
    "author": "@Vivivofi",
    "author_channel_id": "UCc4_SqCz9bg3S057Oth5ojA",
    "text": "So glad to find your channel, this is an amazing resource you’re providing here and I just want to say a big heartfelt thank you - thank you. This is perfection.",
    "like_count": 1,
    "published_at": "2024-02-11T03:31:19Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugw3BBrGAV924Whs2hp4AaABAg.A-eo7PkSSC8A-gP_yDG7Cb",
        "author": "@olurinatti",
        "text": "Wow, thank you so much",
        "like_count": 1,
        "published_at": "2024-02-11T18:26:38Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx8FVt9UrPchX-NelZ4AaABAg",
    "author": "@reppinolskool4965",
    "author_channel_id": "UCGNc7ANY9SHcJrdO7ilca6A",
    "text": "Beautiful Articulate Intelligent Woman !!! ❤❤❤",
    "like_count": 1,
    "published_at": "2024-04-17T20:41:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx4spA8o95GCR-ucGd4AaABAg",
    "author": "@PhantomGender",
    "author_channel_id": "UCflqPi-joF7TuPv8zyovTOg",
    "text": "thank you so much for making this video, im gonna show it to everyone i know. absolutely fantastic work",
    "like_count": 1,
    "published_at": "2024-01-11T00:46:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyJwpNLZa8lSnLsRVx4AaABAg",
    "author": "@petezAAPete",
    "author_channel_id": "UC7QUR-EhKH63w-ehj6uoeBg",
    "text": "I love your vids",
    "like_count": 5,
    "published_at": "2024-01-01T02:17:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxd9daXB58IdcaQj1Z4AaABAg",
    "author": "@clytemnestra",
    "author_channel_id": "UCYhyTufbJ_V0eHZG_jtFi5A",
    "text": "Thank you so much for this video! I live in Wisconsin and really needed some levelheaded thoughts on voting to live through the discourse this year.",
    "like_count": 1,
    "published_at": "2024-01-08T18:36:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy9r4qdXp4DNkqb11J4AaABAg",
    "author": "@parjf",
    "author_channel_id": "UCdNqowSNhlKgSYL7ApHHu8w",
    "text": "This is an amazing video. Shared it on Mastodon - not sure if anyone will see it (I don't have many followers), but I hope some do as this whole video regarding the election, Biden, the democrats, GOP and fascism is compelling.",
    "like_count": 2,
    "published_at": "2024-01-04T21:15:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy_kPuG4-2etx1auex4AaABAg",
    "author": "@noahschiffman3529",
    "author_channel_id": "UCr3T7kaGvcijIdnUnixoRGA",
    "text": "Thank you so much for making this video I literally cannot tell you how much I appreciate this survival guide",
    "like_count": 1,
    "published_at": "2024-01-02T21:30:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugws8CGYOsamofjUj794AaABAg",
    "author": "@southend26",
    "author_channel_id": "UC1_G93hTFZORv5BJly9MLFA",
    "text": "100% correct perspective. Vote cold. These politicians aren't mascots.",
    "like_count": 0,
    "published_at": "2024-01-12T09:45:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzJ-YYli7o52BUkdsJ4AaABAg",
    "author": "@proanuubis2546",
    "author_channel_id": "UCpbtnjtq4auufeKPX6Z7cww",
    "text": "Wasn't expecting to watch the whole 3 hrs in one go but this was too good. ❤",
    "like_count": 1,
    "published_at": "2024-01-02T21:52:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy3nRO9oN0_pUn4zqd4AaABAg",
    "author": "@rescottjr",
    "author_channel_id": "UC9bJRA197Kpggbrp2CIwoXg",
    "text": "Nice! You broke it TF down! Way to go “Olu!”",
    "like_count": 0,
    "published_at": "2024-01-02T11:54:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgykOum5hkjl5BIYWUJ4AaABAg",
    "author": "@twonil1",
    "author_channel_id": "UCwwJvVth9AjstDQZQi_MG4Q",
    "text": "Absolutely wonderful!",
    "like_count": 0,
    "published_at": "2024-01-02T17:26:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx7-cJ2tJr5vGgUhXR4AaABAg",
    "author": "@Doubleptrem",
    "author_channel_id": "UCZN7Bg4E9ar_ctdft4MEKpQ",
    "text": "You got a shout out from the Majority Report.",
    "like_count": 3,
    "published_at": "2024-01-13T14:01:40Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugx7-cJ2tJr5vGgUhXR4AaABAg.9zWGCrmi0iI9zYbxAfpIKi",
        "author": "@cwillott",
        "text": "And The Leftist Mafia!",
        "like_count": 0,
        "published_at": "2024-01-14T11:58:50Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxK9KXH8jqmhLfxjVZ4AaABAg",
    "author": "@mrfreddorenton",
    "author_channel_id": "UCfw4p5sEr7ZRlv2ZMYCWSZQ",
    "text": "Followed you from skip intro's video. I'm going to stick around because this was a great achievement in communication.",
    "like_count": 1,
    "published_at": "2024-01-13T23:43:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzVbE7DmWrSFRt-rCJ4AaABAg",
    "author": "@JL-142",
    "author_channel_id": "UCRGFzd3xaY_A9EMmKfKeXaA",
    "text": "Localities are definitely their own story. The federal election in particular in 2024 is gonna be odd for me just cause participation feels like a tacit exoneration of our government's ability to enable genocide with little to no reapercussions. Ig in my mind there's a bigger statement in withholding your participation in certain contexts because it communicates you see the bs and aren't gonna give it a pass. Not this time. The convo is different with mayors, governors, actual acts you get to vote on for your state, etc.",
    "like_count": 3,
    "published_at": "2024-01-01T17:38:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy20LZ-knmJnPcES754AaABAg",
    "author": "@somekindawunerful",
    "author_channel_id": "UCFwB8Ia-Y1vzOQxX0uKr3cw",
    "text": "Just finished watching this a second time to let it wash over me again.  It's that feaking good.",
    "like_count": 2,
    "published_at": "2024-01-03T19:21:58Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugy20LZ-knmJnPcES754AaABAg.9z74v4zYX8x9z7cHurJPbl",
        "author": "@olurinatti",
        "text": "🥹🙏🏾💚",
        "like_count": 0,
        "published_at": "2024-01-04T00:22:19Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw4C1FWOK5fhkRYgjN4AaABAg",
    "author": "@yes_anotherone3260",
    "author_channel_id": "UCH_9EkyiUshcIJuqcJ_GUhA",
    "text": "Thank you for this very important work!",
    "like_count": 1,
    "published_at": "2024-01-09T02:44:09Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxDyo9vQWghyPNNX3d4AaABAg",
    "author": "@rhondab.3157",
    "author_channel_id": "UCBfbhJrOVXLYt8zhvqzae7A",
    "text": "Thank you for this! There are so many valid perspectives presented and without being condescending to different views. I can really see the time and care taken to complete this project.",
    "like_count": 0,
    "published_at": "2024-01-13T22:08:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwW-SO664o8sbKlqdR4AaABAg",
    "author": "@onement",
    "author_channel_id": "UC0lnt-02uFayaB0XLVDgKZQ",
    "text": "I've been following you on Twitter for ages but never got around to your long form video stuff. This is just really refreshing analysis and clarified a lot of things for me. I appreciate you putting so much time into this. Cheers!",
    "like_count": 2,
    "published_at": "2024-01-02T19:48:46Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwW-SO664o8sbKlqdR4AaABAg.9z4ZBTomtdS9z4_V1h2m77",
        "author": "@olurinatti",
        "text": "I love hearing this, thank you!",
        "like_count": 1,
        "published_at": "2024-01-02T20:00:10Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugwa6mtjSc-HTFBvfQl4AaABAg",
    "author": "@Davey_Da_Vinci",
    "author_channel_id": "UCzM8yQVrnlD8-Nkwbiueluw",
    "text": "Okay Olay I see you breaking into my 3 hour video essays. I'm here for it",
    "like_count": 1,
    "published_at": "2024-01-03T18:08:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxDYgQPwmI_7boGLsF4AaABAg",
    "author": "@lilliehazard",
    "author_channel_id": "UClEzaE7jWN346GQ8B4LOjGA",
    "text": "Thank you for this video!!!",
    "like_count": 0,
    "published_at": "2024-01-13T20:42:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgytDypdV2ZhgVnC2Hh4AaABAg",
    "author": "@victorsrandomvideos5208",
    "author_channel_id": "UChBpoPkCRJFIeZZpK94Casw",
    "text": "Thank you for making this video, I am learning so much that I needed to hear.",
    "like_count": 0,
    "published_at": "2024-05-29T13:41:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwbaFTf9AE1tnTCnNh4AaABAg",
    "author": "@kali5719",
    "author_channel_id": "UCqaabs9XfV4RAkC4suClmhA",
    "text": "I learned so much. Thank you for being so informative and sharing all the other people's views that you listen to. Seeing all these perspectives was important to me, because i've been struggling with so many of the things you spoke about in this video. You were  very clear, and i am way less confused. Honestly, now i am in the middle of readjusting my expectations....but now i have more information on where to focus Activism energies. Well done. I know this took a long time to put together, and I appreciate the thoughtfulness in this piece. The amount of history in it is fantastic as well. Needed conversations.",
    "like_count": 1,
    "published_at": "2024-01-02T14:53:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  }
]