[
  {
    "id": "Ugxw3g95toyY8Fvl61p4AaABAg",
    "author": "@morningstararun6278",
    "author_channel_id": "UCWfyN4p7053pFmOIKWe9aYA",
    "text": "The reason why I adhere to Marxism Leninism.",
    "like_count": 37,
    "published_at": "2023-12-19T04:12:11Z",
    "is_reply": false,
    "reply_count": 9,
    "replies": [
      {
        "id": "Ugxw3g95toyY8Fvl61p4AaABAg.9yUpsUDFTYP9yVQeRrsG_7",
        "author": "@rballen420",
        "text": "I was won to Marxism on a lengthy strike at Firestone and found out 20 years later why: a convoluted history involving the Liberian genocide of 1994-1995 et al!",
        "like_count": 2,
        "published_at": "2023-12-19T09:42:18Z",
        "is_reply": true
      },
      {
        "id": "Ugxw3g95toyY8Fvl61p4AaABAg.9yUpsUDFTYP9yW8XAaKT9b",
        "author": "@EdwardSkihands",
        "text": "ML is Stalinism, IT HAS NOTHING TO DO WITH LENIN",
        "like_count": 0,
        "published_at": "2023-12-19T16:23:08Z",
        "is_reply": true
      },
      {
        "id": "Ugxw3g95toyY8Fvl61p4AaABAg.9yUpsUDFTYP9yWHAJc1Myv",
        "author": "@morningstararun6278",
        "text": "​@EdwardSkihands Just answer me. What is your opinion on Stalin?",
        "like_count": 0,
        "published_at": "2023-12-19T17:38:39Z",
        "is_reply": true
      },
      {
        "id": "Ugxw3g95toyY8Fvl61p4AaABAg.9yUpsUDFTYP9yWJuGDh3_S",
        "author": "@morningstararun6278",
        "text": "@Magar0monk Yes and Mao Zedong thought too. But saying this out in public could mean a lifelong prison time here in India.",
        "like_count": 0,
        "published_at": "2023-12-19T18:02:33Z",
        "is_reply": true
      },
      {
        "id": "Ugxw3g95toyY8Fvl61p4AaABAg.9yUpsUDFTYP9yWNLCrU9t1",
        "author": "@edwardallan197",
        "text": "Many reasons to integrate these two strong thinkers!",
        "like_count": 1,
        "published_at": "2023-12-19T18:32:34Z",
        "is_reply": true
      },
      {
        "id": "Ugxw3g95toyY8Fvl61p4AaABAg.9yUpsUDFTYP9yYxnmildiY",
        "author": "@EdwardSkihands",
        "text": "@morningstararun6278 my opinion on Stalin? I’m in a very bad place right now.",
        "like_count": 0,
        "published_at": "2023-12-20T18:38:24Z",
        "is_reply": true
      },
      {
        "id": "Ugxw3g95toyY8Fvl61p4AaABAg.9yUpsUDFTYP9yZ0EdwDOhT",
        "author": "@morningstararun6278",
        "text": "@EdwardSkihands You are in a very bad place right now? I don't understand how that answers my question.",
        "like_count": 0,
        "published_at": "2023-12-20T19:08:25Z",
        "is_reply": true
      },
      {
        "id": "Ugxw3g95toyY8Fvl61p4AaABAg.9yUpsUDFTYP9yZ1f2uJ_tL",
        "author": "@EdwardSkihands",
        "text": "@morningstararun6278 I’m not going to argue with stalinists",
        "like_count": 0,
        "published_at": "2023-12-20T19:20:54Z",
        "is_reply": true
      },
      {
        "id": "Ugxw3g95toyY8Fvl61p4AaABAg.9yUpsUDFTYP9yZ2F5rzAnm",
        "author": "@morningstararun6278",
        "text": "@EdwardSkihandsHey Trot, then you could say that you focking got nothing.",
        "like_count": 0,
        "published_at": "2023-12-20T19:25:58Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzZmIT5LZ_stllJpHB4AaABAg",
    "author": "@albertp3721",
    "author_channel_id": "UCO-ppxWAKvTdTbltZEpYqpA",
    "text": "That is why you don't take neither capitalism nor socialism like they were gospel, everything always change according to different factor",
    "like_count": 7,
    "published_at": "2023-12-19T07:05:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzBkPW5J_e_0pysdyt4AaABAg",
    "author": "@fate8007",
    "author_channel_id": "UClMIX-KsuSShc_EfgyhZEng",
    "text": "Lenin’s analysis was born from this new observation, that capitalism in its “monopoly phase” has undergone a qualitative change, and that it thus requires more modern analysis on it, and it has profound consequences on strategy. Neocolonialism has divided not just nations up between the bourgeoisie and the proletariat, but the whole world has been divided up between usurer nations and nations under neocolonialism.\n\nThis has lead to very different conclusions which classical Marxists are very uncomfortable with. For example, it means that the primary contradiction is not, in all countries, necessarily between the bourgeoisie and the proletariat. The proletariat can in fact sometimes work with their national bourgeoisie in order to overthrow imperialism. In science, you formulate a theory, which you then use to make a prediction, and then you do an experiment. Based on the experiment, you then update your theory accordingly.\n\nMarx did not predict socialism would come out of poor countries first because he did not have a strong analysis on imperialism. That analysis of imperialism required a better analysis of finance capital. Lenin in 1917 wrote his book Imperialism, the Highest Stage of Capitalism which synthesizes Rudolf Hilferding’s book Finance Capital (1910) with John Hobson’s book Imperialism: A Study (1902) to establish a Marxian theory of imperialism, the mechanisms that drive rich countries into imperialism, the tools which they use to accomplish it, and what it actually looks like.\n\n Marxism-Leninism is an extension of Marxism that includes a resolution to the problem of imperialism that prevents poor countries from developing and how to resolve it. While in classical Marxism, there is no deep analysis of imperialism, so this problem doesn’t even exist, and classical Marxism cannot explain why poor countries had successful socialist revolutions first and usually just chalk it up to \"it wasn't true socialism\"",
    "like_count": 16,
    "published_at": "2023-12-19T02:10:35Z",
    "is_reply": false,
    "reply_count": 7,
    "replies": [
      {
        "id": "UgzBkPW5J_e_0pysdyt4AaABAg.9yUbxrvmJUl9yUk-G_e-sy",
        "author": "@rando3939",
        "text": "Stellar explanation",
        "like_count": 4,
        "published_at": "2023-12-19T03:20:49Z",
        "is_reply": true
      },
      {
        "id": "UgzBkPW5J_e_0pysdyt4AaABAg.9yUbxrvmJUl9yUlGKBdz7k",
        "author": "@joshuaim3263",
        "text": "From my understanding, the implications of this analysis would then be different from classical Marxism because if the primary contraction of capitalism manifests as imperialism, this would mean that the struggle against capitalism takes the shape as the struggle against imperialism and not necessarily between proletariat and bourgeoisie (though this would be the outcome in the long run).\n\nMy guess is that this would be why the concept of nationhood and right to self-determination is more integral to Leninist theory, because these forms of praxis themselves resist imperialism.\n\nAdditionally, it makes sense that Marxism Leninism seems to be much more dominant outside the west as this is where the struggle against imperialism takes place, while in the west, the proletariat themselves benefit from this imperialism. Hence, the proletariat in the west do not have the same interests as those outside of the west, which is probably why you don't see that many Marxist Leninist tendencies within western leftist discourse.",
        "like_count": 2,
        "published_at": "2023-12-19T03:31:53Z",
        "is_reply": true
      },
      {
        "id": "UgzBkPW5J_e_0pysdyt4AaABAg.9yUbxrvmJUl9yUpRHUaV2l",
        "author": "@morningstararun6278",
        "text": "​@joshuaim3263Exactly man. I have been saying this to western Marxists for over a year. But they always say \"Leninism isn't real. It was a thing founded by dictator Stalin to deviate from Marxism and further strengthen his authoritarian rule.\" How naive the western Marxists must be.",
        "like_count": 0,
        "published_at": "2023-12-19T04:08:20Z",
        "is_reply": true
      },
      {
        "id": "UgzBkPW5J_e_0pysdyt4AaABAg.9yUbxrvmJUl9yUur0Qjwlo",
        "author": "@MidwesternMarx",
        "text": "Comrade, Marx changes his opinion on poor countries having to follow rich one’s capitalist path to socialism in the mid to late 1870s. \n\nLenin’s analysis of imperialism, however, is far more concrete than Marx’s precisely for the reasons you mention. \n\nI agree with your point on national liberation struggles, but I disagree with the way you phrase it as a break with classical Marxism. The Marxist notion of class is relational, class is a universal that can only exist in the particular. National liberation struggles, just like women struggles and the black freedom movement, are also CLASS STRUGGLES. The tradition of the 2nd international rejects this dialectical understanding of class, the third international (Marxism Leninism) however, doesn’t- we follow dialectical materialism and see these struggles against imperialism as forms of class struggles. \n\nI wrote about this here: https://brill.com/view/journals/jlso/aop/article-10.1163-24714607-bja10132/article-10.1163-24714607-bja10132.xml",
        "like_count": 11,
        "published_at": "2023-12-19T04:55:40Z",
        "is_reply": true
      },
      {
        "id": "UgzBkPW5J_e_0pysdyt4AaABAg.9yUbxrvmJUl9yUwkS74XE8",
        "author": "@joshuaim3263",
        "text": "@MidwesternMarx \nGot it. When I said classical Marxism I was referring to the Western Kautsky types who refer to themselves as classical/Orthodox Marxists. It's probably best though to not conflate that with Marx's actual works/opinions.",
        "like_count": 5,
        "published_at": "2023-12-19T05:12:15Z",
        "is_reply": true
      },
      {
        "id": "UgzBkPW5J_e_0pysdyt4AaABAg.9yUbxrvmJUl9ztwdeT72gi",
        "author": "@hansfrankfurter2903",
        "text": "@MidwesternMarxThis might be a dumb question but how do we define or understand “class” in the works of Marx and Lenin, Stalin, Mao…etc?",
        "like_count": 0,
        "published_at": "2024-01-23T04:02:58Z",
        "is_reply": true
      },
      {
        "id": "UgzBkPW5J_e_0pysdyt4AaABAg.9yUbxrvmJUlAC50UImqpAP",
        "author": "@alexjeffrey3981",
        "text": "@hansfrankfurter2903 classes are a dialectical model, you can only talk about one class relative to another - ie, the proletariat relative to the bourgeoisie. In the same way that there is no light without dark, no tall without short, etc. What a class is, essentially, is two or more groups of people who differ in their position within the mode of production. So the bourgeoisie, under capitalism, are those who generate their income from owning the means of production and hiring the proletariat, the wage-workers, to perform the labour required to produce the commodities that the bourgeoisie then sell on the market. So under capitalism, there is a class distinction between the workers and the owners. Under feudalism you had the aristocracy who owned the land and extracted rent from the peasantry who worked the land. Once you resolve the contradiction e.g. under socialism, getting rid of private ownership of capital meaning that the proletariat control the means of production as well as performing the labour, eventually class as a concept will no longer exist because there is no subdivision.",
        "like_count": 0,
        "published_at": "2024-12-15T23:24:15Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwPCgMu69BDEoj_2KJ4AaABAg",
    "author": "@ArmyJay",
    "author_channel_id": "UC4F4D5LzklAiO7Ieg0y2eyQ",
    "text": "Yeah your 100% right, Marx had no way of forseeing “Globalisation” or Neo-Colonialism/Imperialism play out the way it did. This is why Lenin and other “Neo-Marxist” thinkers are important, especially to refute the capitalist narrative that “Marx got it wrong, the world didn’t play out the way he predicted, there’s no world proletarian revolution.” Ignorantly ignoring China, as just one example, now the worlds powerhouse and leading economy.",
    "like_count": 8,
    "published_at": "2023-12-20T03:18:00Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwPCgMu69BDEoj_2KJ4AaABAg.9yXJTaPJh30A6oeint9Im8",
        "author": "@ArmyJay",
        "text": "@rod653 Exactly, and hundreds of millions of former farm and countryside workers have been lifted out of poverty. The largest number on earth, while poverty is on the rise in ‘the West’.",
        "like_count": 1,
        "published_at": "2024-08-06T23:01:20Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgweJEEILMS6qgGQmDt4AaABAg",
    "author": "@ferretace",
    "author_channel_id": "UCrJ0jfJ5lH3tyGGpQyRYZYQ",
    "text": "2:39 Nikolai..? How do you spell his name, and what is his work?",
    "like_count": 3,
    "published_at": "2023-12-19T02:16:52Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgweJEEILMS6qgGQmDt4AaABAg.9yUcfusi_v89yUdhYEPK3L",
        "author": "@dsichinava",
        "text": "Nikolai Chernyshevsky - What Is to Be Done?",
        "like_count": 4,
        "published_at": "2023-12-19T02:25:50Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx-U-5XVf2TE8FwEit4AaABAg",
    "author": "@gauravtejpal8901",
    "author_channel_id": "UCeWuqRx13J4VscMbcR0BtDA",
    "text": "I think it is not the case that Marx was wrong and Lenin was right. Certainly the material resistance to Capital has come from the poorest, most exploited regions of the world but the ideas that animate the masses were first synthesized in the most developed regions. Capital is not merely money or the flow of resources. It also has an existence in the domain of ideas.\nAlso, as was mentioned, the narrative that Africa or South America or any other region in the global south suffers from poverty because they are not sufficiently advanced in capitalist development, is fallacious and one that Marx himself rejected.",
    "like_count": 2,
    "published_at": "2023-12-19T09:47:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx1VM-LXim9RY_KmN94AaABAg",
    "author": "@itscolin81",
    "author_channel_id": "UC8hGqYGXLqG-3pm4AwPcbLA",
    "text": "That was the preface to the German edition. He was talking to Germans, not \"India or something.\" Marx's quote wasn't as wrong as this commentary makes it sound but still the rest is legit as is the general point.",
    "like_count": 3,
    "published_at": "2023-12-19T02:55:35Z",
    "is_reply": false,
    "reply_count": 6,
    "replies": [
      {
        "id": "Ugx1VM-LXim9RY_KmN94AaABAg.9yUh6XWDxA_9yUttW8voCa",
        "author": "@MidwesternMarx",
        "text": "Here is the quote. \n\n“In this work I have to examine the capitalist mode of production, and the conditions of production and exchange corresponding to that mode. Up to the present time, their classic ground is England. That is the reason why England is used as the chief illustration in the development of my theoretical ideas. If, however, the German reader shrugs his shoulders at the condition of the English industrial and agricultural labourers, or in optimist fashion comforts himself with the thought that in Germany things are not nearly so bad; I must plainly tell him, “De te fabula narratur!” [It is of you that the story is told. – Horace]\n\nIntrinsically, it is not a question of the higher or lower degree of development of the social antagonisms that result from the natural laws of capitalist production. It is a question of these laws themselves, of these tendencies working with iron necessity towards inevitable results. The country that is more developed industrially only shows, to the less developed, the image of its own future.”\n\nYes, Marx is speaking to his German audience, but his discussion of industrial development in England showing the whole world it’s future is general in character. And, as I mention in the video, through unpublished manuscripts (some which I have written about in the past) he adjusts this position somewhat to something more akin to what Lenin is able to discover at a more advanced stage of capitalism. I think Marx ultimately was right, but even when he was ‘wrong’, it wasn’t really wrong, it’s just that capitalism had yet to develop to its monopoly imperialist stage, so there was no way of accurately making predictions upon a social totality that had yet to complete its development.",
        "like_count": 2,
        "published_at": "2023-12-19T04:47:16Z",
        "is_reply": true
      },
      {
        "id": "Ugx1VM-LXim9RY_KmN94AaABAg.9yUh6XWDxA_9yUwqwpzEuI",
        "author": "@itscolin81",
        "text": "@MidwesternMarx Did his discussion of industrial development in England show \"the whole world it's future\"? Later in life he gave much more focus to Russia, India, China, etc but my understanding is Capital and especially this preface were fairly Eurocentric, including neo Europe.  From the preface:\n\n\"Let us not deceive ourselves on this. As in the 18th century, the American war of independence sounded the tocsin for the European middle class, so that in the 19th century, the American Civil War sounded it for the European working class. In England the process of social disintegration is palpable. When it has reached a certain point, it must react on the Continent. There it will take a form more brutal or more humane, according to the degree of development of the working class itself. Apart from higher motives, therefore, their own most important interests dictate to the classes that are for the nonce the ruling ones, the removal of all legally removable hindrances to the free development of the working class. For this reason, as well as others, I have given so large a space in this volume to the history, the details, and the results of English factory legislation. One nation can and should learn from others. And even when a society has got upon the right track for the discovery of the natural laws of its movement — and it is the ultimate aim of this work, to lay bare the economic law of motion of modern society — it can neither clear by bold leaps, nor remove by legal enactments, the obstacles offered by the successive phases of its normal development. But it can shorten and lessen the birth-pangs.\"",
        "like_count": 0,
        "published_at": "2023-12-19T05:13:08Z",
        "is_reply": true
      },
      {
        "id": "Ugx1VM-LXim9RY_KmN94AaABAg.9yUh6XWDxA_9yUyMpHMwrJ",
        "author": "@coopsnz1",
        "text": "capitalism built the middle class gloabally like the upper class @MidwesternMarx",
        "like_count": 0,
        "published_at": "2023-12-19T05:26:22Z",
        "is_reply": true
      },
      {
        "id": "Ugx1VM-LXim9RY_KmN94AaABAg.9yUh6XWDxA_9yUysI0vrAf",
        "author": "@itscolin81",
        "text": "I think it's fair to call this preface a Eurocentric perspective. I agree with criticizing it in the same spirit and arriving at the same conclusions but I think the criticism is that it's Eurocentric, not that he was talking about \"the whole world\" or \"India or something.\" \n\n... In this work I have to examine the capitalist mode of production, and the conditions of production and exchange corresponding to that mode. Up to the present time, their classic ground is England. That is the reason why England is used as the chief illustration in the development of my theoretical ideas. If, however, the German reader shrugs his shoulders at the condition of the English industrial and agricultural labourers, or in optimist fashion comforts himself with the thought that in Germany things are not nearly so bad; I must plainly tell him, “De te fabula narratur!” [It is of you that the story is told. – Horace]\r\n\r\nIntrinsically, it is not a question of the higher or lower degree of development of the social antagonisms that result from the natural laws of capitalist production. It is a question of these laws themselves, of these tendencies working with iron necessity towards inevitable results. The country that is more developed industrially only shows, to the less developed, the image of its own future.\r\n\r\nBut apart from this. Where capitalist production is fully naturalised among the Germans (for instance, in the factories proper) the condition of things is much worse than in England, because the counterpoise of the Factory Acts is wanting. In all other spheres, we, like all the rest of Continental Western Europe, suffer not only from the development of capitalist production, but also from the incompleteness of that development. Alongside the modern evils, a whole series of inherited evils oppress us, arising from the passive survival of antiquated modes of production, with their inevitable train of social and political anachronisms. We suffer not only from the living, but from the dead. Le mort saisit le vif! [The dead holds the living in his grasp. – formula of French common law]\r\n\r\nThe social statistics of Germany and the rest of Continental Western Europe are, in comparison with those of England, wretchedly compiled. But they raise the veil just enough to let us catch a glimpse of the Medusa head behind it. We should be appalled at the state of things at home, if, as in England, our governments and parliaments appointed periodically commissions of inquiry into economic conditions; if these commissions were armed with the same plenary powers to get at the truth; if it was possible to find for this purpose men as competent, as free from partisanship and respect of persons as are the English factory-inspectors, her medical reporters on public health, her commissioners of inquiry into the exploitation of women and children, into housing and food. Perseus wore a magic cap down over his eyes and ears as a make-believe that there are no monsters.\r\n\r\nLet us not deceive ourselves on this. As in the 18th century, the American war of independence sounded the tocsin for the European middle class, so that in the 19th century, the American Civil War sounded it for the European working class. In England the process of social disintegration is palpable. When it has reached a certain point, it must react on the Continent. There it will take a form more brutal or more humane, according to the degree of development of the working class itself. Apart from higher motives, therefore, their own most important interests dictate to the classes that are for the nonce the ruling ones, the removal of all legally removable hindrances to the free development of the working class. For this reason, as well as others, I have given so large a space in this volume to the history, the details, and the results of English factory legislation. One nation can and should learn from others. And even when a society has got upon the right track for the discovery of the natural laws of its movement — and it is the ultimate aim of this work, to lay bare the economic law of motion of modern society — it can neither clear by bold leaps, nor remove by legal enactments, the obstacles offered by the successive phases of its normal development. But it can shorten and lessen the birth-pangs.\r\n\r\nTo prevent possible misunderstanding, a word. I paint the capitalist and the landlord in no sense couleur de rose [i.e., seen through rose-tinted glasses]. But here individuals are dealt with only in so far as they are the personifications of economic categories, embodiments of particular class-relations and class-interests. My standpoint, from which the evolution of the economic formation of society is viewed as a process of natural history, can less than any other make the individual responsible for relations whose creature he socially remains, however much he may subjectively raise himself above them.\r\n\r\nIn the domain of Political Economy, free scientific inquiry meets not merely the same enemies as in all other domains. The peculiar nature of the materials it deals with, summons as foes into the field of battle the most violent, mean and malignant passions of the human breast, the Furies of private interest. The English Established Church, e.g., will more readily pardon an attack on 38 of its 39 articles than on 1/39 of its income. Now-a-days atheism is culpa levis [a relatively slight sin, c.f. mortal sin], as compared with criticism of existing property relations. Nevertheless, there is an unmistakable advance. I refer, e.g., to the Blue book published within the last few weeks: “Correspondence with Her Majesty’s Missions Abroad, regarding Industrial Questions and Trades’ Unions.” The representatives of the English Crown in foreign countries there declare in so many words that in Germany, in France, to be brief, in all the civilised states of the European Continent, radical change in the existing relations between capital and labour is as evident and inevitable as in England. At the same time, on the other side of the Atlantic Ocean, Mr. Wade, vice-president of the United States, declared in public meetings that, after the abolition of slavery, a radical change of the relations of capital and of property in land is next upon the order of the day. These are signs of the times, not to be hidden by purple mantles or black cassocks. They do not signify that tomorrow a miracle will happen. They show that, within the ruling classes themselves, a foreboding is dawning, that the present society is no solid crystal, but an organism capable of change, and is constantly changing.\r\n\r\nThe second volume of this book will treat of the process of the circulation of capital (Book II.), and of the varied forms assumed by capital in the course of its development (Book III.), the third and last volume (Book IV.), the history of the theory.\r\n\r\nEvery opinion based on scientific criticism I welcome. As to prejudices of so-called public opinion, to which I have never made concessions, now as aforetime the maxim of the great Florentine is mine:\r\n\r\n“Segui il tuo corso, e lascia dir le genti.”\r\n[Follow your own course, and let people talk – paraphrased from Dante]\r\n\r\nKarl Marx\r\nLondon\r\nJuly 25, 1867",
        "like_count": 0,
        "published_at": "2023-12-19T05:30:48Z",
        "is_reply": true
      },
      {
        "id": "Ugx1VM-LXim9RY_KmN94AaABAg.9yUh6XWDxA_9yUzGKbngnl",
        "author": "@itscolin81",
        "text": "From Marx's correspondence with Vera Zasulich:\n\n\"(1) In discussing the genesis of capitalist production, I said [that the secret is that there is at bottom ‘a complete separation of ... the producer from the means of production’ (p. 315, column l, French edition of Capital) and that ‘the expropriation of the agricultural producer is the basis of the whole process. Only in England has it been so far accomplished in a radical manner. ... But al/ the other countries of Western Europe are following the same course’ (loc. cit., column II).\r\n\r\nThus I expressly restricted the ‘historical inevitability’ of this process to the countries of Western Europe. Why did I do this? Please refer to the argument in Chapter XXXII;\"\n\nNot the whole world or India, etc.",
        "like_count": 0,
        "published_at": "2023-12-19T05:34:13Z",
        "is_reply": true
      },
      {
        "id": "Ugx1VM-LXim9RY_KmN94AaABAg.9yUh6XWDxA_9yV-MEs5wl1",
        "author": "@coopsnz1",
        "text": "france has less home ownership than  uk per capita",
        "like_count": 0,
        "published_at": "2023-12-19T05:43:45Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugwo9lecASgEEB2XKVJ4AaABAg",
    "author": "@imme6372",
    "author_channel_id": "UCK_JoRlXNlSQnAkMxXPkgRA",
    "text": "1. Marx: Developed the foundational theory, focusing on industrial capitalism and the working class in advanced economies.\n\n\n2. Lenin: Adapted Marxism to imperialism and underdeveloped capitalist conditions, emphasizing a vanguard party.\n\n\n3. Mao: Shifted the focus to agrarian societies, emphasizing the revolutionary role of peasants and the importance of cultural and ideological struggle.",
    "like_count": 0,
    "published_at": "2024-12-21T12:08:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxZvNPCFD4kQVullHh4AaABAg",
    "author": "@DeepTitanic",
    "author_channel_id": "UCKkENX0yL-TeYLxV1N49Uwg",
    "text": "Personal grooming and weight lifting",
    "like_count": 2,
    "published_at": "2023-12-19T02:06:13Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgxZvNPCFD4kQVullHh4AaABAg.9yUbT-UbIT_9yUk8JvO7Tz",
        "author": "@rando3939",
        "text": "The soy clean shaven fears the Chad unkempt rats nest beard",
        "like_count": 0,
        "published_at": "2023-12-19T03:22:03Z",
        "is_reply": true
      },
      {
        "id": "UgxZvNPCFD4kQVullHh4AaABAg.9yUbT-UbIT_9yUq4xA6YLL",
        "author": "@mrduckman225",
        "text": "Based",
        "like_count": 1,
        "published_at": "2023-12-19T04:14:01Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugy2UKdulnc1uxvXfsh4AaABAg",
    "author": "@jessewallace12able",
    "author_channel_id": "UCu_-nMKhY2G48NOCSWzW9KA",
    "text": "Yeah but you guys aren’t working class.",
    "like_count": 0,
    "published_at": "2025-02-22T07:45:59Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyncti-42xHrsyKWkh4AaABAg",
    "author": "@4sat564",
    "author_channel_id": "UCVjCDcAa15JUCKxYi8bTjqw",
    "text": "Ok, so Lenin was revisionist in his time",
    "like_count": 1,
    "published_at": "2023-12-19T13:53:33Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugyncti-42xHrsyKWkh4AaABAg.9yVsPc_tPXC9yaGj_YppRm",
        "author": "@futurehomestead1263",
        "text": "precisely",
        "like_count": 0,
        "published_at": "2023-12-21T16:11:04Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyHZEak0sTCGodhNoR4AaABAg",
    "author": "@JuanCarlosbarquero-f3e",
    "author_channel_id": "UCUbN2F_qPiwThTDVn14BN1A",
    "text": "What did Lenin write about \"state capitalism\" in his article \"Tax in Kind\"? Why did he later flip to what he called \"war communism\"? The latter, as i see it, was an open door for Stalinism",
    "like_count": 1,
    "published_at": "2023-12-19T11:12:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz1u6AxJxoSIBzKs3J4AaABAg",
    "author": "@matthewkopp2391",
    "author_channel_id": "UCavlTC4r6irTvZYGo2zlk6g",
    "text": "Although I can agree with  some Lenin observations, for example imperialism, I am not a Lenin fan for multiple reasons.\n\nThe first of which is his anti-idealist version of Marxism. I don’t think Marx himself was an anti-idealist. He saw certain contradictions and irrational ideas within idealist based politics and used a materialist analysis to expose this. But Marx’s alienation theory is completely Kantian at its foundation. It supposed an a priori human nature.\n\nLenin’s essay against Kant I find painfully ignorant. And the consequences of this is he believed that human nature was malleable.\n\nI disagree with Lenin’s Vanguardism, because it IMO shrunk what we call the Overton window to a dot. Some ML‘s contest this but I am not convinced based on the historical evidence. I think his NEP policy was important, it included small scale entrepreneurship of 9 persons or less, which is basically Adam Smith policy. But to control this is simply tax over a certain amount, encourage cooperate companies and guilds, but don’t crush completely like Stalin did. This small scale entrepreneurship should be the furthest „right“ a socialist country should entertain.\n\nI also consider a certain set of liberal ideas advancement of socialism and should not be disregarded, which include freedom of press, freedom of religion, due process etc. I realize Lenin said things like „religion was a personal affair“ and this freedom was in many east bloc constitutions. But due process was seriously lacking, freedom of press seriously lacking etc.",
    "like_count": 0,
    "published_at": "2023-12-19T12:53:43Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugz1u6AxJxoSIBzKs3J4AaABAg.9yVlZOcrWaxA1JDYE1_rMU",
        "author": "@Tehz1359",
        "text": "As someone who likes Lenin, I don't disagree necessarily. Marx's materialism is a very specific kind of materialism. He critiqued all other existing materialist philosophies of his time. Like mechanistic materialism/vulgar materialism. And yes, Marx's materialism isn't the polar opposite of idealism, but it still wasn't idealism. Material reality to Marx, was primary. He did believe that there was an underlying human nature that was based in material reality. Not immutable in form, but in content. Lenin did toe the line of vulgar materialism at times. But despite this, he had important insights that were necessary. We owe so much to Lenin. Without him, communism wouldn't have been as successful as it was. This doesn't mean he was right about everything of course. But he had important contributions. Like Stalin also did, and Mao also did.",
        "like_count": 0,
        "published_at": "2024-03-23T02:02:25Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyNtpdHQo2aXRP8UwR4AaABAg",
    "author": "@cosmodradek",
    "author_channel_id": "UCbGVwfNiy1VQwUdWqX_LzNQ",
    "text": "Marx stated that communism would only succed if revolutionary movements were victorious on the advanced capitalist countries. He was absolutely right. URSS is no counter-example, for the obvious reason that communism was defeated there: just look around you. Lenin himself reccognized in the early twenties that if revolutiion did not succceed in Europe, the russian revolution was also doomed to fail. He was also obviously right.",
    "like_count": 0,
    "published_at": "2023-12-19T16:51:33Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgyNtpdHQo2aXRP8UwR4AaABAg.9yWBmFupNUr9yWOT-R5gpD",
        "author": "@fate8007",
        "text": "He never said that at all.\n\n\"You say that civilization is necessary for the building of socialism. Very good. But why could we not first create such prerequisites of civilization in our country by the expulsion of the landowners and the Russian capitalists, and then start moving toward socialism? Where, in what books, have you read that such variations of the customary historical sequence of events are impermissible or impossible?\"\n\n Lenin, Our Revolution",
        "like_count": 5,
        "published_at": "2023-12-19T18:42:22Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyJoy4WMlzrsR04Zs14AaABAg",
    "author": "@RockerAntisystemAntiwoke54",
    "author_channel_id": "UCnfn3JH-yBU0vjgt0rBeTfA",
    "text": "I think the opposite, Lenin's \"democratic centralism\" is wrong (and almost always leads to partisan corruption) and Marx's theses about the spontaneous organization of the working class and moving forward until the State is no longer necessary with the arrival of A classless society it's right. i don't read answers.",
    "like_count": 0,
    "published_at": "2024-08-24T06:21:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  }
]