[
  {
    "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg",
    "author": "@thinkbeforeyoutype7106",
    "author_channel_id": "UC-OYdlMvgSQIzV9mhqVLnRg",
    "text": "\"The biggest insult to the memory of the holocaust is not denying it but using it as an excuse to justify the genocide of the Palestinian people.\"\n\n- Norman Finkelstein",
    "like_count": 545,
    "published_at": "2023-12-16T02:45:01Z",
    "is_reply": false,
    "reply_count": 23,
    "replies": [
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA1lA02EizAk",
        "author": "@shellyseymore6249",
        "text": "I really admire that man, he's spent years fighting for Palestinians and calling out the Israeli right wing political leaders.\n\nHe said that he had to step back for a while, because he was becoming so disillusioned and tired, because of the relentless lies and propaganda that Israel and their allies were spreading to the world, and how they successfully convinced people to actually either be too scared to appear to be antisemitic or in many cases, actually BELIEVE that they were. He genuinely feared that he was fighting an impossible battle.\n\nHowever, since last year\"s Oct 7th attacks (which I do not believe was completely unprovoked, although disavow the killing of ANY innocent, civilian citizens)  and the disproportionate, retaliation, that is now a blatant attempt to wipe out the Palestinian people, Finkelstein has renewed hope, and optimism, because now the world are seeing in real time exactly what's REALLY going on, less and less people are buying their dishonest, obvious propaganda, accusing everyone who disagrees with them, and wants freedom for Palestinians, of being \"antisemitic, haters of Jewish people, who doesn't think they have the right to exist\" ..\n\n🙄😒",
        "like_count": 0,
        "published_at": "2024-04-03T07:49:31Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA1zrlTM8u7a",
        "author": "@johnmajane3731",
        "text": "There is no genocide, there is however a war that Hamas started where they use people as human shields.",
        "like_count": 7,
        "published_at": "2024-04-09T00:49:58Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA284qxXFLqk",
        "author": "@dudua3755",
        "text": "@johnmajane3731 you don't even know what that means. You just use buzz words.",
        "like_count": 52,
        "published_at": "2024-04-12T14:46:13Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA28UkJQTO7f",
        "author": "@tysondennis1016",
        "text": "@johnmajane3731Shut up, colonist.",
        "like_count": 0,
        "published_at": "2024-04-12T18:32:30Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA2AAV5AFF25",
        "author": "@D4isTheBestARPG2025",
        "text": "@johnmajane3731 Why IDF tying up palestinians to their vehicles?\nHamas cant fire their rpgs.",
        "like_count": 11,
        "published_at": "2024-04-13T10:14:00Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA2G5lLcSM9Y",
        "author": "@johnmajane3731",
        "text": "@dudua3755 no it is clear you don't.",
        "like_count": 2,
        "published_at": "2024-04-15T17:28:07Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA2cYiWwpCGH",
        "author": "@Gay_Bradbury",
        "text": "​@johnmajane3731Jesus... get a life. Do you just go around looking for videos you know you'll disagree with and leave uninformed, sound bytes? Do you have even a shred of knowledge about the history of Palestine? I feel like I should pity you. But I really do not. There is no excuse.",
        "like_count": 0,
        "published_at": "2024-04-24T20:03:40Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA2hbHxvlgbk",
        "author": "@vipermad358",
        "text": "@johnmajane3731Thanks for repeating Israeli propaganda.  Pathetic.",
        "like_count": 22,
        "published_at": "2024-04-26T19:11:03Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA2hbNSSUaUz",
        "author": "@vipermad358",
        "text": "@johnmajane3731How does it feel to be a complete tool for The Man?",
        "like_count": 0,
        "published_at": "2024-04-26T19:11:48Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA2hfgZnM7G0",
        "author": "@johnmajane3731",
        "text": "@vipermad358 facts viper, Hamas started this Hamas can stop it but won't. They use \"innocents\" as human shields hoping as many as possible will be killed in order to get even more aid money to steal.",
        "like_count": 0,
        "published_at": "2024-04-26T19:49:30Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA2hgAWir0G8",
        "author": "@johnmajane3731",
        "text": "@D4isTheBestARPG2025 they are securing them so they cannot kill more Israelis and Gazans.",
        "like_count": 0,
        "published_at": "2024-04-26T19:53:44Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA2rmTlKOqym",
        "author": "@johnmajane3731",
        "text": "@teresaamanfu7408 no fairy tale, Hamas started this war. The openly stated they don’t care how many Gazans die in their holy war. They can stop it anytime but won’t. They use women and children as shields. Yet you support this.",
        "like_count": 0,
        "published_at": "2024-04-30T18:01:12Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA2rmWXyKUK6",
        "author": "@johnmajane3731",
        "text": "@vipermad358facts not Propoganda.",
        "like_count": 1,
        "published_at": "2024-04-30T18:01:34Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA37ku9MToMZ",
        "author": "@MellissaSTJuste-dr5cv",
        "text": "No your the one who don't know that the war did knot start on October 7/ We saw a documentary of the Jews who took part in the Nakba and they said they kilk, raped, and Stole Palestinians land. They said it. The Jews paid and knew that the Palestinians was living in that land. Theodore begged and ask the Muslim king to buy Palestine for 2_billlion.",
        "like_count": 0,
        "published_at": "2024-05-07T08:14:33Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA3A2IcuwVsZ",
        "author": "@k2a2l2",
        "text": "⁠​⁠​⁠@johnmajane3731yes just keep on repeating the same BS talking points over and over, im sure it’ll win people over eventually",
        "like_count": 8,
        "published_at": "2024-05-08T05:33:47Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA3Amr5n1aB9",
        "author": "@johnmajane3731",
        "text": "@k2a2l2 repeating the truth will overcome your lies. The truth is the IDF has done all it can to reduce casualties while Hamas has done all it can to increase them. The truth is that this war as with the rest were started by the Arabs, this has been going on for 75 years. Even a child figures out after sticking their hand in a flame once to not do it again. But the Arabs are driven by hate for the Jewish people and they never learn the lesson.",
        "like_count": 0,
        "published_at": "2024-05-08T12:29:20Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA3CJCmXxJXI",
        "author": "@SagesseNoir",
        "text": "@johnmajane3731 There is a genocide  in Palestine happening in real time before our eyes. And those who  deny it are complicit with it",
        "like_count": 0,
        "published_at": "2024-05-09T02:40:01Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA3CwG8udlKt",
        "author": "@keithwilson9378",
        "text": "@johnmajane3731 why when they have a tunnel system that idf cant bomb second you stand in front of a bunch of people see if the people shield you third if idf still bombing innocent people because Hamas using them as shields ok we know they still bomb many innocent even if its one Hamas ok so why Hamas dont go down there tunnel if idf will bomb innocent please explain that and news flash it was the Zionist that invaded Palestine in 1918 research this so who started this first then Zionist from were from dam Poland with non Hebrew last names they not even Semitic a Semitic one born in Africa and or middle east so if you anti Palestinian you are a anti Semitic",
        "like_count": 0,
        "published_at": "2024-05-09T08:30:00Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA3CwxLdYV_2",
        "author": "@keithwilson9378",
        "text": "@johnmajane3731 shut your pie hole funny man before i put something in it",
        "like_count": 0,
        "published_at": "2024-05-09T08:36:02Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA3OV5UaJLNJ",
        "author": "@KingZNIN",
        "text": "@johnmajane3731 do you remember the March of return?",
        "like_count": 1,
        "published_at": "2024-05-13T20:14:46Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA3OWtg4Qpvt",
        "author": "@johnmajane3731",
        "text": "@KingZNIN yes where the Arabs were protesting for the right to invade Israel which Israel successfully and rightfully blocked.",
        "like_count": 0,
        "published_at": "2024-05-13T20:30:30Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA3Y5B_0yoSW",
        "author": "@Trekyhunter",
        "text": "All the holocaust memorial stuff was basically a round of everyone saying \"never again\" while it's taking place. The whole situation has really heightened my disdain for all the politicians and other talking heads involved.",
        "like_count": 4,
        "published_at": "2024-05-17T13:40:49Z",
        "is_reply": true
      },
      {
        "id": "Ugy5lInqYWiYDLi_6lJ4AaABAg.9yMxWTcP6NnA5d_fxlqeP3",
        "author": "@Aldilack",
        "text": "If Israel is a genocide of Palestinians, why is 20% of its population Palestinian Arabs?",
        "like_count": 0,
        "published_at": "2024-07-08T19:14:13Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzGbsKvC-ZMTbj6QIF4AaABAg",
    "author": "@Icytax",
    "author_channel_id": "UC5EYX7QS6i53sE-fQfFQlGw",
    "text": "Sending this video to anyone who keeps the conversation at “it’s complicated”",
    "like_count": 212,
    "published_at": "2023-11-27T23:26:43Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgzGbsKvC-ZMTbj6QIF4AaABAg.9xdFWQOtoG79xn7h9v6moL",
        "author": "@das_it_mane",
        "text": "Send the Michael Brooks soundclip as well.",
        "like_count": 2,
        "published_at": "2023-12-01T19:30:50Z",
        "is_reply": true
      },
      {
        "id": "UgzGbsKvC-ZMTbj6QIF4AaABAg.9xdFWQOtoG7A3LIZVvnzDY",
        "author": "@Rastaferrari829",
        "text": "I’ve learned it’s only “complicated” to those who started paying attention on Oct 7th, or just straight up never cared prior.",
        "like_count": 4,
        "published_at": "2024-05-12T14:27:33Z",
        "is_reply": true
      },
      {
        "id": "UgzGbsKvC-ZMTbj6QIF4AaABAg.9xdFWQOtoG7A3imtpQBKLL",
        "author": "@iammar1159",
        "text": "@Rastaferrari829   Also known as hypocrites.",
        "like_count": 0,
        "published_at": "2024-05-22T02:43:07Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugy_rguBofkmd3ObjQR4AaABAg",
    "author": "@xx2262",
    "author_channel_id": "UCQXa1lGX-ZSxSrv9pRmfLoA",
    "text": "It’s a relief to hear such moral clarity on this issue. I’ve been an anti-Zionist Jew since learning about Israel in my early teens (I am over 50). I learned to never raise the subject at any family gathering soon after. I stopped being invited to those gatherings when I realised what you so clearly argued, silence is complicity. Thank you for giving your voice to this horror 🙏🏼🌻🖤🇵🇸",
    "like_count": 1154,
    "published_at": "2023-11-29T13:54:23Z",
    "is_reply": false,
    "reply_count": 28,
    "replies": [
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9xlPf3OsIKc",
        "author": "@ellerose5997",
        "text": "you are brave and you are a blessing and your presence is so vital",
        "like_count": 33,
        "published_at": "2023-12-01T03:29:21Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9xlXiCaAt1o",
        "author": "@arturohull14161",
        "text": "Are you actually anti Zionist? Do you support extraditing Zionist squatters to their countries of origin.",
        "like_count": 0,
        "published_at": "2023-12-01T04:39:41Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9xstuGT23y3",
        "author": "@pikapi6993",
        "text": "very sad. The fact that you are over 50 makes it even worse. How can someone have spent so much time on Earth and never heard about the Bedouin Arab Muslims who made pecace with Jews immediately 75 years ago and arehappy Israeli citizens today?\nThe Palestinians chose their fate. The Bedouins chose their fate. Bedouin Israelis are living better lives than all other Arabs in the entire Middle East. They have rights, democracy, Job security, education, etc. \nPalestinians are living like Afghans because they think the same way. PEW research has revealed that Palestinians and Afghans think the same way about sharia law and terrorism. It's their choice to live miserable lives. It's not Israel's fault. Bedouins, Druze and many other minorities have great lives in Israel. There are people who left and believe it was their biggest mistake to leave Israel knowing what it has become today.\nMeanwhile Palestinians are living off the victim industiral complex. They are making their leaders filthy rich. Because their leaders became multi billionaires stealing the donation money. The ordinary people are happy being terrorists and their dream is to get martyred one day.",
        "like_count": 11,
        "published_at": "2023-12-04T01:16:59Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9xswgDwdHm0",
        "author": "@RandomPerson-b1s",
        "text": "@pikapi6993 Bedouins live happily... when their villages are not demolished. Like it happens in Naqab.\n\nWhile on paper Arab citizens have full rights, according to reports from Israel itself they have much less resources pro capite allocated to them in terms of education and health, and they have much more difficulty obtaining building permits. So there can still be some form of discrimination even if in principle citizens are supposed to be equal.\n\nI won't even touch the rest you said because it's frankly disturbing.",
        "like_count": 47,
        "published_at": "2023-12-04T01:41:17Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y6DCZYMnuT",
        "author": "@treadstoned9915",
        "text": "​@RandomPerson-b1scool story what rights would J3ws and Christians have under Sharia Law?",
        "like_count": 2,
        "published_at": "2023-12-09T14:43:45Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y6Gzgg8CSm",
        "author": "@RandomPerson-b1s",
        "text": "@treadstoned9915 I was just offering a counterpoint to the assumption Bedouins are de facto treated as equals in Israel.\n\nSo what you are doing right now is straight up whatabaoutism. With a bit of moving the goalpost.",
        "like_count": 19,
        "published_at": "2023-12-09T15:16:49Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y6I0EjRytW",
        "author": "@treadstoned9915",
        "text": "@RandomPerson-b1s no bc you guys always wanna go to these points in time that suit your narrative and leave out all the bad stuff. I do condemn what Israel is doing but just leaving out all the terrible stuff Hamas did (like this video did) and how they want to eliminate all J3ws (like this video did)is very relevant and to act like a bunch of this isn't bc of the Quran (like this video did) and how extremist groups use it is so misleading...",
        "like_count": 3,
        "published_at": "2023-12-09T15:25:46Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y6Ku59TzYZ",
        "author": "@RandomPerson-b1s",
        "text": "@treadstoned9915 You are making a lot of assumption about my intentions. I only cared about correcting a specific point made by another commenter. I left out Hamas because I was talking about the Bedouins in Israel, which have nothing to do with extremism or Hamas.\n\nIf you want to know, yes, I think the October 7 attacks were depraved and I do not like persecutions in any country, including Iran. Ironically, we know about at least some of them thanks to organizations like Human Rights Watch, which the Israeli Government labeled \"antisemitic\" on multiple occasions, but that is going off track.\n\nBut again, that had nothing to do with my comment. I also did not feel the need to repeat them because a lot of media has already spoken about the fact you are talking about, especially mainstream media, so it's not like efforts are being made to hide those facts.",
        "like_count": 15,
        "published_at": "2023-12-09T15:51:00Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y6NwpzdccG",
        "author": "@treadstoned9915",
        "text": "@RandomPerson-b1s perhaps but it seems you didn't want to address the other half of that guys comment and while it was a bit obtuse it wasn't all nonsense.",
        "like_count": 2,
        "published_at": "2023-12-09T16:17:36Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y6RI6dXR_1",
        "author": "@RandomPerson-b1s",
        "text": "@treadstoned9915 I just believed I had better things to do than argue about that, and there are many more people willing to refute those parts. On the other hand, I have found very few people that actually tried and add specifics to the \"everyone in Israel is treated equally\" point, so I decided it was worth to point that out.",
        "like_count": 16,
        "published_at": "2023-12-09T16:46:51Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y6v8A3eE_0",
        "author": "@ousaxx",
        "text": "Huge respect to Jewish people like you",
        "like_count": 6,
        "published_at": "2023-12-09T21:16:22Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y73NdQ_zVW",
        "author": "@hamzajaleel7082",
        "text": "@treadstoned9915under sharia law Jews and Christians are permitted to live alongside Muslims",
        "like_count": 13,
        "published_at": "2023-12-09T22:37:08Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y75As6G7cU",
        "author": "@treadstoned9915",
        "text": "@hamzajaleel7082 equally?! What about apostasy!?",
        "like_count": 3,
        "published_at": "2023-12-09T22:52:52Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y7FrBwxkGq",
        "author": "@idkgirl00",
        "text": "Thank you for using your voice in this conversation. ❤️ Blessings to you",
        "like_count": 5,
        "published_at": "2023-12-10T00:26:09Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y7FwGCUZzl",
        "author": "@idkgirl00",
        "text": "​@treadstoned9915maybe learn about how they lived under Shira law for hundreds of years before you make ridiculous arguments.",
        "like_count": 10,
        "published_at": "2023-12-10T00:26:51Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y7G0XDgqI5",
        "author": "@idkgirl00",
        "text": "​@hamzajaleel7082exactly! They lived peacefully together. I'm sick of Islamaphobia in this country.",
        "like_count": 11,
        "published_at": "2023-12-10T00:27:34Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y7L_0Y0_dq",
        "author": "@treadstoned9915",
        "text": "@idkgirl00 things that never happened for 200. If you are referring to the Ottomans they were 100% after world domination 🤡",
        "like_count": 0,
        "published_at": "2023-12-10T01:16:06Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y7M2mUMKHQ",
        "author": "@treadstoned9915",
        "text": "@idkgirl00 let me guess women and gays have equal rights too 😂",
        "like_count": 2,
        "published_at": "2023-12-10T01:20:18Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y7QVWsqfN9",
        "author": "@idkgirl00",
        "text": "@treadstoned9915 buddy, Christian Nationalists don't want women and gay people to have rights either. There are gay Palestinians. Your MSM brainwashing has told you it's better to kill the women and LGBTQ people of Palestine than help them. Flawed AF.",
        "like_count": 0,
        "published_at": "2023-12-10T01:59:11Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y9Wv3-HNFq",
        "author": "@KaylaJones2000",
        "text": "We supported your liberation to gain your gratitude and friendship, but you have betrayed us. Being pro Israel to us is like being pro blk to you. It's in our blood.",
        "like_count": 0,
        "published_at": "2023-12-10T21:33:43Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y9Zx8L-m0M",
        "author": "@idkgirl00",
        "text": "@KaylaJones2000 That's because you've been raised into thinking that your identity is tied to Nationalism. If you're going to remove your support of black people and call it betrayal then you were never an advocate, but someone looking to trade. \n\nPeople who are oppressed usually side with the oppressed. If you don't see that the oppressed communities you've advocated for supporting your cause, it's important to ask yourself if perhaps your view is wrong and open your mind to other varying opinions and study the history beyond what your side is saying.",
        "like_count": 16,
        "published_at": "2023-12-10T22:00:13Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y9ndpCdI5P",
        "author": "@everythingsfine1395",
        "text": "@pikapi6993\nIsraelis are the terro-rists , you may not hear this now a lot , but in the near future it’ll be repetitive , israel is doing the job , and actually teaching the world young generation how cruel wars were , how nazis used to treat jews and other weak minorities . And israel have became what exactly? Unsafe country ? Living off world donations? An apartheid living example? And occupying power that was built by wars and blood and oppression? Nobody can think about  israel and sees anything but fascists",
        "like_count": 1,
        "published_at": "2023-12-11T00:08:39Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9y9nxWLKuIO",
        "author": "@everythingsfine1395",
        "text": "@hamzajaleel7082\nFk sharia laws , yet israel is too much worse",
        "like_count": 0,
        "published_at": "2023-12-11T00:11:20Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9yCdtHrSu3Q",
        "author": "@cyaneye5098",
        "text": "Wow 😮 ❤that was an incredible comment ❤ thank you for telling your story and for speaking out, can I ask more details about how ur family reacted? were you scared?",
        "like_count": 5,
        "published_at": "2023-12-12T02:41:06Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgY9yHXQm9Tht6",
        "author": "@Simon.the.Likeable",
        "text": "​@pikapi6993The Palestinians may be \"living off the victimization industrial complex\" but they are close to the bottom tier of that complex. No matter how bad their victimization gets, they are unable to change their situation. This puts them nowhere near the world champions of the victimization industrial complex. We all know who are the greatest victims because it never slips from the center of view. As soon as the current situation fades from the headlines, the Palestinian victimhood will be subsumed by another victim group. They don't have museums or holidays about their victimhood.",
        "like_count": 0,
        "published_at": "2023-12-14T00:12:06Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgYA31-cTvT1gU",
        "author": "@allthingsmarva",
        "text": "Americans support a peacful solution.  We always have. But, Hamas is a terririst organization.  That is a fact.",
        "like_count": 0,
        "published_at": "2024-05-04T17:17:16Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgYA9C6P_3Q8S3",
        "author": "@ssaberwolf",
        "text": "@xx2262  Me too -- well, I'm 40, but I'm also a non-Zionist Jew and have been for more than 20 years.  It's slow going, but we've been growing steadily in number.  Hang in there",
        "like_count": 1,
        "published_at": "2024-10-05T03:56:33Z",
        "is_reply": true
      },
      {
        "id": "Ugy_rguBofkmd3ObjQR4AaABAg.9xhNb9JzDgYA9FK-025LSi",
        "author": "@asm-f9u",
        "text": "thank you.",
        "like_count": 0,
        "published_at": "2024-10-06T09:52:58Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg",
    "author": "@ByrdieFae",
    "author_channel_id": "UCl3LSkE0uaJmxMBGK5foxww",
    "text": "The thought of \"You don't cry for me so I won't cry for you\" as a thought process infuriates me. This isn't some contest. They're fellow humans.\n\nAnd Jewish people that feel betrayed by black people advocating for Palestine either supported black liberation for the wrong reason or just aren't paying attention.",
    "like_count": 1750,
    "published_at": "2023-11-28T07:40:46Z",
    "is_reply": false,
    "reply_count": 68,
    "replies": [
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xfPbHYvEbT",
        "author": "@4thoseabout2r0ck4",
        "text": "Beautifully put",
        "like_count": 60,
        "published_at": "2023-11-28T19:33:24Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xfV1BUFCTS",
        "author": "@4thoseabout2r0ck4",
        "text": "Also, nobody should be equating Jews to Israelis because American Jews supported Black liberation but Israel was among the top supporters of apartheid South Africa.",
        "like_count": 236,
        "published_at": "2023-11-28T20:20:45Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xk4Kg-h09R",
        "author": "@Pensnmusic",
        "text": "​@4thoseabout2r0ck4No one should be reinforcing the premise that an ethnostate is valid in any way, especially not by passively accepting the assertion that Israel somehow represents all Jewish people",
        "like_count": 86,
        "published_at": "2023-11-30T15:03:41Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xmZUstqQ1m",
        "author": "@Mars13W",
        "text": "Fr Dr Umar has always been garbage",
        "like_count": 0,
        "published_at": "2023-12-01T14:14:27Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xpjDKSbxYR",
        "author": "@birdmanpdx6716",
        "text": "I would say that a lot of those Jewish people think that other people aren't paying attention... from when they stood arm in arm in the 50s and 60s (the three teens killed in Mississippi burning were one black and two jews, to cite just one popular example), to the modern era of supporting (and being!) progressive prosecutors who are trying to fix the broken justice system that Ms Olurin has so eloquently spoke up for, to marching in BLM, etc etc.    When they hear things like \"the palestinians have stood by us\" (implied: the jews haven't), yes, it is very hard to hear.  Especially when those Jews are also critical of Israel's actions and have been for years.",
        "like_count": 12,
        "published_at": "2023-12-02T19:45:53Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xpqcbcH_RX",
        "author": "@ByrdieFae",
        "text": "@birdmanpdx6716 The part when I said that \"they weren't paying attention\" meant that it's about supporting ALL oppressed peoples and not just certain ones and they must have missed that certain memo. I wasn't saying they did nothing or were all bad.",
        "like_count": 41,
        "published_at": "2023-12-02T20:50:39Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xsGez8yI0U",
        "author": "@jonlenihan4798",
        "text": "Blacks think that Arabs are black and that Jews are white. \nAlso, everyone on both sides of the tracks in Hog Anus, Mississippi is a Baptist. They hate each other but come together to hate Jews, gays, immigrants, Asians, atheists, Catholics, and on and on.",
        "like_count": 0,
        "published_at": "2023-12-03T19:25:23Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xsZOMz9N_x",
        "author": "@birdmanpdx6716",
        "text": "​@Pensnmusic I personally would prefer zero ethno-states and don't care for religious organization at all, but there are dozens of Christian and Muslim ethno-states and only one small Jewish one, and Jews for a long time have been painfully reminded what happens, eventually, when they don't have state power.  Plenty of Jews don't feel it's necessary, but plenty do.",
        "like_count": 3,
        "published_at": "2023-12-03T22:09:00Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xtGtZ9Mteq",
        "author": "@eddie142",
        "text": "@birdmanpdx6716 There are no Christian ethnostates. The concept of a Muslim ethnostate is a little controversial. \nIsrael is one of the only true ethnostates in the entire world in the traditional sense.",
        "like_count": 25,
        "published_at": "2023-12-04T04:46:37Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xuv7R30jxa",
        "author": "@birdmanpdx6716",
        "text": "​@eddie142 25% of Israeli citizens are non-Jewish, non-Jews are not restricted from government service or the private sector.  There are many non-jews who were elected to and serve in the legislature.  Which Muslim-dominant country in the Middle East could say that about their government vis a vis non-Muslims?  What other definitions of \"ethno state\" matter?",
        "like_count": 8,
        "published_at": "2023-12-04T20:06:09Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xvrXMbffai",
        "author": "@tobeme1987",
        "text": "I really doubt most people would care that Israel is an ethnostate if they weren't also an apartheid nation who has problems with Jews who aren't white Jews, the Ethiopian Jews still face troubles there.Also they aren't the native people of Palestine, an while oppressing Palestinians and behaving EXACTLY like the US behaved towards Native Americans the problem would be focused on their behavior...Why didn't Jewish people just migrate to Palestine instead of committing the Nakba?  An ethnostate...any ethnostate will be rife with problems, just like Israel is.",
        "like_count": 22,
        "published_at": "2023-12-05T04:53:58Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xvsSCsThDs",
        "author": "@eddie142",
        "text": "@birdmanpdx6716  \"25% of citizens are non Jewish\"\n\nSolely because Israel has a law about a 70+ Jewish majority, which leads them to do what they do. That's just them working within their quota.\nIf the US still instated racial quotas like it was the 1920s, people would see that racist nonsense for what it is. But we are conditioned to believe that Israel's crimes are somehow exempt from our modern standards.\n\nYou also haven't given any example of a Christian ethnostate.\nAlso, worth noting that non jews in governance are effectively powerless tokens that have to work within a rigged system.\n\nRegardless of your feelings on a definition that \"matters\", Israel fits THE definition and adds onto it being Apartheid that operates open air prisons.\n\nMuslim countries are often quite rigged against non Muslims, although usually not to the legal extent that Israel is.\nYou CAN make a sort of argument about Muslim countries but I would LOOOOVE to know what these Christian ethnostates supposedly are.",
        "like_count": 1,
        "published_at": "2023-12-05T05:02:01Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xxweWJSvpW",
        "author": "@birdmanpdx6716",
        "text": "@eddie142 It's obvious by moving the goal posts that at this point that you wanted to make a claim that you don't understand and you can't support.  If you want to stick the dictionary definition of ethno-state, as you claimed you did, then that is \"a sovereign state of which citizenship is restricted to members of a particular racial or ethnic group.\" If you think Israel does this, you are either misquoting or misunderstanding Israel's laws.   Don't really care which. There are jewish citizens and non-jewish citizens. There are no laws or restrictions about what or how Israeli citizens practice religion, no loss of rights based on whatever choice they make. At several times over the last 70+ years, non-jews have been allowed to become citizens.  Yes, they control the balance of who they let immigrate in. Yes, they use that to ensure a jewish majority.  That does not make them an \"ethnostate\".  Every developed country in the world  uses quotas to manage immigration, and they are not applied evenly. Whether Israel has immigration policy x or y doesn't make it an ethnostate.  America for one, a christian nation according to many of its leaders (all of its republicans), has different limits for different countries.  It can, and does, control at its whim the racial, religious, income level balance of those it lets in. And America is on the liberal side of the immigration spectrum.  If you are complaining that the Arabs in Israel's Knesset are \"powerless\" bc there are less Arabs than Jews in the Knesset, and the country as a whole,  well ... kinda how democracy works.  In South Africa, a true apartheid regime, the smaller minority was controlling, by law and force, a larger majority.  That isn't happening in Israel.   And that brings back my point about de-facto ethnostates, which I agreed that Israel is.  And America, Canada, Australia, all of Europe, all of South America are all de-facto christian states. Putin talks about their Russian Orthodox system all the time.  The Church of England is a thing. There is no mosque of England, or temple of England. Laws, customs, culture in those places are dictated by christianity. If you don't think so, not going to list every example on here.  Every republican in Washington tells us every day that America is a christian nation. Europe is in a crisis because people are getting upset the incoming Muslims are affecting the balance. That is the way of the world.  You want to believe this is an Israel problem, and you can't see any other perspective.",
        "like_count": 4,
        "published_at": "2023-12-06T00:17:16Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xxyq2i-Qzt",
        "author": "@eddie142",
        "text": "@birdmanpdx6716  \"America is a Christian nation according to...\"\n\nLmao. You believe evangelical Republicans. America is a secular republic. Christian Nationalism exists amongst groups but does NOOOOOOT exist within the state. Your example here is so terrible. The USA is 100% not a Christian ethnostate. \nAs a history lesson, the US has an entire constitution founded on concepts of secularism and was written by a bunch of secular deists.\nThe first amendment of the United States(which Israel has expressed some contempt for of the \"Prime Minister of Israel\" Twitter account) dictates that there may be no law respecting a religion.\nThe nonsense of the concept of a \"Christian state\" comes from the rise of the grass roots evangelical movement that wants to uproot and redefine the USA's purpose. This began after the founding during the great Awakening movements as Christian groups were disenfranchised with the country's secular roots. \n\n\"Europeans complain about muslims\"\n\nOk????? You realize those people WANT an ethnostate but don't live in one, right?\nThis isn't an example of ANYTHING but xenophobia on a civilian level lmao.\n\n\"Every country uses quotas\"\n\nThe denialism here is INSANE. Do you know how other countries' quotas work? Because they don't work to maintain an ethnic majority because they are not ethnostates.\n\nDefinition:\n\"Ethnic nationalism, also known as ethnonationalism, is a form of nationalism wherein the nation and nationality are defined in terms of ethnicity.\"\n\nIn this case, it is defined by its Jewish identity and mandated majority.\n\n\"with emphasis on an ethnocentric (and in some cases an ethnocratic) approach to various political issues related to national affirmation of a ethnicity\"\n\nEvery facility of this is relevant to Israel. YOU are the one who doesn't understand Israeli laws due to denialism.\n\nYou are so in denial, the best comparison you could come up with is \"durrrr, Fox News told me that America is founded on Christianity.. DURRRR\".\n\n\"Defacto ethnostates\" as you call them are largely misrepresented here. \"Putin talks about his Orthadox church system all the time\"\n\nPutin is trying to consolidate power in a highly irreligious society. Orthodox Christians make up around 40% of the population and no effort by the Russian state really exists to maintain such a thing.\n\nNo matter how ridiculous your counter example, nothing distracts from the fact that Israel's laws DO constitute an ethnostate. One that engages in settler colonialism, expansionism and ethnic cleansing btw.\n\n\"Yes, they use that to ensure a Jewish majority\"\n\nMhm.\n\n\"That does not make them an ethnostate\"\n\nIn regards to Apartheid being run by the minority: \n\n\"That isn't happening here.\"\n\nYou're technically right. It's worse here, because the displacement of Palestinians and their atomization were so successful compared to South Africa's constant stagnate version of oppression. South Africa was always majority black. Israel was minority Jewish not long ago. There's nothing INHERENTLY wrong with it becoming majority Jewish aside from HOW it happened. And how, despite Palestinians losing the majority in the blink of an eye, Israel kicks the ladder out from under them and insists that since Israel is the \"Jewish state\", it must be legally mandated that they hold their ethnic majority. Hrmmmmmmm\n\nYes, it does. Lol. It's purpose is to ensure the state is defined by its body national. And it is not the only law that makes Israel an ethnostate either.\n\nIt is possible you MIGHT have something with Britain. But I can't comment on it because I lack familiarity with Britian and law vs religion.\nBut considering your other examples were so bad, I'm going to have to assume Bradonolini's Law until I can get to the bottom of it.\n\nBtw use paragraphs, holy shit.",
        "like_count": 0,
        "published_at": "2023-12-06T00:36:19Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xy0i9efMqN",
        "author": "@birdmanpdx6716",
        "text": "​@tobeme1987 I don't think Israeli society is any better or any worse than the average nation. They should be criticized for what they are, but also not for what they aren't.  Their system does not meet any definition of apartheid. All citizens get the same votes and the same basic rules.  I do think the stance on the Ethiopian immigration was questionable, but even if that was totally wrong, that's not what apartheid is.  And to say that they aren't native people of that region is historically wrong. You might feel like their historical claim wasn't strong enough to support early 1900's mass-migration.  But  to deny a historical claim, and an uninterrupted one at that, is just false. An no, they didn't behave EXACTLY like the (early) white immigrants to North America, who came primarily for economic gain.  The Jews who migrated to the Ottoman Empire and later British Palestine did so because they were in many cases literally running for their lives.  And the ones that didn't make a move, didn't make it.  To whatever extent they took property or land from anyone in that process, that property should have been returned.  To imply that's how the *majority* of land was transferred - by theft / force /etc, is also historically inaccurate.",
        "like_count": 1,
        "published_at": "2023-12-06T01:01:27Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xy4s4OU83O",
        "author": "@tobeme1987",
        "text": "@birdmanpdx6716 People who moved to Europe for 2k years and comes back and says hey this is my land are just colonizers. They didn't mass migrate they committed the Nakba. They killed thousands and displaced by force hundreds of thousands of people, to say they didn't is historically inaccurate and disingenuous. British Palestine didn't belong to the colonizer British for them to give it to Israel. What's shocking to me is you can't seem to grant Palestinian people enough humanity to validate what happened to them.",
        "like_count": 24,
        "published_at": "2023-12-06T01:37:45Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9xzU_DThh_f",
        "author": "@tobeme1987",
        "text": "@birdmanpdx6716 No, the Nakba happened denying the Nakba is like denying the holocaust, it points to a questionable character and moral stand points. The land was taken through murder, theft and mass displacement of native people. Also Israel is an apartheid state, if these things can't be acknowledged then it kills your legitimacy in this comment section and paints your morally speaking as just another monster being an apologist for evil happenings.",
        "like_count": 0,
        "published_at": "2023-12-06T14:41:37Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9y-JpJ0YfHk",
        "author": "@birdmanpdx6716",
        "text": "@tobeme1987 You haven't given me a chance to speak to their humanity, which I value as any other human. I absolutely see the pre-migration resident non-Jews claims to their homes, and how the jewish migration affected that and in some cases destroyed it.  I'm not sure that you value humans equally though.  Just because I think Israel acts wrongly at times, or even often, doesn't mean that every lazy counter point of view is justified.  Do some homework. The jews \"moved to Europe\" ? Check your facts - why did they do that?  They left the area entirely? check your facts.  It can be both a mass migration of refugees (look it up) and also be handled immorally and without regard to who else it affected - which again I agree that was, at times. Doesn't mean the people who did that weren't also running for their lives, and not just from \"Europe\" but from all over the Middle East too (most of the Middle East nations aligned with Hitler, so yeah, that   Plenty of non-jews stayed put and became Israeli citizens btw - how and why did that work? How many people were forced to move vs chose to move because they didn't want to be included in Jewish territory? The jews pushed and expanded into a territory.  It wasn't welcomed or appreciated by the people who were there. Neither side handled it very well. The Israelis won, and the non-Israelis lost.  I wonder if that has happened in other places? It wasn't the Brits, or the UN's, authority to hand the administration to the jews? Well whose was it? Before the Brits, the Ottomans had it for several hundred years after they took it from someone, who took it from someone, who took it from someone.  Several times that someone was Jews.  It was also often not.",
        "like_count": 0,
        "published_at": "2023-12-06T22:26:56Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9y-Q0jKU7A_",
        "author": "@ariananegron4679",
        "text": "I agree. There is genocides going on all around the world. The people that are against the one genocide are (usually) against all of them. The argument is flawed",
        "like_count": 0,
        "published_at": "2023-12-06T23:21:03Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9y3dB3FkE5-",
        "author": "@tobeme1987",
        "text": "CooP-dg7ky What a dumb azz comment. I support the humanity of all people, the more i speak to Christians the more i understand they aren't Christ like, and are for the most part, moral monsters.",
        "like_count": 0,
        "published_at": "2023-12-08T14:41:45Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9y6D1LqPZ1w",
        "author": "@treadstoned9915",
        "text": "​@tobeme1987you guys always wanna conveniently go back to one point in history (1948) but what about Hitlers deal with the Sha of Iran? What about the fact that the Quran supports the persecution of Christians and J3ws, especially under Sharia Law?",
        "like_count": 0,
        "published_at": "2023-12-09T14:42:13Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9y6sGYyym6x",
        "author": "@HierophanticRose",
        "text": "Fanon has a great answer for that line of thought actually.",
        "like_count": 2,
        "published_at": "2023-12-09T20:51:18Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9y9WXLt3x6V",
        "author": "@KaylaJones2000",
        "text": "@Pensnmusic We supported your liberation to gain your gratitude and friendship, but you have betrayed us. Being pro Israel to us is like being pro blk to you. It's in our blood.",
        "like_count": 0,
        "published_at": "2023-12-10T21:30:20Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9y9WdSOoEHP",
        "author": "@KaylaJones2000",
        "text": "@ByrdieFae We supported your liberation to gain your gratitude and friendship, but you have betrayed us. Being pro Israel to us is like being pro blk to you. It's in our blood.",
        "like_count": 1,
        "published_at": "2023-12-10T21:31:19Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9y9WfLMKGxc",
        "author": "@KaylaJones2000",
        "text": "@eddie142 We supported your liberation to gain your gratitude and friendship, but you have betrayed us. Being pro Israel to us is like being pro blk to you. It's in our blood.",
        "like_count": 0,
        "published_at": "2023-12-10T21:31:34Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9y9Wg6POzCB",
        "author": "@KaylaJones2000",
        "text": "@4thoseabout2r0ck4 We supported your liberation to gain your gratitude and friendship, but you have betrayed us. Being pro Israel to us is like being pro blk to you. It's in our blood.",
        "like_count": 0,
        "published_at": "2023-12-10T21:31:40Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9y9WhhMG5ik",
        "author": "@KaylaJones2000",
        "text": "@4thoseabout2r0ck4 We supported your liberation to gain your gratitude and friendship, but you have betrayed us. Being pro Israel to us is like being pro blk to you. It's in our blood.",
        "like_count": 0,
        "published_at": "2023-12-10T21:31:53Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9y9cz3WN--U",
        "author": "@eddie142",
        "text": "@KaylaJones2000  I have no idea what you're talking about nor any idea who you are.",
        "like_count": 7,
        "published_at": "2023-12-10T22:35:26Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yA9nl6nsbc",
        "author": "@tobeme1987",
        "text": "@KaylaJones2000 I will never support a nation committing genocide no matter their ethnicity, even if they are black... So why would i support Israel committing genocide against the Palestinians? how hard is it to understand genocide is a no?",
        "like_count": 26,
        "published_at": "2023-12-11T03:30:59Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yBlReZNPrb",
        "author": "@ofCourseI",
        "text": "Say what you want, and justify yourself in whatever way. Arabs muslims and  especially palestinians, have fought for the rights of black people WHO ARENT EVEN IN THEIR COUNTRY. The story of Bilal is one of our biggest representations of that fight. We are just as scared and more, and we see the hypocrisy in your fight for equal rights",
        "like_count": 4,
        "published_at": "2023-12-11T18:27:51Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yCn80H7uoM",
        "author": "@MissSpaz",
        "text": "​CooP-dg7ky\nYou only support Christian Palestinians... and only support Christian Israelis...\nWhat a small world you make yourself live in, where the only people who matter to you are those who share your religion.",
        "like_count": 0,
        "published_at": "2023-12-12T04:01:53Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yDQLfNDyG6",
        "author": "@haroldcruz8550",
        "text": "Why Americans Don’t Support Palestine? Because Americans don't want to upset their masters in Tel Aviv and Wall Street.",
        "like_count": 0,
        "published_at": "2023-12-12T09:53:17Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yGPytM-UYp",
        "author": "@anstaranstar",
        "text": "LESSONS  FOR ARABS.\n\nStop enslaving Africans. Stop discrimination against DARK SKIN PEOPLE...STOP IT  ..... BECAUSE WE ARE  HUMANS AND NEED EACH OTHER.",
        "like_count": 0,
        "published_at": "2023-12-13T13:47:46Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yGeE6boe0I",
        "author": "@starbright3509",
        "text": "@ofCourseI Arab Muslims we’re the first enslaver of black Africans, and were the last to end slavery…. Hell, there’s still Arab Muslim countries that practice slavery to this day.",
        "like_count": 8,
        "published_at": "2023-12-13T16:01:02Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yGeFe3Ji5o",
        "author": "@starbright3509",
        "text": "@ofCourseI Arab Muslims we’re the first enslaver of black Africans, and were the last to end slavery…. Hell, there’s still Arab Muslim countries that practice slavery to this day.\n\nYou all thinking Arab Muslim are your friends, a good chunk of them harbor deep Anti-blackness and will call you an Abeed (slave) to your face. A famous Arab YouTuber Adam Saleh casually called blacks people abeed in his video.",
        "like_count": 0,
        "published_at": "2023-12-13T16:01:15Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yHBfUMvwz8",
        "author": "@mr.d1796",
        "text": "⁠​⁠​⁠​⁠@KaylaJones2000Free Palestine. As a group of people that were oppressed by white Europeans, Jews should be the first to understand that what’s going on in Palestine is fundamentally wrong. Netanyahu and the IDF are quite literally responsible for growing cases of antisemitism, especially on the world stage. Israel needs to realize that people don’t like to see developed countries coming in and massacring underserved civilians indiscriminately. Then seeing the IDF humiliating innocent civilians in the street, I will *NEVER* support Israel.",
        "like_count": 0,
        "published_at": "2023-12-13T21:02:01Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yI6Nlwaq9z",
        "author": "@HarpreetSingh-kj8ro",
        "text": "@birdmanpdx6716 Muhammad owned black slaves and refused to let Belal his prized black slave free and sent him to be owned by another man before he died. BTW Muhammad was also a pedophile. Israel gives more rights to Palestinians than Palestinians in Gaza or WB. Gay Palestinians escape to Israel where they are free can live without free. Ex-Muslim Palestinians also escape to Israel to escape persecution as well.",
        "like_count": 0,
        "published_at": "2023-12-14T05:35:00Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yKkBg7MTng",
        "author": "@respiratoryed",
        "text": "@tobeme1987they didn’t move to Europe on their own. Remember AD 70.",
        "like_count": 3,
        "published_at": "2023-12-15T06:10:06Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yLfaCw7TaN",
        "author": "@tobeme1987",
        "text": "@respiratoryed Doesn't matter, after 2k years if black people forced into the united states, like in Algeria went back to a land that their ancestors were from and committed crimes against the population instead of assimilating then they would be wrong too. The Jews that came from Europe came with all the nastiness of colonization just like other European countries took part in and still do to this day. They could have just migrated, but instead they chose to be oppressors just like they were oppressed.",
        "like_count": 0,
        "published_at": "2023-12-15T14:49:08Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yMMDdyAQ2C",
        "author": "@briopalumpus8676",
        "text": "you dont realise how deep seated racism in the so called middle east is, listen with out occupation even palestianins would show their true face, these people still see black people as their property and not their equals. they like to use the A..  word. the jeews also hold the same views, they started the hamitic curse theory.",
        "like_count": 0,
        "published_at": "2023-12-15T21:10:24Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yMxbHD0PTN",
        "author": "@thinkbeforeyoutype7106",
        "text": "Exactly! Israel will be remembered just like the N@Z!S. I guarantee you since you use the same rhetoric and tactics to commit genocide against the people in Palestine 🇵🇸",
        "like_count": 0,
        "published_at": "2023-12-16T02:45:48Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yMxeQlf0cS",
        "author": "@thinkbeforeyoutype7106",
        "text": "\"The biggest insult to the memory of the holocaust is not denying it but using it as an excuse to justify the genocide of the Palestinian people.\"\n\n- Norman Finkelstein",
        "like_count": 11,
        "published_at": "2023-12-16T02:46:14Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yMxtDL9leP",
        "author": "@thinkbeforeyoutype7106",
        "text": "@birdmanpdx6716 Israeli Soldiers Wear Images of Dead Palestinian Babies on T-shirts :\n\n“Dead babies, mothers weeping on their children's grave, a child in the crosshairs of a sniper's rifle and blown-up mosques are just a few of the images with which IDF soldiers decided to mark their graduation from a training course or tour of duty.”\n\n“Israel’s military condemned soldiers for wearing T-shirts of a pregnant woman in a rifle’s crosshairs with the slogan “1 Shot 2 Kills,” and another of a gun-toting child with the words, “The smaller they are, the harder it is.”\n\nSource : Haraatz, CBSNews, DenverPost, NYDailyNews, etc\n\nThat was 2009. Now, Israel is openly targeting mothers and children in their genocide against the people in Palestine. They project what they’re guilty of on the Palestinian people",
        "like_count": 0,
        "published_at": "2023-12-16T02:48:15Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yQJFMt0TW4",
        "author": "@docshay7328",
        "text": "​@KaylaJones2000 We cracked open the history books, we're increasingly not rocking with yall for GOOD REASONS.",
        "like_count": 5,
        "published_at": "2023-12-17T10:01:23Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yR13KuUfFM",
        "author": "@holadonkey",
        "text": "well said ByrdieFae",
        "like_count": 1,
        "published_at": "2023-12-17T16:41:41Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yX9jUF3Es0",
        "author": "@ofCourseI",
        "text": "@starbright3509 thats an interesting opinion, what white man told you that",
        "like_count": 1,
        "published_at": "2023-12-20T01:52:56Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoW9yea8JRfZ0p",
        "author": "@mianokamuru6333",
        "text": "free darfur from arabs",
        "like_count": 0,
        "published_at": "2023-12-23T08:26:19Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoWA-5wCZGMuLp",
        "author": "@ccvv1119",
        "text": "@birdmanpdx6716 Israel isn’t tiny it has the full support of the American government, steals Palestinian bodies for its skin bank, has the weapons and military, steals land illegally constantly, and places Palestinians in concentration camps. Israel has turned Jewish supporters of Israel into colonizers point blank period claiming land that frankly they don’t have a right to they have more European ancestry atp",
        "like_count": 0,
        "published_at": "2024-01-28T05:09:16Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoWA0do21sd5q0",
        "author": "@brevarium.scarense",
        "text": "Absolutely horrible yeah",
        "like_count": 0,
        "published_at": "2024-03-06T14:42:44Z",
        "is_reply": true
      },
      {
        "id": "UgydNupd3Rs3t-ZlhbZ4AaABAg.9xe82syFgoWA22pl_Z2y7_",
        "author": "@joefreeman3772",
        "text": "@starbright3509  They call black people ‘abid’ (slave) everyday",
        "like_count": 0,
        "published_at": "2024-04-10T13:49:28Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugyb3LrAs10KHS4YCo14AaABAg",
    "author": "@Countcowabunga",
    "author_channel_id": "UCaY0HmepJpoc7rk7wuDhnGA",
    "text": "I’ll never forget visiting Palestine as a kid since my parents were born there. My parents are from the West Bank and there was military presence everywhere and everyone was just used to it. Walking to the mall and passing by grown men with huge guns staring you down was alarming",
    "like_count": 283,
    "published_at": "2023-11-28T09:35:50Z",
    "is_reply": false,
    "reply_count": 5,
    "replies": [
      {
        "id": "Ugyb3LrAs10KHS4YCo14AaABAg.9xeLDfQgOgr9yEUD2S1ttZ",
        "author": "@davyboy1955",
        "text": "@porter9276give jews your house then.",
        "like_count": 0,
        "published_at": "2023-12-12T19:46:18Z",
        "is_reply": true
      },
      {
        "id": "Ugyb3LrAs10KHS4YCo14AaABAg.9xeLDfQgOgrA28Ugjt-ngu",
        "author": "@tysondennis1016",
        "text": "@porter9276It does not have the right to murder innocent kids!",
        "like_count": 19,
        "published_at": "2024-04-12T18:32:01Z",
        "is_reply": true
      },
      {
        "id": "Ugyb3LrAs10KHS4YCo14AaABAg.9xeLDfQgOgrA3QVIcPPns_",
        "author": "@lamontewilliams203",
        "text": "@Why do you types say Israel has a right to exist as if the right to exist is exclusive to Israel? Everyone has a right to exist. Palestinians included.",
        "like_count": 9,
        "published_at": "2024-05-14T14:55:03Z",
        "is_reply": true
      },
      {
        "id": "Ugyb3LrAs10KHS4YCo14AaABAg.9xeLDfQgOgrA3RfIu99xrQ",
        "author": "@faniarethas2716",
        "text": "@porter9276 \nNetaniahou propaganda!",
        "like_count": 2,
        "published_at": "2024-05-15T01:50:27Z",
        "is_reply": true
      },
      {
        "id": "Ugyb3LrAs10KHS4YCo14AaABAg.9xeLDfQgOgrA3crH-XYwdz",
        "author": "@iammar1159",
        "text": "@porter9276 How convenient it is that you choose to forget the events of the last 7 decades and all the events that took place long before October 2023.",
        "like_count": 2,
        "published_at": "2024-05-19T19:25:56Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugz3ZYO9gH3NqWDV3HB4AaABAg",
    "author": "@ionlyemergeafterdark",
    "author_channel_id": "UCKZonX-tqwAACeVx70pcieQ",
    "text": "Yes, a liar is a thief and a thief is a murderer.",
    "like_count": 493,
    "published_at": "2023-11-28T00:01:33Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugz3ZYO9gH3NqWDV3HB4AaABAg.9xdJVPQKXMM9yeaV70mYkI",
        "author": "@mianokamuru6333",
        "text": "stfu free blacks in dafur, palestine, mauritania and libya from arab slavers",
        "like_count": 0,
        "published_at": "2023-12-23T08:29:25Z",
        "is_reply": true
      },
      {
        "id": "Ugz3ZYO9gH3NqWDV3HB4AaABAg.9xdJVPQKXMMA3IMmKPJYxP",
        "author": "@MaxineMcNeil",
        "text": "A liar is a thief and a thief is a murderer. Interesting!!!!",
        "like_count": 3,
        "published_at": "2024-05-11T11:06:40Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxtdIKWnZny4CUFofx4AaABAg",
    "author": "@noahschiffman3529",
    "author_channel_id": "UCr3T7kaGvcijIdnUnixoRGA",
    "text": "Hello- I am not sure if you will even see this comment or have time to read it but I am a leftist, anti-zionist jewish person who's entire family have been staunchly in support of Israel for years. Needless to say things really have not been great lately. Thank you, thank you, thank you for making this video. It authentically kind of meant the world to me in a way I am really struggling to verbalize, but I am so beyond grateful you chose to make it in spite of the reasonable hesitancy to. Thank you also specifically for acknowledging the side of the jewish community that firmly stand against Israel. My sister called me a \"traitor to my kind\" the other day (horrifying, I know) and watching this video really really helped, not to mention taught me a myriad of elements of this I didn't even know about. This is a long YouTube comment. Thank you so much. Please keep doing what you're doing, you are an inspiration.",
    "like_count": 183,
    "published_at": "2023-11-28T23:46:47Z",
    "is_reply": false,
    "reply_count": 11,
    "replies": [
      {
        "id": "UgxtdIKWnZny4CUFofx4AaABAg.9xfrbDs_qww9xg-ewBwywd",
        "author": "@olurinatti",
        "text": "💜 💜 💜 💜 💜 💜 💜 💜",
        "like_count": 26,
        "published_at": "2023-11-29T01:05:56Z",
        "is_reply": true
      },
      {
        "id": "UgxtdIKWnZny4CUFofx4AaABAg.9xfrbDs_qww9y9X-KSIn9I",
        "author": "@KaylaJones2000",
        "text": "@olurinatti We supported your liberation to gain your gratitude and friendship, but you have betrayed us. Being pro Israel to us is like being pro blk to you. It's in our blood.",
        "like_count": 0,
        "published_at": "2023-12-10T21:34:26Z",
        "is_reply": true
      },
      {
        "id": "UgxtdIKWnZny4CUFofx4AaABAg.9xfrbDs_qww9yQKcdI7gGw",
        "author": "@trending7852",
        "text": "You are a very brave person, don't let ignorant, arrogant idiots let you down. It's not easy to go against the grain of society but I believe if you have any morals and decency you should stand against killing and war regardless of which religion or ethnicity is on either side. More power to you",
        "like_count": 7,
        "published_at": "2023-12-17T10:13:26Z",
        "is_reply": true
      },
      {
        "id": "UgxtdIKWnZny4CUFofx4AaABAg.9xfrbDs_qwwA28VRc8kBi_",
        "author": "@tysondennis1016",
        "text": "You are no traitor. You are a conscientious objector. Israel doesn’t represent Judaism as a whole, and anybody who says so is antisemetic.",
        "like_count": 0,
        "published_at": "2024-04-12T18:38:33Z",
        "is_reply": true
      },
      {
        "id": "UgxtdIKWnZny4CUFofx4AaABAg.9xfrbDs_qwwA2MB9wsjVuD",
        "author": "@samo9275",
        "text": "@KaylaJones2000 bot #1 (per comments here)",
        "like_count": 3,
        "published_at": "2024-04-18T02:10:44Z",
        "is_reply": true
      },
      {
        "id": "UgxtdIKWnZny4CUFofx4AaABAg.9xfrbDs_qwwA2MBDLPqEp6",
        "author": "@samo9275",
        "text": "@porter9276 bot #2 (per comments here, as well as on other channels discussing the topic)",
        "like_count": 3,
        "published_at": "2024-04-18T02:11:12Z",
        "is_reply": true
      },
      {
        "id": "UgxtdIKWnZny4CUFofx4AaABAg.9xfrbDs_qwwA2MBGST3cZE",
        "author": "@samo9275",
        "text": "❤ @noahschiffman3529 you are not alone",
        "like_count": 2,
        "published_at": "2024-04-18T02:11:38Z",
        "is_reply": true
      },
      {
        "id": "UgxtdIKWnZny4CUFofx4AaABAg.9xfrbDs_qwwA3LWoBbaGpg",
        "author": "@mikeg2306",
        "text": "Are you an American against America too?",
        "like_count": 0,
        "published_at": "2024-05-12T16:32:02Z",
        "is_reply": true
      },
      {
        "id": "UgxtdIKWnZny4CUFofx4AaABAg.9xfrbDs_qwwA3Lek_Bf6BK",
        "author": "@samo9275",
        "text": "@mikeg2306 non-bot hazbarrist #1; you’re on a progressive page — the ‘you’re anti-Murican’ talking point will fall on deaf ears here",
        "like_count": 8,
        "published_at": "2024-05-12T17:50:11Z",
        "is_reply": true
      },
      {
        "id": "UgxtdIKWnZny4CUFofx4AaABAg.9xfrbDs_qwwA3LrYlF-gh8",
        "author": "@noahschiffman3529",
        "text": "@samo9275 thx for taking this one",
        "like_count": 2,
        "published_at": "2024-05-12T19:42:02Z",
        "is_reply": true
      },
      {
        "id": "UgxtdIKWnZny4CUFofx4AaABAg.9xfrbDs_qwwA3Lray592Cf",
        "author": "@noahschiffman3529",
        "text": "@mikeg2306 y-yes?",
        "like_count": 2,
        "published_at": "2024-05-12T19:42:28Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw-cpAh3MuzwsmFf-94AaABAg",
    "author": "@realboerner",
    "author_channel_id": "UCjUIaeFyBiSYH7mVIs2Yopg",
    "text": "Thank you for speaking out. It feels quite lonely here in Germany, since it seems like no one here is willing to differentiate between antizionism and antisemitism. Even the leftist spaces are falling for Israels propaganda. Our politicians want to establish a pro Israel stance as a condition for migrants to get the German citizenship. I never thought something like \"maybe no child should die?\" could be controversial...",
    "like_count": 778,
    "published_at": "2023-11-28T06:47:40Z",
    "is_reply": false,
    "reply_count": 22,
    "replies": [
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9xetOfgfnVL",
        "author": "@lillys3001",
        "text": "schön jemanden zu sehen der auch so verstört von den aktuellen narrativen hier in deutschland ist. manchmal wenn ich artikel und feuilleton lese komme ich mir vor als würde ich in einer anderen welt leben, wenn so viele selbsterklärte \"linke\" ihre schamlos pro-zionistischen positionen teilen",
        "like_count": 1,
        "published_at": "2023-11-28T14:43:10Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9xhyIepPKIP",
        "author": "@KendrixTermina",
        "text": "You're not alone, they just want us to feel this way by taking away normal forums of expression for public opinion such as media & politics. There are record-breaking protests, aren't there? \nI mean, we can all see it. 2 +2 is 4, the sky is blue, the emperor is naked, and nothing in the world can justify killing all these children",
        "like_count": 0,
        "published_at": "2023-11-29T19:23:46Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9xk6-gb0j3s",
        "author": "@thatgirlinautumn5995",
        "text": "For them (and thus me) the distinction doesn’t matter anymore, also they never point out specific examples because the antisemitism in equating all of Judaism with the Israeli government far outweighs that of the strawmen they _try_ to discuss with. It’s the blatant racism, the dehumanisation, the open calls for genocide that are wildly upsetting to me. They claim antisemitism while perpetuating the exact kind of generalisations, vocabulary, and apologetics that were used to murder Jewish people not even a hundred years ago. The treatment of a people as human can not and should never depend on trends, we should know\nEdit: There obviously _is_ a distinction between the two, it just doesn’t play a role in the discussion anymore. There is no need for semantics when pointing out the humanity of an entire population, it’s just moving the goalpost.",
        "like_count": 25,
        "published_at": "2023-11-30T15:18:18Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9xkdcznAjPJ",
        "author": "@majaherold1325",
        "text": "Oh my god, I'm German as well and I seriously want to slam my head against the wall whenever I see another Spiegel or TAZ or FAZ headline. It is so frustrating that so so many left leaning people and publications lack any kind of nuance in their analysis and fail to see past their own holocaust shame to understand that Israel genociding Palestine doesn't mean that we want to kill Jews again. \nI'm especially infuriated by the insanely islamophobic, racist narrative that anti-Semitism is an imported problem (by the evil, evil brown immigrants). As if we have no Neonazis left in Germany, as if the AFD is not in most Landtagen, as if the Hubert Aiwanger scandal wasn't only a few months ago. Honestly, the GALL to call this an imported issue in GERMANY of all places...",
        "like_count": 0,
        "published_at": "2023-11-30T20:20:54Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9xkvkmJ3rfg",
        "author": "@cookiequeen5430",
        "text": "Ja der deutsche \"Diskurs\" ist so durchgeknallt und realitätsfern...",
        "like_count": 23,
        "published_at": "2023-11-30T22:59:15Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9xkyf2VKSrY",
        "author": "@majaherold1325",
        "text": "@cookiequeen5430 Es ist alles so unfassbar lächerlich. Man kann eigentlich nur darüber lachen weil es so absurd ist, aber dafür ist die Lage mittlerweile zu ernst.",
        "like_count": 13,
        "published_at": "2023-11-30T23:24:41Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9xlA7vLO41H",
        "author": "@chickensalad3535",
        "text": "Antizionism IS antisemitism because without zionism the Jewish population will be terrorized and  exterminated.",
        "like_count": 0,
        "published_at": "2023-12-01T01:13:37Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9xmwk7W6Ahu",
        "author": "@ap5587",
        "text": "❤",
        "like_count": 1,
        "published_at": "2023-12-01T17:46:23Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9xnlC1MB0Kf",
        "author": "@pikapi6993",
        "text": "As a German you should know that Antizionism and Antisemitism is the same. If you deny Israel its existence, then this is by definition antisemitic. If you scream \"from the river to the sea\" this is by definition a call for genocide. It means that you want to throw the Jews to the sea until no jew lives in Israel anymore. I am happy that you ar lonely in Germany. You claim to care about Palestinians but you are happy that they are teaching their children to become terrorists and cild soldiers. You don't care about their well being. You want them to be oppressed by Muslims, like all people are in majority islamic countries.\nMeanwhile Muslim Arab Israelis are so happy that they can live in a free and democratic country. And they can thank their smart ancestors for this, because they made peace with the Jews 75 years ago.",
        "like_count": 0,
        "published_at": "2023-12-02T01:24:43Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9xsI6rAFgtR",
        "author": "@jonlenihan4798",
        "text": "No Muslim state has ever granted human or political rights to the Jews, because\"human rights\" is a secular ideology.  Christendom excluded the Jews as well , before the French Revolution. Societies in which membership in a state church/mosque is a prerequisite for inclusion regard Jews and other non-members, or disobedient members, as \"internal enemies.\"  Think of non or anti communists in today's North Korea.",
        "like_count": 3,
        "published_at": "2023-12-03T19:38:04Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9xsPHa84sUC",
        "author": "@jonlenihan4798",
        "text": "@pikapi6993 Christian religion, like Islam, is about membership and obedience. This is because, both Christianity and Islam developed as state ideologies, designed to iterate state power. Christians/Muslims are eligible for forgiveness, no matter how evil and depraved their actions, by virtue of their membership. Non-Christians/Muslims are damned, no matter how virtuous their lives.  Moral authority = ask the priest./mullah Don't think too  much. Take it on faith. Membership and obedience.  \n\nWestern Christians have been mostly won over to secular humanism. How they see the world is a mix of Christian and secular beliefs, more secular than religious for most. Still, it is the institutional belief of the Roman Catholic Church eg, that the secular present is an aberration, which will not endure. Also, the Protestant churches will return to the Catholic fold. \n\nChristiandom changed to secular humanist Europe. The Lands of Islam have been fighting this change for the past 100 years, successfully. Does that have something to do with the difference between Christian religion and Islam? Maybe.",
        "like_count": 3,
        "published_at": "2023-12-03T20:40:42Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9xstFl6hAo4",
        "author": "@pikapi6993",
        "text": "@jonlenihan4798 This is a total lie. Christianity developed as a secular religion in the Roman Empire. For more than 300 years, Christianity spread by missionary. Poor people who travelled the world spread Christianity by preaching Jesus message.  Jesus said his kingdom is not on Earth, but in heaven. Jesus said theat people should give Caesar what belongs to Caesar, and give to God what belongs to God. Europe has always been secular since Christianity became state religion, because there is no Christian law. The Roman empire continued to use Roman law after it became the state's religion. A Christian law doesn't exist. Chrisitanity by definition, by everything Jesus has taught, is a secular religion.\nAnd no, Christians are not forgiven no matter what they do. You clearly haven't read the Bible. Jesus spent half of the time warning the people from hell. Many are invited, but only few will actually make it.\nChristianity never changed or bowed down to anybody. It's the same faith since 30 AD, just the times have changed as they always do. Secular humanism is just an Atheist religion that copies everything from Christianity minus the responsibility and consequences for ones actions and coincidence. This is why they clash. Other than that, there is nothing new to secular humanism. When you look at Atheists in hsitory they were often very immoral people. Doing things such as forcing your girlsfriend to give away all the babies she birthed (Rousseau) or having incestious relations with your Niece (Voltaire). Understandable that they wanted to get rid of Christianity. And their descendants did even worse things. This Atheist movement ended with one of the worst dictatorships and genocideds in human history. The French Revolution, reign of terror + genocide of Christians. Meanwhile in America the first real democracy was founded,  the constitution was built based on Christianity. Freedoms were also based on the goal to make harmonius coexistence between protestants and catholics possible. \nAt the same time in France \"intellectuals\" were laughing at America for introducing seperation of powers. Well, they ended up executed by the Guillotine. Because there was no seperation of powers in the Atheist republic run by the \"Cult of Reason\". They thought it was reasonable to kill anyone who questioned 1% of what they were doing.",
        "like_count": 0,
        "published_at": "2023-12-04T01:11:19Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9xzC9-YH5El",
        "author": "@camelopardalis84",
        "text": "@ygt2813 Have you heard about or even followed the Gil Ofarim case? When it started a year ago, the hotel where the formerly alleged took place showed \"that it's not anti-Semitic\" by supporting the state of Israel. Back then, German media was able to point out that Israel doesn't equal Judaism. That showing that you support Israel isn't the logical thing to do to dispel accusations of anti-Semitism. Just one year later, German media somehow doesn't know about that this simple \"Judaism doesn't equal Israel\" thing anymore.",
        "like_count": 0,
        "published_at": "2023-12-06T12:00:36Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9y9M2D_u9_y",
        "author": "@Adraria8",
        "text": "Germany somehow finding the most fascist way to try to beat the fascist allegations from their past is really something",
        "like_count": 21,
        "published_at": "2023-12-10T19:58:42Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9y9Wvd8VMZQ",
        "author": "@KaylaJones2000",
        "text": "We supported your liberation to gain your gratitude and friendship, but you have betrayed us. Being pro Israel to us is like being pro blk to you. It's in our blood.",
        "like_count": 1,
        "published_at": "2023-12-10T21:33:47Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9y9XOl9oEop",
        "author": "@camelopardalis84",
        "text": "@KaylaJones2000 What is \"pro blk\"? And in whose blood is it to be \"pro Israel\"?",
        "like_count": 7,
        "published_at": "2023-12-10T21:37:54Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDK9yBjAXJfOVr",
        "author": "@InspiredByEbonyLove",
        "text": "Do you think this is imposed cultural guilt for what happened under the Nazis about 80 years ago?",
        "like_count": 8,
        "published_at": "2023-12-11T18:08:02Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDKA-9uVvcVQb0",
        "author": "@realboerner",
        "text": "@InspiredByEbonyLove 100%, overcorrecting",
        "like_count": 6,
        "published_at": "2024-01-29T18:11:23Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDKA-9xe6486ii",
        "author": "@realboerner",
        "text": "@cookiequeen5430 @majaherold als ein Weißbrot, dass mit den black US Service kids aufgewachsen ist (Ramstein, Kaiserslautern), fühle ich mich immer lowkey isoliert, wenn ich solche channels schaue. Deutschsprachige Kommentare sind eine willkommene Überraschung 😅❤🖤",
        "like_count": 2,
        "published_at": "2024-01-29T18:38:51Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDKA3P-EjX6aiC",
        "author": "@communism_is_based",
        "text": "@realboerner  seems that they interpreted 'jewish people are some kind of special race that deserves unapologetic defense no matter what some of them might do' instead of 'dehumanizing people to justify their erasure is wrong, no matter who the victim and the perpetrator is'.\r\nDon't get me started on how so much of them ignore how n4z1sm is just colonialism applied to Europe, and don't see colonialism as an equally abhorrent endeavour (but that's europeans overall, except the Irish).\r\nI love much of German history , especially the DDR, its weather and noir je ne sais quoi, love the vibe of Berlin and Leipzig  and always dreamed of moving there. Now that I can actually do it, seeing how they handle standing up against genocide is giving me major red flags and unfortunate flashbacks.",
        "like_count": 0,
        "published_at": "2024-05-14T00:55:39Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDKA6b5WCuDv9o",
        "author": "@DrEcKiGeRDaN88",
        "text": "@jonlenihan4798 \nYou dont know Christianity at all.",
        "like_count": 0,
        "published_at": "2024-08-01T16:34:47Z",
        "is_reply": true
      },
      {
        "id": "Ugw-cpAh3MuzwsmFf-94AaABAg.9xe1ywxnxDKAB2664T2hCI",
        "author": "@17-MASY",
        "text": "I advise reading chapter 17 of the Quran.",
        "like_count": 0,
        "published_at": "2024-11-19T23:44:16Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxiOlGHLgH0N3U0cRZ4AaABAg",
    "author": "@grim_glim",
    "author_channel_id": "UCi3O_HdC6WSg3v6ETCIcYfA",
    "text": "A bit over two weeks ago I attended a wedding. Cousin from my mother's side, American Jews. The younger generations (<40 years old) from this clan all checked in briefly and confirmed that yes, every one of us was on the same page re: recognizing Israel's apartheid and genocide. The only person older than that who had moved on the issue was a civil rights lawyer. Our own social circles are in similar states.\n\nSo the good news is that perception on this among Jews has flipped HARD and it's only a matter of time for pre-social-media favorable perception of Israel to go away. The bad news is, obviously, shit is going down right now and for the last 70+ years. Just have to keep pushing.",
    "like_count": 94,
    "published_at": "2023-11-28T00:36:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzLNxak3R1M1Ktjy0d4AaABAg",
    "author": "@bryncheeze8970",
    "author_channel_id": "UCzYLBUU3xT4RvfjW3OKxs2w",
    "text": "I cannot wait for your video discussing the DRC. I only recently learned some of the history of the country and how its been exploited by colonizers for hundreds of years now. Thank you for providing such incredible educational content that never feels boring or irrelevant",
    "like_count": 114,
    "published_at": "2023-11-28T01:43:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzpRDbWmd9zpBMrTmt4AaABAg",
    "author": "@SamM32727",
    "author_channel_id": "UCObIm4BK8TdOYpx3haT_YFg",
    "text": "Thank you so much for compassionate breakdown. I’m literally crying tears of relief watching this video. I’m a nonwhite Jew from nyc and it feels like whoever I’m speaking to about this issue is always missing something crucial about the situation, but you really covered it all here. I have ppl in my family who lost loved ones in the attacks on 10/7. In 2017 I lived along side Palestinian exchange students from the university of Bethlehem. All but 2 of them are dead now. I have protested for Palestinian freedom for almost a decade. I was arrested for protesting two different times in two different cities in the last two months, but even as I am protesting for Palestinian freedom I am scared to let it be known that I’m Jewish bc of the rise in antisemitism from nonwhite ppl that I have been seeing lately. Thank you so much for stating it clearly. Equating Israel with the Jewish ppl is the most antisemitic thing we could do, and that is exactly what the Israeli government is trying to do. There is no safety or freedom for any of us, including Jewish ppl, while Palestinians have to endure these atrocities. Long live Palestine. ❤🖤💚",
    "like_count": 205,
    "published_at": "2023-11-30T02:10:57Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgzpRDbWmd9zpBMrTmt4AaABAg.9xigu-pOkXJ9xv6u0wikS6",
        "author": "@Jimmy1982Playlists",
        "text": "Amen! Arab-American, here, who always speaks out against anti-semitism *and* speaks out against the horrific actions of Israel.",
        "like_count": 19,
        "published_at": "2023-12-04T21:57:47Z",
        "is_reply": true
      },
      {
        "id": "UgzpRDbWmd9zpBMrTmt4AaABAg.9xigu-pOkXJ9xvdoGAlmmg",
        "author": "@user_ha343",
        "text": "If there's one thing I have known in this genocide as someone live in middle east I learn more about Judaism and Jews who stand against what Israel do , i know a little thing about jews who was lived in Egypt , until know i still remember that in the first episode when jew family was saying goodbye to the other family that was Muslim and Christians and they were speaking that it wasn't Safe any more and they had to go  \ni was thinking that wait they are Egyptian Jews why they have to go, this is their country like us ,it opens my eyes about how other Jews had to pay for what Israel did and we helped Israel in it by kicking them out of their country it's the same thing that we have to pay for what isis do but i hate them",
        "like_count": 3,
        "published_at": "2023-12-05T02:54:05Z",
        "is_reply": true
      },
      {
        "id": "UgzpRDbWmd9zpBMrTmt4AaABAg.9xigu-pOkXJ9xxdln2nDbQ",
        "author": "@SamM32727",
        "text": "@Jimmy1982Playlists ❤️",
        "like_count": 1,
        "published_at": "2023-12-05T21:32:14Z",
        "is_reply": true
      },
      {
        "id": "UgzpRDbWmd9zpBMrTmt4AaABAg.9xigu-pOkXJ9yBkYNgHf-R",
        "author": "@InspiredByEbonyLove",
        "text": "@user_ha343The Zionist state indirectly and directly made life harder for Jews in the Arab world by their ongoing oppression and genocidal attempts against Palestinian Arabs of all faiths. Sephardi Jews didn’t want to leave the countries they were in for the Zionist state, and they weren’t expelled for the longest. In fact many Arab countries would not allow their Jews to leave. They were vital members of the countries, and they also didn’t want them to leave & go to the Zionist state. When some did allow their Jewish citizens to leave, ( the anti-Jewishness was stoked among the people as the pretending to be “ Jewish” state was abusing and terrorizing Palestinian/ Arab people) they did so with the provision that they would NOT go to the Zionist state.",
        "like_count": 5,
        "published_at": "2023-12-11T18:20:02Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzGTyUdXvGfVjSnQ0V4AaABAg",
    "author": "@DepressionCat1",
    "author_channel_id": "UCWQrN2bqvgFXCS-w_YP3qOg",
    "text": "Great video like always\nYou can’t put the word Palestine in your video titles without being censored by the algorithm",
    "like_count": 280,
    "published_at": "2023-11-28T00:03:21Z",
    "is_reply": false,
    "reply_count": 9,
    "replies": [
      {
        "id": "UgzGTyUdXvGfVjSnQ0V4AaABAg.9xdJhbLxpnu9xdK3NOYok_",
        "author": "@olurinatti",
        "text": "Thank you, I’ll consider changing it if I get the sense that’s happening!",
        "like_count": 80,
        "published_at": "2023-11-28T00:06:27Z",
        "is_reply": true
      },
      {
        "id": "UgzGTyUdXvGfVjSnQ0V4AaABAg.9xdJhbLxpnu9xfGy2FJPka",
        "author": "@ChristopherSadlowski",
        "text": "So, this is just an anecdote, but this video with the title \"The Silencing of Palestine\" was served up to me unprompted by the algorithm. Who knows if in a few hours this video takes off YouTube won't try to tamp it down, because YouTube can be petty like that. I am new here and this video is so good I'm subscribing after I finish this comment. Hopefully there's a lot of people behind me doing the same thing.",
        "like_count": 28,
        "published_at": "2023-11-28T18:17:51Z",
        "is_reply": true
      },
      {
        "id": "UgzGTyUdXvGfVjSnQ0V4AaABAg.9xdJhbLxpnu9xfYpy34N67",
        "author": "@RoseCalyx",
        "text": "just proving the point youtube...",
        "like_count": 2,
        "published_at": "2023-11-28T20:54:02Z",
        "is_reply": true
      },
      {
        "id": "UgzGTyUdXvGfVjSnQ0V4AaABAg.9xdJhbLxpnu9xk2YX8DrZp",
        "author": "@voltage80x",
        "text": "@ChristopherSadlowskiim here because of the algorithm as well.",
        "like_count": 1,
        "published_at": "2023-11-30T14:48:06Z",
        "is_reply": true
      },
      {
        "id": "UgzGTyUdXvGfVjSnQ0V4AaABAg.9xdJhbLxpnu9xkHFFmnFzL",
        "author": "@THELIONSDEN-jw4ul",
        "text": "​@olurinatti THAT LAND WAS NEVER CALLED PALESTINIE. THAT LAND WAS CALLED CAANAN THEN WHEN THE 12 TRIBES OF ISRAEL INHERITED IT THEN IT WAS SPLIT INTO EACH TRIBES  WHEN THE 12 TRIBES  OF ISRAEL WENT INTO EXILE THEN THOSE PALESTINIANS MOVED IN. THAT IS NOT THEIR LAND. \nIF YOU ARE ON YOUR FATHERS LINE NEGROES JAMAICANS HATIANS NATIVE AMERICAN INDIANS SEMINOLE INDIANS AND ALL HISPANICS OF INDIAN DECENT WE ARE THE BIBLICAL 12 TRIBES OF ISRAEL.  . WHEN THE TRIBES OF ISRAEL WENT INTO EXILE GOD PUT CURSES ON THAT LAND.  GOD SAID HE WOULD MAKE JERUSALEM A TREMBLING CUP AND GOD SAID ANYONE WHO FALLS UPON JERUSALEM WOULD BE CUT OFF.  IN THE JEWISH ENCYCLOPEDIA IT HAS THEM LISTED UNDER A DIFFERENT NATION CALLED EDOM AND EDOM IS ESAU.  THE BIBLE SAYS WHEN THE JEWS ARE BACK HOME THERE WILL BE NO MORE WARS AND NO MORE WEAPONS.  THE PROBLEM IS JEWISH PEOPLE FINANCED THE TRANSATLANTIC SLAVE TRADE AND MUSLIMS ENSLAVED US AND HAD A HAND IN THE TRANSATLANTIC SLAVE TRADE.  THE FIRST CHURCH BUILT BY THE SLAVES IN SAVANAH GEORGIA HAS ANCIENT HEBREW CARVED IN THE PUGHS.  NO ONE CAN GO AGAINST GOD'S PROPHESY",
        "like_count": 0,
        "published_at": "2023-11-30T16:56:33Z",
        "is_reply": true
      },
      {
        "id": "UgzGTyUdXvGfVjSnQ0V4AaABAg.9xdJhbLxpnu9xkHSiA5xv6",
        "author": "@THELIONSDEN-jw4ul",
        "text": "AND YOU CANT CALL THAT LAND PALESTINIE WHEN IT NEVER WAS CALLED IT.  THE WORLD IS WAKING UP TO THE FACT THAT JESUS IS BLACK",
        "like_count": 0,
        "published_at": "2023-11-30T16:58:23Z",
        "is_reply": true
      },
      {
        "id": "UgzGTyUdXvGfVjSnQ0V4AaABAg.9xdJhbLxpnu9xmx-XvmCRn",
        "author": "@ap5587",
        "text": "Exactly, not great that that happens",
        "like_count": 0,
        "published_at": "2023-12-01T17:48:37Z",
        "is_reply": true
      },
      {
        "id": "UgzGTyUdXvGfVjSnQ0V4AaABAg.9xdJhbLxpnu9xpAQ37kU-y",
        "author": "@danbeaulieu2130",
        "text": "@THELIONSDEN-jw4ul \nJesus is imaginary.",
        "like_count": 0,
        "published_at": "2023-12-02T14:33:03Z",
        "is_reply": true
      },
      {
        "id": "UgzGTyUdXvGfVjSnQ0V4AaABAg.9xdJhbLxpnu9xyYkHbicAQ",
        "author": "@A_MapleBar",
        "text": "@THELIONSDEN-jw4ul Jesus was not \"black\" or a direct African, his people were from the Levant. He was a man born in Bayt Laḥm (Bethlehem) in modern day occupied Palestine. The debate of his skin tone should not be something that people ponder over for years. We can leave it at the fact the he most definitely did not look like a Scandinavian man.✌",
        "like_count": 6,
        "published_at": "2023-12-06T05:58:50Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxTEoSS3U6m5dyyMet4AaABAg",
    "author": "@msnoodles1",
    "author_channel_id": "UCzafdu_e_kX4APVIrj-EsEQ",
    "text": "I'm from Ireland and this is great education for me. I couldn't understand Americans support Israel. I've been taught about Palestine's history since a very young age. Their history is very similar to ours. We can't help but empathise with their struggle. Even our government has stated their support for Palestine.",
    "like_count": 153,
    "published_at": "2023-11-30T17:44:37Z",
    "is_reply": false,
    "reply_count": 24,
    "replies": [
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAkl9yRHq5iKwdm",
        "author": "@Akiraspin",
        "text": "Irish people typically don't bomb retirement homes or rape Englishwomen to the chants of \"GOD IS GREATEST.\" so no it's not quite the same.",
        "like_count": 1,
        "published_at": "2023-12-17T19:08:18Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAkl9yZblbwuZ4p",
        "author": "@Rrrrpyd",
        "text": "As an black american our govt supporting Israel isnt surprising especially with this country’s history. Alot of us actually have empathy and dont feel that way at all. Colonizers will support their own",
        "like_count": 27,
        "published_at": "2023-12-21T00:45:06Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA1uapRk0cc0",
        "author": "@gloverfox9135",
        "text": "I support israel because it’s the most progressive state in the Middle East",
        "like_count": 3,
        "published_at": "2024-04-06T23:45:46Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA23kQ41aNFh",
        "author": "@lordhoot1",
        "text": "@gloverfox9135 You don't have to support any state that murders civilians. You know it's not compulsory right",
        "like_count": 0,
        "published_at": "2024-04-10T22:21:57Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA2Jw_jpNmaX",
        "author": "@merubmalik8299",
        "text": "Progressive until pales..tne",
        "like_count": 4,
        "published_at": "2024-04-17T05:16:06Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA2MBXza9XIr",
        "author": "@samo9275",
        "text": "@gloverfox9135Not sure what progressive state bans media, imprisons thousands of brown children without charge (prior to these events), allows for and supports internationally iIIegaI settI3r expansion, targets and arrests citizens for ~~social media posts~~ critical of the govt let alone voicing any humanity for PaI. Etc etc.",
        "like_count": 16,
        "published_at": "2024-04-18T02:14:01Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA2MFmYd8ute",
        "author": "@gloverfox9135",
        "text": "@samo9275 it’s the only state in the Middle East that allows homosexuality, LGBT rights, it’s easily the richest country in the region in terms of per capita, it’s the country with the highest human development index rating. Israel is the country with the best rights for women in the Middle East.",
        "like_count": 3,
        "published_at": "2024-04-18T02:51:06Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA2MXmpZ8Ykr",
        "author": "@samo9275",
        "text": "@gloverfox9135 ‘but it’s rich doe’ — what do the extracted ‘riches’ & subsidized welfare of a coIoniaI outpost propped up by the U/S have to do with being a “progressive” state? and how pro-Igbt is X’ing every last g, b, or t PaIestinian in sight?",
        "like_count": 12,
        "published_at": "2024-04-18T05:28:25Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA2Mo_9xuoNb",
        "author": "@gloverfox9135",
        "text": "@samo9275 most of the money israel makes is of their own volition. Israel has few natural resources so that means they have to be smart with how they make money. Saudi Arabia is a literal petrol state and their gdp per capita is far lower than israel’s. \nMy last point about Israel being pro-lgbt is that people can openly be homosexual in israel without the fear of being stoned to death or being thrown off buildings like in Palestine, which officially bans homosexuality by the way.",
        "like_count": 4,
        "published_at": "2024-04-18T08:03:51Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA3A9k6FsVly",
        "author": "@k2a2l2",
        "text": "much love to Ireland🫶",
        "like_count": 4,
        "published_at": "2024-05-08T06:38:51Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA3G98UA9aGQ",
        "author": "@fredarice524",
        "text": "Sometimes we get beyond our self one man’s rite to live depends on how I feel really let’s get some love in our hearts I thought there for a minute people were making this up the Jews have been persecuted first hand experience should anyone have to tell you how horrible this is  people around the world being miss treated behind wat another man feels u can’t live with me because I’m from another skin tone  wow explain",
        "like_count": 1,
        "published_at": "2024-05-10T14:29:01Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA3SN4iDvE-q",
        "author": "@amrita-sodaa",
        "text": "@gloverfox9135 You DO realize interfaith marriages aren't even recognized in Isntreall, right? And the infamous settlers who are religious lunatics whose existence is a flagrant violation of international law? The \"secular\" country that has literal concentration camps",
        "like_count": 0,
        "published_at": "2024-05-15T08:21:43Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA3SNdXo60yd",
        "author": "@amrita-sodaa",
        "text": "@gloverfox9135 bro is glazing a country with literal concentration camps lmfao",
        "like_count": 5,
        "published_at": "2024-05-15T08:26:37Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA3UU6IAL_Js",
        "author": "@xaspirate8060",
        "text": "@samo9275 Imprisons thousands of brown children???!?!?!?!  Would you lay down some proof here please? If you do you just might convince me to flip support>>",
        "like_count": 0,
        "published_at": "2024-05-16T04:01:35Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA3UUB9UJitj",
        "author": "@xaspirate8060",
        "text": "@gloverfox9135 Alot of resentment within thhis discussion === all of the things that no one wants to touch.",
        "like_count": 0,
        "published_at": "2024-05-16T04:02:15Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA3UULDzVGhx",
        "author": "@xaspirate8060",
        "text": "@samo9275 Just keep making up sht---something's gotta stick right?",
        "like_count": 0,
        "published_at": "2024-05-16T04:03:37Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA3ZDIumRiwj",
        "author": "@squigeyjoe823",
        "text": "It doesn't just have parallels, it had the same players. When the Irish kicked out the British, they literally sent the same people who were trying to control the Irish population, to try and control the Palestinian population. Ronald Storrs, a British governor of Jerusalem between 1917 and 1926 stated that their goal was “forming for England ‘a little loyal Jewish Ulster’ in a sea of potentially hostile Arabism.\"",
        "like_count": 3,
        "published_at": "2024-05-18T00:10:58Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA3goXBw6Ebl",
        "author": "@gloverfox9135",
        "text": "@amrita-sodaa they aren’t recognized in Palestine either. At least israel allows homosexual marriages, which is far more than I can say for Palestine, or any other middle eastern country for that matter. It even has a much higher human development index ranking than all of the middle east",
        "like_count": 0,
        "published_at": "2024-05-21T08:18:53Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA3gohEpoGzj",
        "author": "@gloverfox9135",
        "text": "@amrita-sodaaam I wrong tho? Am I wrong in saying that israel is the most developed and successful country in the Middle East by far?",
        "like_count": 0,
        "published_at": "2024-05-21T08:20:24Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA3gtveTLoui",
        "author": "@amrita-sodaa",
        "text": "​@gloverfox9135 You are wrong tho, I immedialtely knew you were lying on the HDI development point even before I looked it up. Look up for yourself a list ranking HDI's in the Middle East and nearly all the gulf countries gap Isntreal by a mile.",
        "like_count": 1,
        "published_at": "2024-05-21T09:06:03Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA3gwtum5yyE",
        "author": "@gloverfox9135",
        "text": "@amrita-sodaa https://en.m.wikipedia.org/wiki/List_of_countries_by_Human_Development_Index \n\nIt literally states that israel is ranked 25 in terms of HDI, the only country in the Middle East that ranks higher is the UAE, and even then, israel has both a higher gdp and gdp per capita than the UAE.",
        "like_count": 0,
        "published_at": "2024-05-21T09:32:02Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA6SzsK2eOt5",
        "author": "@zerir.3726",
        "text": "@gloverfox9135 What does it matter about the specifics of such when a sizeable amount of the entire Palestinian population and the land they live on is actively being razed? Did you even watch the video? \nAny argument of such becomes invalid when you have proof of entire neighbourhoods and cities being leveled by them. Just as in the US any support goes to there wth is your problem",
        "like_count": 0,
        "published_at": "2024-07-29T03:43:36Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA6T-wxwN9Ff",
        "author": "@gloverfox9135",
        "text": "@amrita-sodaa and they’re all petrol states. Without it, they would still be backward tribes serving the Turks.",
        "like_count": 0,
        "published_at": "2024-07-29T03:52:58Z",
        "is_reply": true
      },
      {
        "id": "UgxTEoSS3U6m5dyyMet4AaABAg.9xkMkKJIAklA9ooEvWcVkS",
        "author": "@CRose9205",
        "text": "Palestine has none of the same values as the Irish.  To even think that is a disgrace to Ireland.  No offense, but palestine is horrible and has no basic human rights.  Treat women and gays like absolute shit, ruled by a terror organization that has radicalized much of the population.  They've stated that they want to kill all jews.  They start almost every violent confrontation.  There's no argument here.",
        "like_count": 0,
        "published_at": "2024-10-20T13:58:41Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw1Z-3-GWpQ7PbQF-d4AaABAg",
    "author": "@islandofideals6571",
    "author_channel_id": "UCkz5AF_2i_teorE9yzI_lEg",
    "text": "My grandma has always said 'if you lie you'll steal, and if you'll steal you'll kill.' She's lived her whole life in Birmingham AL. It's telling what says are common across the diaspora",
    "like_count": 42,
    "published_at": "2023-11-28T16:18:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwinU3L4uGGPxvMNFB4AaABAg",
    "author": "@SoWren_S",
    "author_channel_id": "UC2j2bhmCPaZhkwAfIpVIx8A",
    "text": "Olay makes some of the best content on the internet. I hope she never stops speaking truth to power.",
    "like_count": 120,
    "published_at": "2023-11-28T04:30:14Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwinU3L4uGGPxvMNFB4AaABAg.9xdnFP-PFi29yMk5XmBnIc",
        "author": "@RedSunriseOnTheHorizon",
        "text": "Even better, tells the truth to the people. Power doesn't care, but if enough of the people do, they will have to",
        "like_count": 1,
        "published_at": "2023-12-16T00:47:45Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyzBG9KJ4zxJ0rvq1V4AaABAg",
    "author": "@nitachondria",
    "author_channel_id": "UCsjT4RIDkaqWmmcwjHAiymw",
    "text": "thank you for making the educational video and speaking up for Palestine ❤️🇵🇸🍉",
    "like_count": 395,
    "published_at": "2023-11-27T23:58:59Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgyzBG9KJ4zxJ0rvq1V4AaABAg.9xdJChqYRDJ9xkOJEFOp_l",
        "author": "@jeffersonclippership2588",
        "text": "What does the watermelon mean? I've been seeing it a lot recently w/ pro-palestinian stuff",
        "like_count": 8,
        "published_at": "2023-11-30T17:58:15Z",
        "is_reply": true
      },
      {
        "id": "UgyzBG9KJ4zxJ0rvq1V4AaABAg.9xdJChqYRDJ9xkjmk4TmA0",
        "author": "@scholarssolutions6735",
        "text": "@jeffersonclippership2588it’s a symbol for Palestinian freedom. Israel tried to ban the Palestinian flag because their fragile politicians couldn’t stand the idea of Palestinians wanting basic human rights. So since the watermelon has similar colors it became a symbol for Palestine.",
        "like_count": 18,
        "published_at": "2023-11-30T21:14:39Z",
        "is_reply": true
      },
      {
        "id": "UgyzBG9KJ4zxJ0rvq1V4AaABAg.9xdJChqYRDJ9y9XNzrJwDy",
        "author": "@KaylaJones2000",
        "text": "Day 1: Palestinian cowards dancing, singing, celebrating and cheering for hamas for what they called \"VICTORY\". Day 2 onwards: Crying like babies and seeking for help, lmao. Israel has a right to exist and has a right to defend itself. Hamas should never have started something they couldn’t finish 🇮🇱. There wouldn't be any borders or fences if gaza wasn't a terror base, and that's a fact, whether you like it or not.\nIn the 90s, many Israeli jews supported 2 state solution. In 2000, when Ehud Barak offered a generous offer (in Israeli eyes) and was answered with the second intifada, many Jews stopped believing it is possible. In 2006, after Gaza was returned to arab hands, and Hammas rose into power and started bombarding Israel instead of trying to build Gaza, many more lost faith in the the 2 state solution. Now, after 7.10, good luck in finding any Israeli that would consider it.",
        "like_count": 0,
        "published_at": "2023-12-10T21:37:48Z",
        "is_reply": true
      },
      {
        "id": "UgyzBG9KJ4zxJ0rvq1V4AaABAg.9xdJChqYRDJA28Wq8r4aML",
        "author": "@tysondennis1016",
        "text": "@KaylaJones2000Can you stop repeating the same hateful talking points word for word?",
        "like_count": 1,
        "published_at": "2024-04-12T18:50:46Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw7UtC51zK4Y1J8TA54AaABAg",
    "author": "@suliim",
    "author_channel_id": "UCarDhV_mw32pJJVR5AdN7RA",
    "text": "Your father's message hit me close to heart. I appreciate your voice and integrity under this colonial pressure. Free Palestine",
    "like_count": 48,
    "published_at": "2023-12-03T09:36:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxH6pM1sD3pW8IVkDh4AaABAg",
    "author": "@somethingsinlife5600",
    "author_channel_id": "UCL8n3R3JhFlfTzydnEz88Ng",
    "text": "Excellent video. We need people who can speak to show the rest that it's okay to speak.  The more silent people are when witnessing atrocities, the worse it gets.",
    "like_count": 47,
    "published_at": "2023-11-28T03:06:09Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwtf2_XH0eCDC0MRbF4AaABAg",
    "author": "@chargoond",
    "author_channel_id": "UCf3c_LO12Eoox1050IohtxQ",
    "text": "Brilliant video Olay ❤ I’m an American who’s half Jewish half Presbyterian, and it’s been a struggle  trying to explain this to my Jewish mother; I grew up in a strict father conservative family model where in my father was quite antisemtic despite my mothers’ background.  We’re working on it ❤️ I appreciate the support. Love you lots ❤️❤️❤️",
    "like_count": 224,
    "published_at": "2023-11-28T00:12:38Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "Ugwtf2_XH0eCDC0MRbF4AaABAg.9xdKldnNLpn9xdKtwpNqGU",
        "author": "@olurinatti",
        "text": "🥹❤️❤️❤️",
        "like_count": 33,
        "published_at": "2023-11-28T00:13:46Z",
        "is_reply": true
      },
      {
        "id": "Ugwtf2_XH0eCDC0MRbF4AaABAg.9xdKldnNLpn9xkEZnPZhsf",
        "author": "@abdul-rahimdahman3300",
        "text": "Hi! Palestinian American here. Wanted to just lyk that your actions are very much appreciated, and that we are also trying to combat the bias that exists amongst our elders as well. \n\nI'm constantly sharing advocacy from JVP and IfNotNow with my mom, and she has gone from an understandable \"the Jewish community would never support us, don't trust them\" to understanding that Jewish allyship and love does exist. She still tells me to be careful when dealing with Jewish orgs, part of that lingering bias, but like you said, we're working on it. Cheers ✨",
        "like_count": 19,
        "published_at": "2023-11-30T16:33:08Z",
        "is_reply": true
      },
      {
        "id": "Ugwtf2_XH0eCDC0MRbF4AaABAg.9xdKldnNLpn9yBo5Ynx8z1",
        "author": "@InspiredByEbonyLove",
        "text": "@abdul-rahimdahman3300African American Jew here. Give yo mama my love and tell her that there are Jews who love God, love our Palestinian friends, and we KNOW that many of you have Jewish ancestors from the land, and we recognize and declare that what the Zionists are doing to Palestinians and in the name of Jews and the people Israel is both an appalling and egregious sin and work of wickedness and a shame to the name of HaShem. We have resisted oppression by the same system as well and we SEE YOU!! We pray for your freedom and for the establishment of a system of JUSTICE. WE AFFIRM that your lives are as valuable and precious as ours are and we do our best to speak out at the risk of threats against us by Zionists of all faiths, particularly those who claim to be religious or “ Jewish” ethnically, whatever that means. ❤",
        "like_count": 9,
        "published_at": "2023-12-11T18:51:03Z",
        "is_reply": true
      },
      {
        "id": "Ugwtf2_XH0eCDC0MRbF4AaABAg.9xdKldnNLpn9yeaNWJbXHo",
        "author": "@mianokamuru6333",
        "text": "@InspiredByEbonyLove  lol 'palestinian friends' do you know what arabs are doing to blacks in dafur, palestine, mauritania and libya ?",
        "like_count": 0,
        "published_at": "2023-12-23T08:28:23Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugyf-pdtOu4xW43B6K54AaABAg",
    "author": "@rachelbanning2909",
    "author_channel_id": "UCYKwdZWQ9k1WEeLXHGhNKKA",
    "text": "The second this popped up on my timeline I didn’t care I was in the middle of watching something else.. no thought, quick click. I’m so so happy to hear from you about this nightmare. I really appreciate the thoughtfulness you gave to pointing out how important it is to speak the truth if you can.. and that we all need to stand up.. we are much harder to take down together. Thank you, Olay.",
    "like_count": 79,
    "published_at": "2023-11-28T03:12:52Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugyf-pdtOu4xW43B6K54AaABAg.9xdeOiPQWse9xdekJ467v5",
        "author": "@olurinatti",
        "text": "🥹🥹💜💚",
        "like_count": 8,
        "published_at": "2023-11-28T03:15:57Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyHUUJolxYi2ELL6r14AaABAg",
    "author": "@jbj8580",
    "author_channel_id": "UC7rCL7jiRZtEfUPHg36EbZA",
    "text": "My child sent this video to me. Very informative and I hope it gives me the courage to speak out.",
    "like_count": 21,
    "published_at": "2023-11-28T23:22:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxXwUWyS-7VNUKe4vV4AaABAg",
    "author": "@moirajilani1",
    "author_channel_id": "UCE-jXm9mv_1xUu5dD4bCp1w",
    "text": "From Someone who lives in Occupied East Jerusalem...Thank you!!!!❤❤❤",
    "like_count": 16,
    "published_at": "2023-12-21T13:20:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyphhWjLqTvqgxtEVp4AaABAg",
    "author": "@nanoaged1",
    "author_channel_id": "UCwGRI1EgyrAeDsXkxklSCpQ",
    "text": "Yo, straight up thank you for this show. As a Marxist, any show that highlights the realities of the truth deserves to be highlighted and praised! #HastaLaVictoria",
    "like_count": 58,
    "published_at": "2023-11-28T14:51:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw1O3UICP9JPQ2leUR4AaABAg",
    "author": "@rudetuesday",
    "author_channel_id": "UCof66rvb8qukotHzgoabweA",
    "text": "Thank you for this video. I'm from St. Louis, and have family that lived in the Ferguson area when Michael Brown was killed. I've lived elsewhere for a good while, so I was on Twitter and other places online, looking for information. Those messages from Palestine were a balm. ❤🇵🇸🍉",
    "like_count": 36,
    "published_at": "2023-11-28T03:32:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwLGiZVMsUV0vu8Reh4AaABAg",
    "author": "@TheProblem2025",
    "author_channel_id": "UCgbC_oeK1eto4_CbtYbR5Lg",
    "text": "Thank you for this, your videos are always so high quality and well thought thru I feel comfortable sharing them with friends and fam 💕\n\nwe getting ready for more protests this weekend in Australia. Stay safe everybody and see that Palestine will be free 🇵🇸",
    "like_count": 40,
    "published_at": "2023-11-28T00:17:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyRMs-mR6M-b5Atqjl4AaABAg",
    "author": "@timmcdraw7568",
    "author_channel_id": "UCNTSWPoLzzBphtzvkEoy66A",
    "text": "I’m commenting here because i want more people to see this. Thank you for this wonderful essay. \n\nI’m commenting from the art world where there is a blacklist. People are being tanked and everything they’ve ever done is being disappeared for speaking out for Palestine. I’m a jewish woman and, based on my activity on social media I’m on the blacklist too. My name isn’t Tim nor McDraw, this is anonymous. Just like everything I do now about Palestine. Not that im hiding, its just that people are being tanked sometimes just for liking things on instagram! I’m willing to die on a hill for Palestine’s freedom, i absolutely am, I just want it to be worth it. The hill i die on needs to matter. \nUntil that moment I am silenced. It’s devastating. I’m still active in other ways, without a name or identity, and im still on the blacklist, but i haven’t been dropped yet from my galleries. I think the ice under my feet is very thin. \nThis essay matters! It truly does.",
    "like_count": 23,
    "published_at": "2023-11-29T04:16:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzwGQPT9RmTHJJuJLB4AaABAg",
    "author": "@danjo2080",
    "author_channel_id": "UC_JoY3_PgWwBh8ArF_luL7Q",
    "text": "Whoa. The part about the tear gas cannisters is a great illustration of the connection between all these struggles. Solidarity forever ✊",
    "like_count": 21,
    "published_at": "2023-11-28T01:34:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxWqpw2eZQs4lLscCR4AaABAg",
    "author": "@anonymousmurphy",
    "author_channel_id": "UCwm-ebbcRcGhtJpa3D2M88w",
    "text": "Had to rewatch that last part on national gaslighting, because gahd’damn. That shit hit different as a Caribbean person.",
    "like_count": 16,
    "published_at": "2023-11-28T15:40:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyrg02ekQqyaGdu7gR4AaABAg",
    "author": "@kittywhiskers996",
    "author_channel_id": "UC0j2TfG3y3WQsNt_AST8VgA",
    "text": "Thank you for being able to use words to speak about this. I have just been crying and yelling for weeks. It is not fair for mothers, grandmothers, and children to suffer so. I feel this in my body, in my soul. I have been praying, praying, praying, this is the worse thing I have ever seen.",
    "like_count": 23,
    "published_at": "2023-11-28T13:09:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzwe1Vf16xQAdmtvBh4AaABAg",
    "author": "@JacobW567",
    "author_channel_id": "UC9mX7tY1mJq4FJtauUNDjIw",
    "text": "We have the same saying in Arabic \"a liar is a thief\"...",
    "like_count": 13,
    "published_at": "2023-11-28T02:23:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzcSuUy1IgQFGuuajJ4AaABAg",
    "author": "@Bojangus-",
    "author_channel_id": "UCHS7RJr_qqbmD1I26aN4LBA",
    "text": "I had zero idea how little the amount of Palestinian land left was. I’ve been pro-Palestine for a few years now and I erroneously believed the struggle was more of two geographically equal forces pushing against each other with one far more equipped than the other- what I didn’t realize was how precarious the Palestinian position is. Wow.",
    "like_count": 468,
    "published_at": "2023-11-29T20:14:50Z",
    "is_reply": false,
    "reply_count": 12,
    "replies": [
      {
        "id": "UgzcSuUy1IgQFGuuajJ4AaABAg.9xi38fh-MDg9xv7JO7-Wgg",
        "author": "@Jimmy1982Playlists",
        "text": "🎯💯✊🏼",
        "like_count": 13,
        "published_at": "2023-12-04T22:01:22Z",
        "is_reply": true
      },
      {
        "id": "UgzcSuUy1IgQFGuuajJ4AaABAg.9xi38fh-MDg9y-Ow6oadQL",
        "author": "@nullvoid9001",
        "text": "I was in the same spot and had the same reaction when I saw the amount of land. It's something so shocking and immediately sobering. Especially with how the land in the West Bank isn't even one solid connected piece. Something like that is so radicalizing and undeniable when confronted and I feel like if someone who looks at that and THAT isn't enough to get them to reconsider their Zionist position, then there's no hope!",
        "like_count": 0,
        "published_at": "2023-12-06T23:11:33Z",
        "is_reply": true
      },
      {
        "id": "UgzcSuUy1IgQFGuuajJ4AaABAg.9xi38fh-MDg9y9WxKUpWq6",
        "author": "@KaylaJones2000",
        "text": "We supported your liberation to gain your gratitude and friendship, but you have betrayed us. Being pro Israel to us is like being pro blk to you. It's in our blood.",
        "like_count": 2,
        "published_at": "2023-12-10T21:34:01Z",
        "is_reply": true
      },
      {
        "id": "UgzcSuUy1IgQFGuuajJ4AaABAg.9xi38fh-MDg9yAcSdAUyja",
        "author": "@hairymcnipples",
        "text": "​@KaylaJones2000who supported the liberation of black people? Certainly not Israel, who were one of the last countries to give up their support of apartheid south Africa and who have a long history of sterilising black women without their consent, among many, many other evils.",
        "like_count": 0,
        "published_at": "2023-12-11T07:50:06Z",
        "is_reply": true
      },
      {
        "id": "UgzcSuUy1IgQFGuuajJ4AaABAg.9xi38fh-MDg9yCg5Sq5S32",
        "author": "@ranxerox76D",
        "text": "generally countries do not get bigger when u lose wars.",
        "like_count": 4,
        "published_at": "2023-12-12T03:00:22Z",
        "is_reply": true
      },
      {
        "id": "UgzcSuUy1IgQFGuuajJ4AaABAg.9xi38fh-MDg9yeWP8ujxSA",
        "author": "@user-qq6rr2je4q",
        "text": "Gaza was part of Egypt and West Bank was part of Jordan. Palestinians have been mostly driven out from where they lived before the creation of lsrael",
        "like_count": 3,
        "published_at": "2023-12-23T07:44:55Z",
        "is_reply": true
      },
      {
        "id": "UgzcSuUy1IgQFGuuajJ4AaABAg.9xi38fh-MDgA2AlIoJLpJp",
        "author": "@witherschat",
        "text": "I googled a map of the region out of curiosity a few days ago. I was shocked by what I saw. I think everyone should see a map of the area before speaking about it.",
        "like_count": 1,
        "published_at": "2024-04-13T15:44:23Z",
        "is_reply": true
      },
      {
        "id": "UgzcSuUy1IgQFGuuajJ4AaABAg.9xi38fh-MDgA3A3b0YTSRG",
        "author": "@k2a2l2",
        "text": "⁠@KaylaJones2000 “we supported your liberation” uhh liberation from who then? the oxford dictionary definition of liberation is “the act of setting someone free from imprisonment, slavery, or oppression”. so you oppressed people for decades with occupation while stealing their homes but then claim you support their freedom? the only way to do that is to stop what israels been doing for decades and thats what people have been protesting for but israels in no way interested in this.",
        "like_count": 0,
        "published_at": "2024-05-08T05:45:11Z",
        "is_reply": true
      },
      {
        "id": "UgzcSuUy1IgQFGuuajJ4AaABAg.9xi38fh-MDgA3CE8mAseoH",
        "author": "@jeremygardner5987",
        "text": "@KaylaJones2000Zionists did not support black liberation.",
        "like_count": 1,
        "published_at": "2024-05-09T01:55:47Z",
        "is_reply": true
      },
      {
        "id": "UgzcSuUy1IgQFGuuajJ4AaABAg.9xi38fh-MDgA3S8-MHX_f5",
        "author": "@jeremygardner5987",
        "text": "@SamBourgeois-mr4hq taking the actions of individuals into account, even influential individuals, does not erase the cooperative actions of the state of Israel, its many capitalist attaches, Mossad and US intelligence, in the active opposition to black liberation movements the world over on the basis of anti-communism in the Cold War years.\n\nWhy is Africa still in the condition it is in? The Afro-Caribbean? Latin America? The short answer is the United States and it’s imperialist Allies did everything in their power to prevent unity and growth in these movements.\n\nI’m not coming at this from a US centric perspective.",
        "like_count": 0,
        "published_at": "2024-05-15T06:09:55Z",
        "is_reply": true
      },
      {
        "id": "UgzcSuUy1IgQFGuuajJ4AaABAg.9xi38fh-MDgA3S8SXkaqoD",
        "author": "@jeremygardner5987",
        "text": "@SamBourgeois-mr4hq not looking at this from only a US pov. Zoom out fam.",
        "like_count": 1,
        "published_at": "2024-05-15T06:13:54Z",
        "is_reply": true
      },
      {
        "id": "UgzcSuUy1IgQFGuuajJ4AaABAg.9xi38fh-MDgA7QqvjRzhbt",
        "author": "@RemiJean86",
        "text": "@KaylaJones2000 Black people have not \"betrayed\" you. We are not anti-Jewish. Most of us want you to be prosperous and free, just not at the cost of the prosperity and freedom of the Palestinian people. There is no reason to see a desire for universal happiness as a betrayal.",
        "like_count": 2,
        "published_at": "2024-08-22T04:18:20Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwsXIHixWREn_FlpTh4AaABAg",
    "author": "@hypnoamber3248",
    "author_channel_id": "UCon-5xZrx95P0jzq1l2BM-g",
    "text": "This video is yet another excellent analysis. And I was so happy to hear from MLH because I've been interested in seeking him out after he got fired from cnn. I'm also picking up that book. \n\n\nOne thing that gives me hope is that when I was involved with the BDS movement 10 years ago there was like 20 of us and we got so much hate. To see more people speak out about this and thousands of people march makes me feel like a change is coming. \n\nThank you for this video.",
    "like_count": 22,
    "published_at": "2023-11-28T04:43:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyYt1QmqaeXzRsm1hZ4AaABAg",
    "author": "@ldgrtt",
    "author_channel_id": "UCoaH_KY5YqpitfRfQ1ZOHPA",
    "text": "This was so well written, so educational, and so entertaining to watch. Thank you for having the guts to speak up about this issue.",
    "like_count": 17,
    "published_at": "2023-11-29T04:32:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzEA0nJkgg471nyIm54AaABAg",
    "author": "@nadiaomar-i9w",
    "author_channel_id": "UCTHyzsPQ-3sv8YMan1lFmhQ",
    "text": "Your courage and fearlessness is something I wish so many would have but don’t. We live in a world of selective advocates and fake humanity, so I truly find this episode refreshing. Thank you from the bottom of my heart. \n\n-your Palestinian sister ❤️",
    "like_count": 14,
    "published_at": "2023-11-30T16:48:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzjKfSxaSN5X8lqVMt4AaABAg",
    "author": "@victorhart5198",
    "author_channel_id": "UCBFANiWAXLi_utqfGzUoqtg",
    "text": "Thank you so much for this video Olay. Your hard work is so important, we are fortunate to have you.",
    "like_count": 17,
    "published_at": "2023-11-28T00:42:36Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwWyjcvVjnU0fPcKSl4AaABAg",
    "author": "@jessicawalton3497",
    "author_channel_id": "UCHL8ymBCZIRyXn6EFwKOvdQ",
    "text": "Thank you for covering this. I value your unbiased reporting as well as your opinions. \n\nI was hoping to send money to support your channel here, but it doesn't doesn't give me the option 😔",
    "like_count": 61,
    "published_at": "2023-11-27T23:42:23Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgwWyjcvVjnU0fPcKSl4AaABAg.9xdHJ7FE-MC9xdHRh-40Xy",
        "author": "@olurinatti",
        "text": "Thank you so much boo! I have a cashapp $oolurin11",
        "like_count": 27,
        "published_at": "2023-11-27T23:43:34Z",
        "is_reply": true
      },
      {
        "id": "UgwWyjcvVjnU0fPcKSl4AaABAg.9xdHJ7FE-MC9xdJOEQp86R",
        "author": "@jessicawalton3497",
        "text": "I'll send it through my partner's cashapp. It's not much, but we want to support you when we can!",
        "like_count": 16,
        "published_at": "2023-11-28T00:00:34Z",
        "is_reply": true
      },
      {
        "id": "UgwWyjcvVjnU0fPcKSl4AaABAg.9xdHJ7FE-MC9y6EOxXkIc_",
        "author": "@treadstoned9915",
        "text": "​@olurinattiArab slave trade 1400 yrs (way before Europe btw)",
        "like_count": 0,
        "published_at": "2023-12-09T14:54:11Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugyd6iO8HaN0KFz9RBd4AaABAg",
    "author": "@bojassem12",
    "author_channel_id": "UC8b-9v5HTVVJbjhccz-MTmQ",
    "text": "Thank you so much for this great video!\nGrowing up as an arab I would see the atrocities commented by Israel and US in Palestine, Iraq, and so many other middle eastern countries, but  it felt like the rest of the world was silent.\nIt is heart warming to see more people standing up for the Palestinians, especially for other marginalized people. Like you said our struggles are all connected! This conflict has been going before I was born and I really hope the Marc is right about it ending our life time, I'm cautiously hopefully now.\nFree Palestine! All the power to all the people!",
    "like_count": 15,
    "published_at": "2023-11-28T20:05:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzXE4WV12U4vlqk7VJ4AaABAg",
    "author": "@muaidk8511",
    "author_channel_id": "UC2NF7BWAUn_W1vNQ6hqAwAw",
    "text": "I’m not black or Palestinian but this made me cry, and I rarely cry.\n\nWe should always stand with justice for Black, Palestinian, Jewish and every oppressed person everywhere. We stand with humanity no matter what. \n\nAnd yes we need to make sure we don’t ignore Congo or Ethiopia. It took us more than half a century to care about Palestine so let’s not repeat this mistake. \n\nThank you @olurinatti and @marclamonthillofficial",
    "like_count": 37,
    "published_at": "2024-04-05T23:56:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwmPA1sHdZlWxT1H2h4AaABAg",
    "author": "@MA69Supra",
    "author_channel_id": "UCusQjKHwkdHe6I5Mj1if3BA",
    "text": "Brilliant video Olay! I’m half Beirutsi Armenian, my mom’s side of the family came from Lebanon, they ended up there after the Armenian genocide (and bitch ass Britain fucked us too with splitting up land in a area they have no knowledge about.) They ended up having to move sometime in the 60s after tensions got worse. Upon looking into it turns out that was because of the Nakba in the 50s causing Palestinian displacement that flooded into Lebanon caused tensions among the religious groups. Super militant christian groups tried to get the Armenian neighborhoods to join but they didn’t, which resulted in them attacking the neighborhoods. My mom told me how at night they had to cover their windows so the lights wouldn’t give them away and they wouldn’t get bombed. I feel like so many westerners don’t see how devastating it is for people living in these colonized places and the horrors they have to endure, especially in America where being attacked is such a foreign concept to most people since it’s a reality they’ve never had to face it in a real way. And it really is true that all our oppression is interlinked, the continued genocide in Artsakh and Armenia, the tactics they used in the ethnic displacement and cleansing in Artsakh is damn near exactly what’s happening in Palestine now, shellings, white phosphorus, destroying the land, kicking people out of their homes they’ve lived in for generations, it’s all connected. We NEED to have solidarity with one another, because we are stronger together",
    "like_count": 7,
    "published_at": "2024-01-19T20:53:33Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwujWd6NBzY0CDHrKt4AaABAg",
    "author": "@Parker402",
    "author_channel_id": "UCuOneEEKNnBKir7ZWVm5mSQ",
    "text": "Your videos are always bangers. Very informative, entertaining, and this was probably the best one in my opinion. Thank you for being so real in detailing your personal experience of wanting to cover this topic and the pressures from other people who want you and others to be safe. Marc Lamont Hill great guest too",
    "like_count": 15,
    "published_at": "2023-11-28T02:57:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxJOOKvWyBp66t6bgB4AaABAg",
    "author": "@lmaoashley",
    "author_channel_id": "UC_3vCy_oB25kouZUM1CpRwQ",
    "text": "Just found your channel from your video about transphobia harming black women. Your voice and opinions are refreshing. We as Caribbean people, who descend from the indigenous populations who were decimated and the slaves brought from Africa, are acutely aware of the evils of colonialism. \nLove from your sister from Puerto Rico. 🇵🇷 ❤️🇧🇸",
    "like_count": 8,
    "published_at": "2024-03-15T00:52:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxpCXnxMeui5sFp_054AaABAg",
    "author": "@levantineking98",
    "author_channel_id": "UCBldSvyMfogSG6gnvR0C70Q",
    "text": "I’m a new subscriber here. Loved this video, thank you for shedding light on the plight of the Palestinian people ❤️. Looking forward to watching more of your videos",
    "like_count": 44,
    "published_at": "2023-11-28T01:27:35Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxpCXnxMeui5sFp_054AaABAg.9xdTLekWSPR9xdeaYRd42a",
        "author": "@olurinatti",
        "text": "💜💚",
        "like_count": 9,
        "published_at": "2023-11-28T03:14:37Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw17ckIdCtydCDycYx4AaABAg",
    "author": "@imartin43",
    "author_channel_id": "UCQZ4KrbGhLLNqq-aXGZGDjA",
    "text": "A liar is a tief and a tief is a murderer!! Powerful thesis sis.",
    "like_count": 17,
    "published_at": "2023-11-28T03:19:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz_YUninYVD-hyt2JN4AaABAg",
    "author": "@weronikakuacz6919",
    "author_channel_id": "UC02GNjZhBbHjLfV8xRIPaqQ",
    "text": "As a person from country in Middle-Eastern Europe I want to thank you for that essay — it helped me to the great extend to understand the high stakes of being pro-Palestine in America, especially when it intersects with being Black. Hugely enlightening, thank you",
    "like_count": 161,
    "published_at": "2023-11-28T14:11:07Z",
    "is_reply": false,
    "reply_count": 10,
    "replies": [
      {
        "id": "Ugz_YUninYVD-hyt2JN4AaABAg.9xepiuX8ERj9xfNwlNWTwy",
        "author": "@warriorca8559",
        "text": "Dr. Umar is a fool",
        "like_count": 0,
        "published_at": "2023-11-28T19:18:51Z",
        "is_reply": true
      },
      {
        "id": "Ugz_YUninYVD-hyt2JN4AaABAg.9xepiuX8ERj9xq3V8Hm1RV",
        "author": "@MsRainingDays",
        "text": "What's middle eastern Europe 😅😂",
        "like_count": 3,
        "published_at": "2023-12-02T22:51:49Z",
        "is_reply": true
      },
      {
        "id": "Ugz_YUninYVD-hyt2JN4AaABAg.9xepiuX8ERj9xrIPHSZbq-",
        "author": "@weronikakuacz6919",
        "text": "@MsRainingDays in this case Poland, but also other countries like Czech Republic, Slovakia and so on",
        "like_count": 3,
        "published_at": "2023-12-03T10:21:20Z",
        "is_reply": true
      },
      {
        "id": "Ugz_YUninYVD-hyt2JN4AaABAg.9xepiuX8ERj9xrqAmx6y0K",
        "author": "@MsRainingDays",
        "text": "@weronikakuacz6919 that's interesting. So what is East Europe? Romania and Ukraine?\n\nI am European and never came across this level of granular separation. Tbh sounds to me like polish propaganda that they're not East European since the Brits made east European a slur😅",
        "like_count": 2,
        "published_at": "2023-12-03T15:25:11Z",
        "is_reply": true
      },
      {
        "id": "Ugz_YUninYVD-hyt2JN4AaABAg.9xepiuX8ERj9xtAyO1_0UN",
        "author": "@iammar1159",
        "text": "@MsRainingDays   Ignorance at its finest",
        "like_count": 0,
        "published_at": "2023-12-04T03:54:50Z",
        "is_reply": true
      },
      {
        "id": "Ugz_YUninYVD-hyt2JN4AaABAg.9xepiuX8ERj9xt_s7LMZgI",
        "author": "@weronikakuacz6919",
        "text": "Well, I had a semester long classes in my university program on Middle Eastern Europe so it’s not propaganda in my humble opinion. And yes, we were asking ourselves there and discussing if there is a justification for this term and which countries should we count as Middle Eastern Europe but still, scholars are working on the topic so I feel like you can’t just say it’s propaganda (especially singularly polish one I’d say). I recommend Milan Kundera’s essay from 1984 „The tragedy of Central Europe” if you need a starting point in debunking this „polish propaganda”",
        "like_count": 2,
        "published_at": "2023-12-04T07:41:10Z",
        "is_reply": true
      },
      {
        "id": "Ugz_YUninYVD-hyt2JN4AaABAg.9xepiuX8ERj9xtc5qy6VHL",
        "author": "@weronikakuacz6919",
        "text": "Yeah but tbh I make fun of myself now reading this as I sound like… I dunno, it’s not that serious. Call Poland Eastern Europe of you want, it doesn’t offend me",
        "like_count": 2,
        "published_at": "2023-12-04T08:00:40Z",
        "is_reply": true
      },
      {
        "id": "Ugz_YUninYVD-hyt2JN4AaABAg.9xepiuX8ERj9xtc7LLRh49",
        "author": "@weronikakuacz6919",
        "text": "Yeah but tbh I make fun of myself now reading this as I sound like… I dunno, it’s not that serious. Call Poland Eastern Europe of you want, it doesn’t offend me",
        "like_count": 0,
        "published_at": "2023-12-04T08:00:52Z",
        "is_reply": true
      },
      {
        "id": "Ugz_YUninYVD-hyt2JN4AaABAg.9xepiuX8ERj9y3VPralonX",
        "author": "@ppetal1",
        "text": "​@weronikakuacz6919 yes. It's geographically more accurate than \"The Middle East\" (actually South-West Asia). Very strange.",
        "like_count": 0,
        "published_at": "2023-12-08T13:25:08Z",
        "is_reply": true
      },
      {
        "id": "Ugz_YUninYVD-hyt2JN4AaABAg.9xepiuX8ERj9yBn-Qs8x2G",
        "author": "@InspiredByEbonyLove",
        "text": "@weronikakuacz6919I was thinking Turkey. 😅 I would have just referred to Poland as Eastern Europe.",
        "like_count": 0,
        "published_at": "2023-12-11T18:41:29Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwkbT9d1e7rc8L3q8h4AaABAg",
    "author": "@berryzem",
    "author_channel_id": "UCHSIWMH9Ju8QZSSEqg9L8GA",
    "text": "Olay I cannot thank you enough for this video. I'm a mixed Palestinian American and would like to talk a bit about my family's experience if that's okay:\n\nMy great grandparents and grandfather on my dad's side lived in Jaffa. They owned farmland. Acres of orange and olive trees. They had a house on the shore and would have cookouts/picnics on the weekend. It's a beautiful place (think a type of port city people dream of vacationing to) They lost everything when the occupation happened in '48 and my dad grew up and lived in a tiny garage in Jerusalem (the house it was attached to was owned by some relatives who offered it up for my displaced relatives to stay) with his 5 brothers, parents, grandparents, and a couple of aunts/uncles. My dad has trauma that is just...unfathomable to even talk about growing up in such extreme poverty. He literally worked as a child to help provide for the family because my grandfather was only earning up to $20 a month to feed 8 people. When my dad was 20, he had to go to Jordan to get a passport to even come to this country because he had no country. Palestine isn't even considered a country. That's just scratching the surface.\n\nAfter becoming a US citizen, my dad refused to pay taxes because he knew where the government sent that tax money. How could he send money to the people who were the very reason his family suffered and are to this day still suffering so much?\nHe almost went to jail after being audited by you know who. My mom wasn't about to let that happen so she often would work 60-80 hour weeks to help pay that off. Didn't exactly do me and my siblings many favors having our parents working so hard all the time and constantly burnt out, but we made it. I, as a child at the time, couldn't understand it. Now I do. You can imagine how pissed I was when that report came out the previous president paid less than $800 in taxes in that year meanwhile my family had to pay tens of thousands of dollars in the early 2000s. \n\nI definitely can say with absolute certainty that growing up in this country has felt like being an unwilling participant of a life-long gaslighting experiment. Truthfully, I wasn't even expecting a portion of the support that has been outpouring over the world for Palestine when I first heard about what began in October. You just kind of...get used to people just sweeping it under the rug when the news is loud and clear where their support lies, you know? Growing up, I didn't have the resources like the internet to find out that Malcom X, the Black Panthers,  Nelson Mandela, and so many more people supported Palestine (I grew up in a mid-low income neighborhood. Decent internet wasn't even available to me until 2010) so it felt so...isolating. I've never been so happy to have been proven wrong over the years.\n\nFrom the bottom of my heart, I thank you. Thank you for taking the time and the risk to think of us (I know you had another video about voting you wanted to make and I look forward to watching that too and the video about the Congo) and thank you for your support. I'm sending lots of love your way ♥",
    "like_count": 392,
    "published_at": "2023-11-28T06:31:17Z",
    "is_reply": false,
    "reply_count": 16,
    "replies": [
      {
        "id": "UgwkbT9d1e7rc8L3q8h4AaABAg.9xe05zxFz0c9xepGihz9IV",
        "author": "@The_Mighty_Red",
        "text": "Thank you for telling us some of your family's history. All my love to you and your entire family ♥",
        "like_count": 44,
        "published_at": "2023-11-28T14:07:08Z",
        "is_reply": true
      },
      {
        "id": "UgwkbT9d1e7rc8L3q8h4AaABAg.9xe05zxFz0c9xfGUuaHt3E",
        "author": "@berryzem",
        "text": "@The_Mighty_Red Thank you for reading and appreciate the love. It means more than you know ♥",
        "like_count": 32,
        "published_at": "2023-11-28T18:13:44Z",
        "is_reply": true
      },
      {
        "id": "UgwkbT9d1e7rc8L3q8h4AaABAg.9xe05zxFz0c9xfJHKzk7AV",
        "author": "@olurinatti",
        "text": "🥹💜💜💜💜💜💜💜💜",
        "like_count": 34,
        "published_at": "2023-11-28T18:38:06Z",
        "is_reply": true
      },
      {
        "id": "UgwkbT9d1e7rc8L3q8h4AaABAg.9xe05zxFz0c9xnWFRlNn2V",
        "author": "@MindfulMoments1444",
        "text": "Thank you for sharing!! Sending you family healing energy!!",
        "like_count": 17,
        "published_at": "2023-12-01T23:05:22Z",
        "is_reply": true
      },
      {
        "id": "UgwkbT9d1e7rc8L3q8h4AaABAg.9xe05zxFz0c9xs6gr1MXpF",
        "author": "@berryzem",
        "text": "@MindfulMoments1444 Thank you so much for taking the time to read it and for your well wishes. Sending healing energy to you too if you need it ♥",
        "like_count": 13,
        "published_at": "2023-12-03T17:58:15Z",
        "is_reply": true
      },
      {
        "id": "UgwkbT9d1e7rc8L3q8h4AaABAg.9xe05zxFz0c9xsV1WTUaFB",
        "author": "@jonlenihan4798",
        "text": "They all had farms as big as Texas, and 50 limousines apiece. Impressive, considering that the territory was, before Zionism, an impoverished backwater, thinly populated by tribal people who preyed on one another.\n\nYou came to America to take advantage of the tax-supported services: schools, hospitals, police, roads. You did not feel like paying taxes, because blah blah blah.",
        "like_count": 0,
        "published_at": "2023-12-03T21:30:55Z",
        "is_reply": true
      },
      {
        "id": "UgwkbT9d1e7rc8L3q8h4AaABAg.9xe05zxFz0c9xv6NTIT5Kt",
        "author": "@Jimmy1982Playlists",
        "text": "AMEN! I'm a mixed Lebanese-American and feel the exact same way, as does the rest of my family. Sending all my love to you all and everyone suffering in Gaza and the West Bank. 🙏🏼❤",
        "like_count": 8,
        "published_at": "2023-12-04T21:53:12Z",
        "is_reply": true
      },
      {
        "id": "UgwkbT9d1e7rc8L3q8h4AaABAg.9xe05zxFz0c9xxAqKQRG0r",
        "author": "@Princesswithaspikedtiara",
        "text": "Thank you for sharing your story.    Much love to you and your family ❤",
        "like_count": 5,
        "published_at": "2023-12-05T17:10:42Z",
        "is_reply": true
      },
      {
        "id": "UgwkbT9d1e7rc8L3q8h4AaABAg.9xe05zxFz0c9xxJv8iNi6-",
        "author": "@jenelaina5665",
        "text": "Thank you for sharing ❤",
        "like_count": 4,
        "published_at": "2023-12-05T18:30:00Z",
        "is_reply": true
      },
      {
        "id": "UgwkbT9d1e7rc8L3q8h4AaABAg.9xe05zxFz0c9y9fWbKbHxF",
        "author": "@berryzem",
        "text": "@Jimmy1982Playlists Super appreciate your love and understanding. Sending love to you and your family, too ♥",
        "like_count": 1,
        "published_at": "2023-12-10T22:57:37Z",
        "is_reply": true
      },
      {
        "id": "UgwkbT9d1e7rc8L3q8h4AaABAg.9xe05zxFz0c9y9fi1ETTCy",
        "author": "@berryzem",
        "text": "@Princesswithaspikedtiara Thank you for taking the time to read it. Much love to you and your loved ones as well♥",
        "like_count": 1,
        "published_at": "2023-12-10T22:59:19Z",
        "is_reply": true
      },
      {
        "id": "UgwkbT9d1e7rc8L3q8h4AaABAg.9xe05zxFz0c9y9fsUfmPqA",
        "author": "@berryzem",
        "text": "@jenelaina5665 Thank you for reading ♥",
        "like_count": 2,
        "published_at": "2023-12-10T23:00:44Z",
        "is_reply": true
      },
      {
        "id": "UgwkbT9d1e7rc8L3q8h4AaABAg.9xe05zxFz0c9yAlA96yvOu",
        "author": "@hairymcnipples",
        "text": "​@porter9276day 1 was in 1948 when over 700,000 people were ejected from their homes at gunpoint and many murdered, including people who had been offering hospitality to refugees who then violently ejected them and took their home, an act of unbelievable cruelty and violence that puts even the Israeli state's own later actions to shame. This was a cruel, genocidal act which is *still* celebrated by Zionists.",
        "like_count": 0,
        "published_at": "2023-12-11T09:06:13Z",
        "is_reply": true
      },
      {
        "id": "UgwkbT9d1e7rc8L3q8h4AaABAg.9xe05zxFz0c9yE5vqURQLx",
        "author": "@berryzem",
        "text": "@porter9276 Unnf yes, give Olay's video more traction so the algorithm can promote the video for more people to see. Thank you so much for your contribution. Truly.",
        "like_count": 3,
        "published_at": "2023-12-12T16:14:06Z",
        "is_reply": true
      },
      {
        "id": "UgwkbT9d1e7rc8L3q8h4AaABAg.9xe05zxFz0cA390Ium0Y-A",
        "author": "@JohnDorian-j7x",
        "text": "The HORROR: \"I grew up in a mid-low income neighborhood. Decent internet wasn't even available to me until 2010\"!!! Bruh... literally nobody had \"decent internet\" until 2010, lmao. You sound like you're complaining every other sentence... you're complaining that your dad had to pay taxes, you're complaining that your parents had to pay off back taxes owed, you're complaining that you had to live an average low to middle income life, you're complaining that you 'have' to live in the US as if its some sort of demented science experiment... just complaining, complaining, complaining. Man up dawg, holyshyt",
        "like_count": 0,
        "published_at": "2024-05-07T19:57:07Z",
        "is_reply": true
      },
      {
        "id": "UgwkbT9d1e7rc8L3q8h4AaABAg.9xe05zxFz0cA6le9P8GWnZ",
        "author": "@MsBinnyb",
        "text": "God Bless you and your family to the sea Palestine 🇵🇸 will be free ✊🏾✊🏾✊🏾✊🏾",
        "like_count": 1,
        "published_at": "2024-08-05T18:58:38Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwKxMc-TpTmbMrHbH54AaABAg",
    "author": "@GiuseppeMacaluso-fg4zv",
    "author_channel_id": "UCHx_ZkV46V1AdALf_94G5FA",
    "text": "I can't tell you how thankful I am for this video, not enough creators I follow have spoken on this and it needs to be talked about more.",
    "like_count": 12,
    "published_at": "2023-11-28T20:57:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwARPOSOUkSSSm00Ph4AaABAg",
    "author": "@Yahabibiyarasul",
    "author_channel_id": "UCPv5bn1dfNvPqwZCHJnOTkw",
    "text": "We appreciate you for your courage and bravery and using your platform to speak out against the tyranny of the Israeli terrorist state.",
    "like_count": 14,
    "published_at": "2023-11-29T03:19:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxmrwwOBolLZlYHmjd4AaABAg",
    "author": "@TearXstar",
    "author_channel_id": "UCQXR-fhq-AK3F4Ax6zYKe5g",
    "text": "This is a fantastic video, thank you for using your platform to bring awareness on whats happening. One problem i'm having though; I went to look for the full Malcom X speech, \"The Palestinian struggle is not just a cry for justice, it's a blistering battle for the most fundamental human rights,\" from 1964, but I can't seem to find the original speech anywhere, and every article including it seems to be only a month old and referencing the tiktok.\n\nA few places are claiming it to be AI generated. One youtube channel has a video called \"The Viral Malcom X Speech on Palestine is not real\" and seems to debunk it in the description, noting inconsistencies with his use of language and historical dates, and claiming to have confirmed that the creator wrote it themselves and used AI to mimic Malcom X, falsely attributing it to an article Malcom X wrote called \"Zionist Logic.\" The problem is that they don't identify who the original creator is and comments are off so I can't ask them. \n\nI know for certain Malcom X has spoken about and been to Palestine, but I'm not sure if this speech was real? If anyone can help me track down the original speech that'd be wonderful!!",
    "like_count": 7,
    "published_at": "2023-12-23T01:18:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxa0N7Wa-kvH5v6DNx4AaABAg",
    "author": "@NaderNabilart",
    "author_channel_id": "UCLfB7lvLsjmTWdGoy5p-tJA",
    "text": "I've been following Olay for a while and completely understand the hesitation every marginalized voice have battled with before talking about Palestine. Building bridges between our common struggles will eventually knock down the walls that keep us segregated and far from creating a critical mass movement against our oppressors.\nBeen following closely Black American activism ever since Ferguson 2014 and felt the tectonic shift after George Floyd in 2020 suddenly everyone in Arab communities in the middle east and in diaspora are strongly vocal about Black liberation and racism in the West. Probably read hundreds of articles and posts by regular people and intellectuals, but that's not nearly enough, we need to be more vocal, create common spaces and discussions, on the ground protesting, marching, doing everything we could for our brothers.\nEssential part of this 75-year struggle for Palestinian liberation will be about educating and informing, rooting out antisemitism and racism generally and combating false narratives.\n\nBtw I'm Egyptian and Olay introduced me and lots of my friends here to a whole new spectrum of Black activists and voices and their struggles seem a lot like ours, we can learn a lot from each other.\nAll love to Olay from Egypt ❤❤",
    "like_count": 38,
    "published_at": "2023-11-28T14:22:16Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugxa0N7Wa-kvH5v6DNx4AaABAg.9xer-UN7RzK9xf4pK6n3lE",
        "author": "@olurinatti",
        "text": "🥹🥹🥹💜💜💜💜",
        "like_count": 8,
        "published_at": "2023-11-28T16:31:48Z",
        "is_reply": true
      },
      {
        "id": "Ugxa0N7Wa-kvH5v6DNx4AaABAg.9xer-UN7RzK9xfOR2zuDOl",
        "author": "@NaderNabilart",
        "text": "@olurinatti 💕💕💕",
        "like_count": 3,
        "published_at": "2023-11-28T19:23:07Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxFvulQGC6bLtw2VNl4AaABAg",
    "author": "@patdrummer",
    "author_channel_id": "UC9k-tMlepaL6tmZlIqH1A0A",
    "text": "This is phenomenal! I’m going to watch this again but this time with a notepad. I feel like I just left a university lecture (I mean that in a good way).",
    "like_count": 10,
    "published_at": "2023-11-28T03:27:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyzn5hgkc5yq-ozjiJ4AaABAg",
    "author": "@Cormac_Bowman",
    "author_channel_id": "UCh-fU18KEm2KVJA9G1MYFeQ",
    "text": "Thank you Olay for discussing this ❤️",
    "like_count": 13,
    "published_at": "2023-11-28T03:18:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyvFyVtt4iAe3xCgtZ4AaABAg",
    "author": "@kbt-143",
    "author_channel_id": "UCAr2Ocfvbgkr2Fa0763gB1g",
    "text": "Black Jew here giving you my support and commenting for the algo",
    "like_count": 19,
    "published_at": "2023-11-28T14:00:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw7fZZsM_jqpMtlBu94AaABAg",
    "author": "@FinntasticMrFox",
    "author_channel_id": "UCqRukfgKf-tV8kMK7VMs_1g",
    "text": "Thank you so much for speaking up on this.",
    "like_count": 11,
    "published_at": "2023-11-28T00:26:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyhWgL8zejrjdxv9pl4AaABAg",
    "author": "@CMDR_Lani",
    "author_channel_id": "UCuBZw8o0cb_9F0fsoZNzt-Q",
    "text": "Sometimes I don't even have the words to express how much I appreciate you, Olay.",
    "like_count": 6,
    "published_at": "2023-12-02T16:49:27Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzNs4mjnzj0w4j9RwZ4AaABAg",
    "author": "@uncensoredreality",
    "author_channel_id": "UCORCkCc2aGGBS_GQbn95dMg",
    "text": "Thank you for providing a reading list towards the end!!! Much appreciated for those who want to learn more on this 🙏🏾",
    "like_count": 6,
    "published_at": "2023-11-28T21:07:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx8MLTbK8g8e8GX_DN4AaABAg",
    "author": "@VeronikaBenson",
    "author_channel_id": "UCyb7N-Z0c9k9JctK9fNltrw",
    "text": "I appreciate your guest, Marc was very nuanced and salient with his critiques. As a Jewish person I am grateful that people can simultaneously criticize Israel for its horrific actions and antisemitism and its insidious nature.",
    "like_count": 45,
    "published_at": "2023-11-30T16:54:42Z",
    "is_reply": false,
    "reply_count": 5,
    "replies": [
      {
        "id": "Ugx8MLTbK8g8e8GX_DN4AaABAg.9xkH1k6Kj1C9y6vi7TaqIo",
        "author": "@ousaxx",
        "text": "Comments like this just make me happy!\nRespect and love to all of you brave Jewish people ❤",
        "like_count": 4,
        "published_at": "2023-12-09T21:21:25Z",
        "is_reply": true
      },
      {
        "id": "Ugx8MLTbK8g8e8GX_DN4AaABAg.9xkH1k6Kj1CA390cDUtlZG",
        "author": "@JohnDorian-j7x",
        "text": "What do you think Israel should have done as a response to the october attacks, retrospectively?",
        "like_count": 1,
        "published_at": "2024-05-07T19:59:53Z",
        "is_reply": true
      },
      {
        "id": "Ugx8MLTbK8g8e8GX_DN4AaABAg.9xkH1k6Kj1CA3988H9fiRq",
        "author": "@VeronikaBenson",
        "text": "@JohnDorian-j7x something other than genocide",
        "like_count": 3,
        "published_at": "2024-05-07T21:05:34Z",
        "is_reply": true
      },
      {
        "id": "Ugx8MLTbK8g8e8GX_DN4AaABAg.9xkH1k6Kj1CA39xScOO5eB",
        "author": "@JohnDorian-j7x",
        "text": "@VeronikaBenson That doesn't answer the question. Would it have been fine if they did their normal full scale invasion of gaza to destroy hamas's main locusts of power if they were just more careful with civilian deaths and treated them decent?",
        "like_count": 1,
        "published_at": "2024-05-08T04:42:43Z",
        "is_reply": true
      },
      {
        "id": "Ugx8MLTbK8g8e8GX_DN4AaABAg.9xkH1k6Kj1CA3A3UiZwRLv",
        "author": "@VeronikaBenson",
        "text": "@JohnDorian-j7x I don’t really care about answering your question nor am i necessarily qualified to answer such a complicated geopolitical question. I don’t know the best practices of war, but I do know that almost 40 thousand people are dead and the war isn’t stopping. Israel could have acted considerably more measured in their response",
        "like_count": 5,
        "published_at": "2024-05-08T05:44:11Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugz48Ryc_IIiwkMN6R94AaABAg",
    "author": "@Jefforado",
    "author_channel_id": "UC15jIm-kk4lNxcL4thc3W0g",
    "text": "I appreciate that you provided a reading list at the end. It's helpful to have a foundation of knowledge to contextualize the the fight for Palestinian liberation. ✊🏿",
    "like_count": 5,
    "published_at": "2024-01-02T20:18:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyHrUMiiShiTERJrl94AaABAg",
    "author": "@txcats",
    "author_channel_id": "UCzuaDepqPG4d4XN6gqL72-A",
    "text": "Came from FD Signifier, instant fan! Thank you.",
    "like_count": 7,
    "published_at": "2023-11-30T17:10:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz-3wCLrP_qEBRYk7R4AaABAg",
    "author": "@Just_One_Tree",
    "author_channel_id": "UCIaA4-W7811Dt4f2hzm0Y3Q",
    "text": "Thank you for making this video!",
    "like_count": 3,
    "published_at": "2024-03-25T03:20:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxYV_kDTOBB_bwVLD54AaABAg",
    "author": "@celestialnubian",
    "author_channel_id": "UC-0_bIeHuT_6qtXst3-8cyw",
    "text": "Q: Why Americans Don’t Support Palestine\nA: AIPAC, J Street, the ADL, Media Control",
    "like_count": 6,
    "published_at": "2023-12-07T08:59:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwbxdWnb3-SnOG22BR4AaABAg",
    "author": "@squisherking",
    "author_channel_id": "UChT2qhD-7EFRNEKKuLgrUtA",
    "text": "Mark was a great guest to get for this. He explains things so succinctly! Thanks Olay this is an important issue to speak out on.",
    "like_count": 6,
    "published_at": "2023-11-28T18:45:33Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw7sxrrvSMOJ-OG7Hp4AaABAg",
    "author": "@antennafabricationstudio1289",
    "author_channel_id": "UC2B4-8ry6tRBTaDrHwKAX9w",
    "text": "your Bravery , Honesty and Integrity is an inspiration to everyone else to think for themselves and Speak up !",
    "like_count": 3,
    "published_at": "2023-12-14T00:32:38Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzKQ1He1CBFOhMMtm94AaABAg",
    "author": "@kristenr563",
    "author_channel_id": "UCQJzq8uHyCH0Rngp5fgKLeA",
    "text": "This was so helpful . Thank you !",
    "like_count": 4,
    "published_at": "2024-01-07T14:01:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw71pTvYb_EH5aVAQh4AaABAg",
    "author": "@Naeruve",
    "author_channel_id": "UCyU3cFdGk-DTU8vN5In89dQ",
    "text": "Thank you, omg thank you for this video! People need to keep speaking up because ethics is not okay, none of this is okay and the apartheid is horrifying when you start looking into it. I felt like I was loosing my mind for so long with grief ❤❤❤",
    "like_count": 6,
    "published_at": "2023-11-28T05:14:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwmHaNgQ2SAYXjIE_p4AaABAg",
    "author": "@jadorejoe",
    "author_channel_id": "UC4jbPCrbthag6TS0aEnWDRg",
    "text": "Another absolute banger! Thank you for your hard work as always in helping to educate us. Would love to hear your take on Project 2025 as well, it’s getting scary out here",
    "like_count": 8,
    "published_at": "2023-11-28T00:55:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxTIggQZs8gjffgfst4AaABAg",
    "author": "@mr_stoney2124",
    "author_channel_id": "UC2txUTjOjMNhP9UstJ32XkQ",
    "text": "Thank you for this especially the segment on international intersectionality and solidarity. Too many people believe that isolated “liberation” of just one group is all that matters and it’s such a cynical perspective to walk around with that gets us stuck.",
    "like_count": 20,
    "published_at": "2023-11-28T14:07:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx03knjyyVZKkcwipJ4AaABAg",
    "author": "@unsolvedmystery7408",
    "author_channel_id": "UCadOJ7EKA6lorgIW9BLHC9w",
    "text": "I cannot explain you how much i am thankful for your work.\nI thank you for the bottom of my heart.",
    "like_count": 4,
    "published_at": "2023-12-11T11:38:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy4UQkDv7avEyvgOup4AaABAg",
    "author": "@Wanda_M_DS9",
    "author_channel_id": "UCIS5PTFnqGHwevRgPAn_iZg",
    "text": "Powerful TRUTH!",
    "like_count": 14,
    "published_at": "2023-11-27T23:23:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyd_24WUSNVyIYbllF4AaABAg",
    "author": "@slm11484",
    "author_channel_id": "UCzVTTIb9JiMR1MnP2hwakKQ",
    "text": "Olay this was brilliant and so accessible. Thank you for approaching this from so many different angles and giving us a justice based framework from which to discuss this issue.",
    "like_count": 5,
    "published_at": "2023-11-28T06:56:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxa4iAFDlpqMiqSiMJ4AaABAg",
    "author": "@CommanderShepard-ig1tx",
    "author_channel_id": "UCVEYd8Pjp4ySFidwVJWaJCw",
    "text": "Jessie Gender sent me here. Thank you for making this very informative video!",
    "like_count": 2,
    "published_at": "2024-04-11T04:51:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzA4wkkkAMu45gs-3p4AaABAg",
    "author": "@michaellebron9425",
    "author_channel_id": "UCn-70z1vx0v4d6HueuiXHIQ",
    "text": "I really needed that part about how Jewish people being conflated with Israel was a danger to them. I believed this to be true but you were able to articulate it in that way that made it click. Israel is a threat to the historic coalition against white supremacy.",
    "like_count": 11,
    "published_at": "2023-12-01T18:05:25Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyGpSVbmeBxgIA7Qmt4AaABAg",
    "author": "@becmoss",
    "author_channel_id": "UC42imsGdZJYu7Ea2IsmkONw",
    "text": "Thank you. I haven't seen too many creators so far talk about this on youtube and while that could be partially due to the algorithm and naming the video something different. I have been doing my reading and keeping my eye on Palestine through tiktok, but it's an important issue that needs to be discussed by larger creators. Thank you.",
    "like_count": 7,
    "published_at": "2023-11-29T22:08:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwnmelYWiC34YEcywl4AaABAg",
    "author": "@BeepBoopIAmFlesh",
    "author_channel_id": "UC3_exXiRTGYHeMN3RDqdVrA",
    "text": "FD sent me here. I'm gonna send him a thank you. Great video.",
    "like_count": 5,
    "published_at": "2023-11-29T23:05:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgweYJd_XxzJkAAvC_p4AaABAg",
    "author": "@dhatroit",
    "author_channel_id": "UCPPhdmDDHpfUK5WoLiiPkVA",
    "text": "Thank you for including the congo! And the story about your dad that's real!!",
    "like_count": 6,
    "published_at": "2023-11-28T00:19:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwEr0a4eZm5axx6eVN4AaABAg",
    "author": "@Lexnyuu",
    "author_channel_id": "UCn78eR90G4BoxjVF8Yzh0wA",
    "text": "Thank you for all of your hard work and efforts in speaking up in the clearest way possible, it’s empowering",
    "like_count": 4,
    "published_at": "2023-11-29T19:14:27Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyRtR-VtrnkwPizOfR4AaABAg",
    "author": "@lucretia_macevil",
    "author_channel_id": "UCBeXafO2MCMJhj3PStpN9CQ",
    "text": "🇵🇸❤️🖤💚our struggle is their struggle.\n\nThanks for the video as always !",
    "like_count": 9,
    "published_at": "2023-11-30T00:21:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxsgFIq6-WsFisoSSB4AaABAg",
    "author": "@Stuntmandantheman",
    "author_channel_id": "UCuw_dWeybKsXey5G6JE4iEA",
    "text": "Thank you Olayemi I feel this video is extremely important for our country and the world",
    "like_count": 3,
    "published_at": "2024-04-26T23:26:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxthPzOtDzoGW9ktDF4AaABAg",
    "author": "@ja9.b73",
    "author_channel_id": "UCIN08VkLgZvpXwulrXo8WQQ",
    "text": "Thank you for your bravery in speaking out. It is a much needed reminder and inspiration to myself to be braver too.",
    "like_count": 3,
    "published_at": "2023-11-28T14:43:09Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw1AGa1PWeLgyD3cSx4AaABAg",
    "author": "@beadymore",
    "author_channel_id": "UCgOUMPM01oxbCWJlb9EXEOA",
    "text": "Very excited for the next video you mentioned here, I really don't have any idea what is happening in the Congo and it sounds like I ought to.",
    "like_count": 3,
    "published_at": "2023-12-02T18:13:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxcMAdsLsM2bg0uTKR4AaABAg",
    "author": "@ruthtrentwood3374",
    "author_channel_id": "UCFDSS7L7Y5__vSBA-obG1PA",
    "text": "I was mad when I read the title. I'm glad I stuck around.",
    "like_count": 1,
    "published_at": "2023-12-15T01:34:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw7vaEQpcYlhtzbLfF4AaABAg",
    "author": "@GalihadVancouver",
    "author_channel_id": "UCamBDiWbJnRszxTr3kOePZA",
    "text": "Amazing video Olay! Thank you so much for making it. Now I can send it to people to help them educate themselves. I also really want to say I am incredibly grateful that you're speaking out. I'm a college student right now, trying to organize as much as I can for a Free Palestine, and the environment right now is straight up McCarthyism. There's been moments where I felt like I'm the crazy one, but you're totally right! America is a nation of gaslighters. This video has helped me remember that we're on the right side of History, and they can't take that away from us. Keep doing you, Olay! I will always be a supporter ❤",
    "like_count": 5,
    "published_at": "2023-11-30T15:32:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzL982WMjJ7_pNZoUt4AaABAg",
    "author": "@AddiRockART",
    "author_channel_id": "UC8SO0vPYLOVtqDFxmjC0Ffw",
    "text": "People like to gaslight minorities in the USA… hearing you voice everything so precisely makes me feel sane again. As an lgbtq Latino I try to stay aware of what’s going on, and it feels, very often, like our voting choices are “BAD” versus “hey at least I’m not THAT guy. I ain’t gonna help you but at least I’m not them,” and since the same lobbies and incentives are floated to both sides, we tend to not get any real progress. I do think people need to really, really start holding their elect officials accountable or replace them… “business as usual” is becoming more and more uncomfortable by the day, and it would be practical to handle it before it gets wholly unbearable.",
    "like_count": 245,
    "published_at": "2023-11-28T19:57:31Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgzL982WMjJ7_pNZoUt4AaABAg.9xfSMxMIwCw9xkZAru9eRo",
        "author": "@viridianacortes9642",
        "text": "The best way to do this is by voting for every election, every primary, and every position. From the school supervisors and lowest city council members, to your members of congress. Power in a democracy goes from bottom up. Local elections make a huge impact on diminishing the power of lobbies and increasing that of the community. In my state of AZ, we’ve voted in more progressives to our local to government, and they’ve passed some good progressive bills. AZ is purple now.",
        "like_count": 17,
        "published_at": "2023-11-30T19:33:14Z",
        "is_reply": true
      },
      {
        "id": "UgzL982WMjJ7_pNZoUt4AaABAg.9xfSMxMIwCwA2xFJ3Px6KN",
        "author": "@Femyoz",
        "text": "Holding them accountable doesn't mean you shouldn't vote for them. If Project 2025 takes place, abortions will be further restricted and trans people will be legislated out of existence at a federal level. We cannot afford to have Trump in office for the sole purpose of \"holding politicians accountable.\" I should not lose my right to necessary medical care as a trans person over some vague notion of accountability.",
        "like_count": 0,
        "published_at": "2024-05-02T20:58:05Z",
        "is_reply": true
      },
      {
        "id": "UgzL982WMjJ7_pNZoUt4AaABAg.9xfSMxMIwCwA3AzrGBQOmL",
        "author": "@sigilfredogaleano6568",
        "text": "I agree.  And policy should be written to benefit all no just a few or who ever pay money the most",
        "like_count": 2,
        "published_at": "2024-05-08T14:22:57Z",
        "is_reply": true
      },
      {
        "id": "UgzL982WMjJ7_pNZoUt4AaABAg.9xfSMxMIwCwA3CDyAK2lxE",
        "author": "@jeremygardner5987",
        "text": "That’s where they got you. They convinced you they weren’t “them.”",
        "like_count": 0,
        "published_at": "2024-05-09T01:54:12Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwKquw5EQ-W-dq1Xd54AaABAg",
    "author": "@directorgumby.",
    "author_channel_id": "UCw5sAEWMlYVEU4GejUYaA9w",
    "text": "I’ve been waiting for this one your voice has proven time and time again to hold so much clarity regarding current events thank you for your work",
    "like_count": 2,
    "published_at": "2023-11-28T00:46:09Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgysapyAX2Gqfi_ZNeJ4AaABAg",
    "author": "@Antanese2Real",
    "author_channel_id": "UCw5HPWwFIecuDzeOqs_QJEg",
    "text": "Why the likes don’t match the viewers? 👍🏾 the video",
    "like_count": 9,
    "published_at": "2023-11-27T23:01:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxRelc_-Us7K7UQHOV4AaABAg",
    "author": "@marcelinegarcia4330",
    "author_channel_id": "UCCFocnIXQZBaIJdHunTXi_Q",
    "text": "Thank you for sharing and speaking up about this. I appreciate learning from you",
    "like_count": 1,
    "published_at": "2023-12-29T17:51:25Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwsBtT6pjUAoJhW9LR4AaABAg",
    "author": "@anastasiazabalueva2260",
    "author_channel_id": "UCjZrnxKV08vOVZwccTpMoPw",
    "text": "Thank you for the video, very illuminating. And a great parallel with Ukraine - perfectly showcases double standards",
    "like_count": 3,
    "published_at": "2024-03-20T03:07:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzww0GXQNBEF1LISZp4AaABAg",
    "author": "@NoGoZoon",
    "author_channel_id": "UCg9utVlWjzPRW_o72kraC5Q",
    "text": "The malcom x monologue around the 40m mark made me shed a tear. I had never heard that, thank you",
    "like_count": 1,
    "published_at": "2024-05-31T11:12:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxfCHvc54ZNCV3AsGR4AaABAg",
    "author": "@keyfiender799",
    "author_channel_id": "UCkg8KHmPETozon2sL31wSBg",
    "text": "Wow. 🤯 I can only say thank you!!!! For this documentary. I hear you speaking wisdom and history I heard from Young Black Radical activists and leaders in 2020 in Portland. This is the first time I've listened to you and I. AM. HERE. 🗣️📣 THANK YOU 🖤 ... [Palestine's National Animal is the Gazelle 🎉]",
    "like_count": 4,
    "published_at": "2023-11-29T23:12:04Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzpJTanOQMwB-uX6kB4AaABAg",
    "author": "@wadnold123",
    "author_channel_id": "UCQci1RdqU-x2Ie6yMH-rimQ",
    "text": "What a profound incredible video ❤ Thank you so much for creating this to be concise and informative and deeply honest.",
    "like_count": 2,
    "published_at": "2023-12-14T15:11:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx3I1VqC--ZAKQcfFl4AaABAg",
    "author": "@mep15067",
    "author_channel_id": "UCGI53lmBpyhDo0jszP9lbPg",
    "text": "Just found your channel today through this video, this was really well made and im glad to find a new perspective about this and was very informative. Gonna sub after this, hope you have a good day and free Palestine",
    "like_count": 3,
    "published_at": "2023-12-13T21:58:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwUkMOmpYfDWoqHbHJ4AaABAg",
    "author": "@Hermeze",
    "author_channel_id": "UCDU4mBsGtA-ho1mScXm6bmg",
    "text": "I wish that this video would reach more people, not enough people are educated on this topic and you handled it incredibly",
    "like_count": 1,
    "published_at": "2024-09-23T04:30:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxa8d_GeIW-Lp4VT114AaABAg",
    "author": "@karaoke-y4i",
    "author_channel_id": "UC517ChKOTmxJnC1Un02PIRQ",
    "text": "Im so ready for your video on the congo! Thank you for this love your work! <3",
    "like_count": 3,
    "published_at": "2023-11-28T12:32:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxy8iz7xhCACsJIyv14AaABAg",
    "author": "@icandykingkong",
    "author_channel_id": "UCRP3FqoMG9v7MG5SvZzjg1A",
    "text": "ty for this!! Im looking for your video about congo and sudan and ethiopia! can you make videos about them too? your'e definitely right that ppl haven't heard about them and they're blips in the news.",
    "like_count": 4,
    "published_at": "2023-11-28T02:01:26Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwIYyMPCZ63NKbNJ6t4AaABAg",
    "author": "@hajras",
    "author_channel_id": "UCUMW7L7duAd6-96OhB4HQvQ",
    "text": "Been waiting for this video since you were on Marc Lamont Hill’s channel!",
    "like_count": 3,
    "published_at": "2023-11-28T16:37:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw5S6cXXmCZS2e5m994AaABAg",
    "author": "@yellowbutterfly6796",
    "author_channel_id": "UCy5Z87W1CZOFEeJFTEY1h9A",
    "text": "Thank you Olay for talking about this, which i especially appreciate after hearing about the difficulties you had in making this video. i hope this reaches many people and thank you for teaching me more about it",
    "like_count": 2,
    "published_at": "2023-11-29T00:40:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw261wZrWIKn45W03R4AaABAg",
    "author": "@DrakeAndMomTV",
    "author_channel_id": "UCY5olfG15KMfiHanRzxWc-w",
    "text": "This is so good. Well done, ma’am! Thank you for your service. ❤️‍🔥",
    "like_count": 3,
    "published_at": "2023-11-29T20:54:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzkP8qVc1OKKGJwmRB4AaABAg",
    "author": "@tysondennis1016",
    "author_channel_id": "UCAIeqjzyUImAcyGmaYvwLYA",
    "text": "Never again means never again for anybody.",
    "like_count": 1,
    "published_at": "2024-04-12T15:03:04Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwsqb-wzFBJ0zo4CHR4AaABAg",
    "author": "@ZeroN1neZero",
    "author_channel_id": "UCTAy1G6KR4f2O7DKR51lzuQ",
    "text": "Time to roll up my sleeves and stop talking myself out of being a commentary creator. We need more voices to speak up now more than ever because truly no one is free until we’re all free. Thank you, Olay💖I look forward to your video on the Congo as well!",
    "like_count": 4,
    "published_at": "2023-11-28T19:39:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwiZ_gtZjfbQiCVQc94AaABAg",
    "author": "@Justgottabesaid",
    "author_channel_id": "UCD_fq2qGOjwvX6q7GUn0Www",
    "text": "Loving the objectivity you brought to this and the education! Amazing job… MLH needs to be compensated for his losses fighting this fight.",
    "like_count": 2,
    "published_at": "2023-11-28T00:48:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzHL9AEqM-9EBO9bbN4AaABAg",
    "author": "@kenjoneslee",
    "author_channel_id": "UCZwQhpAeLdhnazbeMUGkXEw",
    "text": "I saw one old video where an Israeli female Jew said in Israel, they always play the Holocaust card when addressing any criticism coming from Europe...and they play the anti-semitism card when addressing criticism from the USA.",
    "like_count": 18,
    "published_at": "2023-11-28T01:57:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx4ILOcbREiikICgu54AaABAg",
    "author": "@longlivebeans",
    "author_channel_id": "UCqfImrTpaXySvTeh4Z0eEBg",
    "text": "I feel like I’m re-living the post 9/11 Bush years & as an Arab American, that scares the shit out of me.",
    "like_count": 66,
    "published_at": "2023-11-29T15:41:49Z",
    "is_reply": false,
    "reply_count": 5,
    "replies": [
      {
        "id": "Ugx4ILOcbREiikICgu54AaABAg.9xhZu1SFB5b9xndy2xyZgl",
        "author": "@jam5533",
        "text": "That's what I was thinking, I remember hearing about how people were reacting when I was a little kid. Disturbing really..",
        "like_count": 15,
        "published_at": "2023-12-02T00:21:30Z",
        "is_reply": true
      },
      {
        "id": "Ugx4ILOcbREiikICgu54AaABAg.9xhZu1SFB5b9xyZ8UAByTv",
        "author": "@A_MapleBar",
        "text": "As a kid in the 00s, I didn't notice these things, but now I'm already noticing the long stares and dirt looks, not as an Arab but as a Muslim.",
        "like_count": 10,
        "published_at": "2023-12-06T06:02:16Z",
        "is_reply": true
      },
      {
        "id": "Ugx4ILOcbREiikICgu54AaABAg.9xhZu1SFB5bA12UKuwm0M4",
        "author": "@ConejitoPequenito",
        "text": "I hear that a lot lately 😢",
        "like_count": 3,
        "published_at": "2024-03-16T14:02:03Z",
        "is_reply": true
      },
      {
        "id": "Ugx4ILOcbREiikICgu54AaABAg.9xhZu1SFB5bA390qGqo6Q1",
        "author": "@JohnDorian-j7x",
        "text": "Bruh... don't even try to appropriate the discrimination of arab looking people post 9/11 to now... they're not even remotely comparable. Shame on you",
        "like_count": 1,
        "published_at": "2024-05-07T20:01:48Z",
        "is_reply": true
      },
      {
        "id": "Ugx4ILOcbREiikICgu54AaABAg.9xhZu1SFB5bA3L_3TR4Mia",
        "author": "@mikeg2306",
        "text": "Why is it the Arabs are always the ones starting __it? Think about that.",
        "like_count": 0,
        "published_at": "2024-05-12T17:00:28Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgziI2LfDW8WlWGW91p4AaABAg",
    "author": "@LA91Y2",
    "author_channel_id": "UC44DGQUmL8pEa4_P5Gh22UA",
    "text": "Thank you so much for making this video. It means a lot.",
    "like_count": 2,
    "published_at": "2023-12-13T01:24:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwnnapo_jaV9k4nTv94AaABAg",
    "author": "@margheriteottaviano442",
    "author_channel_id": "UCNLhXIi4XwOIOcLi5vB1WBA",
    "text": "Love your candor. Thank you for making the time. Vital work!",
    "like_count": 1,
    "published_at": "2023-12-02T14:41:26Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyC45w8iUZeWwb8NM14AaABAg",
    "author": "@AfroRemus",
    "author_channel_id": "UCKDwLtvVeb09SkSRArLgC7Q",
    "text": "This is  gold 🥇 girl 👍🏾 don't EVER stop!!!",
    "like_count": 5,
    "published_at": "2023-11-30T00:58:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgySp54pqdwFv2V2jGx4AaABAg",
    "author": "@cricketcreacher",
    "author_channel_id": "UC_u_VW5zqi5Zm5rg1xFjZMw",
    "text": "found you from twitter! this is the exact kind of content i've been trying to find but the recommended page and search bar are useless. i've subscribed and can't wait to see more, keep up the good work, it's doing good in this world <3",
    "like_count": 6,
    "published_at": "2023-11-28T02:49:33Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgySp54pqdwFv2V2jGx4AaABAg.9xdbit971Ic9xdjlLjckrH",
        "author": "@cricketcreacher",
        "text": "beautiful metaphors within ur script btw",
        "like_count": 1,
        "published_at": "2023-11-28T03:59:47Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxlxNiW3rlVzN-1ZvV4AaABAg",
    "author": "@__kiki",
    "author_channel_id": "UC8DA_8B-1nWTK154wfy1xTQ",
    "text": "Wonderful, thoughtful, well researched and well spoken video. Subscribed! Thank you!",
    "like_count": 3,
    "published_at": "2023-11-29T23:34:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzp4A92AJf41UsiOg54AaABAg",
    "author": "@MintyMido",
    "author_channel_id": "UCV_Lw3SPt2pt8nmyrqUWjtA",
    "text": "So beautifully done!! Just subbed <3 thank you for the book recommendations & I look forward to your video about the Congo!",
    "like_count": 1,
    "published_at": "2023-12-08T03:17:27Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzUCc_SPWWeI5parU14AaABAg",
    "author": "@AmericanTouristAbroad",
    "author_channel_id": "UCBDTYtb1pxPTPIVytdU9ipA",
    "text": "As soon as my Rachel Corrie video started gaining traction, it was censored. 😭Thanks for your perspective btw!❤",
    "like_count": 3,
    "published_at": "2023-11-30T17:49:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx0yc_NjGGrDZVLrbx4AaABAg",
    "author": "@mixedbeatz16",
    "author_channel_id": "UCG8pMgvrJWR0cbSNSnjPfEA",
    "text": "Thank you, for the attention, education and advocacy provided here.",
    "like_count": 1,
    "published_at": "2023-11-29T21:33:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz22idTOMs9h40fqm94AaABAg",
    "author": "@BigWoodzCBCL",
    "author_channel_id": "UCt8trLUuvci0M9n8MJr1ZqQ",
    "text": "Great work here!!! I truly hope this explodes in the algorithm so as many people as possible see it!",
    "like_count": 0,
    "published_at": "2023-11-30T18:54:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwEMtbZSDNvtJOjYVt4AaABAg",
    "author": "@beasley1232",
    "author_channel_id": "UCirxSJwsNmQpsfpmDnPKUXQ",
    "text": "This is an amazing video! Surprised it only has 74k views, ALL Americans AND Europeans need to see this!!",
    "like_count": 1,
    "published_at": "2023-12-12T22:48:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyYx5A2Rz_jO16Kzpt4AaABAg",
    "author": "@MIS315",
    "author_channel_id": "UCoGSDh9ZdZ2tiiqN3UVzddw",
    "text": "My mind and soul feel fed and quenched. We need to make this video global. Please spread it and educate those around you with this insightful information",
    "like_count": 1,
    "published_at": "2023-12-01T05:07:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugym2HxQwz8W34hNf614AaABAg",
    "author": "@ZanaharyBunziMaat",
    "author_channel_id": "UCRROHKnE8vplpXajvlNV_6w",
    "text": "The algorithm is on my side today. Your video came across my feed. Very well said. Thank you -- subscribed! <3",
    "like_count": 1,
    "published_at": "2023-12-02T03:53:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzFSnovLLdkGaatB214AaABAg",
    "author": "@purpleplumm",
    "author_channel_id": "UCWeI3L4SQq8ww7gQYDt7dng",
    "text": "thank you for your balanced and compassionate approach! ❤️",
    "like_count": 1,
    "published_at": "2023-12-24T10:48:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx8ko0OTqHD6clP-OJ4AaABAg",
    "author": "@The_Mighty_Red",
    "author_channel_id": "UC0uig_vafqEVdAU3MWSDZig",
    "text": "Love to your Father, you are so amazing and strong and radiant and I am so thankful for you. You set a great example for others and for me ❤",
    "like_count": 4,
    "published_at": "2023-11-28T13:50:21Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugx8ko0OTqHD6clP-OJ4AaABAg.9xenLqls8889xf4tREVoS-",
        "author": "@olurinatti",
        "text": "Thank you so much!🥹🥹❤️",
        "like_count": 1,
        "published_at": "2023-11-28T16:32:22Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugz5rY251flj2DZ1c554AaABAg",
    "author": "@omnipotentbanana1576",
    "author_channel_id": "UCywB96AxPewrBn4zbQBtnqQ",
    "text": "Great essay, this issue is hard to explain concisely, but you did a great job",
    "like_count": 0,
    "published_at": "2023-12-20T17:02:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxD-KPu_2Opv6TZTmh4AaABAg",
    "author": "@drewmcgill5290",
    "author_channel_id": "UCHC3qvYWux64_fF3JV9nA2A",
    "text": "Incredible production! Great job :D",
    "like_count": 1,
    "published_at": "2023-12-01T17:19:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyM1gll9Zvn9c5pm9N4AaABAg",
    "author": "@eddyvldez14",
    "author_channel_id": "UC6WaNUCreVu6kqU2a_o-r6g",
    "text": "Sad video but glad you made it",
    "like_count": 2,
    "published_at": "2023-12-14T01:00:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxm3ffctafVmEdferN4AaABAg",
    "author": "@aaronstewart3352",
    "author_channel_id": "UCnAo9YDJ-Z2fTDwe12eTYcA",
    "text": "Olay, you had me in tears, particularly at the very end when you added the national animals of Palestine, bc it humanized them, which has continued to be absent from the convo. I’ve been bashing my head against the wall for years advocating on this issue, but it gives me hope that so many more people are coming at this thoughtfully, rationally, and from knowledge, from the perspective of all sides. Kudos.",
    "like_count": 37,
    "published_at": "2023-11-28T01:38:38Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugxm3ffctafVmEdferN4AaABAg.9xdUbWj3VqD9xdeWvEqKwP",
        "author": "@olurinatti",
        "text": "💚💜💚",
        "like_count": 2,
        "published_at": "2023-11-28T03:13:59Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgztN9BAMazD72-3bJl4AaABAg",
    "author": "@Wonderingmillenial",
    "author_channel_id": "UCrDlllwl73uMxRwLz8-bVLg",
    "text": "4:39  lol! You don’t go to a thief to claim what isn’t yours!",
    "like_count": 1,
    "published_at": "2023-12-25T23:52:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyxL9yrwtHwQmkPeS14AaABAg",
    "author": "@UdochiOkeke",
    "author_channel_id": "UCSiKPrt8CD49eH_gk0pphMw",
    "text": "I came here from F. D. Signifier's share. I didn't know you existed. You've got a lot of great videos. this video is amazing! Very well made. I'm subscribing. I recently started watching videos from people like Dr. Nicole Truesdell and Donnellwrites. Donnellwrites had a really good breakdown on Zionism and American Evangelical Christianity White Supremacist ideology. Watching that and then following up with this video is a really powerful follow up. I really hope the powers that be don't start censoring more aggressively, because... the truth is being spoken. And I am here for it!",
    "like_count": 3,
    "published_at": "2023-11-30T01:32:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy1EJJD6pD4kDbKSVN4AaABAg",
    "author": "@Who-en2vo",
    "author_channel_id": "UCISPMYEBiluF6r0EGqGVTAw",
    "text": "So glad to find you on here and your take and thorough analysis. YT algorithm did good today 🎉",
    "like_count": 0,
    "published_at": "2023-12-01T00:48:20Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwGtLGi-sXTGxgM0pJ4AaABAg",
    "author": "@ayaya173",
    "author_channel_id": "UCTn1Nugb7JkRyr5QcVkgeHg",
    "text": "Amazing work, and I'm not even halfway through. Will come again for this channel.",
    "like_count": 2,
    "published_at": "2023-11-30T05:44:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugye2t1TZTXTeFWeTAN4AaABAg",
    "author": "@pennycheshire5608",
    "author_channel_id": "UCnCS48jO0Xk8FufTVzaVOLQ",
    "text": "Thank you for this Olay 🙏🏻 you never miss!",
    "like_count": 3,
    "published_at": "2023-11-28T00:43:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyStYFJ02eEarRY91Z4AaABAg",
    "author": "@kayleejade7227",
    "author_channel_id": "UCC1hqV0pBE8BvZKJ7edYBaA",
    "text": "thank you so much for putting this video togethr. thank you for putting your voice in to this. your voice matters. you matter. thank you.",
    "like_count": 0,
    "published_at": "2023-12-02T02:24:09Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgweW92ThGHkqidnVtN4AaABAg",
    "author": "@lancevoltron3585",
    "author_channel_id": "UC2OqvB3OQ3qXDvVSUlds1cQ",
    "text": "Thank you for the this video. It made me consider some things I hadn't given proper thought to before.",
    "like_count": 0,
    "published_at": "2023-11-28T00:56:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxSSmNDzspqZkSedhd4AaABAg",
    "author": "@mexistential",
    "author_channel_id": "UCLM0GSL4zctCG0WVgs90IKg",
    "text": "Thank you for having such a principled stance and continuing to speak despite the consequences! I love your work and hope to see your channel grow.",
    "like_count": 2,
    "published_at": "2023-11-29T00:54:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxyBtUzd1vo5RoTN_54AaABAg",
    "author": "@canyounot4814",
    "author_channel_id": "UCZYmZGE9VdQGxlifqqhho5Q",
    "text": "Amazing video! I see your tweets promoted to me all the time but I had no clue you made such excellent YouTube videos",
    "like_count": 0,
    "published_at": "2023-11-30T16:26:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyDcFJivASbZf4LKih4AaABAg",
    "author": "@stephengreen-dowden9068",
    "author_channel_id": "UCuOGnfzpkIdHlpB1zek-TLQ",
    "text": "Greetings Olay, this is beyond a great video!! I'm glad there are others out there who are not attached to legacy media speaking out on this issue. I've said many times, love girl!!❤",
    "like_count": 3,
    "published_at": "2023-11-28T14:53:20Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzqs8gWy3QQAp9CjAp4AaABAg",
    "author": "@MissEliza99",
    "author_channel_id": "UCikewnIsJ-HPinfNVK5NJVQ",
    "text": "Excellent work, as always.   Thank you for the book recommendations.",
    "like_count": 0,
    "published_at": "2023-11-30T13:16:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyz8wYIXy9KaGO3pc94AaABAg",
    "author": "@maximilius22",
    "author_channel_id": "UC32jdZUS-NJOmXydOOZuCRg",
    "text": "Thank you so much for giving the oppressed a voice",
    "like_count": 3,
    "published_at": "2023-12-16T01:09:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzwKiSyg7uBWqCgpuR4AaABAg",
    "author": "@dl2725",
    "author_channel_id": "UCaXLwQ59fjIqKJ32HYpePaQ",
    "text": "Thank you for this, Olayemi. I’m looking forward (with dread, of course) to what you can teach about the genocide in Congo",
    "like_count": 4,
    "published_at": "2023-11-29T05:50:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzWzq779QwqjsVq3Bd4AaABAg",
    "author": "@victoriaaar",
    "author_channel_id": "UC48sea63jytEvYohpToS6aw",
    "text": "Phenomenal video!! Just found ur channel but I'm subbed",
    "like_count": 2,
    "published_at": "2023-11-28T14:12:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwRiea9kK4gbnrmrNl4AaABAg",
    "author": "@flowerhead44",
    "author_channel_id": "UCIKH9wQUeJL5MiFjcdEMW0g",
    "text": "The last minutes oof. we need to have this talk, I hope to see more people talking about this on social media.",
    "like_count": 2,
    "published_at": "2023-11-28T00:57:36Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxrcQgVUztIfBRKgcZ4AaABAg",
    "author": "@aye3678",
    "author_channel_id": "UCiQKMTj_lZABDL-D2R_5xtw",
    "text": "Brilliantly put together. Thanks for sharing.",
    "like_count": 0,
    "published_at": "2023-12-02T14:04:25Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxbpb42Ma2AZOq9OsR4AaABAg",
    "author": "@Bee-kz1ei",
    "author_channel_id": "UCHLxT635N9YJZ5e4Peb9KBA",
    "text": "Thank you for this video. Your insight & compassion on this issue are so, so appreciated. Something I have noticed is the support for Palestine has turned to support for the Congo, to Ethiopia, to Myanmar, to Yemen. The reaction of our elected officials has led many to believe that we have no voice, that we have no say in how our countries are run. But we do. We do in spite of government. Keep speaking up, keep screaming. None of us are free until all of us are free.",
    "like_count": 20,
    "published_at": "2023-11-28T14:08:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwPYVl3pe0DB5wRb_p4AaABAg",
    "author": "@madalyndrewno5280",
    "author_channel_id": "UCY1ce0-Pqr5gcvdfLgYXLvA",
    "text": "I just found your channel, and I want to say thank you so much for speaking on this. There are so many people online and in my life who I thought would stand up against the gcide and propaganda but have remained silent. Thank you for your integrity!",
    "like_count": 1,
    "published_at": "2024-04-10T18:10:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzTyAFfA_WHcU2ewhZ4AaABAg",
    "author": "@mpeekay76",
    "author_channel_id": "UCg9av98CZkUWcB0bObhCl8w",
    "text": "I'm with Dr Umar on this one. I'm from the country Dr Umar mentioned. The events in Gaza coincided with the fact that for the first time in 3 decades my country was fighting back against an American backed unrest that saw the death of more than 10 Million Congolese people. In color, in full HD but in silence. I have never seen an Israeli, a Palestinian or even a Ukrainian cry for my people or denounce what happened to them..I'm not saying that I want y'all to do the same and worry about the Congo. I'm saying we have our own problems to worry about. The best I could contribute in what's happening In Palestine is that if it looks, walks and smells like  genocide. Don't let them gaslight you into telling you otherwise. They are getting exterminated. Other than that I believe American sensationalism makes us think that we need to have a loud opinion on everything and get involved in everything. I refuse to be the hero of other people's problems while we been fighting our own by our lonesome for centuries.",
    "like_count": 3,
    "published_at": "2023-12-13T11:09:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyn2VVITt8_aFt-MV14AaABAg",
    "author": "@kimpacheco8466",
    "author_channel_id": "UCVJQDoCa9Xi9CJJDDQ76VXw",
    "text": "Thank you so much for covering this.",
    "like_count": 2,
    "published_at": "2023-11-29T00:19:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzZQ9k5-NTUmc1n5xJ4AaABAg",
    "author": "@voltage80x",
    "author_channel_id": "UCn5GCVIYETrSvAw_0T-wKWg",
    "text": "I'm an American. I've never felt more helpless in a situation. I feel my mental declining sharply. I feel bad for even caring about that with all that is going on. I feel like not paying attention is hurting them, but paying so much attention is destroying me.",
    "like_count": 6,
    "published_at": "2023-11-30T14:40:35Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzZQ9k5-NTUmc1n5xJ4AaABAg.9xk1gRq8mU-9xmrS5R5PdI",
        "author": "@pbjmochi8400",
        "text": "It may SEEM hopeless, but there is hope. There always is. I've seen more support in protests from around the world than ever before. Yes, people are being censored for speaking out, but they're still speaking out. I will continue to speak out.\n\nPay attention to what's going on, but pay attention to your mental health, too! Genocide is incomprehensible to the human brain by design. It normalizes death to the point of learned helplessness. Do not give in. Remember: look for the helpers. Look for those who resist injustice. Look for those who find joy in spite of everything.*\n\n*To clarify: this isn't advocating for inspiration porn. That's self-centered and gross. What I AM advocating for is understanding that kindness and resistance is just as human as our capacity for cruelty, if not moreso. Hatred is learned. It can and should be unlearned.",
        "like_count": 0,
        "published_at": "2023-12-01T17:00:05Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzKXC-R7kw4vzsiHnV4AaABAg",
    "author": "@sameenj6095",
    "author_channel_id": "UCBv9n_nfJSll5nvVmY2lmIg",
    "text": "Thank you for speaking on this. Amazing amazing video essay. I learned a lot. ❤❤❤❤",
    "like_count": 0,
    "published_at": "2023-11-30T19:52:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzL7R5_Aee-Dsek1cF4AaABAg",
    "author": "@Jammoud",
    "author_channel_id": "UCoAjUA67KD9WY2B-LrmvCvA",
    "text": "God thank you so much for this. My family’s first gen from lebanon moved to Tennessee at a young age man. Growing up has been a constant disillusionment of america - laden with hypocrisy and  islamophobia. I always felt weak feeling that it was so hard being arab/muslim in the USA - but given the uptick in awareness and vids like this make me feel sane and put words to feelings i’ve felt my whole life.\n\nwhat i realized is that the average white american has no original opinions - faux performative caring but will always default to ideas and subconscious racist beliefs the minute it threatens their feeling of entitled status as the normal, salient race. This uptick in palestinian erasure has revealed to me who in my life truly do and don’t get it - most white people think they get it and are being open minded, but rarely actually peek beneath the surface of their conditioning to see the true nature of what is going on. The arab has been a convenient boogey man for all of western society, the arab and “the orient” have and will always be a great device for western people to justify hatred of a group and assurance of their own values. The average american wants to think that they’re agents in their decision making and have moral world views, but they remain under the thumb of media and ideologies that trigger their emotions and create a false sense of threatening of their position as the the dominant race. \n\nnothing scares the dominant people than the oppressed group becoming aware and empowered",
    "like_count": 6,
    "published_at": "2023-12-01T19:35:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgypWOC2xqRQicjnV-94AaABAg",
    "author": "@justjess6636",
    "author_channel_id": "UC7KRsCAiAhcXKOogUdYxZmA",
    "text": "Thank you. It's so frustrating to the point of tears how careless people really are about this issue.",
    "like_count": 0,
    "published_at": "2023-12-01T15:38:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw_bZPEd6ONugSaD1J4AaABAg",
    "author": "@wirelessbaguette",
    "author_channel_id": "UC_LAbnPHeuPXvLwRv2q44zA",
    "text": "This video was so so good. Accepting all the true nuance of this conversation while not giving the time of day to any of the bad faith arguments on the issue. Subscribed and looking forward to your video on the Congo, so that I'll be able to know better and do better.",
    "like_count": 3,
    "published_at": "2023-11-29T18:35:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwldng368oIgKj-RId4AaABAg",
    "author": "@110metsfan",
    "author_channel_id": "UCfMmo0-fNR4XvcaMY5QO-yA",
    "text": "Thank you for this well done video…. Your voice is important, glad your channel has found me",
    "like_count": 0,
    "published_at": "2023-11-30T14:26:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxnJozB_M-Rc5wnvKp4AaABAg",
    "author": "@bLAZay00",
    "author_channel_id": "UCtLf5OOrym4BDUAjJfjKwRg",
    "text": "I was at a Black History Month play at my local Black Rep theater where a Palestinian teenager came in solidarity and to ask for support in their cause. \n\nI lived in a chocolate city and had no idea we had a Palestinian community there. We aren't free as long as even one person remains in shackles.",
    "like_count": 62,
    "published_at": "2023-11-29T01:25:47Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgxnJozB_M-Rc5wnvKp4AaABAg.9xg1wGom64t9xkXZFo4AKR",
        "author": "@fire418",
        "text": "Our status don't have nothing to do Palestinians or Israel.",
        "like_count": 3,
        "published_at": "2023-11-30T19:19:05Z",
        "is_reply": true
      },
      {
        "id": "UgxnJozB_M-Rc5wnvKp4AaABAg.9xg1wGom64t9xtB5nfIXks",
        "author": "@iammar1159",
        "text": "@fire418   What are you even talking about",
        "like_count": 12,
        "published_at": "2023-12-04T03:55:59Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyhlvGXvNTUZ7mpPhl4AaABAg",
    "author": "@JLeezy95",
    "author_channel_id": "UCptpeurDhhL7ZZw8u0fd1gQ",
    "text": "Excellent commentary and overview. Thank you",
    "like_count": 1,
    "published_at": "2024-06-08T22:18:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyDKpSEsaP1Ws9h1Nt4AaABAg",
    "author": "@mjxsh3lm",
    "author_channel_id": "UC8LjH0Zw4S0yPFPMsLoFEmg",
    "text": "This is amazing!! Thank you Olay ✊🇵🇸",
    "like_count": 4,
    "published_at": "2023-11-28T01:38:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwZ5XFClvGXLSqk5Z54AaABAg",
    "author": "@JustinEastTheWerkmeisterDragon",
    "author_channel_id": "UCjFlkeLIzEADtuG3-l96T7A",
    "text": "Please keep up the great work! We NEED more voices speaking truth so more can finally hear it!",
    "like_count": 2,
    "published_at": "2023-11-28T17:27:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyceq_QWOZ71b2aXSl4AaABAg",
    "author": "@ajemma78",
    "author_channel_id": "UCF9l1dH7P1gE4ignd1ZRFew",
    "text": "God damn, but this was brilliant!",
    "like_count": 5,
    "published_at": "2023-11-27T23:56:59Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwbNa-AOyAN4lb7Uix4AaABAg",
    "author": "@nunisnowden",
    "author_channel_id": "UCly7LMZjbu7hBpOdMC0If9w",
    "text": "Great video.\nTo the point of, “why speak up if everything has already been said” as Marc pointed out— the more voices that speak out, the louder the collective voice becomes. \n\nAlso, it’s good for the algorithm 💁🏾‍♀️",
    "like_count": 2,
    "published_at": "2023-11-30T20:57:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwQ8A7i6KaMQfc5mQN4AaABAg",
    "author": "@fernanne08",
    "author_channel_id": "UCc9qS9QxW-Zy8YrgPX1F-9Q",
    "text": "Thank you, you are an inspiration",
    "like_count": 4,
    "published_at": "2023-11-28T22:01:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwZreSATIR1xqDF2dd4AaABAg",
    "author": "@jacobpierce4208",
    "author_channel_id": "UCeg5xVMJOZOWjxUuoEZUH2g",
    "text": "Bless the YT algorithm for putting this on my feed ❤ thank you",
    "like_count": 0,
    "published_at": "2023-12-01T01:58:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzsz12lAN7-zfLFubx4AaABAg",
    "author": "@serenity6831",
    "author_channel_id": "UCjltFvoAxLQq7FbxwjDWT_g",
    "text": "Im so glad you touched on the inportance of black people supporting Palestine. Its not that theres *no* antiblackness in Palestine (and not just from Israeli occupants), bc its everywhere due to the insiduousness of antiblackness itself. Its that when one of us is violently oppressed, we all are. Black people have an extremely fine tuning for oppression wherever it lies, bc we know it well here. This is our fight as well (along with the colonized people of Congo, Sudan, etc). \n\nI do wish we knew more about the Congolese ppl's plight because it is the same violent genocide, but its often taken a backseat to whats going on in Palestine, and we all know why.",
    "like_count": 6,
    "published_at": "2023-11-28T23:06:13Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugzsz12lAN7-zfLFubx4AaABAg.9xfmy1kWVxH9xkXjj_uAzq",
        "author": "@fire418",
        "text": "What black people? Not black Americans",
        "like_count": 0,
        "published_at": "2023-11-30T19:20:39Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzAy38f-6MHGZE6LXl4AaABAg",
    "author": "@JasonWalkerJamaica",
    "author_channel_id": "UCxE92wbIQqKToV-RhUwrJAw",
    "text": "Fantastically well put together video! Share the Truth Ms Olurin!",
    "like_count": 1,
    "published_at": "2023-12-01T19:12:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzsUXwtIChazPQ5Ipp4AaABAg",
    "author": "@fefii21",
    "author_channel_id": "UC68Po3sD1yOY_VSKx-QT4cg",
    "text": "Girl where can I buy those earrings?!\n-Pretty please?\n\nGreat content, the truth is the truth is the TRUTH!",
    "like_count": 5,
    "published_at": "2023-11-28T01:57:01Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzsUXwtIChazPQ5Ipp4AaABAg.9xdWi8vJrvW9xdeTJBl12P",
        "author": "@olurinatti",
        "text": "Thank you boo! I actually bought the earrings from a woman in the subway station who’d handmade them so I have no way to link em to you",
        "like_count": 3,
        "published_at": "2023-11-28T03:13:29Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzWrV22MNaufGzxDmV4AaABAg",
    "author": "@zavin9779",
    "author_channel_id": "UC8I5L4CPpaDfqq35Caa35pg",
    "text": "Olurinatti, can u pls talk about the issue in Congo so I can educate myself on it",
    "like_count": 1,
    "published_at": "2023-12-13T20:44:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyhMRHFpi6w_DKu_cp4AaABAg",
    "author": "@bb-ss2ip",
    "author_channel_id": "UCElcOVtqYtqy_W2soP3VWig",
    "text": "i'm sat 🪑",
    "like_count": 6,
    "published_at": "2023-11-27T22:55:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy3PjM-8gws41lQJXF4AaABAg",
    "author": "@ivanclark2275",
    "author_channel_id": "UCzA6qoxA_TWiu2OKz8160Sg",
    "text": "Does anyone know where to find a more full version the Kwame Ture lecture used at around 3:20 ?",
    "like_count": 1,
    "published_at": "2023-11-30T22:01:25Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxg5HzzbOgc_MNXoJR4AaABAg",
    "author": "@shadylittlefox",
    "author_channel_id": "UCyucAPg_143h3H_Q5Ay-0yg",
    "text": "Mad respect for you as always",
    "like_count": 3,
    "published_at": "2023-11-28T02:46:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw8KC_McDVSjm4XDOJ4AaABAg",
    "author": "@HideYourKarmaChameleon",
    "author_channel_id": "UCldK_t_Pa8JqclqhwFYGv-A",
    "text": "Thank you for your video and the book list at the end. 🕊️💜🙏🏽",
    "like_count": 0,
    "published_at": "2023-11-28T10:05:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyKEzgYVvMTDmS9TM14AaABAg",
    "author": "@bryncheeze8970",
    "author_channel_id": "UCzYLBUU3xT4RvfjW3OKxs2w",
    "text": "Like comment and share to boost this message! Fight the algorithm 🇵🇸",
    "like_count": 3,
    "published_at": "2023-11-28T01:22:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzWVwB53J3ST3TfV3B4AaABAg",
    "author": "@FrankDenbowDotCom",
    "author_channel_id": "UCoVbbnnfsJ5a64w_bd_V04w",
    "text": "Appreciate the effort that goes into making something like this. Need clips on it?",
    "like_count": 1,
    "published_at": "2023-11-28T00:09:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw8sGG2Ob39XOp5Ard4AaABAg",
    "author": "@HighAsHeckPriestess",
    "author_channel_id": "UCAKRQTLUVoGFxPPPhAs_2FQ",
    "text": "Another golden video!! I think a lot about how many sickening things happening to black people I wasn't aware of, and I am a black people, and it's parallels to just about every modern, for lack of a better phrase, human rights violation shitshow over the last 80 years. Learning more about it sparked the radical fire in my tummy I had when I was 17. The thing is it doesn't make me resentful of countries getting more media attention, it shines the unflattering light on structures that decide daily whose lives matter more for all of us.",
    "like_count": 16,
    "published_at": "2023-11-28T03:07:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzOu6YUhJ-o0eoWlVN4AaABAg",
    "author": "@Maarji",
    "author_channel_id": "UCUFl7siA8mqxe_ynZu_ORlA",
    "text": "We need this type of strength of mind. Great work! Keep it up! From 🇧🇷",
    "like_count": 0,
    "published_at": "2023-11-30T19:56:34Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw0Xy_ANj_UxFJEof54AaABAg",
    "author": "@Lice-party",
    "author_channel_id": "UCVqxz2-ofcCb7SSeqSOXMBQ",
    "text": "You are the first YouTuber I’ve seen make such A detailed video on this genocide. Thank you! FREE FREE 🇵🇸",
    "like_count": 4,
    "published_at": "2023-12-01T18:58:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzNIJxAgKypwuwigjF4AaABAg",
    "author": "@banafanafofana6914",
    "author_channel_id": "UCWHZsAc-6Roe0GSTFPWzLqg",
    "text": "Saying hi from PR 🇵🇷 love your videos! Thank you for speaking up!",
    "like_count": 1,
    "published_at": "2023-11-28T00:31:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxN-9AkZ2fkCgr6T4J4AaABAg",
    "author": "@claireneto",
    "author_channel_id": "UCkDEh-pN7PhdoTMlITXXwgw",
    "text": "Thank you for noting the struggle between black people and Palestine. Also with coverage on Palestine it helps other places like Sudan and the Congo to push for more action on their end. I've been watching Sudan since April/May bc my friend is from there and the fact that mainstream media gave up after a week or two is telling. Peeps also look into Fatima Bernawi, Palestinian-Nigerian militant and Farah member. And thank you for including the national animals of Palestine, it is important to note the ecological destruction that was caused by Israel as a result of colonization. (Also your video was really well made and informative ❤)",
    "like_count": 16,
    "published_at": "2023-11-28T01:07:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwDPit0w_eNoudhmV94AaABAg",
    "author": "@Horlahj",
    "author_channel_id": "UCYVc0sm_72wuASM6sJRArkA",
    "text": "Good job! Emphasizing that we are all impacted by WS!",
    "like_count": 2,
    "published_at": "2023-11-28T20:07:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgynC-xvugFOXId3mSx4AaABAg",
    "author": "@ajemma78",
    "author_channel_id": "UCF9l1dH7P1gE4ignd1ZRFew",
    "text": "Facts",
    "like_count": 9,
    "published_at": "2023-11-27T23:28:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzdh46vUwg8VR5v0Hd4AaABAg",
    "author": "@oreganothankyou",
    "author_channel_id": "UC7d5f-fNN0zfzvcqRpdGaRA",
    "text": "You consistently post some of the most nuanced and well researched videos on the internet. I had originally intended to have this video play as background noise while I fold laundry and pack, but the content and way it was delivered kept me engaged from start to finish. I have shared the ideology of \"If you know better, you do better\" practically my entire life, thank you so much for putting it in to words.",
    "like_count": 0,
    "published_at": "2023-12-19T06:07:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwlv6aWKm09yVA5fRR4AaABAg",
    "author": "@kynetx",
    "author_channel_id": "UCTFsPcZvIFgBJDloagsYtjg",
    "text": "Thanks for this. While I appreciate the \"no one is free till we're all free\" philosophy, I can't get behind the attitude of \"where were you when I needed help?\".\nI saw it with some anti-racist creators expressing glee over Mexican oppression in the states, lumping them in with anti-communist Cuban far-right voters. \"Where were the Latinos/Chicanos when black people were asking for help?\". They were probably in Mexico trying to figure out how to feed their families, most likely.\nIts POC vs US foreign and domestic policy. We got no time for resentment and scorekeeping.",
    "like_count": 6,
    "published_at": "2023-11-29T15:47:24Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugwlv6aWKm09yVA5fRR4AaABAg.9xh_Xu4pJlC9yB4DEsGAjy",
        "author": "@zakai-kaz",
        "text": "Yeah Western supremacy is by far the greatest tool of division in our current world we need to not lost sight of that or else  it's systems and the elites amongst us will have us all fighting each other for scraps again. I firmly believe Oppression and human rights should not  be viewed and combated through this transactional framing.",
        "like_count": 0,
        "published_at": "2023-12-11T12:01:24Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxggdosbMTW7cj-hrZ4AaABAg",
    "author": "@carsonwieker",
    "author_channel_id": "UCkG_i64-kTo6vNfyOmKmWVg",
    "text": "Very well done, detailed and nuanced. All the best, cheers!",
    "like_count": 0,
    "published_at": "2023-11-28T11:43:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw9v9ZNaeARXwIIqcZ4AaABAg",
    "author": "@f.d.5173",
    "author_channel_id": "UCNd20_0kAkAx2opDQUBQZlw",
    "text": "So I'm black (Haitian to be specific) and recently started to convert to Judaism. I have a lot of Jewish friends but had to cut a few out of my life because they didn't like me not blindly supporting Israel. I've always supported Palestine but never this loudly before. I just graduated college and it was crazy to see how Israel is active in our universities, let alone affecting job security. But I think now's as good a time as ever to lean into socialism for each other if capitalists don't want us speaking out against their sate-sanctioned brutalization of indigenous people.",
    "like_count": 5,
    "published_at": "2023-11-30T18:35:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxYoaRG2to2si4FLyF4AaABAg",
    "author": "@platiumplay",
    "author_channel_id": "UC49cK6KlE97XiSkwsQqrlVA",
    "text": "I care about those people as much as they care about me",
    "like_count": 2,
    "published_at": "2024-05-07T20:49:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugye7PhYsxAoMVDFmrx4AaABAg",
    "author": "@dariamorgendorffer592",
    "author_channel_id": "UCR7_OQx52D419DwOVttfptQ",
    "text": "im at 18:50 wow really resonated with me alot when you spoke about your dad\nmy dad is palestinian and since 2020 (back story: was born and raised in UAE but i left the country 5 years ago and my family still live there and 2020 was the year UAE signed a deal with Israel) he begged me not to talk about palestine while we're on the phone in fear of getting deported to palestine since alot of people were either jailed or deported when they stood with palestine in that country :c\neven when he came to visit me, he put all our devices in another room before we dove into the subject, but now since the whole world is finally speaking up and we talk on discord (not under america's surveillance) he's not as scared as before, we talk almost everyday and you have no idea how liberated we feel now, i love my dad so much and he sacrificed so much for us, i wish he didnt have to sacrifice leaving his home for us and i wish he lives long enough to be able to retire back in palestine but i think he's lost all hope on that dream :c\n(thank you so much for making this video, imma go back and continue watching <33)",
    "like_count": 3,
    "published_at": "2023-12-02T14:55:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzs66pWz6p5h2N94b94AaABAg",
    "author": "@jessicabe3278",
    "author_channel_id": "UCpJH9rTNw70uDU5C34ZCbvg",
    "text": "Beautiful. Standing ovation. I'm glad you sensibly offered your insight, and, as you stated, even as you had to really consider how speaking out may professionally impact an individual, you stood for your morals. 👏",
    "like_count": 2,
    "published_at": "2023-11-28T10:14:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzfLQSIS7wflf9lN2V4AaABAg",
    "author": "@kenwilliams7597",
    "author_channel_id": "UCatAVSZTrcKu6b0oC6GhtcQ",
    "text": "The European Jews come from the same gene pool as European Christians.\nie. Russian Christians & Russian Jews. It's the same thing all across Europe.   \nSome converted to Christianity hence becoming Christians & some converted to Judaism hence becoming Jewish. Others were agonistic or adopted other religions. They have no history in Palestine.\n    Donald Trump's daughter has converted to Jewish in order to marry her husband. She is totally European but she now has the right of return to Israel. She has the right skin colour so she will benefit from the complete freedom of white Jewish people in Israel.   Let  that sink in.",
    "like_count": 5,
    "published_at": "2023-12-02T12:33:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzeOK_PNgDDJn9VKlt4AaABAg",
    "author": "@majaherold1325",
    "author_channel_id": "UCyBkgtsH_sg_jYAeTdOxsTg",
    "text": "Thank you for this!!! 🙌",
    "like_count": 0,
    "published_at": "2023-11-30T20:10:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwUIXdSzOw229gGbzd4AaABAg",
    "author": "@gneissnicebaby",
    "author_channel_id": "UCMRFUlKSjiL7SNaRevcsNCQ",
    "text": "Thank you for even just hinting at how we can compare and contrast the war in Ukraine with the war in Palestine. \nMy parents and I for over a month now have been seeing Israel act and talk more and more like Russia and it feels like no one else can see it.",
    "like_count": 3,
    "published_at": "2023-11-28T19:18:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzA6baERsCIYSxfqd54AaABAg",
    "author": "@danielbiddle5941",
    "author_channel_id": "UCf3GpIiDT7FSxY5rSSHBtrw",
    "text": "I appreciate your content, your perspective, and your voice. Keep this up! ❤❤❤",
    "like_count": 0,
    "published_at": "2023-12-02T18:43:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxI3lqTDz5rnCPLNO14AaABAg",
    "author": "@hollagonzalez7954",
    "author_channel_id": "UC97eOKXu42z-h-_D9r9f_HQ",
    "text": "Really great video.. Thank you",
    "like_count": 2,
    "published_at": "2023-12-03T05:23:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgypPn4L5m_6VNxJmN94AaABAg",
    "author": "@AnnieRegret",
    "author_channel_id": "UCG6eNFeopdVY9bplTCfONXQ",
    "text": "❤",
    "like_count": 5,
    "published_at": "2023-11-27T23:38:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzOWwhreHtH-Tfq8V14AaABAg",
    "author": "@mariapaula3376",
    "author_channel_id": "UCgu1pCVGORxKNYyeOngGfrw",
    "text": "Incredible work. \nThank you 🥰",
    "like_count": 0,
    "published_at": "2023-12-12T23:40:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxno9pvwWJASM-23e14AaABAg",
    "author": "@JoannaRives",
    "author_channel_id": "UCGfxgE7-Y6WIsxBQQ2GXtJA",
    "text": "I really liked the analysis in this vlog with the caveat that it ignored the influece of  White Evangelical's tokenized philosemitism. That a significant number of  White Christian Americans who hold power in this country interpret their faith to include a belief that to speak or act against Israeli government is to invite a curse on American (  or their ) interests.",
    "like_count": 4,
    "published_at": "2023-11-30T21:18:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxVH7aSIqmxOadGuRh4AaABAg",
    "author": "@kincentric",
    "author_channel_id": "UCryAElrJQ1-KkSs0dRzZvFA",
    "text": "Excellent analysis. Finally a place where critical thought and nuance is present. Thank you for your work. Subscribed! 💗",
    "like_count": 1,
    "published_at": "2024-04-30T18:44:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyr6qlmfLCUMtfFCp94AaABAg",
    "author": "@s.m.mannix8582",
    "author_channel_id": "UCBbcLklHsqgxCqId2bax1ZQ",
    "text": "Brilliant.",
    "like_count": 3,
    "published_at": "2023-11-27T23:56:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwK21p4UA-dRXs2OCd4AaABAg",
    "author": "@dame-o6m",
    "author_channel_id": "UCH9JpPDdzTqmylAB6E5NSog",
    "text": "Thank you for this. When you know who you can't critique you know who is your master.",
    "like_count": 0,
    "published_at": "2023-12-15T07:40:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyX0xO9fXiKK7HHxzV4AaABAg",
    "author": "@monsutades9999",
    "author_channel_id": "UCQJn2KvJDZj5QXP0U9BeMgA",
    "text": "As a Palestinian I am SO SO thankful for you making this well researched and passionate video. I feel the love and support put into it.THANK YOU🇵🇸🤍",
    "like_count": 10,
    "published_at": "2023-12-04T14:04:25Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgyX0xO9fXiKK7HHxzV4AaABAg.9xuGj-9nk1p9xy_9VX6g0B",
        "author": "@olurinatti",
        "text": "Thank you so much 🥹❤️❤️❤️",
        "like_count": 1,
        "published_at": "2023-12-06T06:11:09Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugyxzq3ehktrx2H41T14AaABAg",
    "author": "@PrivateDncr86",
    "author_channel_id": "UCRNj3ZsoCS01XfBwR4cU9kw",
    "text": "A comment for the algorithm!",
    "like_count": 2,
    "published_at": "2023-11-28T00:09:26Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzvTLRykYi5gzsnpbd4AaABAg",
    "author": "@nanoaged1",
    "author_channel_id": "UCwGRI1EgyrAeDsXkxklSCpQ",
    "text": "@27:57 Malcolm X speaks on the international revolution and Internationalism",
    "like_count": 2,
    "published_at": "2023-11-28T15:07:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzrG_nWGfqooqiXslF4AaABAg",
    "author": "@tylerhackner9731",
    "author_channel_id": "UCbwlrgLNVjnejJT6NKWfzMQ",
    "text": "🇵🇸🇵🇸",
    "like_count": 10,
    "published_at": "2023-11-27T23:05:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzH9RTjK3nBPvLqJPN4AaABAg",
    "author": "@2468ayesha2468",
    "author_channel_id": "UCprRoesBjqHqBZZGIHHQPKw",
    "text": "Very interesting post. Gives everyone allot to think of",
    "like_count": 0,
    "published_at": "2023-12-13T10:46:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxosrPBifQRjoKNot54AaABAg",
    "author": "@ToxicMayhem",
    "author_channel_id": "UCYkZXAEI4mERHuoSLLg06ZA",
    "text": "😮😢🎉😮😢",
    "like_count": 2,
    "published_at": "2023-11-27T23:08:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxn1VrShjykHpljNcx4AaABAg",
    "author": "@chronosi",
    "author_channel_id": "UCNA4zwKrSbYucAhtKPLYl1w",
    "text": "Excellent video, as always. Thank you for talking about this clearly and consisely",
    "like_count": 1,
    "published_at": "2023-11-28T13:43:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzSNjY6bOvjPp14vcN4AaABAg",
    "author": "@Cirex2118",
    "author_channel_id": "UCgP7L-OY3YY-vG5W0ZIag2g",
    "text": "🍵 👀",
    "like_count": 4,
    "published_at": "2023-11-27T22:36:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyaZm5VNb_EMRAMGGR4AaABAg",
    "author": "@raymarshall4809",
    "author_channel_id": "UC2L624Xw3Bs_Dref97TBqPQ",
    "text": "Got family deep in the weeds of believing Israel is the victim, that Hamas is the source of problems... same people hate immigrants because they were told they are the reason for all the bad things going on here... this being seen and pushed back on with no progress is depressing on so many levels.  If we can't get to someone who we love and loves us, what chance do we have with someone we have no real connection to? How, without magic, can we get through to good people?",
    "like_count": 3,
    "published_at": "2023-11-28T14:41:34Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxhRIlT5hiORdemVnZ4AaABAg",
    "author": "@joeyrufo",
    "author_channel_id": "UCUvKiarcClsbCXb-EaNk9Fw",
    "text": "18:14 your dad sounds super chill! Damn!",
    "like_count": 0,
    "published_at": "2023-12-18T17:11:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz7HIhkyGr8VN7mAnx4AaABAg",
    "author": "@yooralee9451",
    "author_channel_id": "UC8dIOv8BXkCxn1TrhRjpq5g",
    "text": "from what I've been seeing till today, those people who still cannot wrap their heads around the fact that colonizing people's land is wrong, and the owner of the land has their rights to STAY in their land, those people came from a ancestry of colonizers lol. I'm Indonesian, so of course we know what a colonialism & fighting for our independence mean.",
    "like_count": 3,
    "published_at": "2023-12-11T19:25:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyq7vVHq72bYov6ZIh4AaABAg",
    "author": "@geraldgooding9790",
    "author_channel_id": "UCD35oXYY84In4tKmxpBwnAw",
    "text": "THANK YOU FOR. OLAYEMI",
    "like_count": 0,
    "published_at": "2024-05-04T15:59:31Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  }
]