[
  {
    "id": "Ugw00_SaUo4K27umxUB4AaABAg",
    "author": "@letsride2024",
    "author_channel_id": "UC47Fp7WtOKthHGRE5UgG5yQ",
    "text": "You *do* have two classes (I don't believe in a middle class), but what's funny is, you'll have the masses who are working so hard and struggling under this system *STILL* argue this is the best there is to offer.",
    "like_count": 34,
    "published_at": "2021-02-18T15:52:03Z",
    "is_reply": false,
    "reply_count": 9,
    "replies": [
      {
        "id": "Ugw00_SaUo4K27umxUB4AaABAg.9Juc0ldLkUO9JxckAAdsIh",
        "author": "@JakeyJake05",
        "text": "Ikr it's so sad to see them being gaslit so much",
        "like_count": 3,
        "published_at": "2021-02-19T19:56:06Z",
        "is_reply": true
      },
      {
        "id": "Ugw00_SaUo4K27umxUB4AaABAg.9Juc0ldLkUO9JxdiPTAK7l",
        "author": "@letsride2024",
        "text": "@JakeyJake05 I think people have been indoctrinated from a very young age and through generations about anything other than Capitalism is bad. You talk to people, even right-wingers, they'll believe in some form of equality without realising.",
        "like_count": 4,
        "published_at": "2021-02-19T20:04:36Z",
        "is_reply": true
      },
      {
        "id": "Ugw00_SaUo4K27umxUB4AaABAg.9Juc0ldLkUO9JxlbpRwuE4",
        "author": "@JakeyJake05",
        "text": "@letsride2024 yeah you're absolutely right it's tragic",
        "like_count": 3,
        "published_at": "2021-02-19T21:13:36Z",
        "is_reply": true
      },
      {
        "id": "Ugw00_SaUo4K27umxUB4AaABAg.9Juc0ldLkUO9PqzQdDqHgW",
        "author": "@vannajs5024",
        "text": "@letsride2024 As someone who grew up in a socialist society in former Yugoslavia,I can tell you first hand that,Other way around has been tried,They tried to indocrinate people with socialism,But it simply didn't work.Majority, it's simple not ready for a society based on solidarity.Im free to say that majority of people now a days, it's self-centered, egoistic, shallow to build such a society,based on pure solidarity,care for others,,fate in better tomorrow, companionship,Moral values, etc.,We are not ready yet.Even Marx predicted that socialsim could be and will be build out of mature Capitalism,I believe it's what modern China it's doing ,it way to build a socialism.it's almost there,When you compere capitalism in Marx's time and now,a lot of things has changed on better.Socialism it's invetble,It just going to take some time.",
        "like_count": 0,
        "published_at": "2021-07-16T09:07:57Z",
        "is_reply": true
      },
      {
        "id": "Ugw00_SaUo4K27umxUB4AaABAg.9Juc0ldLkUO9Pr0ee6VWO0",
        "author": "@letsride2024",
        "text": "@vannajs5024 Perhaps you're right, I don't disbelieve you.",
        "like_count": 0,
        "published_at": "2021-07-16T09:27:29Z",
        "is_reply": true
      },
      {
        "id": "Ugw00_SaUo4K27umxUB4AaABAg.9Juc0ldLkUO9Ps3gC6VJa8",
        "author": "@vannajs5024",
        "text": "@letsride2024 Parenti stress that out in Reds and Blackshirt,where he said,he spoke to e\nEast German ambassador sometimes in the early 80s and asked him,why they are making such a poor quality cars,as Trabant.Parenti said people are complaing about it and they prefer western cars and western goods in general, ambassadors replied\" We wanted to encourage public transportation usage,We thought ,if we make a good society,we will make  a good people.",
        "like_count": 0,
        "published_at": "2021-07-16T19:13:09Z",
        "is_reply": true
      },
      {
        "id": "Ugw00_SaUo4K27umxUB4AaABAg.9Juc0ldLkUO9Ps4uinbJJo",
        "author": "@vannajs5024",
        "text": "@letsride2024 I also agree with you that people in US dont even know what socialism is and they been indocrinated with capitalism, Consumerism, Education it's very poor too,..etc.But radical ,other way around also doesn't work.Capitalims it's encouraging the worst in human's and it's adapting itself in order to please majority, and therefore survive..Socialism has to do the same thing,To find a way to adapt and encourage good and rational side in people.As was done back in 20s,30s,when socialism was a very popular political point of view,Even US had a strong Socialist party.This thing with Bernie Sanders it's move in right direction,but that's not Socialism,taxing rich,it wouldn't work, They would simple cut the expenses and a purposely cause the economic crisis, Something similar they done and still doing in Venezuela.",
        "like_count": 0,
        "published_at": "2021-07-16T19:23:52Z",
        "is_reply": true
      },
      {
        "id": "Ugw00_SaUo4K27umxUB4AaABAg.9Juc0ldLkUO9PvGZkjQ1T3",
        "author": "@robertstan298",
        "text": "@vannajs5024 You're 60+ years old? 'The fuck? Not ageist, but I find it really hard to belive you lived during Tito's time and you didn't love reasonable control over the fruits of your labor and country's resources, massive vacation time and the multicultural and ethnic harmony of Tito era Yugoslavia. Sounds a lot like a very involved trolling attempt, you never know these days.\n\nAlso imagine thinking some mild 35 year old socialist socialization in one country can compare with 400 years of global hegemonic Capitalist rule and saying \"here's the receipt, it doesn't work,  trust me and my anecdotes bro!\"\n\nBig \"wut\" there...",
        "like_count": 0,
        "published_at": "2021-07-18T01:03:27Z",
        "is_reply": true
      },
      {
        "id": "Ugw00_SaUo4K27umxUB4AaABAg.9Juc0ldLkUO9Q1W2-scS59",
        "author": "@vannajs5024",
        "text": "@robertstan298 No Iam 40+,But I do remember time under socialism,We had  preserved publicly,state owned factories and enterprises till the early 00's.So I experienced that time pretty well,I loved it,I never said I personally didn't love it,Large majority benefited huge, from that system,But still majority accepted nationalistic, petit burgouse and anti communist view,in the early 90s..\n Regardless the benefits they had, Apartments they got it for free, Universities they studied tuttiion free, Healthcare,Dental care they enjoyed for free or for some symbolic price.Corruption was wide spread .Despite pressure from the west existed and I do blame western powers for annihilation of Yugoslav socialist system,But majority of people bought it,they weren't ready for such a system based on solidarity, brotherhood and unity.Even now a days majority will say,Yes ,we had a great life under Tito,but thanks to American loans,That must be some secret plot to destroy(Serbs,Croats)..depends which nationality you are speaking too..Right wing and petit burgouse mentality, it's widespread among people..In US,large majority has petit burgouse, entrepreneur and liberal/conservative mentality,Not to forget to mention a huge number or lumpen..They are miles away from the people who are capable building Socialism.",
        "like_count": 0,
        "published_at": "2021-07-20T20:33:20Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyfhJpcq3nvRihviB14AaABAg",
    "author": "@tylerbecker8398",
    "author_channel_id": "UCdx1JAmFPMV0CN0E6UOlRIQ",
    "text": "As Parenti says “We? Who’s we? It’s Them.”",
    "like_count": 9,
    "published_at": "2021-02-19T09:09:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxVG-U7OiTa_3tZXsF4AaABAg",
    "author": "@americanknow8232",
    "author_channel_id": "UCOtpgwyIQsZAn7HkAxsLoaQ",
    "text": "We won the min. wage, unemployment insurance, and Social Security.",
    "like_count": 11,
    "published_at": "2021-02-18T15:29:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz_T8gF7dklWcyHrL94AaABAg",
    "author": "@TheDarkllite",
    "author_channel_id": "UCLYvYvy_d_kdgE3Ds_1ZFlQ",
    "text": "Great video! Quick question: any thoughts or opinions about the CPUSA?",
    "like_count": 8,
    "published_at": "2021-02-18T16:56:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzTrnhkl4ICSM6y5Sh4AaABAg",
    "author": "@mukesh_bombay",
    "author_channel_id": "UCEb--RLECwTgmL2nJXq6TZg",
    "text": "Simps for capitalism are so quick to forget the struggle of Labor for a 40 hour workweek, a 5-day workweek, overtime pay, worker's compensation, non-child labor, and the list goes on and on.",
    "like_count": 4,
    "published_at": "2021-04-05T14:55:14Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzTrnhkl4ICSM6y5Sh4AaABAg.9Lky4wNsqA89OsaiZAllBP",
        "author": "@realdealreds2578",
        "text": "They usually don't even know, and have no reason to believe leftists about it cuz we don't give them a reason too",
        "like_count": 0,
        "published_at": "2021-06-22T03:39:10Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxaMN_hH_0WJ19oNLZ4AaABAg",
    "author": "@carmellotringali8507",
    "author_channel_id": "UChptL43dqjhwjr6kr8eZeJg",
    "text": "We also gotta organize those who don't work. Don't wanna leave them out. Watch the documentary Crip Camp.",
    "like_count": 1,
    "published_at": "2021-07-12T00:07:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx_mtPQxasYyrXLjcx4AaABAg",
    "author": "@小肉肉-f4u",
    "author_channel_id": "UCKuI15URhUs-AYkldTPhPDw",
    "text": "Why is the wrestling competition held in the Winter Olympics? It is like you guys wrestling in the snows? 🤔🤔🤔",
    "like_count": 2,
    "published_at": "2021-02-18T15:12:31Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyni4zw7W4z9Abg7Vx4AaABAg",
    "author": "@mukesh_bombay",
    "author_channel_id": "UCEb--RLECwTgmL2nJXq6TZg",
    "text": "\" We see the source of this disconnect, unlike most on the socialist left today, not on the inability of workers to commit to an anti-capitalist sentiment, but rather on the inexistence of a left that truly aims at the heart of capitalist society.\" this is on your website. In the past year, I feel like I've really moved from being a liberal to a leftist, partially because of your videos. So keep it up",
    "like_count": 1,
    "published_at": "2021-04-05T14:57:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyqTHxOtjjxMXyazvl4AaABAg",
    "author": "@chanceinternet5679",
    "author_channel_id": "UCKciUK_RG-dDzPR8i7qtC0Q",
    "text": "thank u",
    "like_count": 0,
    "published_at": "2021-03-22T07:25:33Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzdLfwtZLf_zD-1xA14AaABAg",
    "author": "@aidanluhmann3028",
    "author_channel_id": "UCIPI_eO2cDWteg1cTGDCLWg",
    "text": "Hmmmmmm comment for the algorithm.",
    "like_count": 1,
    "published_at": "2021-03-25T22:59:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyGOrdXeSVTVVdBndl4AaABAg",
    "author": "@小肉肉-f4u",
    "author_channel_id": "UCKuI15URhUs-AYkldTPhPDw",
    "text": "Do you know the YT channel -- Serpentza ?",
    "like_count": 0,
    "published_at": "2021-02-18T15:07:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugybv8vuqzUkiclr3QF4AaABAg",
    "author": "@howenator",
    "author_channel_id": "UCtE2phcN4v6_NaxpcG8-JZg",
    "text": "I don’t think everything the US has ever done was bad, the struggle for the limited rights we have in this country was mostly good. However, I still think any sort of American nationalism is almost entirely reactionary, I still support the Leninist principle of self determination for all oppressed nations being adhered to here. We don’t necessarily need a Balkanization of the US, but we must recognize that every oppressed group must be liberated in order to build socialism.",
    "like_count": 0,
    "published_at": "2022-01-11T21:34:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwJsHReuwcQhMo99y94AaABAg",
    "author": "@terriblebroseph",
    "author_channel_id": "UCPvORHt0A7TNZRIFExRpNhg",
    "text": "Hey eddie. Quick question. I'm disabled and cant work. Am I lumpenproletariat? Or proletariat?",
    "like_count": 2,
    "published_at": "2021-02-18T19:10:58Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgwJsHReuwcQhMo99y94AaABAg.9JuymlqgztP9K3Tca9fTNP",
        "author": "@Weinus",
        "text": "Hey there. Just in case he doesn't get to your question:\n\nTypically the 'lumpen'-proletariat is defined as the lower classes who do not possess the knowledge and/or interest to partake in class struggle. As such, your position within either category depends more on what is going on with your thoughts and ideology than what may be different about your body. I am not sure how intense your disabilities are, but Leninism in particular put a large emphasis on cultivating a group of engaged and politically-minded socialists (the vanguard) to lead the lumpenproletariat despite their lack of knowledge or disinterest in political considerations. Not only could your voice provide an invaluable perspective during the deliberations of such a body, but that applies to any organization which structures a meaningful work role around your needs.\n\nI'm a firm believer that we have a societal duty to provide work that is fulfilling and meaningful to all people who desire it. Just because the system doesn't view you as a potential source of enough exploitable profit doesn't mean you should be marginalized in any way. Wherever you live might not have a society structured to provide you with the kind of life you deserve, but you are just as much enmeshed in the potential proletarian struggles of wherever you live as anyone who is not in a position like yours.\n\nAgain, I can't stress enough how valuable your perspective and insights could potentially be when properly considered by a compassionate governmental body that is trying to plan the most suitable roles for people with issues such as your own.\n\nHopefully that cleared things up a bit, and hopefully I didn't accidentally slip any ableist language in there. It's something I've had to consciously work on. \n\nTake care out there =).",
        "like_count": 6,
        "published_at": "2021-02-22T11:42:22Z",
        "is_reply": true
      },
      {
        "id": "UgwJsHReuwcQhMo99y94AaABAg.9JuymlqgztP9KI1eSfzzOH",
        "author": "@terriblebroseph",
        "text": "@Weinus that was very insightful thank you!",
        "like_count": 0,
        "published_at": "2021-02-28T03:26:34Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzG0lSm5S06TU0SSgl4AaABAg",
    "author": "@TriclopstheInfinite",
    "author_channel_id": "UCMVY9vruc62M9_jX21w-UMg",
    "text": "Is that a Haitian flag on your wall?",
    "like_count": 0,
    "published_at": "2021-02-18T20:11:42Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzG0lSm5S06TU0SSgl4AaABAg.9Jv4jXZyoGW9JwENv6NkuR",
        "author": "@ThankYouBasedGod1738",
        "text": "Venezuelan flag",
        "like_count": 4,
        "published_at": "2021-02-19T06:55:14Z",
        "is_reply": true
      }
    ]
  }
]