[
  {
    "id": "Ugx9cOtNgE8i6Uq247J4AaABAg",
    "author": "@waspwrap1235",
    "author_channel_id": "UCUHJ7XAeCvyfLL_U1upAeiQ",
    "text": "North Korea Is probably one of the most sanctioned and isolated countries on the planet. I think the fact that a major uprising didn’t occur says something.",
    "like_count": 11,
    "published_at": "2025-06-25T05:13:04Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgycENTSkd6MprwPdsN4AaABAg",
    "author": "@waspwrap1235",
    "author_channel_id": "UCUHJ7XAeCvyfLL_U1upAeiQ",
    "text": "Over half of North Korean farmers are armed",
    "like_count": 17,
    "published_at": "2025-06-25T05:12:30Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgycENTSkd6MprwPdsN4AaABAg.AJmSA1QQoSMAM65Db2KQRg",
        "author": "@waspwrap1235",
        "text": "@RomanII499I don’t remember the source I read so take it with a grain of salt, but the main reason is due to many army members also work as farmers",
        "like_count": 1,
        "published_at": "2025-08-21T22:38:51Z",
        "is_reply": true
      },
      {
        "id": "UgycENTSkd6MprwPdsN4AaABAg.AJmSA1QQoSMAQczK3Pe1SJ",
        "author": "@MarkAntony-l7s",
        "text": "@waspwrap1235 And almost everyone serves in the army by the way so there's that.",
        "like_count": 1,
        "published_at": "2025-12-12T12:38:19Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwuQQnlIm8YnXSwqQ14AaABAg",
    "author": "@carrotwax-42",
    "author_channel_id": "UC1uAL1H9245wZuXCUMwSYBg",
    "text": "You basically said North Korea is more democratic just because it is socialist, but didn't go into the ways the people have power and influence policy.  I've read about China, but actually don't know much about how North Korea actually works in terms of democracy.",
    "like_count": 36,
    "published_at": "2025-06-24T07:14:11Z",
    "is_reply": false,
    "reply_count": 28,
    "replies": [
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJk5qJxdsQ5",
        "author": "@ResurrectCromwell",
        "text": "Juche",
        "like_count": 8,
        "published_at": "2025-06-24T07:18:57Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJkHxTJxPQD",
        "author": "@AndrewAddisonUniqueDrewski980",
        "text": "Get it together it is actually a true Democratic Socialists Traditionalist Far Left country. Please get your facts in order sir. Democratic Socialist as one, I too am a Democratic Socialists in definition and not stuck to any political party owned by the liberal governmental system of U.S.A.",
        "like_count": 1,
        "published_at": "2025-06-24T09:04:47Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJk_txoIvSe",
        "author": "@alexjeffrey3981",
        "text": "The Taean work system is a model of workplace democracy, and they have both a supreme people's assembly and local assemblies for electing representatives.",
        "like_count": 5,
        "published_at": "2025-06-24T11:50:20Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJkfI3-YsC-",
        "author": "@Exile-from-the-future",
        "text": "Saying North Korea is more democratic because it is socialist doesn't convince anyone.  I could give specific reasons how China is far more democratic than people think.  You need to give concrete examples rather than mentioning ancient Greek or name-dropping famous philosophers..",
        "like_count": 13,
        "published_at": "2025-06-24T12:37:26Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJkh2A4IUwr",
        "author": "@Exile-from-the-future",
        "text": "​@antimattvI agree, but you are oreaching to the choir.  Be precise about why socialism is democratic.",
        "like_count": 6,
        "published_at": "2025-06-24T12:52:45Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJkoMrkIo-w",
        "author": "@alexjeffrey3981",
        "text": "​@Exile-from-the-futureyes we need to speak to our audience in a way they can relate to.",
        "like_count": 3,
        "published_at": "2025-06-24T13:56:45Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJkpVIQJRHr",
        "author": "@AndrewAddisonUniqueDrewski980",
        "text": "​@Exile-from-the-future Socialism created Democratic. Democratic Socialism in definition is based on Traditionalism, Working Class, Collectivism.",
        "like_count": 0,
        "published_at": "2025-06-24T14:06:38Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJkzP_xngLZ",
        "author": "@StrayChoom",
        "text": "@carrotwax-42 they have a National Assembly it’s basically the socialist equivalent of a parliamentary system. Do not trust the Wikipedia page on this though, the only citations are Associated press and the BBC. Completely bunk sources on this matter, they have been caught red handed bold faced lying about the DPRK before, so I wouldn’t trust any reporting by them on this matter. \n\nFrom DPRK sources, it’s pretty much just stated to be a relatively normal parliamentary system. Just capitalist parties are more or less banned, or esoteric, the same way that socialist parties don’t have much relevance/are outright banned in the west.\n\nAnd no Kim jong un is not actually the leader of state affairs. \nHe’s more like prince harry to England. Just an honored celebrity for the Kim family’s role in the revolution. \n\nMost North Korean expats who don’t become grifters, they simply state that they left for economic reasons. Which would make sense because the DPRK is heavily sanctioned.",
        "like_count": 1,
        "published_at": "2025-06-24T15:33:14Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJl-Dn6ihF5",
        "author": "@StrayChoom",
        "text": "They have a National Assembly it’s basically the socialist equivalent of a parliamentary system. \n\nThe Wikipedia page in English is misleading on this, the only citations are Associated press and the BBC. \n\nCompletely bunk sources on this matter, they have been caught red handed spreading misinformation about the DPRK before, several times. \n\nSo I would be highly skeptical of what these specific sources say.\n\nFrom DPRK-based souces, it’s pretty much just stated to be a relatively normal parliamentary system. \n\nThere’s a little modularisation and it’s more focused on the local than the state level.\n\nJust capitalist parties are more or less banned, or esoteric, the same way that socialist parties don’t have much relevance/are outright banned in the west.\n\nKim Jong Un is more like prince harry to England. Just an honored celebrity for the Kim family’s role in the founding of the DPRK. Not an actual state leader, though often speaks for the country. \n\nMost expats from the DPRK, simply state that they left for economic reasons. \n\nWhich would make sense because the DPRK is heavily sanctioned, and it is still technically a developing nation.\n\nThough it has made tons of progress in the last few decades, so many people who are there are proud of the strides and progress their country has been making, in spite of adversity from the west.",
        "like_count": 6,
        "published_at": "2025-06-24T15:40:22Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJoKp9hcjav",
        "author": "@ClassWarMatrix",
        "text": "This should clear things up:\n\nWhen Eastern \"authoritarian\" Communist countries speak of freedom--   they're speaking of a definite social freedom of a particular determinate country/civilization:\nFreedom to be free to define & uphold their own cultures and laws,\nFreedom to insist upon their own People's historical record and their own particular truths,\nFreedom to pursue their own sovereign (partial) (illiberal) paths of political-economic development that aren't dictated by transnational Western bankers, monopolists, governments, and social-engineering NGOs.\n\nWhen Western liberals speak of freedom,  they are speaking of an indefinite, indeterminate, hyper-individualist freedom:\nFreedom to be free from assuming any authentic political partiality or partisanship;  freedom from having any vested interest in state authority,\nFreedom to be free from any and all particular social mores and cultural realities;  free from all personal inhibitions and collective obligations and accountabilities;  free from social-regulation by any morality or religion,  freedom from any definite existence attached to any particular society;  freedom from the social grounds of your own individuality;  freedom from your own dignity,\nfreedom from any necessity to establish a concrete manifestation of freedom.\n\nFreedom for  vs  freedom from.\nThis is why the East is now rising -  while the West is experiencing profound cultural decay and spiritual crisis as it slips back into fascism and perpetual state of emergency.\n\nThe Cartesian metaphysics of liberal philosophy have fully exhausted their world-historic capacity for real progress and now their furthest logical conclusions have lead to:\nReddit, atheistic pagan satanism,  a fundamental distrust of reality,  anti-human Malthusianism,  racial-science,  something called a \"gene\",  the reduction of the essence of all human existence down to one-sided biology and \"reproduction of genes\",  the Marvel cinematic universe,  Hitlerism,  anti-Communism,  'wokeism',  eugenics, diversity-equity-inclusion,  elevation of cultural and sexual deviancy to the status of supreme norm of all society,  Epstein islands, the Maidan Revolution,  something called \"Israel\",  de-growth and d3p0pulation agendas, \"War on Terror\",  and all manner of other intellectual and ideological perversions.\n\nBecause the Open Society cannot tolerate enemies of the Open Society,  it cannot tolerate closed societies,  closed individuals nor closed collectives.\n\nAnd so in their pursuit of spreading \"freedom and democracy\" to the \"backwards\" \"totalitarian\" countries,  the liberal himself becomes the totalitarian that he perceives in the world,  and begins to cannibalize and destroy the very same classical-liberal ideals that he once ushered into existence.\n\"In the pursuit of spreading \"enlightened secular humanism\" to the \"backward fanatical Islamic Jihadists\",  to create a world free of atrocities committed by Jihad,  the liberal himself engages in a Jihad for which he will commit atrocities.\" -- Logo Daedalus\n\nThe only positive liberty that you truly have in the capitalist West is:  freedom to be a slave,  freedom to live as undignified cattle,  freedom to be perpetually demoralized about your real human existence,  freedom to get pimped by NGOs and robbed by banks,  freedom to be a prostitute for the highest bidder.",
        "like_count": 1,
        "published_at": "2025-06-25T22:46:49Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJoLBBdQFd5",
        "author": "@StrayChoom",
        "text": "@ClassWarMatrixbest comment I’ve ever seen on YouTube omg",
        "like_count": 2,
        "published_at": "2025-06-25T22:49:58Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJoMFSWcVbk",
        "author": "@ClassWarMatrix",
        "text": "@stray I'm honestly surprised YT doesn't auto snatch it like it does most of my other comments 😂😂😂\nIt's a collection of nukes from our sphere that I've compiled into a mega nuke.\nCopy and paste it !",
        "like_count": 0,
        "published_at": "2025-06-25T22:59:17Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJoN9uTatDC",
        "author": "@StrayChoom",
        "text": "@ClassWarMatrixyeah 95% of the stuff I write gets censored I really have to tip toe around the algorithm. It was a funny comment. I find your wording for some parts a bit odd “profound cultural decay” “spiritual crisis”, these don’t strike me as the words of a materialist. But most of the rest I agree with outside of a few things on the ideological perversions list.\n\nBut the main point and the differing interpretations of freedom, I find interesting read about. I know the basics of this topic but it’s always fun to see an interesting new quote on the subject, and some funny lines, a funny and engaging piece. \n\nJust some parts strike me as strausserite which I do not see often. But I’m not trying to make an assertion, that’s not necessarily an attack it’s just not the wording an ML would use. There were parts that seemed reactionary.\n\nBut it was a pleasure to read I can say that. Gave me a chuckle and was informative.",
        "like_count": 0,
        "published_at": "2025-06-25T23:07:16Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJoNKtlppyr",
        "author": "@StrayChoom",
        "text": "@ClassWarMatrixoh wait nope they did censor it just came up in my feed that was it, sometimes censored comments do that.",
        "like_count": 0,
        "published_at": "2025-06-25T23:08:46Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJo_ZARQtyp",
        "author": "@ClassWarMatrix",
        "text": "@stray All of your replies and mine seem to be posted fine.\nYou can tell if it did by tracking the replies counter of a comment.\nIf it the counter updates +1 but then goes back -1 a minute later,   that means it was soft snatched,  and can still be viewed if sorting comments by \"newest first\".\n(You can also post a \"test\" comment @ someone,  then edit it 10 minutes later and paste your actual comment,  and it will still appear in their inbox despite being snatched).\nBut if the counter never updates +1 after posting,  that means it was hard snatched and can't be viewed anywhere or edited.\n\nAnyway.\nCulture and spirit are material,  they matter,  to individuals and to collectives and to societies,  and very much so.\nSocial conservatism is not necessarily materialist or anti-materialist,  but it is a material reality experienced by people on a social level.\n\nStrausserism as in Leo Strauss ?\nI don't believe anything I'm saying is fundamentally rooted in Strauss.\n\nHere's comrade Jiang Zemin:\n\"Material poverty is not socialism, and neither is spiritual emptiness. Socialism not only enriches people's material lives, but also uplifts them spiritually. Some Party members and cadres, including leading cadres, pursue and imitate the Western decadent lifestyle, worship money and are hedonistic. This is very dangerous. In Western countries today, some statesmen and insightful people are deeply troubled by Western social problems, such as widespread hedonism, degenerate thinking and spiritual decadence. A book by an American author  entitled   Social Problems in the Western World   states that the theoretical basis of Western freedom is hedonism;  that is, the purpose of life is the pursuit of sensual pleasure.\"\n\nI believe Kim il Sung has written similar things.\nLenin was also not a big fan of the latest \"trendy\" cosmopolitan & exhibitionist cultural tendencies of his time,  which he traced back to bourgeois culture",
        "like_count": 0,
        "published_at": "2025-06-26T01:04:19Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJofj1cXX4Z",
        "author": "@StrayChoom",
        "text": "@ClassWarMatrix​​⁠​⁠socialism would innately uplift the spirit of the proletariat. I agree with that. \n\nAnd culture can be important under certain circumstances, I’m aware in Vietnam the culture itself is heavily inspired by the cultural freedom provided by socialist revolution.\n\nSocialism was the only way to sustain Vietnamese culture. That was something important to them. Historical, spiritual almost.  \nIt was protection of their culture against imperialists that wanted to destroy it, that motivated many Vietnamese people into revolutionary socialism.\n\nAnd even Marx wrote how bourgeois power leaves proletarians without a nation, without a culture. It just leaves them exploited.\n\nI’m British so we do have some culture & customs. Outside of the imperialist dominance, exploitation & xenophobia. There is something beneath it.\n\nAmericans on the other hand, have nothing but vague notions. Their only culture is the dollar. Their “culture” was born from genocide, war, greed and slavery. And the culture has not changed to this day.\n\nThough equally I would never turn on my LGBTQ friends. Solidarity is important in that sense as focus on such issues, these people are merely proletarians and with the proletariats emancipation, follows their emancipation in the same vein.\n\nIt is also true that Marx or Engels stated (well cited an earlier socialist thinker in agreement),  the emancipation of women is an appropriate measure for the emancipation of the proletariat. \n\nAnd that reactionary sentiment should dutifully be fought against. \n\nAll that said, though I agree with the aspect, that socialism would uplift spirit and culture. \nIn my eyes, I would add two caveats, that the culture, such as American culture might be better off altered, or evolved into a something beyond the violent settler colonial culture America has. \n\nWhich in all fairness it likely would naturally evolve upon the removal of class antagonisms from the dynamic.\n\nAnd I remain firm I do not consider spirituality to be material either. That is something metaphysical which materialists reject. The value it has is social value for some proletarians. \n\nAnd some bourgeois. So it has as a social phenomena, it is closely tied with the superstructure standing atop the productive base of society. \nAnd it is changes in the mode of production that influence social change, more than the other way around.\n\nCulture and spirituality are something of value that socialism would protect & uplift , but the whole philosophical point of communism from the Marxist perspective is leisure  & happiness over duty. \n\nWhich is given as the basis of freedom. \n\nSo the specific rejection of hedonism strikes me as interesting.  \nNot necessarily that I disagree, hedonism runs downwind of consumerism. It’s not healthy on the individual level or the social level. \n\nBut what would be considered hedonism, is a matter of perspective.\n\nOne of  Marx’s main inspirations  outside  of  Hegel was Epicureanism, an ancient philosophy that focused on individual happiness through friendship.  \nAnd Marx also echoed this sentiment in pieces like wage labour capital and critique of the Gotha programme.  \n\nWith that comes the woman question, (real thing) and the question of freedom from social expectation (my question). In the case of what would be considered “true emancipation”.\n \nAs far as the strausserite comment, it was more of a… “vibe”. \nAn exercise in vibes based analysis. It was the only word I could think of. I was basically asking if you consider yourself a third positionist or not.\n\nBecause though I do not call myself “left” I say I am a communist. But I do consider myself to be “far left” and not necessarily a third positionist.\n\nFor example Mussolini in the doctrine of fascism talked extensively about the “profound degradation of culture” and “spiritual crisis”. So the overlap here is something that seemed markedly odd, as it’s not the language a Leninist would use.\n\nWhich is where the third positionist question comes in. \nBecause I wouldn’t register you as a simple Leninist. You didn’t cite Lenin as a reply 😂\n\nThough I’m not calling you a fascist merely that there were some things that I noticed that had overlap with what Mussolini wrote in the doctrine of fascism.\n\nBut now I mostly understand the context of what you were saying. Though I’m still skeptical of reactionary views. But ultimately I agree with most of what you’re saying comrade.",
        "like_count": 0,
        "published_at": "2025-06-26T01:58:14Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJoh7pANYId",
        "author": "@StrayChoom",
        "text": "@ClassWarMatrixnooo I wrote a long comment in reply but it got auto snatched god damnit (luckily I copy pasted it into my journal app)",
        "like_count": 0,
        "published_at": "2025-06-26T02:10:29Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAJohMZA4D07",
        "author": "@StrayChoom",
        "text": "@ClassWarMatrixoh wait no the trick worked, it’s up but what if there’s thousands of comments",
        "like_count": 0,
        "published_at": "2025-06-26T02:12:30Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAL5G1U4ZLVn",
        "author": "@alexandrecordeiro4957",
        "text": "If China or North Korea really did the people will, they would be both democracies by now. They serve the will of the members of the communist party, but mostly the will of the guy at the helm of the party.",
        "like_count": 0,
        "published_at": "2025-07-27T18:22:40Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAL5GHXVy3NK",
        "author": "@alexandrecordeiro4957",
        "text": "​@ResurrectCromwell yes, they worship the fat man GOD. and I'm not referring to sidartha gautama.",
        "like_count": 0,
        "published_at": "2025-07-27T18:24:52Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAL5Grqc0V1-",
        "author": "@alexandrecordeiro4957",
        "text": "​@AndrewAddisonUniqueDrewski980why don't you move there,and then try to complain about their government, like you complain about the government here. The western democracies have a lot of faults, but they are still the best system. And yes the self anointed beacon of democracy USA 🇺🇸, looking more like an oligarchy.",
        "like_count": 0,
        "published_at": "2025-07-27T18:29:58Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAL5JwmCWCxT",
        "author": "@AndrewAddisonUniqueDrewski980",
        "text": "​@alexandrecordeiro4957About what? What you said doesn't make any sense. Do you care to even explain why you're complaining out of nowhere for? North Korea has a right to exist as well as those in America. To me you're just a fake American and not a real one to begin with? True USA is in full support of North Korea, Russia and China since all of those places helped form United States of America to what is it today. Without them there would be no us to be had.",
        "like_count": 0,
        "published_at": "2025-07-27T18:56:51Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAL5KCWfCs2c",
        "author": "@AndrewAddisonUniqueDrewski980",
        "text": "​@alexandrecordeiro4957 About what? What you said doesn't make any sense.North Korea has a right to exist as well as those in America. To me you're not even a real American and not a real one to begin with? True USA is in full support of North Korea, Russia and China since all of those places helped form United States of America to what is it today. Without them there would be no us to be had. I love U.S.A., North Korea and Russia since all three work well together and there is no stopping it, not even you can stop that. Please try again.",
        "like_count": 0,
        "published_at": "2025-07-27T18:59:08Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAL5KT6s5JVI",
        "author": "@AndrewAddisonUniqueDrewski980",
        "text": "​@alexandrecordeiro4957Excuse me? I don't believe you made a point except not speak any facts that were relevant at all. Too bad you can't always have everything your way because North Korea, Palestine, Arab, Russia, China, Spanish and French helped form America. It seems to me you're a pretend citizen wishing badly to be accept here. This country was built in true immigration. If you don't like it, tough that is your issue and not ours.",
        "like_count": 0,
        "published_at": "2025-07-27T19:01:24Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAL5KcFn9F8F",
        "author": "@AndrewAddisonUniqueDrewski980",
        "text": "​@alexandrecordeiro4957The United States of America is North Korea, China, Russia, Muslim, Arab, Palestine, Spanish and French. That's too bad if you cannot accept that, not even Donald Trump can save you. 😂😂😂😂😂",
        "like_count": 0,
        "published_at": "2025-07-27T19:02:47Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycAL5Ki-e1srT",
        "author": "@AndrewAddisonUniqueDrewski980",
        "text": "​@alexandrecordeiro4957Democratic Socialists Traditionalists Far Left is United States of America. Deal with it or get out you're not stopping this show at all.",
        "like_count": 0,
        "published_at": "2025-07-27T19:03:34Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycARGvEfCyGGS",
        "author": "@jasonphillips2534",
        "text": "​@ClassWarMatrixthis sounds anti woke to me LMAO jihad can be practiced through sharia without forcing everyone else into sharia this comment makes it feel like 2 sides of a coin instead of being more nuanced",
        "like_count": 0,
        "published_at": "2025-12-28T10:11:29Z",
        "is_reply": true
      },
      {
        "id": "UgwuQQnlIm8YnXSwqQ14AaABAg.AJk5IQ4qCycARHBvO1lhLn",
        "author": "@ClassWarMatrix",
        "text": "jasonphillips     yeah you're absolutely right.   In my example i was referring to to the average Western neocon's understanding of jihad and how they use that term.\nBut i am anti-woke as well--   in the sense of how contemporary liberals understand that term",
        "like_count": 0,
        "published_at": "2025-12-28T12:46:00Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugybf2FmZrPPmwq37qt4AaABAg",
    "author": "@hynekjanousek7887",
    "author_channel_id": "UCsReoPWLs-bjo73tCKM2n9g",
    "text": "This really reminds me of David Hume saying that no matter how crazy a proposition sounds, in philosophy, there will be at least one person who will defend it, and if that person is articulate some people will actually believe it. I am saying this in memory of all those comrades who went to check the supposed utopia in Stalin's Russia and never came back.",
    "like_count": 8,
    "published_at": "2025-07-25T21:58:01Z",
    "is_reply": false,
    "reply_count": 5,
    "replies": [
      {
        "id": "Ugybf2FmZrPPmwq37qt4AaABAg.AL0V4xJybhGAMHpBwbrfDW",
        "author": "@Youva-d2p",
        "text": "@hynekjanousek7887 There was no Russia. It was thankfully dissolved to enable a proper multinational guild-based dictatorship of the working class where the democratic instances were pyramidal and communal.",
        "like_count": 0,
        "published_at": "2025-08-26T12:00:57Z",
        "is_reply": true
      },
      {
        "id": "Ugybf2FmZrPPmwq37qt4AaABAg.AL0V4xJybhGAMHtiIIvRSD",
        "author": "@hynekjanousek7887",
        "text": "@Youva-d2p Thank you for illustrating my thesis.",
        "like_count": 2,
        "published_at": "2025-08-26T12:40:28Z",
        "is_reply": true
      },
      {
        "id": "Ugybf2FmZrPPmwq37qt4AaABAg.AL0V4xJybhGAPDfsae1jxX",
        "author": "@Evelyn80264",
        "text": "Is that why life expectancy plummeted after the dissolution of the USSR, why wages have stagnated in the US without a socialist threat forcing capitalism to pretend to work for the worker? Polls today show that people that lived under the USSR say that life was better back then. Yes the government under Stalin was harsh, it was WW2, America threw japanese people in concentration camps for their race, germany commited genocide, japan raped and killed tens of thousands of women and children, and what did the USSR do? root out traitors and nazi sympathizers from their government? that's really that bad? do you know how many domestic terrorists were in the USSR, destroying factories and trying to sabotage their defence against the nazis?",
        "like_count": 2,
        "published_at": "2025-11-07T10:56:45Z",
        "is_reply": true
      },
      {
        "id": "Ugybf2FmZrPPmwq37qt4AaABAg.AL0V4xJybhGAPDvCWoSomP",
        "author": "@hynekjanousek7887",
        "text": "Please, go to North Korea or spend several years living in a totalitarian system like I did.  How your remarks make  Norh Korea a democratic or a free system or a system of Stalin's Gulags a nice and free place to live in is not really clear. Why should I interpret anything regarding U.S.A., which I presume is your country but not mine, do I want you to interpret French Revolution or Belgian colonianism so that we can decide something about contemporary North Korea or slaughtered Western or Polish communists who dissapeared after they took refuge in the country they idealised for themselves and of which they very knew little even though they constantly put it forward as a place of wonderfull freedom?",
        "like_count": 2,
        "published_at": "2025-11-07T13:10:41Z",
        "is_reply": true
      },
      {
        "id": "Ugybf2FmZrPPmwq37qt4AaABAg.AL0V4xJybhGAPmNmPqPWEm",
        "author": "@JorisVDC",
        "text": "Thank you for sharing the reference to Hume, it's very helpful in this context.\nI fear that this is a case of believing in an ideal and so you start defending anything that seems to be proof of this ideal.\n\nI am with Osho on this: don't believe in anything external like God, ideology or firm of government.\n\nI also would like to live in a tribe, a good community, but I don't trust any form of government to provide this.",
        "like_count": 0,
        "published_at": "2025-11-21T07:42:33Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyUiJIluCdSgFy8eiR4AaABAg",
    "author": "@numbersix8919",
    "author_channel_id": "UCSg0yRT9cP1grJH6LwRnZ9A",
    "text": "Bold words!  Makes a guy think 🤔  maybe.",
    "like_count": 7,
    "published_at": "2025-06-24T07:14:47Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgyUiJIluCdSgFy8eiR4AaABAg.AJk5MqDns4oAJoO5esGR5D",
        "author": "@ClassWarMatrix",
        "text": "When Eastern \"authoritarian\" Communist countries speak of freedom--   they're speaking of a definite social freedom of a particular determinate country/civilization:\nFreedom to be free to define & uphold their own cultures and laws,\nFreedom to insist upon their own People's historical record and their own particular truths,\nFreedom to pursue their own sovereign (partial) (illiberal) paths of political-economic development that aren't dictated by transnational Western bankers, monopolists, governments, and social-engineering NGOs.\n\nWhen Western liberals speak of freedom,  they are speaking of an indefinite, indeterminate, hyper-individualist freedom:\nFreedom to be free from assuming any authentic political partiality or partisanship;  freedom from having any vested interest in state authority,\nFreedom to be free from any and all particular social mores and cultural realities;  free from all personal inhibitions and collective obligations and accountabilities;  free from social-regulation by any morality or religion,  freedom from any definite existence attached to any particular society;  freedom from the social grounds of your own individuality;  freedom from your own dignity,\nfreedom from any necessity to establish a concrete manifestation of freedom.\n\nFreedom for  vs  freedom from.\nThis is why the East is now rising -  while the West is experiencing profound cultural decay and spiritual crisis as it slips back into fascism and perpetual state of emergency.\n\nThe Cartesian metaphysics of liberal philosophy have fully exhausted their world-historic capacity for real progress and now their furthest logical conclusions have led to:\nReddit, atheistic pagan satanism,  a fundamental distrust of reality,  anti-human Malthusianism,  racial-science,  something called a \"gene\",  the reduction of the essence of all human existence down to one-sided biology and \"reproduction of genes\",  the Marvel cinematic universe,  Hitlerism,  anti-Communism,  'wokeism',  eugenics, diversity-equity-inclusion,  elevation of cultural and sexual deviancy to the status of supreme norm of all society,  Epstein islands, the Maidan Revolution,  something called \"Israel\",  de-growth and d3p0pulation agendas, \"War on Terror\",  and all manner of other intellectual and ideological perversions.\n\nBecause the Open Society cannot tolerate enemies of the Open Society,  it cannot tolerate closed societies,  closed individuals nor closed collectives.\n\nAnd so in their pursuit of spreading \"freedom and democracy\" to the \"backwards\" \"totalitarian\" countries,  the liberal himself becomes the totalitarian that he perceives in the world,  and begins to cannibalize and destroy the very same classical-liberal ideals that he once ushered into existence.\n\"In the pursuit of spreading \"enlightened secular humanism\" to the \"backward fanatical Islamic Jihadists\",  to create a world free of atrocities committed by Jihad,  the liberal himself engages in a Jihad for which he will commit atrocities.\" -- Logo Daedalus\n\nThe only positive liberty that you truly have in the capitalist West is:  freedom to be a slave,  freedom to live as undignified cattle,  freedom to be perpetually demoralized about your real human existence,  freedom to get pimped by NGOs and robbed by banks,  freedom to be a prostitute for the highest bidder.",
        "like_count": 0,
        "published_at": "2025-06-25T23:15:26Z",
        "is_reply": true
      },
      {
        "id": "UgyUiJIluCdSgFy8eiR4AaABAg.AJk5MqDns4oAJoQV1yLJ18",
        "author": "@numbersix8919",
        "text": "​@ClassWarMatrixReally really good, but the meaning of \"illiberal\" is  counter to your intent.  \nAs far as I know there is no single opposite to classical liberalism or neoliberalism.\nRather than illiberal, how about antiliberalistic.",
        "like_count": 2,
        "published_at": "2025-06-25T23:36:22Z",
        "is_reply": true
      },
      {
        "id": "UgyUiJIluCdSgFy8eiR4AaABAg.AJk5MqDns4oAJoSnqGp9ZL",
        "author": "@ClassWarMatrix",
        "text": "​@numbersix8919interesting.  I never pondered the meaning of the prefix ill 👍",
        "like_count": 1,
        "published_at": "2025-06-25T23:56:33Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwbLMogx2cUIKvCerh4AaABAg",
    "author": "@ZionistBourgeoisie",
    "author_channel_id": "UCrfo4nja2s_s0vPOSckB8Gg",
    "text": "What do you mean \"the institutions highest of which should be the state\"\n\n\"The proletariat needs the state\" — this phrase is repeated by all opportunists, social-chauvinists, and Kautskyites, who assure us that this is what Marx taught.\nBut they conveniently “forget” to add two essential points:\nFirst, according to Marx, the proletariat needs only a state that is already withering away—that is, a state so constituted that it begins to wither away immediately, and cannot help but wither away.\nSecond, the working people need a state, that is, the proletariat organized as the ruling class.\n\nThe state is a special organization of force—an organization of violence designed for the suppression of a particular class.\n\n-State and Revolution, Vladimir Lenin (page 24)",
    "like_count": 9,
    "published_at": "2025-06-24T22:35:54Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwbLMogx2cUIKvCerh4AaABAg.AJljmIGT72DAJoORIWC8ZL",
        "author": "@ClassWarMatrix",
        "text": "The institution of state withering away doesn't mean government and social authority disappearing.\nThis is what Carlos means.\n\nBut if you're wondering why the state of DPRK is not withering away,  it's probably because they've been under siege since 1950",
        "like_count": 2,
        "published_at": "2025-06-25T23:18:23Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyU61rzLgxfurg7lyB4AaABAg",
    "author": "@reid.7680",
    "author_channel_id": "UCVhSOkvwN6jR0J_PWtxhTZg",
    "text": "I'm legitimately interested but I don't feel like any of my questions are answered",
    "like_count": 13,
    "published_at": "2025-06-24T11:31:48Z",
    "is_reply": false,
    "reply_count": 5,
    "replies": [
      {
        "id": "UgyU61rzLgxfurg7lyB4AaABAg.AJkYmISbnGrAJoKssOeiEJ",
        "author": "@ClassWarMatrix",
        "text": "When Eastern \"authoritarian\" Communist countries speak of freedom--   they're speaking of a definite social freedom of a particular determinate country/civilization:\nFreedom to be free to define & uphold their own cultures and laws,\nFreedom to insist upon their own People's historical record and their own particular truths,\nFreedom to pursue their own sovereign (partial) (illiberal) paths of political-economic development that aren't dictated by transnational Western bankers, monopolists, governments, and social-engineering NGOs.\n\nWhen Western liberals speak of freedom,  they are speaking of an indefinite, indeterminate, hyper-individualist freedom:\nFreedom to be free from assuming any authentic political partiality or partisanship;  freedom from having any vested interest in state authority,\nFreedom to be free from any and all particular social mores and cultural realities;  free from all personal inhibitions and collective obligations and accountabilities;  free from social-regulation by any morality or religion,  freedom from any definite existence attached to any particular society;  freedom from the social grounds of your own individuality;  freedom from your own dignity,\nfreedom from any necessity to establish a concrete manifestation of freedom.\n\nFreedom for  vs  freedom from.\nThis is why the East is now rising -  while the West is experiencing profound cultural decay and spiritual crisis as it slips back into fascism and perpetual state of emergency.\n\nThe Cartesian metaphysics of liberal philosophy have fully exhausted their world-historic capacity for real progress and now their furthest logical conclusions have lead to:\nReddit, atheistic pagan satanism,  a fundamental distrust of reality,  anti-human Malthusianism,  racial-science,  something called a \"gene\",  the reduction of the essence of all human existence down to one-sided biology and \"reproduction of genes\",  the Marvel cinematic universe,  Hitlerism,  anti-Communism,  'wokeism',  eugenics, diversity-equity-inclusion,  elevation of cultural and sexual deviancy to the status of supreme norm of all society,  Epstein islands, the Maidan Revolution,  something called \"Israel\",  de-growth and d3p0pulation agendas, \"War on Terror\",  and all manner of other intellectual and ideological perversions.\n\nBecause the Open Society cannot tolerate enemies of the Open Society,  it cannot tolerate closed societies,  closed individuals nor closed collectives.\n\nAnd so in their pursuit of spreading \"freedom and democracy\" to the \"backwards\" \"totalitarian\" countries,  the liberal himself becomes the totalitarian that he perceives in the world,  and begins to cannibalize and destroy the very same classical-liberal ideals that he once ushered into existence.\n\"In the pursuit of spreading \"enlightened secular humanism\" to the \"backward fanatical Islamic Jihadists\",  to create a world free of atrocities committed by Jihad,  the liberal himself engages in a Jihad for which he will commit atrocities.\" -- Logo Daedalus\n\nThe only positive liberty that you truly have in the capitalist West is:  freedom to be a slave,  freedom to live as undignified cattle,  freedom to be perpetually demoralized about your real human existence,  freedom to get pimped by NGOs and robbed by banks,  freedom to be a prostitute for the highest bidder.",
        "like_count": 5,
        "published_at": "2025-06-25T22:47:20Z",
        "is_reply": true
      },
      {
        "id": "UgyU61rzLgxfurg7lyB4AaABAg.AJkYmISbnGrAKQ5nTgAvOs",
        "author": "@justinroyse4271",
        "text": "@ClassWarMatrix What exactly does sexual deviancy and genes mean to you?",
        "like_count": 0,
        "published_at": "2025-07-11T00:05:54Z",
        "is_reply": true
      },
      {
        "id": "UgyU61rzLgxfurg7lyB4AaABAg.AJkYmISbnGrAKVuB6BrHUy",
        "author": "@reid.7680",
        "text": "@ClassWarMatrix Those ideas have been gestating in my mind for quite awhile, so thank you for directing the question itself towards a territory I feel I am familiar with. What I still struggle with however is how the comparison between the liberal West and North Korea favors the latter by using a definition of alternate freedom that I feel is just as narrow as the hyperindividualistic definition of freedom.\n\nI would buy into this more if I believed that the state of North Korea provided its citizens with community, fulfillment, and purpose. And maybe I don’t believe that because my perceptions of North Korea are not as well-informed as I think, as radical leftists tell me.\n\nI am willing to learn more, but I don’t know where to start, as most radical left sources and media are eager to tell me that my preconceptions are wrong but don’t give me a grounded start I feel comfortable with. \n\nI would like to read more but I also don’t know where to start.",
        "like_count": 1,
        "published_at": "2025-07-13T06:11:07Z",
        "is_reply": true
      },
      {
        "id": "UgyU61rzLgxfurg7lyB4AaABAg.AJkYmISbnGrAKxxs1h7Uuo",
        "author": "@ClassWarMatrix",
        "text": "@reid listen to interviews given by the North Korean refugees and defectors who have come out and said that they wish they could return to DPRK.\nCommunity,  fulfillment,  and purpose  is EXACTLY what they say they miss about DPRK,  which they say is missing from South Korea and other Western societies that they ended up in.\n\nThis is exactly it.\nDPRK can't afford its people much in terms of luxury and wealth,  but what they do have is real community,  a real collective belonging;  communal and familial support systems dating back generations,  which have enabled them to persevere and stay united through unimaginable hardships.\n\nI would recommend you research this with Yandex (because g***le blocks everything)",
        "like_count": 0,
        "published_at": "2025-07-24T13:01:18Z",
        "is_reply": true
      },
      {
        "id": "UgyU61rzLgxfurg7lyB4AaABAg.AJkYmISbnGrAKxyHheHdmr",
        "author": "@ClassWarMatrix",
        "text": "@reid listen to interviews given by the North Korean refugees and defectors who have come out and said that they wish they could return to DPRK.\nCommunity,  fulfillment,  and purpose  is EXACTLY what they say they miss about DPRK,  which they say is missing from South Korea and other Western societies that they ended up in.\n\nThis is exactly it.\nDPRK can't afford its people much in terms of luxury and wealth and consumption,  but what they do have is real community,  a real collective belonging;  communal and familial support systems dating back generations,  which have enabled them to persevere and stay united through unimaginable hardships.\n\nI would recommend you research this with that one Russian search engine that begins with a Y\n(because g***le censors everything)\n(They won't even let me type its name)",
        "like_count": 0,
        "published_at": "2025-07-24T13:04:57Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxwoBrx_8lz6ThT8ut4AaABAg",
    "author": "@Huy-G-Le",
    "author_channel_id": "UCZs2x6MavzfjdbKEAykF0rQ",
    "text": "Most likely untrue, and it isn't like you have like there for more than 10 years while being particularly observant, but it's most likely the single country that is least affected by capitalism and neoliberalism. \n\nA Soviet base economic models of domestic production and self sufficient possible, the pro is that, you economy is most likely contains to your owns nations, you don't get affected by inflations by other country, the con is that, you need to rely solely to your own country capabilities to produces in order to feed, house, and cares for your citizens. \n\nThis bring the limitation in food options, like how during the Soviet era, Russia have chocolates and banana shortage because they weren't allows to import such thing, because of NATO sanction, so North Korea been facing the same issue. \n\nTheir nations are blessed with mineral wealth, as the expense of fertilizes soils, crop yield, extensive farmland and any good land to raise cattle. \n\nIgnorant peoples also forget how, for the early medieval period in England, in the Kingdom of the Anglo Saxon for example, those barbarian doesn't even have potato, red carrot, because they didn't imported it's from elsewhere.",
    "like_count": 5,
    "published_at": "2025-06-24T07:15:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxIf5Mqa3-ybGrlgQp4AaABAg",
    "author": "@DrWoofOfficial",
    "author_channel_id": "UCk_VGZMbL91bhB_XnR3Yotg",
    "text": "Anything we can read or watch to learn more? I have always respected NK and been sceptic in what is said against it, but I'd like to learn more",
    "like_count": 1,
    "published_at": "2025-08-04T15:57:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw6SCVNGEba6y_f4wV4AaABAg",
    "author": "@Clowner-d8l",
    "author_channel_id": "UCWxbKC313kyuVwLCe-uoIOQ",
    "text": "This is arguably even more idiotic than claiming that a man can get pregnant.",
    "like_count": 1,
    "published_at": "2025-12-07T03:15:35Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugw6SCVNGEba6y_f4wV4AaABAg.AQQ5x589PyUAQioM61KTCR",
        "author": "@Darktwistedfateinsane",
        "text": "Whats more idiotic is believing this black and white view of history North Korea is not that bad It isn't perfect and under heavy sanctions but you won't get your family killed for sneaking a USB with lion king in it lmao or not having a state approved hair cut most people who escape exaggerate stories for book sales and media attention and the US puts these on the front news paper because why would you promote the enemy? if someone has something good to say bury it we see it all the time in todays media",
        "like_count": 0,
        "published_at": "2025-12-14T18:57:55Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwUmih1YFupj9_krwl4AaABAg",
    "author": "@TheodricWillow",
    "author_channel_id": "UCmyspGgApc9lTRzOrR2_g3w",
    "text": "Love u but hate the glasses",
    "like_count": 2,
    "published_at": "2025-06-24T17:13:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwt8504vK_KgV5uyhV4AaABAg",
    "author": "@jasonphillips2534",
    "author_channel_id": "UCPcMqGkWkcO_bLhftKW7CUg",
    "text": "But what about the hierarchy that a totalitarian bureaucracy would have how is it popular if they can just control the opinion of the people",
    "like_count": 0,
    "published_at": "2025-12-28T09:45:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy1GLMngBrDINBKlsx4AaABAg",
    "author": "@bowleggedbear",
    "author_channel_id": "UCcQmBIG34quoXbCxtOMN5KQ",
    "text": "What really got me thinking is learning frkm a critical liberal westerner, and shared as if a dunk on the DPRK's absurdly militant culture: most workplaces have a loaded and well stocked gun wrack. Its easily accessible to all because its there for both training and emergency necessity.  They know they are at war for their very survival.  They know they have to trust each other's strength and training. But they aren't voicelessly going along out of fear. They could end themselves or others in a pinch of things were dire. Hostage situations too. They wouldn't survive if they were voiceless.",
    "like_count": 8,
    "published_at": "2025-06-25T03:22:30Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugy1GLMngBrDINBKlsx4AaABAg.AJmF_NrTXSfAKi3cYeb0C1",
        "author": "@yourtrappedinmygenjutsu",
        "text": "most work places don't have a gun rack that's open to employees that's just a blatant lie.",
        "like_count": 0,
        "published_at": "2025-07-18T08:52:30Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugy9eMhhRzaKASGtxeB4AaABAg",
    "author": "@ViejoLocuelo",
    "author_channel_id": "UCMODvdpVaHseL88KbYwQv5A",
    "text": "Ah… ha ha ha ha ha…. Ha ha ha ha…. Stop it!   Ha ha ha ha ha",
    "like_count": 1,
    "published_at": "2025-06-24T15:25:35Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugy9eMhhRzaKASGtxeB4AaABAg.AJkyXZx5-ReAJoQzH6KNyq",
        "author": "@ClassWarMatrix",
        "text": "When Eastern \"authoritarian\" Communist countries speak of freedom--   they're speaking of a definite social freedom of a particular determinate country/civilization:\nFreedom to be free to define & uphold their own cultures and laws,\nFreedom to insist upon their own People's historical record and their own particular truths,\nFreedom to pursue their own sovereign (partial) (illiberal) paths of political-economic development that aren't dictated by transnational Western bankers, monopolists, governments, and social-engineering NGOs.\n\nWhen you-- Western liberals--  speak of freedom,  y'all are speaking of an indefinite, indeterminate, hyper-individualist freedom:\nFreedom to be free from assuming any authentic political partiality or partisanship;  freedom from having any vested interest in state authority,\nFreedom to be free from any and all particular social mores and cultural realities;  free from all personal inhibitions and collective obligations and accountabilities;  free from social-regulation by any morality or religion,  freedom from any definite existence attached to any particular society;  freedom from the social grounds of your own individuality;  freedom from your own dignity,\nfreedom from any necessity to establish a concrete manifestation of freedom.\n\nFreedom for  vs  freedom from.\nThis is why the East is now rising -  while the West is experiencing profound cultural decay and spiritual crisis as it slips back into fascism and perpetual state of emergency.\n\nThe Cartesian metaphysics of liberal philosophy have fully exhausted their world-historic capacity for real progress and now their furthest logical conclusions have led to:\nReddit, atheistic pagan satanism,  a fundamental distrust of reality,  anti-human Malthusianism,  racial-science,  something called a \"gene\",  the reduction of the essence of all human existence down to one-sided biology and \"reproduction of genes\",  the Marvel cinematic universe,  Hitlerism,  anti-Communism,  'wokeism',  eugenics, diversity-equity-inclusion,  elevation of cultural and sexual deviancy to the status of supreme norm of all society,  Epstein islands, the Maidan Revolution,  something called \"Israel\",  de-growth and d3p0pulation agendas, \"War on Terror\",  and all manner of other intellectual and ideological perversions.\n\nBecause the Open Society cannot tolerate enemies of the Open Society,  it cannot tolerate closed societies,  closed individuals nor closed collectives.\n\nAnd so in their pursuit of spreading \"freedom and democracy\" to the \"backwards\" \"totalitarian\" countries,  the liberal himself becomes the totalitarian that he perceives in the world,  and begins to cannibalize and destroy the very same classical-liberal ideals that he once ushered into existence.\n\"In the pursuit of spreading \"enlightened secular humanism\" to the \"backward fanatical Islamic Jihadists\",  to create a world free of atrocities committed by Jihad,  the liberal himself engages in a Jihad for which he will commit atrocities.\" -- Logo Daedalus\n\nThe only positive liberty that you truly have in the capitalist West is:  freedom to be a slave,  freedom to live as undignified cattle,  freedom to be perpetually demoralized about your real human existence,  freedom to get pimped by NGOs and robbed by banks,  freedom to be a prostitute for the highest bidder.",
        "like_count": 1,
        "published_at": "2025-06-25T23:40:38Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyHVe5Qabed5Uola654AaABAg",
    "author": "@paulmichaelfreedman8334",
    "author_channel_id": "UCGMOf7v8Ijh99C6mvyX4xqQ",
    "text": "100% bot and all lies.",
    "like_count": 1,
    "published_at": "2025-06-24T12:01:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwjblfAoO8xc81gXgF4AaABAg",
    "author": "@GallicNine",
    "author_channel_id": "UCxTpxxRMi6NnLNI2yyZNkuA",
    "text": "This is simply bad rage bait. I will give a warning to anyone who doesn’t read up on the world much. North koreas freedom index is among the lowest in the world.",
    "like_count": 1,
    "published_at": "2025-06-24T22:13:38Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzpQA6wplY_y9lpNIJ4AaABAg",
    "author": "@JoCool5000",
    "author_channel_id": "UC4vpQbOtjdSCO69AgibNHQw",
    "text": "Common socialist L",
    "like_count": 3,
    "published_at": "2025-06-29T17:28:26Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgzpQA6wplY_y9lpNIJ4AaABAg.AJy3ZecRJ_jARPN2erst2y",
        "author": "@fineproductions18929",
        "text": "how is it an L",
        "like_count": 0,
        "published_at": "2025-12-31T16:57:10Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugwa7q8SgzaF2e4ebVh4AaABAg",
    "author": "@OffTopic-f3n",
    "author_channel_id": "UCFEUC5cMuyDSgDIUtvjiBag",
    "text": "I mean…. no haha😆",
    "like_count": 1,
    "published_at": "2025-06-26T12:09:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx3OfdWlXQyiyH_Kdx4AaABAg",
    "author": "@pspspspssspspps",
    "author_channel_id": "UC3daJo8YlzsMCiYb0pNAm_w",
    "text": "ragebait",
    "like_count": 6,
    "published_at": "2025-08-31T09:55:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxhSWf24qZ3HebYeml4AaABAg",
    "author": "@porteal8986",
    "author_channel_id": "UCBH-T4ZWvibGQamHrXuqm8Q",
    "text": "Easy to say, harder to back up with facts. This video doesn't address the anti democratic election methods, intellectual suppression, and social repression that exist in North Korea",
    "like_count": 12,
    "published_at": "2025-06-24T21:56:24Z",
    "is_reply": false,
    "reply_count": 9,
    "replies": [
      {
        "id": "UgxhSWf24qZ3HebYeml4AaABAg.AJlfG0A8wzqAJoOZRth7pZ",
        "author": "@ClassWarMatrix",
        "text": "When Eastern \"authoritarian\" Communist countries speak of freedom--   they're speaking of a definite social freedom of a particular determinate country/civilization:\nFreedom to be free to define & uphold their own cultures and laws,\nFreedom to insist upon their own People's historical record and their own particular truths,\nFreedom to pursue their own sovereign (partial) (illiberal) paths of political-economic development that aren't dictated by transnational Western bankers, monopolists, governments, and social-engineering NGOs.\n\nWhen Western liberals speak of freedom,  they are speaking of an indefinite, indeterminate, hyper-individualist freedom:\nFreedom to be free from assuming any authentic political partiality or partisanship;  freedom from having any vested interest in state authority,\nFreedom to be free from any and all particular social mores and cultural realities;  free from all personal inhibitions and collective obligations and accountabilities;  free from social-regulation by any morality or religion,  freedom from any definite existence attached to any particular society;  freedom from the social grounds of your own individuality;  freedom from your own dignity,\nfreedom from any necessity to establish a concrete manifestation of freedom.\n\nFreedom for  vs  freedom from.\nThis is why the East is now rising -  while the West is experiencing profound cultural decay and spiritual crisis as it slips back into fascism and perpetual state of emergency.\n\nThe Cartesian metaphysics of liberal philosophy have fully exhausted their world-historic capacity for real progress and now their furthest logical conclusions have led to:\nReddit, atheistic pagan satanism,  a fundamental distrust of reality,  anti-human Malthusianism,  racial-science,  something called a \"gene\",  the reduction of the essence of all human existence down to one-sided biology and \"reproduction of genes\",  the Marvel cinematic universe,  Hitlerism,  anti-Communism,  'wokeism',  eugenics, diversity-equity-inclusion,  elevation of cultural and sexual deviancy to the status of supreme norm of all society,  Epstein islands, the Maidan Revolution,  something called \"Israel\",  de-growth and d3p0pulation agendas, \"War on Terror\",  and all manner of other intellectual and ideological perversions.\n\nBecause the Open Society cannot tolerate enemies of the Open Society,  it cannot tolerate closed societies,  closed individuals nor closed collectives.\n\nAnd so in their pursuit of spreading \"freedom and democracy\" to the \"backwards\" \"totalitarian\" countries,  the liberal himself becomes the totalitarian that he perceives in the world,  and begins to cannibalize and destroy the very same classical-liberal ideals that he once ushered into existence.\n\"In the pursuit of spreading \"enlightened secular humanism\" to the \"backward fanatical Islamic Jihadists\",  to create a world free of atrocities committed by Jihad,  the liberal himself engages in a Jihad for which he will commit atrocities.\" -- Logo Daedalus\n\nThe only positive liberty that you truly have in the capitalist West is:  freedom to be a slave,  freedom to live as undignified cattle,  freedom to be perpetually demoralized about your real human existence,  freedom to get pimped by NGOs and robbed by banks,  freedom to be a prostitute for the highest bidder.",
        "like_count": 2,
        "published_at": "2025-06-25T23:19:30Z",
        "is_reply": true
      },
      {
        "id": "UgxhSWf24qZ3HebYeml4AaABAg.AJlfG0A8wzqAJoT598dg0z",
        "author": "@TheodricWillow",
        "text": "\"anti democratic election method\" thats just buzzword.  We dont directly elect the president either.   The suppression and repression have mothing to do with democracy which means essentially majority rule, which can be rather aithoritarian.  Thats why the US considers itself a republic.   DPRK is also a republic just more democratic and therefore more authoritarian.",
        "like_count": 3,
        "published_at": "2025-06-25T23:59:03Z",
        "is_reply": true
      },
      {
        "id": "UgxhSWf24qZ3HebYeml4AaABAg.AJlfG0A8wzqAJp8mgzDUqy",
        "author": "@salj.5459",
        "text": "@TheodricWillow Insane mental gymnastics",
        "like_count": 1,
        "published_at": "2025-06-26T06:20:52Z",
        "is_reply": true
      },
      {
        "id": "UgxhSWf24qZ3HebYeml4AaABAg.AJlfG0A8wzqAJxyPt4RB2b",
        "author": "@TheodricWillow",
        "text": "​​@salj.5459its actually simple but youre a brain washed idiot.  Democracy inherently involves authority.  The question is which class is represented.  In DPRK people get housing for free and a bogger house of you have kids. They dont pay taxes either.  Voting democrat or Republican is not automatically the ultimate or only form of democracy.   I bet you dont even own land yourself nor have any participation in your local governance nor in any form of co op o workersr union.   Youre likely a peasant who cries \"mental gymnastics\" when someone challenges your NPC loop.",
        "like_count": 0,
        "published_at": "2025-06-29T16:34:40Z",
        "is_reply": true
      },
      {
        "id": "UgxhSWf24qZ3HebYeml4AaABAg.AJlfG0A8wzqAPDglSGKVSB",
        "author": "@Evelyn80264",
        "text": "@salj.5459 It's illegal to run for office as a communist in america. Look at Mcarthyism, we arent democratic either, we have two corporate parties, and whichever gets more funding from corporate donors wins from the few people that even bother voting. Nobody's won from a different party since 1853 with Millard Fillmore.",
        "like_count": 0,
        "published_at": "2025-11-07T11:04:31Z",
        "is_reply": true
      },
      {
        "id": "UgxhSWf24qZ3HebYeml4AaABAg.AJlfG0A8wzqAPHYFwngFbM",
        "author": "@crackheadnaomi",
        "text": "@Evelyn80264 its not illegal though???",
        "like_count": 0,
        "published_at": "2025-11-08T22:58:24Z",
        "is_reply": true
      },
      {
        "id": "UgxhSWf24qZ3HebYeml4AaABAg.AJlfG0A8wzqAPSyZwerafT",
        "author": "@Evelyn80264",
        "text": "@crackheadnaomi Communist Control Act of 1954, membership in a communist party meant a $10,000 fine or five years imprisonment. this isn't really used anymore, but it was never repealed, if a communist movement ever pops up in america again, i'm certain they wont hesitate to reinstate mccarthyism. Plus several states have laws making it illegal to \"assemble for purposes of communism\" I know florida has one, so any communist movement can be broken up as soon as they organize at all.",
        "like_count": 0,
        "published_at": "2025-11-13T09:28:42Z",
        "is_reply": true
      },
      {
        "id": "UgxhSWf24qZ3HebYeml4AaABAg.AJlfG0A8wzqAPdXhYJqrgt",
        "author": "@crackheadnaomi",
        "text": "@Evelyn80264 proper victim mentality",
        "like_count": 0,
        "published_at": "2025-11-17T21:16:06Z",
        "is_reply": true
      },
      {
        "id": "UgxhSWf24qZ3HebYeml4AaABAg.AJlfG0A8wzqAQXNgka4Tt8",
        "author": "@LewisSmith-f2q",
        "text": "So youve fallen for what Western media outlets have portrayed of NK? Got it.",
        "like_count": 1,
        "published_at": "2025-12-09T23:05:19Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxfWcYNGUs0w1S70Ad4AaABAg",
    "author": "@dylanwaller2468",
    "author_channel_id": "UCJ8LVgVo1mLC2lYZiVDcrpA",
    "text": "So are the Kim family the common people now? Are they the working class?",
    "like_count": 4,
    "published_at": "2025-06-24T16:20:10Z",
    "is_reply": false,
    "reply_count": 7,
    "replies": [
      {
        "id": "UgxfWcYNGUs0w1S70Ad4AaABAg.AJl3mIZnCE5AJoQUuXXDs1",
        "author": "@ClassWarMatrix",
        "text": "No but they hold a popular mandate from the working class and would've long been old news if they were just serving their own petty & selfish personal/individual interests",
        "like_count": 1,
        "published_at": "2025-06-25T23:36:21Z",
        "is_reply": true
      },
      {
        "id": "UgxfWcYNGUs0w1S70Ad4AaABAg.AJl3mIZnCE5AJp94LYtsa0",
        "author": "@salj.5459",
        "text": "@ClassWarMatrix What a bunch of nonsense. You could say the same thing about medieval monarchies, which lasted for hundreds of years before being overthrown.",
        "like_count": 4,
        "published_at": "2025-06-26T06:23:25Z",
        "is_reply": true
      },
      {
        "id": "UgxfWcYNGUs0w1S70Ad4AaABAg.AJl3mIZnCE5AJpA7o7yUf4",
        "author": "@ClassWarMatrix",
        "text": "@ Yeah monarchies did perform such a role historically for a long time,  until they were subverted by newly emerging oligarchies.\nSuch is the trend of historical development since antiquity.\nYou should read the works of Michael Hudson about this.\n\nLucky for DPRK,  Marxism-Leninism specializes in liquidating oligarchies to preserve the central authority of the sovereign.",
        "like_count": 0,
        "published_at": "2025-06-26T06:32:37Z",
        "is_reply": true
      },
      {
        "id": "UgxfWcYNGUs0w1S70Ad4AaABAg.AJl3mIZnCE5AK0ysO5to4H",
        "author": "@dylanwaller2468",
        "text": "@ClassWarMatrix A: There is a clear military/WPK oligarchy in the DPRK that obviously benefits enormously from its close association with the Kim family.\nB: The DPRK hasn’t officially followed Marxism-Leninism in decades.\nC: The idea of there being one, centralized personalist sovereign is completely antithetical to the concept of a society where the working class hold political, social, and economic power, because in such a society, only the sovereign would be in control. So where’s the leftism here?",
        "like_count": 3,
        "published_at": "2025-07-01T05:55:39Z",
        "is_reply": true
      },
      {
        "id": "UgxfWcYNGUs0w1S70Ad4AaABAg.AJl3mIZnCE5AKx2ymiedij",
        "author": "@salj.5459",
        "text": "@ClassWarMatrix Which work of Michael Hudson specifically? I bought two of his books on finance (Super Imperialism and Killing the Host) but haven't gotten around to reading them yet",
        "like_count": 0,
        "published_at": "2025-07-24T04:35:24Z",
        "is_reply": true
      },
      {
        "id": "UgxfWcYNGUs0w1S70Ad4AaABAg.AJl3mIZnCE5AKxvakac4Zb",
        "author": "@ClassWarMatrix",
        "text": "@salj Specifically about the dynamic between oligarchs vs popular sovereigns throughout history,  \"The Collapse of Antiquity\" covers this in great depth.\nThough it is a recurring topic through all of his books i believe.\nI haven't read Killing the Host yet,  but Superimperialism is his most important work I'd say.  That one's crucial for understanding how the imperialist system has evolved since the capitalism of the 1800s,  and how it functions today in the post-Bretton-Woods era where commodity-money has been done away with.\n\"And Forgive Them Their Debts\" is also a big one,   it's about the Jubilee Years during the Bronze Age and the Old Testament era where sovereigns used to frustrate the formation of oligarchies through cyclical debt cancelations and slave emancipations.  (The Greeks and Romans got rid of the Jubilee Years when they conquered the Middle East,  and it was Christianity that arose in a revolutionary attempt to bring them back)",
        "like_count": 0,
        "published_at": "2025-07-24T12:41:28Z",
        "is_reply": true
      },
      {
        "id": "UgxfWcYNGUs0w1S70Ad4AaABAg.AJl3mIZnCE5AKxvxNo0Edc",
        "author": "@ClassWarMatrix",
        "text": "@dylan 1. I don't think you know what oligarchy means.\nMoney doesn't dictate or determine the content of DPRK's politics or government.\nIn cases where it does,  it is corruption,  and is punished ruthlessly.\n\nYou don't need to be associated with the Kim family in order to achieve a high standing in military or government,  or to have upward mobility in society.\n\n2. Juche is derivative of Marxism-Leninism.\nIt is a new synthesis of ML that corresponds to the material conditions of Korea and the national context of Korea,  similar to 'socialism with Chinese characteristics'.\n\nML is a living science which is constantly evolving.\nIt's not a platonic ideal,  it's not a static form.\n\n3. You're not thinking dialectically about political-economy.\nThe working class never directly holds state power and they never directly administer society.\nBecause they're busy working.\nIt is the job of statesmen and sovereigns to wield power in the interests of the masses (in the interests of general labor,  in the case of Communist states).\nIn DPRK there are direct means through which workers and ordinary people influence the state,  and they do this through the party,  through their enterprises & workplaces,  and through other collective organizations.\nBut they don't directly preside over state organs.\nAnd neither can Kim Jong Un just do whatever he wants willy nilly at his own personal behest.\n\nThe WPK holds power at the behest of a popular mandate from workers.  Not at the behest of oligarchs and landowners and bourgeoisie.\nIf DPRK was run by oligarchs, it would've long either collapsed,  or sold out to Western banks--  as is the dominant tendency of oligarchs in the 21st century.",
        "like_count": 0,
        "published_at": "2025-07-24T12:44:33Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyUheXe-YHEabNBeJB4AaABAg",
    "author": "@devin233",
    "author_channel_id": "UCDzJ5YzCkFpTQGRZ7Cuuy9w",
    "text": "eeeeeeh I disagree. Now, the DPRK is certainly more democratic than most in the west give them credit for, to say its THE most free and democratic country on earth seems a bit excessive. The DPRK isnt even the best example of modern proletarian democracy that goes to Cuba (based on my knowledge.) So while I think this guy is fairly well intentioned, I don’t really agree with this claim.",
    "like_count": 41,
    "published_at": "2025-06-24T07:38:16Z",
    "is_reply": false,
    "reply_count": 12,
    "replies": [
      {
        "id": "UgyUheXe-YHEabNBeJB4AaABAg.AJk82rUf-KAAJkHk9QGdvk",
        "author": "@AndrewAddisonUniqueDrewski980",
        "text": "You obviously don't know what you are even talking about. North Koreans are the real Democratic Socialist Traditionalist Far Left people overseas versus the ones here in the West. Fake Democratic Socialists are both the Democratic Party and Republican Party here in the United States of America.",
        "like_count": 0,
        "published_at": "2025-06-24T09:02:58Z",
        "is_reply": true
      },
      {
        "id": "UgyUheXe-YHEabNBeJB4AaABAg.AJk82rUf-KAAJkID0qySIp",
        "author": "@AndrewAddisonUniqueDrewski980",
        "text": "Disagree with what exactly? You are not making any sense since you're so used to what the fake Democrats of the United States of America have  been feeding your brain to believe all these years. North Korea is one the real Democratic Socialist countries overseas.",
        "like_count": 0,
        "published_at": "2025-06-24T09:07:02Z",
        "is_reply": true
      },
      {
        "id": "UgyUheXe-YHEabNBeJB4AaABAg.AJk82rUf-KAAJkbZ9zB2og",
        "author": "@paulmichaelfreedman8334",
        "text": "DPRK is totally non-democratic. Anything you think you know is a pack of lies and a front. Go visit NK, all you will see is what they want you to see, but the rest of the country lives in absolute poverty, and those parts you never ever get to photograph.The kim family are greedy butchers.",
        "like_count": 0,
        "published_at": "2025-06-24T12:04:50Z",
        "is_reply": true
      },
      {
        "id": "UgyUheXe-YHEabNBeJB4AaABAg.AJk82rUf-KAAJkpCVCMwmO",
        "author": "@isak86",
        "text": "@antimattvCuba has a much more extensive electoral system and doesn’t have a single self serving family at the top that gains to benefit from being economically closed off.",
        "like_count": 7,
        "published_at": "2025-06-24T14:04:04Z",
        "is_reply": true
      },
      {
        "id": "UgyUheXe-YHEabNBeJB4AaABAg.AJk82rUf-KAAJl7rBd5uuq",
        "author": "@borkingborker5567",
        "text": "I agree with you. But I would also like to add that the DPRK is still technically at war with an armistice in place. With any country, wartime results in reduced freedoms and liberties. I believe DPRK would have more freedoms and liberties if the war officially ended, all war games were halted, sanctions were lifted, and relations normalized.",
        "like_count": 8,
        "published_at": "2025-06-24T16:55:47Z",
        "is_reply": true
      },
      {
        "id": "UgyUheXe-YHEabNBeJB4AaABAg.AJk82rUf-KAAJlIkC6DMjX",
        "author": "@devin233",
        "text": "@borkingborker5567for sure",
        "like_count": 0,
        "published_at": "2025-06-24T18:30:57Z",
        "is_reply": true
      },
      {
        "id": "UgyUheXe-YHEabNBeJB4AaABAg.AJk82rUf-KAAJnRo5UhcuK",
        "author": "@morningstararun6278",
        "text": "​@isak86 \"That gains to benefit from being economically closed off\"\n\nSays so much about your understanding of DPRK. That family you are criticizing, has always been ready to open upto the world, on its own terms. Heck, they even tried to create a Special Administrative Region like Hong Kong. But they were asked to let go off their nukes. Even that was deemed negotiable by the Korean side. But the Hong Kong business magnate who was supposed to invest in DPRK at that time, was a big financial fraud, whom China wanted gone at all cost. And making him invest in a place in DPRK that sits close to North Eastern China, and that too in an open city like Hong Kong was seen as extremely suspicious by China. In the end, Chinese officials have said that they will rather have a non-open DPRK imas their North Eastern neighborhood, instead of a Hong Kong like city directly sitting on their border. If you want to blame the closed economic model of DPRK, blame America and China.",
        "like_count": 5,
        "published_at": "2025-06-25T14:28:36Z",
        "is_reply": true
      },
      {
        "id": "UgyUheXe-YHEabNBeJB4AaABAg.AJk82rUf-KAAJnpiQ2ahYi",
        "author": "@isak86",
        "text": "@morningstararun6278ok that’s fair and I didn’t know that. But I just feel that Kim jong un has strayed a bit too far from what his dad and grandfather did. I know that most of what I see of him is just propaganda but I also haven’t heard anything amazing about him even from actual leftist. If there’s any thing you’ve heard I’d be glad to listen.",
        "like_count": 0,
        "published_at": "2025-06-25T18:06:17Z",
        "is_reply": true
      },
      {
        "id": "UgyUheXe-YHEabNBeJB4AaABAg.AJk82rUf-KAAJu0wpu00pK",
        "author": "@famousplan2693",
        "text": "Nah Cuba withheld popular reforms as blackmail to the population during the latest referendum.",
        "like_count": 1,
        "published_at": "2025-06-28T03:48:33Z",
        "is_reply": true
      },
      {
        "id": "UgyUheXe-YHEabNBeJB4AaABAg.AJk82rUf-KAAJy8FYkq6mC",
        "author": "@devin233",
        "text": "⁠@kevintewey1157I mean, yeah. At the time I was just stating my current feelings on the claim in the video. I didn’t post the comment above with the expectation that people would reply to it. It was also entirely based on what I already knew, which isn’t much frankly because i’m still quite new to the whole Marxism thing.",
        "like_count": 0,
        "published_at": "2025-06-29T18:09:22Z",
        "is_reply": true
      },
      {
        "id": "UgyUheXe-YHEabNBeJB4AaABAg.AJk82rUf-KAAK3-69OkS0i",
        "author": "@kiythetheocrat5723",
        "text": "@isak86don’t search up Fidel Castros son",
        "like_count": 0,
        "published_at": "2025-07-02T00:44:53Z",
        "is_reply": true
      },
      {
        "id": "UgyUheXe-YHEabNBeJB4AaABAg.AJk82rUf-KAAMUTveueii6",
        "author": "@pspspspssspspps",
        "text": "go ghere then, little worm",
        "like_count": 0,
        "published_at": "2025-08-31T09:56:29Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx8rND1glkP5gvRfGt4AaABAg",
    "author": "@justinroyse4271",
    "author_channel_id": "UC_NpCnmtbnGuwk7R1E_v4iA",
    "text": "I have no idea how one comes up with delusional brainless takes like these",
    "like_count": 2,
    "published_at": "2025-07-11T00:02:38Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugx8rND1glkP5gvRfGt4AaABAg.AKQ5QZ-ynY2ARnPklm9Mfj",
        "author": "@Michael_Arnold",
        "text": "You just think outside your brainwashing.",
        "like_count": 0,
        "published_at": "2026-01-10T10:21:50Z",
        "is_reply": true
      },
      {
        "id": "Ugx8rND1glkP5gvRfGt4AaABAg.AKQ5QZ-ynY2ARo9kGwvK9K",
        "author": "@justinroyse4271",
        "text": "@Michael_ArnoldDawg, North Korea is one of the most totalitarian states with low development. This is delusional talk, demonstrate to me how I’m being delusional, North Korea is the direct opposite of a workers state. It’s a den generated monarchy the Kim dynasty controls.",
        "like_count": 0,
        "published_at": "2026-01-10T17:21:11Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxJ8npAhcWQ-i8EiPt4AaABAg",
    "author": "@jeffklenovic4386",
    "author_channel_id": "UCW1CNnqaxI4BeqFT7IVZk7w",
    "text": "I do not know much about what it is like to live in North Korea….. neither does Carlos. Clickbait will bite you in the ass sometimes. The good professor lost credibility on this one.",
    "like_count": 3,
    "published_at": "2025-06-24T15:07:29Z",
    "is_reply": false,
    "reply_count": 5,
    "replies": [
      {
        "id": "UgxJ8npAhcWQ-i8EiPt4AaABAg.AJkwSvME2L6AJoQhrQQVYL",
        "author": "@ClassWarMatrix",
        "text": "When Eastern \"authoritarian\" Communist countries speak of freedom--   they're speaking of a definite social freedom of a particular determinate country/civilization:\nFreedom to be free to define & uphold their own cultures and laws,\nFreedom to insist upon their own People's historical record and their own particular truths,\nFreedom to pursue their own sovereign (partial) (illiberal) paths of political-economic development that aren't dictated by transnational Western bankers, monopolists, governments, and social-engineering NGOs.\n\nWhen Western liberals speak of freedom,  they are speaking of an indefinite, indeterminate, hyper-individualist freedom:\nFreedom to be free from assuming any authentic political partiality or partisanship;  freedom from having any vested interest in state authority,\nFreedom to be free from any and all particular social mores and cultural realities;  free from all personal inhibitions and collective obligations and accountabilities;  free from social-regulation by any morality or religion,  freedom from any definite existence attached to any particular society;  freedom from the social grounds of your own individuality;  freedom from your own dignity,\nfreedom from any necessity to establish a concrete manifestation of freedom.\n\nFreedom for  vs  freedom from.\nThis is why the East is now rising -  while the West is experiencing profound cultural decay and spiritual crisis as it slips back into fascism and perpetual state of emergency.\n\nThe Cartesian metaphysics of liberal philosophy have fully exhausted their world-historic capacity for real progress and now their furthest logical conclusions have led to:\nReddit, atheistic pagan satanism,  a fundamental distrust of reality,  anti-human Malthusianism,  racial-science,  something called a \"gene\",  the reduction of the essence of all human existence down to one-sided biology and \"reproduction of genes\",  the Marvel cinematic universe,  Hitlerism,  anti-Communism,  'wokeism',  eugenics, diversity-equity-inclusion,  elevation of cultural and sexual deviancy to the status of supreme norm of all society,  Epstein islands, the Maidan Revolution,  something called \"Israel\",  de-growth and d3p0pulation agendas, \"War on Terror\",  and all manner of other intellectual and ideological perversions.\n\nBecause the Open Society cannot tolerate enemies of the Open Society,  it cannot tolerate closed societies,  closed individuals nor closed collectives.\n\nAnd so in their pursuit of spreading \"freedom and democracy\" to the \"backwards\" \"totalitarian\" countries,  the liberal himself becomes the totalitarian that he perceives in the world,  and begins to cannibalize and destroy the very same classical-liberal ideals that he once ushered into existence.\n\"In the pursuit of spreading \"enlightened secular humanism\" to the \"backward fanatical Islamic Jihadists\",  to create a world free of atrocities committed by Jihad,  the liberal himself engages in a Jihad for which he will commit atrocities.\" -- Logo Daedalus\n\nThe only positive liberty that you truly have in the capitalist West is:  freedom to be a slave,  freedom to live as undignified cattle,  freedom to be perpetually demoralized about your real human existence,  freedom to get pimped by NGOs and robbed by banks,  freedom to be a prostitute for the highest bidder.",
        "like_count": 1,
        "published_at": "2025-06-25T23:38:15Z",
        "is_reply": true
      },
      {
        "id": "UgxJ8npAhcWQ-i8EiPt4AaABAg.AJkwSvME2L6AJoZ8e5kWMf",
        "author": "@jeffklenovic4386",
        "text": "You are giving the leadership in North Korea far too much leeway. There have been divisions between various Socialist states from the beginning. The best example is the tension between Stalin and Tito. When you compare North Korea with Vietnam, it is apparent that the mixed model Vietnam chose (similar to modern Day China) has led to much more prosperity and \"freedom\" for the Vietnamese ​compared to the North Koreans. We have similar disparities in the West. An example is the Scandal avian countries with a more mixed economy than the US. The bit about \"freedom\" in North Korea, regardless of how you describe their economic cannot be taken seriously. Carlos missed the mark on this one@ClassWarMatrix",
        "like_count": 3,
        "published_at": "2025-06-26T00:51:57Z",
        "is_reply": true
      },
      {
        "id": "UgxJ8npAhcWQ-i8EiPt4AaABAg.AJkwSvME2L6AK-QidEN_dg",
        "author": "@jeffklenovic4386",
        "text": "I live in MX now. You are missing the point. To suggest that the people of North Korea have the same freedoms as Russians, Mexicans, Americans or the Vietnamese is​ ludicrous. Just because a country is Socialists, Communist or Capitalist does not necessarily mean that it is better or worse. The US cannot compete with Norway anymore than the North Koreans can against the Chinese in terms of prosperity or personal freedoms. The Chinese Communist party is much more democratic now than it was under Mao and even more so than N. korea@kevintewey1157",
        "like_count": 0,
        "published_at": "2025-06-30T15:29:15Z",
        "is_reply": true
      },
      {
        "id": "UgxJ8npAhcWQ-i8EiPt4AaABAg.AJkwSvME2L6AK-R5P_XljZ",
        "author": "@jeffklenovic4386",
        "text": "​@kevintewey1157too funny Kevin.  There are many sources and different takes. People that fall into the extremes on any political ideology need to be reigned in periodically. Some people who are book smart get carried away sometimes in the argument and cannot see the forest from the trees. The North Koreans do not even want to pull back the curtain to allow people to take a closer look.",
        "like_count": 0,
        "published_at": "2025-06-30T15:32:29Z",
        "is_reply": true
      },
      {
        "id": "UgxJ8npAhcWQ-i8EiPt4AaABAg.AJkwSvME2L6ALeE9yFe20M",
        "author": "@jeffklenovic4386",
        "text": "​@kevintewey1157where is the laugh button when you need it?",
        "like_count": 0,
        "published_at": "2025-08-10T17:39:01Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxEOQWEe-jgbKolXPx4AaABAg",
    "author": "@CatsAgainstCapitalism",
    "author_channel_id": "UCszlZGMxPB58gSwlZtrNM3w",
    "text": "So, this guy's a bootlicker. Nice. And not at all shocking.",
    "like_count": 0,
    "published_at": "2025-11-16T19:15:04Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxtEhI111luhJ08crl4AaABAg",
    "author": "@crackheadnaomi",
    "author_channel_id": "UCPB3j4TnP-m4Cgsof2hnRWA",
    "text": "please quit while youre behind",
    "like_count": 0,
    "published_at": "2025-11-08T22:56:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyxjwpoIJTovjy7K2p4AaABAg",
    "author": "@damien4969",
    "author_channel_id": "UCvlGHIuC6fEB7j7otJO69Gg",
    "text": "Ight this I’m out this is insane",
    "like_count": 7,
    "published_at": "2025-06-24T16:10:01Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgyxjwpoIJTovjy7K2p4AaABAg.AJl2bwgMrMcAJoN9PaHO6P",
        "author": "@ClassWarMatrix",
        "text": "When Eastern \"authoritarian\" Communist countries speak of freedom--   they're speaking of a definite social freedom of a particular determinate country/civilization:\nFreedom to be free to define & uphold their own cultures and laws,\nFreedom to insist upon their own People's historical record and their own particular truths,\nFreedom to pursue their own sovereign (partial) (illiberal) paths of political-economic development that aren't dictated by transnational Western bankers, monopolists, governments, and social-engineering NGOs.\n\nWhen you-- Western liberals--  speak of freedom,  y'all are speaking of an indefinite, indeterminate, hyper-individualist freedom:\nFreedom to be free from assuming any authentic political partiality or partisanship;  freedom from having any vested interest in state authority,\nFreedom to be free from any and all particular social mores and cultural realities;  free from all personal inhibitions and collective obligations and accountabilities;  free from social-regulation by any morality or religion,  freedom from any definite existence attached to any particular society;  freedom from the social grounds of your own individuality;  freedom from your own dignity,\nfreedom from any necessity to establish a concrete manifestation of freedom.\n\nFreedom for  vs  freedom from.\nThis is why the East is now rising -  while the West is experiencing profound cultural decay and spiritual crisis as it slips back into fascism and perpetual state of emergency.\n\nThe Cartesian metaphysics of liberal philosophy have fully exhausted their world-historic capacity for real progress and now their furthest logical conclusions have led to:\nReddit, atheistic pagan satanism,  a fundamental distrust of reality,  anti-human Malthusianism,  racial-science,  something called a \"gene\",  the reduction of the essence of all human existence down to one-sided biology and \"reproduction of genes\",  the Marvel cinematic universe,  Hitlerism,  anti-Communism,  'wokeism',  eugenics, diversity-equity-inclusion,  elevation of cultural and sexual deviancy to the status of supreme norm of all society,  Epstein islands, the Maidan Revolution,  something called \"Israel\",  de-growth and d3p0pulation agendas, \"War on Terror\",  and all manner of other intellectual and ideological perversions.\n\nBecause the Open Society cannot tolerate enemies of the Open Society,  it cannot tolerate closed societies,  closed individuals nor closed collectives.\n\nAnd so in their pursuit of spreading \"freedom and democracy\" to the \"backwards\" \"totalitarian\" countries,  the liberal himself becomes the totalitarian that he perceives in the world,  and begins to cannibalize and destroy the very same classical-liberal ideals that he once ushered into existence.\n\"In the pursuit of spreading \"enlightened secular humanism\" to the \"backward fanatical Islamic Jihadists\",  to create a world free of atrocities committed by Jihad,  the liberal himself engages in a Jihad for which he will commit atrocities.\" -- Logo Daedalus\n\nThe only positive liberty that you truly have in the capitalist West is:  freedom to be a slave,  freedom to live as undignified cattle,  freedom to be perpetually demoralized about your real human existence,  freedom to get pimped by NGOs and robbed by banks,  freedom to be a prostitute for the highest bidder.",
        "like_count": 1,
        "published_at": "2025-06-25T23:07:12Z",
        "is_reply": true
      },
      {
        "id": "UgyxjwpoIJTovjy7K2p4AaABAg.AJl2bwgMrMcAJoON0TXe95",
        "author": "@damien4969",
        "text": "@ClassWarMatrixdid you type this up from your basement? I don’t want to be a slave of Kim Jon Un either",
        "like_count": 2,
        "published_at": "2025-06-25T23:17:48Z",
        "is_reply": true
      },
      {
        "id": "UgyxjwpoIJTovjy7K2p4AaABAg.AJl2bwgMrMcAJoQHDLTp3E",
        "author": "@ClassWarMatrix",
        "text": "Nobody saying u need to go live over there lol.\nImprove your own country",
        "like_count": 1,
        "published_at": "2025-06-25T23:34:29Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyBOjEZi2DpGz_Yb9F4AaABAg",
    "author": "@JorisVDC",
    "author_channel_id": "UCBle_eQ4W_6ylf0fMelpdGQ",
    "text": "Oh gee, where do we begin?\nWell lastly DPRK has given the people half a day of holiday to procreate more.\nPeople love their freedom and power so much that they don't want to make children anymore.\n\nIf North Korea is such a beacon of freedom and democracy, there would be no issue with the birth rate because immigration would compensate right?\nAnd where do all the immigration actually go to?\n\nCarlos can call himself a philosophy professor, yet he has no problem discarding basic facts in order to make his ideology right.",
    "like_count": 1,
    "published_at": "2025-10-14T13:46:59Z",
    "is_reply": false,
    "reply_count": 7,
    "replies": [
      {
        "id": "UgyBOjEZi2DpGz_Yb9F4AaABAg.AOGBHKOFoOLAPlpR024gMK",
        "author": "@Bredafromdejungule",
        "text": "The NK have TFR of 1.8 per woman , the south has a TFR of 0.75. That's less than half.   Fertility isn't a measure of being happy, but if you're making it out to be, then at least get the facts straight.",
        "like_count": 1,
        "published_at": "2025-11-21T02:33:39Z",
        "is_reply": true
      },
      {
        "id": "UgyBOjEZi2DpGz_Yb9F4AaABAg.AOGBHKOFoOLAPmN8X75bvI",
        "author": "@JorisVDC",
        "text": "​@BredafromdejunguleI stand corrected, South Korea is giving people a day off to make children.\n\nAt any rate both Korea's aren't in the greatest spot.\n\nThe North has the advantage that they are not under the tyranny of a Central Bank, but rather a Communist dynasty.\n\nSo yeah, it's not looking great.",
        "like_count": 0,
        "published_at": "2025-11-21T07:36:58Z",
        "is_reply": true
      },
      {
        "id": "UgyBOjEZi2DpGz_Yb9F4AaABAg.AOGBHKOFoOLARPMhjI30KS",
        "author": "@fineproductions18929",
        "text": "Well north korea is being destroyed by the west so they cant afford to have kids",
        "like_count": 1,
        "published_at": "2025-12-31T16:54:11Z",
        "is_reply": true
      },
      {
        "id": "UgyBOjEZi2DpGz_Yb9F4AaABAg.AOGBHKOFoOLARPZ-u23Q7o",
        "author": "@JorisVDC",
        "text": "​@fineproductions18929It surely has nothing to do with the totalitarian regime.\nBut yes, the West is slowly but surely moving towards the same totalitarianism, if we don't stop it soon.",
        "like_count": 1,
        "published_at": "2025-12-31T18:41:39Z",
        "is_reply": true
      },
      {
        "id": "UgyBOjEZi2DpGz_Yb9F4AaABAg.AOGBHKOFoOLARRu8X3pGel",
        "author": "@fineproductions18929",
        "text": "@JorisVDCBs. the west is already totalitarian and is controlled by an international elite that taxes their workers to absolute poverty while enriching their elites. North korea is authoritarian but in a good way. the west's sanctions have made north korea much worse and the only reason they put sanctions is because their financial system isnt controlled by the financial elites.",
        "like_count": 1,
        "published_at": "2026-01-01T16:33:33Z",
        "is_reply": true
      },
      {
        "id": "UgyBOjEZi2DpGz_Yb9F4AaABAg.AOGBHKOFoOLARRuXuawjUN",
        "author": "@JorisVDC",
        "text": "​@fineproductions18929I agree with you about the West, yet I rather live here in Belgium, Europe than in North Korea.",
        "like_count": 0,
        "published_at": "2026-01-01T16:37:01Z",
        "is_reply": true
      },
      {
        "id": "UgyBOjEZi2DpGz_Yb9F4AaABAg.AOGBHKOFoOLARXEIO_5UxG",
        "author": "@fineproductions18929",
        "text": "@JorisVDCYeah i wouldnt want to live in a country that has been completely destroyed by the west either",
        "like_count": 0,
        "published_at": "2026-01-03T18:14:36Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxhTCdOXF4n7reysxp4AaABAg",
    "author": "@forgotMyUsername100",
    "author_channel_id": "UC3vP9YzOQ6unkqwl8JK-H-w",
    "text": "I get that defectors are a big source of info on N.Korea & the US has propaganda against them -- but your assertion about \"democratic and free\" sounds like quite a stretch based on everything I've heard AND you presented NO EVIDENCE.\nI think you've got a bad take - just because the capitalist oligarchs don't like N.Korea doesn't mean N.Korea is good, two things can be wrong at once - just look at Republicans & Democrats.\nN.Korea appears to have slave labor prison-camps just like the USA, and the ruling elite there live like the capitalist oligarchs here, while the Korean people suffer malnutrition - that at least is provable. \n\nAnd it's not democratic if you can't vote out the leader -- that's authoritarianism. If you think arbitrary authority is good, I've got to unsubscribe -- the ICE Gestapo are bad, but so were the KGB. If you think the USA is bad because you want to be the oligarch, you are not better than the capitalists.",
    "like_count": 1,
    "published_at": "2025-06-25T16:25:09Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgxhTCdOXF4n7reysxp4AaABAg.AJne8i6dqi8AJoR5qGMh2c",
        "author": "@ClassWarMatrix",
        "text": "When Eastern \"authoritarian\" Communist countries speak of freedom--   they're speaking of a definite social freedom of a particular determinate country/civilization:\nFreedom to be free to define & uphold their own cultures and laws,\nFreedom to insist upon their own People's historical record and their own particular truths,\nFreedom to pursue their own sovereign (partial) (illiberal) paths of political-economic development that aren't dictated by transnational Western bankers, monopolists, governments, and social-engineering NGOs.\n\nWhen you-- Western liberals--  speak of freedom,  y'all are speaking of an indefinite, indeterminate, hyper-individualist freedom:\nFreedom to be free from assuming any authentic political partiality or partisanship;  freedom from having any vested interest in state authority,\nFreedom to be free from any and all particular social mores and cultural realities;  free from all personal inhibitions and collective obligations and accountabilities;  free from social-regulation by any morality or religion,  freedom from any definite existence attached to any particular society;  freedom from the social grounds of your own individuality;  freedom from your own dignity,\nfreedom from any necessity to establish a concrete manifestation of freedom.\n\nFreedom for  vs  freedom from.\nThis is why the East is now rising -  while the West is experiencing profound cultural decay and spiritual crisis as it slips back into fascism and perpetual state of emergency.\n\nThe Cartesian metaphysics of liberal philosophy have fully exhausted their world-historic capacity for real progress and now their furthest logical conclusions have led to:\nReddit, atheistic pagan satanism,  a fundamental distrust of reality,  anti-human Malthusianism,  racial-science,  something called a \"gene\",  the reduction of the essence of all human existence down to one-sided biology and \"reproduction of genes\",  the Marvel cinematic universe,  Hitlerism,  anti-Communism,  'wokeism',  eugenics, diversity-equity-inclusion,  elevation of cultural and sexual deviancy to the status of supreme norm of all society,  Epstein islands, the Maidan Revolution,  something called \"Israel\",  de-growth and d3p0pulation agendas, \"War on Terror\",  and all manner of other intellectual and ideological perversions.\n\nBecause the Open Society cannot tolerate enemies of the Open Society,  it cannot tolerate closed societies,  closed individuals nor closed collectives.\n\nAnd so in their pursuit of spreading \"freedom and democracy\" to the \"backwards\" \"totalitarian\" countries,  the liberal himself becomes the totalitarian that he perceives in the world,  and begins to cannibalize and destroy the very same classical-liberal ideals that he once ushered into existence.\n\"In the pursuit of spreading \"enlightened secular humanism\" to the \"backward fanatical Islamic Jihadists\",  to create a world free of atrocities committed by Jihad,  the liberal himself engages in a Jihad for which he will commit atrocities.\" -- Logo Daedalus\n\nThe only positive liberty that you truly have in the capitalist West is:  freedom to be a slave,  freedom to live as undignified cattle,  freedom to be perpetually demoralized about your real human existence,  freedom to get pimped by NGOs and robbed by banks,  freedom to be a prostitute for the highest bidder.",
        "like_count": 1,
        "published_at": "2025-06-25T23:41:40Z",
        "is_reply": true
      },
      {
        "id": "UgxhTCdOXF4n7reysxp4AaABAg.AJne8i6dqi8AJoTASUisox",
        "author": "@forgotMyUsername100",
        "text": "​@ClassWarMatrix quite an essay! Interesting definition of freedom, I get where you are coming from & thanks for the clarification.\nBut I do think \"freedom for\" an authoritarian slave society (to be hyperbolic about N.Korea) is still less free than typical westerners, wage slaves tho we may be.\nI do have a reflexive distrust of closed societies, which perhaps I shall examine. But right now I think it doesn't feel fair for Japan to say imagrants from 600 years ago are still not Japanese. Nor for Israel to be closed to Palestinians.",
        "like_count": 0,
        "published_at": "2025-06-25T23:59:47Z",
        "is_reply": true
      },
      {
        "id": "UgxhTCdOXF4n7reysxp4AaABAg.AJne8i6dqi8AJp4xRGUj0_",
        "author": "@ClassWarMatrix",
        "text": "@ I genuinely don't know what you mean by \"slave society\".\nDPRK does not practice chattel slavery in any way shape or form.\nThe material way in which they're less free than us is primarily due to stunted development and lower living standards,  which itself is primarily due to sanctions and the collapse of crucial trade deals that they had with COMECON before 1991. (primarily food and oil and machinery importation)\n\nIn another fashion you might say they are less free as individuals because of their socially conservative cultural & social norms,  but they don't see that as a problem so that's largely irrelevant.\n\nYou should listen to Donald Coulter's interview on the show Legitimate Targets.\nHe's an American journalist who recently visted the DPRK bout half a year ago.\n\nAs for Japan,  yeah,  that's a failure to recognize and account for the phenomenon of assimilation and indigenization,  which occurs organically and objectively unless artificially prevented.\nDPRK doesn't seem to have this problem.\nThose American deserters from the war didn't seem to have any problem becoming Korean.\n\nAs for Israel, well it doesn't even really exist.  It's just a military base for Western transnational monopoly bourgeoisie.\nThe entire \"existence\" and foundational premises of that state and \"nation\" are defined by artificiality.\nIt is the pinnacle of negative abstraction perpetually suspended within its dialectial development,  as per Hegel.\nThe so called \"Jewish nation\",  created completely from scratch,  has no concrete beginning,  no end,  and must forever be insulated from the historical and social laws which cause nations to morph and change.\nIt will never be compatible with the supra-national civilizational reality that is shared by the masses of the Middle East,  as it refuses to indigenize.\nIt is like a foreign virus in the human body being rejected by the immune system.\n\nAnyway,  i recommend you check out the TalonSight and InfraMiG YT channels and listen to some of Infrared's old lectures.\n\nThe KGB is necessary to defend the revolution.\nBut of course,  it,  and the revolution,  can always be corrupted.\n\nLearn from China my friend,  they're already in the future.",
        "like_count": 0,
        "published_at": "2025-06-26T05:47:23Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxT97wWpwIFBqWeUc54AaABAg",
    "author": "@LewisSmith-f2q",
    "author_channel_id": "UC9BafX6biPvkTfx9Q_ejI-Q",
    "text": "It seems to me that North Korea embodies a form of independence rarely acknowledged. The nation is self sufficient, untainted by Western consumerism, and maintains a social order that prioritises collective stability over individual indulgence. Access to pornography is prohibited, a measure that protects mental clarity rather than erodes freedom. Citizens benefit from clean water, universal services, and a society where homelessness is virtually absent. The country has been spared terrorism, foreign wars, and the cultural dislocation that often accompanies imported values. In this sense, one might argue that North Korea represents a model of social progress defined not by Western metrics but by its own sovereign ideals.",
    "like_count": 0,
    "published_at": "2025-12-09T23:01:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyA_JEQQpqIIIyMiqZ4AaABAg",
    "author": "@ghassan8674",
    "author_channel_id": "UCYcLqz7KBEzkuWzSVCbEmZg",
    "text": "Agree",
    "like_count": 7,
    "published_at": "2025-06-24T07:48:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx4ZnlKHTDaVL9yTU54AaABAg",
    "author": "@fineproductions18929",
    "author_channel_id": "UCBC9Go1A6UryTD9aqSDBB_A",
    "text": "North korea is national socialist.",
    "like_count": 0,
    "published_at": "2025-12-31T16:52:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyIEwEmipNcIYkzMHZ4AaABAg",
    "author": "@PROVOO.1",
    "author_channel_id": "UCIWWTMjAGJ4fUaPB9Sl8bjw",
    "text": "Least thought out ragebait.",
    "like_count": 24,
    "published_at": "2025-06-24T11:39:40Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgyIEwEmipNcIYkzMHZ4AaABAg.AJkZfwsyXhNAJlA5qX4_tB",
        "author": "@TheodricWillow",
        "text": "I mean they have a lot of worker Co ops and participation in local governance via people's assemblies.  It's just different than how we do it, and some argue better.\n\nAnyone can see we just live in a dictatorship of capital",
        "like_count": 5,
        "published_at": "2025-06-24T17:15:24Z",
        "is_reply": true
      },
      {
        "id": "UgyIEwEmipNcIYkzMHZ4AaABAg.AJkZfwsyXhNAJoPvMfl01O",
        "author": "@ClassWarMatrix",
        "text": "When Eastern \"authoritarian\" Communist countries speak of freedom--   they're speaking of a definite social freedom of a particular determinate country/civilization:\nFreedom to be free to define & uphold their own cultures and laws,\nFreedom to insist upon their own People's historical record and their own particular truths,\nFreedom to pursue their own sovereign (partial) (illiberal) paths of political-economic development that aren't dictated by transnational Western bankers, monopolists, governments, and social-engineering NGOs.\n\nWhen you-- Western liberals--  speak of freedom,  y'all are speaking of an indefinite, indeterminate, hyper-individualist freedom:\nFreedom to be free from assuming any authentic political partiality or partisanship;  freedom from having any vested interest in state authority,\nFreedom to be free from any and all particular social mores and cultural realities;  free from all personal inhibitions and collective obligations and accountabilities;  free from social-regulation by any morality or religion,  freedom from any definite existence attached to any particular society;  freedom from the social grounds of your own individuality;  freedom from your own dignity,\nfreedom from any necessity to establish a concrete manifestation of freedom.\n\nFreedom for  vs  freedom from.\nThis is why the East is now rising -  while the West is experiencing profound cultural decay and spiritual crisis as it slips back into fascism and perpetual state of emergency.\n\nThe Cartesian metaphysics of liberal philosophy have fully exhausted their world-historic capacity for real progress and now their furthest logical conclusions have led to:\nReddit, atheistic pagan satanism,  a fundamental distrust of reality,  anti-human Malthusianism,  racial-science,  something called a \"gene\",  the reduction of the essence of all human existence down to one-sided biology and \"reproduction of genes\",  the Marvel cinematic universe,  Hitlerism,  anti-Communism,  'wokeism',  eugenics, diversity-equity-inclusion,  elevation of cultural and sexual deviancy to the status of supreme norm of all society,  Epstein islands, the Maidan Revolution,  something called \"Israel\",  de-growth and d3p0pulation agendas, \"War on Terror\",  and all manner of other intellectual and ideological perversions.\n\nBecause the Open Society cannot tolerate enemies of the Open Society,  it cannot tolerate closed societies,  closed individuals nor closed collectives.\n\nAnd so in their pursuit of spreading \"freedom and democracy\" to the \"backwards\" \"totalitarian\" countries,  the liberal himself becomes the totalitarian that he perceives in the world,  and begins to cannibalize and destroy the very same classical-liberal ideals that he once ushered into existence.\n\"In the pursuit of spreading \"enlightened secular humanism\" to the \"backward fanatical Islamic Jihadists\",  to create a world free of atrocities committed by Jihad,  the liberal himself engages in a Jihad for which he will commit atrocities.\" -- Logo Daedalus\n\nThe only positive liberty that you truly have in the capitalist West is:  freedom to be a slave,  freedom to live as undignified cattle,  freedom to be perpetually demoralized about your real human existence,  freedom to get pimped by NGOs and robbed by banks,  freedom to be a prostitute for the highest bidder.",
        "like_count": 2,
        "published_at": "2025-06-25T23:31:22Z",
        "is_reply": true
      },
      {
        "id": "UgyIEwEmipNcIYkzMHZ4AaABAg.AJkZfwsyXhNASWTU7Iw9I_",
        "author": "@ozymandius8804",
        "text": "​@ClassWarMatrix peak based comment. Respect, comrade🤝",
        "like_count": 0,
        "published_at": "2026-01-28T07:39:26Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugz8wdXVp9CEBIK0MpV4AaABAg",
    "author": "@richardparker7121",
    "author_channel_id": "UC8dsB8t5GdUs8Nq4S-eNO9g",
    "text": "💪💯",
    "like_count": 4,
    "published_at": "2025-06-24T06:59:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy-HjbZo15_Mro48U54AaABAg",
    "author": "@user-Tinfoilhat",
    "author_channel_id": "UCV2dDDGcT5LgD88mdOmhFfA",
    "text": "What flavor is the kool aid?",
    "like_count": 3,
    "published_at": "2025-06-24T14:21:40Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugy-HjbZo15_Mro48U54AaABAg.AJkrDThI_LqAJoQjlM0gQX",
        "author": "@ClassWarMatrix",
        "text": "When Eastern \"authoritarian\" Communist countries speak of freedom--   they're speaking of a definite social freedom of a particular determinate country/civilization:\nFreedom to be free to define & uphold their own cultures and laws,\nFreedom to insist upon their own People's historical record and their own particular truths,\nFreedom to pursue their own sovereign (partial) (illiberal) paths of political-economic development that aren't dictated by transnational Western bankers, monopolists, governments, and social-engineering NGOs.\n\nWhen you-- Western liberals--  speak of freedom,  y'all are speaking of an indefinite, indeterminate, hyper-individualist freedom:\nFreedom to be free from assuming any authentic political partiality or partisanship;  freedom from having any vested interest in state authority,\nFreedom to be free from any and all particular social mores and cultural realities;  free from all personal inhibitions and collective obligations and accountabilities;  free from social-regulation by any morality or religion,  freedom from any definite existence attached to any particular society;  freedom from the social grounds of your own individuality;  freedom from your own dignity,\nfreedom from any necessity to establish a concrete manifestation of freedom.\n\nFreedom for  vs  freedom from.\nThis is why the East is now rising -  while the West is experiencing profound cultural decay and spiritual crisis as it slips back into fascism and perpetual state of emergency.\n\nThe Cartesian metaphysics of liberal philosophy have fully exhausted their world-historic capacity for real progress and now their furthest logical conclusions have led to:\nReddit, atheistic pagan satanism,  a fundamental distrust of reality,  anti-human Malthusianism,  racial-science,  something called a \"gene\",  the reduction of the essence of all human existence down to one-sided biology and \"reproduction of genes\",  the Marvel cinematic universe,  Hitlerism,  anti-Communism,  'wokeism',  eugenics, diversity-equity-inclusion,  elevation of cultural and sexual deviancy to the status of supreme norm of all society,  Epstein islands, the Maidan Revolution,  something called \"Israel\",  de-growth and d3p0pulation agendas, \"War on Terror\",  and all manner of other intellectual and ideological perversions.\n\nBecause the Open Society cannot tolerate enemies of the Open Society,  it cannot tolerate closed societies,  closed individuals nor closed collectives.\n\nAnd so in their pursuit of spreading \"freedom and democracy\" to the \"backwards\" \"totalitarian\" countries,  the liberal himself becomes the totalitarian that he perceives in the world,  and begins to cannibalize and destroy the very same classical-liberal ideals that he once ushered into existence.\n\"In the pursuit of spreading \"enlightened secular humanism\" to the \"backward fanatical Islamic Jihadists\",  to create a world free of atrocities committed by Jihad,  the liberal himself engages in a Jihad for which he will commit atrocities.\" -- Logo Daedalus\n\nThe only positive liberty that you truly have in the capitalist West is:  freedom to be a slave,  freedom to live as undignified cattle,  freedom to be perpetually demoralized about your real human existence,  freedom to get pimped by NGOs and robbed by banks,  freedom to be a prostitute for the highest bidder.",
        "like_count": 1,
        "published_at": "2025-06-25T23:38:31Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxRyobRrnbidvsLtYB4AaABAg",
    "author": "@Waxican",
    "author_channel_id": "UCPLA2O5EErfu3IKRf90VPMw",
    "text": "North Koreans risk their lives to escape to the South. That’s all one needs to know about the veracity of your statement.",
    "like_count": 2,
    "published_at": "2025-06-29T04:36:54Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxRyobRrnbidvsLtYB4AaABAg.AJwgGuE3asKARPN5ZdMrmK",
        "author": "@fineproductions18929",
        "text": "wrong. there are north koreans stuck in the south who try to get back to the north.",
        "like_count": 0,
        "published_at": "2025-12-31T16:57:34Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzHe5NrF1Mgqwj2FVN4AaABAg",
    "author": "@haroldgraphene",
    "author_channel_id": "UCSNQY_mUHiOqwm4by3tRcIQ",
    "text": "I love this new look",
    "like_count": 0,
    "published_at": "2025-06-24T12:50:59Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxJOSua_OkFl3t6I-p4AaABAg",
    "author": "@a88304",
    "author_channel_id": "UCk5j9B06SBLHovgw53NG_Qg",
    "text": "I seriously thought this was a joke but he’s actually serious…. Dude… Maybe call me crazy here but an Autocracy is literally the opposite of a socialist government. North Korea has more in common with Tsarist Russia than Greek Dmeocratic ideals. Never heard of another modern government where you by law have to have a picture of “The Dear Leader” in your home and can be executed with Anti-Aircraft cannon fire. But hey I invite you to head on over, try some reforms out publicly, and let us know your progress",
    "like_count": 2,
    "published_at": "2025-07-27T03:42:27Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgxJOSua_OkFl3t6I-p4AaABAg.AL3gI_5SfQyAMHpN3A15pN",
        "author": "@Youva-d2p",
        "text": "Anti Aircraft Penal Batallions weren’t a thing in the Russian Empire",
        "like_count": 0,
        "published_at": "2025-08-26T12:02:29Z",
        "is_reply": true
      },
      {
        "id": "UgxJOSua_OkFl3t6I-p4AaABAg.AL3gI_5SfQyARPMo9o3tgr",
        "author": "@fineproductions18929",
        "text": "Yeah its not a democracy at all. but thats a good thing. democracy just leads to slow governance and a lack of progression.",
        "like_count": 0,
        "published_at": "2025-12-31T16:55:04Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxUfs71zubt6MMwX1V4AaABAg",
    "author": "@Harrold_01",
    "author_channel_id": "UChmfO2wpmn5sZ6KNJVWqG7A",
    "text": "Please don't believe that NK is amazing. Do your own research. It's a tyrannical dictatoship.",
    "like_count": 3,
    "published_at": "2025-07-03T12:45:15Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxUfs71zubt6MMwX1V4AaABAg.AK6rL7KpQSaARPN060UBVg",
        "author": "@fineproductions18929",
        "text": "no proof",
        "like_count": 0,
        "published_at": "2025-12-31T16:56:50Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyqmxBoWCVlDi7lqEV4AaABAg",
    "author": "@servusprotervus6463",
    "author_channel_id": "UCFsvG5fyLU5zQqjGCZL4WkA",
    "text": "North Korea is not a socialist state in any meaningful sense. The regime has long mimicked socialist rhetoric and symbolism, primarily because it was politically convenient — wrapping itself in the red flag to secure aid from the declining Soviet Union in its final years. Today, this mimicry persists mainly to ensure continued support from China. However, the red banners and stars merely conceal what is, in essence, an archaic feudal monarchy. The Kim dynasty has no intention of building communism; there is no socialism in practice. The entire economy functions as the private property of the ruling family, while the North Korean people live as their indentured laborers.",
    "like_count": 4,
    "published_at": "2025-07-11T09:50:57Z",
    "is_reply": false,
    "reply_count": 6,
    "replies": [
      {
        "id": "UgyqmxBoWCVlDi7lqEV4AaABAg.AKR8kUMrlFOARPMuM_axf5",
        "author": "@fineproductions18929",
        "text": "It depends what you consider socialism. but north korea is national socialist they dont have much democracy which is good.\nalso north korea gets almost no support from china. theyve developed into a self sufficient tiny country that does almost no international trade.",
        "like_count": 0,
        "published_at": "2025-12-31T16:55:54Z",
        "is_reply": true
      },
      {
        "id": "UgyqmxBoWCVlDi7lqEV4AaABAg.AKR8kUMrlFOARPNaQ4goap",
        "author": "@servusprotervus6463",
        "text": "@fineproductions18929 Socialism is the process of building communism in the main. It is classic marxist exp",
        "like_count": 0,
        "published_at": "2025-12-31T17:01:55Z",
        "is_reply": true
      },
      {
        "id": "UgyqmxBoWCVlDi7lqEV4AaABAg.AKR8kUMrlFOARPOnFoVRcO",
        "author": "@fineproductions18929",
        "text": "@servusprotervus6463 Socialism was made before communism. only internationalist communists see socialism as a temporary stage.",
        "like_count": 0,
        "published_at": "2025-12-31T17:12:25Z",
        "is_reply": true
      },
      {
        "id": "UgyqmxBoWCVlDi7lqEV4AaABAg.AKR8kUMrlFOARPSmDu1woG",
        "author": "@servusprotervus6463",
        "text": "@fineproductions18929 Oh really!? So the process of building something happens before we get the result of that construction? What a discovery. You should write a scientific paper about it. A Nobel Prize is waiting for you. Genius.",
        "like_count": 0,
        "published_at": "2025-12-31T17:47:14Z",
        "is_reply": true
      },
      {
        "id": "UgyqmxBoWCVlDi7lqEV4AaABAg.AKR8kUMrlFOARRuLyJCvuc",
        "author": "@fineproductions18929",
        "text": "@s@servusprotervus6463Communism is not the final stage of socialism. only communists believe it is but socialists like me dont agree with it and want to keep socialism longterm.",
        "like_count": 0,
        "published_at": "2026-01-01T16:35:23Z",
        "is_reply": true
      },
      {
        "id": "UgyqmxBoWCVlDi7lqEV4AaABAg.AKR8kUMrlFOARSZj6OST7b",
        "author": "@servusprotervus6463",
        "text": "@fineproductions18929 Based on a materialist understanding of the world, nothing is static: matter exists in a state of constant motion, change, and development. This fully applies to society as well. From the standpoint of historical materialism, socio-economic formations are not frozen structures but historically variable forms of organizing social production, existing in a process of continuous development.\n\nLike any complex form of organized matter, society develops through internal contradictions. As these contradictions accumulate, quantitative changes inevitably lead to qualitative leaps, expressed in the transition from one socio-economic formation to another. Therefore, society cannot remain indefinitely in the same state: each formation has a historically limited character.\n\nEach subsequent socio-economic formation does not arise out of nothing, but on the basis of material and social preconditions created within the framework of the preceding one. Thus, the slave-owning formation emerged as a result of the disintegration of the primitive communal system, alongside the growth of productive forces and the appearance of surplus product, which made the exploitation of man by man possible. The feudal formation took shape in the process of crisis and disintegration of slave-owning society, relying on the inherited material base while constructing different relations of production. Capitalism, in turn, arose on the foundation of feudal society, making use of the productive forces accumulated in previous epochs and radically transforming forms of property and the organization of labor.\n\nThus, historical materialism provides no grounds for viewing any socio-economic formation as final or immutable.",
        "like_count": 0,
        "published_at": "2026-01-01T22:45:41Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwN4UN_pY96-b1DgEl4AaABAg",
    "author": "@Mr00000111",
    "author_channel_id": "UCWl17acqQQJ_KXhc-DsLlow",
    "text": "No explanation whatsoever. Just babbling slogans.",
    "like_count": 13,
    "published_at": "2025-06-24T11:08:38Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgwN4UN_pY96-b1DgEl4AaABAg.AJkW7ZED1-KAJlAJZx808q",
        "author": "@TheodricWillow",
        "text": "Ya I respect this man but they could do better with propaganda and the glasses are horrible",
        "like_count": 1,
        "published_at": "2025-06-24T17:17:16Z",
        "is_reply": true
      },
      {
        "id": "UgwN4UN_pY96-b1DgEl4AaABAg.AJkW7ZED1-KAJoQpcNhMnw",
        "author": "@ClassWarMatrix",
        "text": "When Eastern \"authoritarian\" Communist countries speak of freedom--   they're speaking of a definite social freedom of a particular determinate country/civilization:\nFreedom to be free to define & uphold their own cultures and laws,\nFreedom to insist upon their own People's historical record and their own particular truths,\nFreedom to pursue their own sovereign (partial) (illiberal) paths of political-economic development that aren't dictated by transnational Western bankers, monopolists, governments, and social-engineering NGOs.\n\nWhen you-- Western liberals--  speak of freedom,  y'all are speaking of an indefinite, indeterminate, hyper-individualist freedom:\nFreedom to be free from assuming any authentic political partiality or partisanship;  freedom from having any vested interest in state authority,\nFreedom to be free from any and all particular social mores and cultural realities;  free from all personal inhibitions and collective obligations and accountabilities;  free from social-regulation by any morality or religion,  freedom from any definite existence attached to any particular society;  freedom from the social grounds of your own individuality;  freedom from your own dignity,\nfreedom from any necessity to establish a concrete manifestation of freedom.\n\nFreedom for  vs  freedom from.\nThis is why the East is now rising -  while the West is experiencing profound cultural decay and spiritual crisis as it slips back into fascism and perpetual state of emergency.\n\nThe Cartesian metaphysics of liberal philosophy have fully exhausted their world-historic capacity for real progress and now their furthest logical conclusions have led to:\nReddit, atheistic pagan satanism,  a fundamental distrust of reality,  anti-human Malthusianism,  racial-science,  something called a \"gene\",  the reduction of the essence of all human existence down to one-sided biology and \"reproduction of genes\",  the Marvel cinematic universe,  Hitlerism,  anti-Communism,  'wokeism',  eugenics, diversity-equity-inclusion,  elevation of cultural and sexual deviancy to the status of supreme norm of all society,  Epstein islands, the Maidan Revolution,  something called \"Israel\",  de-growth and d3p0pulation agendas, \"War on Terror\",  and all manner of other intellectual and ideological perversions.\n\nBecause the Open Society cannot tolerate enemies of the Open Society,  it cannot tolerate closed societies,  closed individuals nor closed collectives.\n\nAnd so in their pursuit of spreading \"freedom and democracy\" to the \"backwards\" \"totalitarian\" countries,  the liberal himself becomes the totalitarian that he perceives in the world,  and begins to cannibalize and destroy the very same classical-liberal ideals that he once ushered into existence.\n\"In the pursuit of spreading \"enlightened secular humanism\" to the \"backward fanatical Islamic Jihadists\",  to create a world free of atrocities committed by Jihad,  the liberal himself engages in a Jihad for which he will commit atrocities.\" -- Logo Daedalus\n\nThe only positive liberty that you truly have in the capitalist West is:  freedom to be a slave,  freedom to live as undignified cattle,  freedom to be perpetually demoralized about your real human existence,  freedom to get pimped by NGOs and robbed by banks,  freedom to be a prostitute for the highest bidder.",
        "like_count": 2,
        "published_at": "2025-06-25T23:39:19Z",
        "is_reply": true
      },
      {
        "id": "UgwN4UN_pY96-b1DgEl4AaABAg.AJkW7ZED1-KAJqBRO1ediP",
        "author": "@Mr00000111",
        "text": "​@ClassWarMatrixthe only inaccurate thing you wrote is that I am a western liberal. All I said is that Carlos didnt explain anything. Your elaborate comment is much more worthy than his useless video.",
        "like_count": 1,
        "published_at": "2025-06-26T16:03:17Z",
        "is_reply": true
      },
      {
        "id": "UgwN4UN_pY96-b1DgEl4AaABAg.AJkW7ZED1-KAJqIi-gGiG7",
        "author": "@ClassWarMatrix",
        "text": "@Mr word i gotchu.  I was just pasting that @ everyone.\nYeah i gotta agree,  Carlos cuz didn't really elaborate much here",
        "like_count": 0,
        "published_at": "2025-06-26T17:06:51Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugzpb6wfikSX_x4_rK14AaABAg",
    "author": "@zazaaziella16",
    "author_channel_id": "UCa0g_ejVtJt7va5g1beImxA",
    "text": "Most of the population in north korea is starved. People having to bow to images everytime they walk by is insane.",
    "like_count": 3,
    "published_at": "2025-06-24T19:01:03Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugzpb6wfikSX_x4_rK14AaABAg.AJlMBhVPu7fAJlUCGRUQLP",
        "author": "@grimexecutioner",
        "text": "This is what uncritical consumption of western propaganda looks like",
        "like_count": 2,
        "published_at": "2025-06-24T20:11:02Z",
        "is_reply": true
      },
      {
        "id": "Ugzpb6wfikSX_x4_rK14AaABAg.AJlMBhVPu7fAJoPsWJqDcw",
        "author": "@ClassWarMatrix",
        "text": "Nobody *has* to bow to anything lmao.\nAnd nobody over there is starving anymore since the late-2000s at the latest.\nEspecially not today now that Russia stopped enforcing sanctions against them and is trading them food again.\nYou needa catch up.\nTheir biggest issue was that in the 1990s,  they lost crucial trade deals with Russia and monsoons wiped out majority of their farmland.\nBut yet they're still standing strong.\nHow confident would you say you are  that your own country would remain intact & united through the kinds of calamities that DPRK has faced ?",
        "like_count": 3,
        "published_at": "2025-06-25T23:30:58Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzYasgZbwmob7da7-V4AaABAg",
    "author": "@UmbrellaCorp68",
    "author_channel_id": "UCo7FauuTO5k6K-v2-eleEnw",
    "text": "I need a daily dose of communist cringe lol I’m glad this came up in the feed, I miss the old days when you use to be arrested for even remotely showing communism interest.",
    "like_count": 1,
    "published_at": "2025-08-19T18:21:26Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgySvG7LuUB-ypgoW794AaABAg",
    "author": "@hank12-z7w",
    "author_channel_id": "UC5nOBR2grpd34Washr-_dIQ",
    "text": "Based. The DPRK is embargoed and under siege but they still manage to deliver a good quality of life for the workers, now compare that to most countries in the global south. The Workers Party is doing a tremendous job. (Long live MWM and ACP, we need more hardliners on the left, enough of radlibbery)",
    "like_count": 3,
    "published_at": "2025-06-24T10:48:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxW0aRhYLzL8RqiW614AaABAg",
    "author": "@salj.5459",
    "author_channel_id": "UCoBRIALVV9SyIcrS4ZHE_2w",
    "text": "Being a Marxist-Leninist makes you take delusional positions like these. LOL.",
    "like_count": 4,
    "published_at": "2025-06-26T06:24:03Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxW0aRhYLzL8RqiW614AaABAg.AJp992mtM-MARPN8uybis3",
        "author": "@fineproductions18929",
        "text": "north korea isnt marxist",
        "like_count": 0,
        "published_at": "2025-12-31T16:58:02Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugyk5ze5llC5U_Pf0JN4AaABAg",
    "author": "@DjVortex-w",
    "author_channel_id": "UCWfb3GxC4lXat-Rj4HYYhcw",
    "text": "Quite clearly you have absolutely no idea what \"democracy\" and \"freedom\" mean.",
    "like_count": 11,
    "published_at": "2025-06-24T11:52:18Z",
    "is_reply": false,
    "reply_count": 7,
    "replies": [
      {
        "id": "Ugyk5ze5llC5U_Pf0JN4AaABAg.AJka7R6RdCnAJlU85KJwDM",
        "author": "@grimexecutioner",
        "text": "Its almost like those words have no meaning 🤯",
        "like_count": 0,
        "published_at": "2025-06-24T20:10:28Z",
        "is_reply": true
      },
      {
        "id": "Ugyk5ze5llC5U_Pf0JN4AaABAg.AJka7R6RdCnAJmzSPxtC75",
        "author": "@maklame3318",
        "text": "@grimexecutioner demoncracy and freedome",
        "like_count": 0,
        "published_at": "2025-06-25T10:12:06Z",
        "is_reply": true
      },
      {
        "id": "Ugyk5ze5llC5U_Pf0JN4AaABAg.AJka7R6RdCnAJnXfNO5qH8",
        "author": "@homieslice1996",
        "text": "@grimexecutioner @maklame3318 “Democracy” is power of the people; in ancient times, the slave owners were the “people”. The basis for democracy is economic in fact, so thus those with economic power and ownership have the direct and indirect power to rule over everyone else.  \n   In liberal “democracies”, the wealthy and the propertied have been the “people” in practice since they indirectly and sometimes even directly (see Musk’s DOGE) wield power of law and the state. \n   In a state like the Democratic People’s Republic of Korea, the working class is the people, and they have people’s assemblies that directly put representatives of the working class in power to serve the working class. Since the Worker’s Party is in power there, those who used to be last are first (the working class) and those who used to be first are last (any capitalists that DPRK allows to operate). \n-\n   “Freedom” is tied to the economy most concretely, since without food and water, you will only have freedom in passing away. \n    Freedom can only be achieved if exploitation of humans in abolished: the most concrete exploitation is economic, in which an exploiter (like a capitalist, imperialist, or landlord in the modern times, or a slave owner in older times) will leverage their property ownership that is protected by (in fact) the exploiters’ “democracy” even when the masses don’t consent to protect the exploiters’ ownership or their unequal rights in relation to the working masses. \n  Thus freedom from exploiting humans and freedom of mass abundance for humans is the most concrete liberty that bridges various gaps. Freedom for exploiters is not freedom for the exploited, for context. \n   By that standard, DPRK has more freedom than the US has ever had since DPRK’s democracy is more economic-based in a straight forward way as described in the paragraphs on “democracy”.",
        "like_count": 0,
        "published_at": "2025-06-25T15:19:50Z",
        "is_reply": true
      },
      {
        "id": "Ugyk5ze5llC5U_Pf0JN4AaABAg.AJka7R6RdCnAJoQvGvJQj-",
        "author": "@ClassWarMatrix",
        "text": "When Eastern \"authoritarian\" Communist countries speak of freedom--   they're speaking of a definite social freedom of a particular determinate country/civilization:\nFreedom to be free to define & uphold their own cultures and laws,\nFreedom to insist upon their own People's historical record and their own particular truths,\nFreedom to pursue their own sovereign (partial) (illiberal) paths of political-economic development that aren't dictated by transnational Western bankers, monopolists, governments, and social-engineering NGOs.\n\nWhen you-- Western liberals--  speak of freedom,  y'all are speaking of an indefinite, indeterminate, hyper-individualist freedom:\nFreedom to be free from assuming any authentic political partiality or partisanship;  freedom from having any vested interest in state authority,\nFreedom to be free from any and all particular social mores and cultural realities;  free from all personal inhibitions and collective obligations and accountabilities;  free from social-regulation by any morality or religion,  freedom from any definite existence attached to any particular society;  freedom from the social grounds of your own individuality;  freedom from your own dignity,\nfreedom from any necessity to establish a concrete manifestation of freedom.\n\nFreedom for  vs  freedom from.\nThis is why the East is now rising -  while the West is experiencing profound cultural decay and spiritual crisis as it slips back into fascism and perpetual state of emergency.\n\nThe Cartesian metaphysics of liberal philosophy have fully exhausted their world-historic capacity for real progress and now their furthest logical conclusions have led to:\nReddit, atheistic pagan satanism,  a fundamental distrust of reality,  anti-human Malthusianism,  racial-science,  something called a \"gene\",  the reduction of the essence of all human existence down to one-sided biology and \"reproduction of genes\",  the Marvel cinematic universe,  Hitlerism,  anti-Communism,  'wokeism',  eugenics, diversity-equity-inclusion,  elevation of cultural and sexual deviancy to the status of supreme norm of all society,  Epstein islands, the Maidan Revolution,  something called \"Israel\",  de-growth and d3p0pulation agendas, \"War on Terror\",  and all manner of other intellectual and ideological perversions.\n\nBecause the Open Society cannot tolerate enemies of the Open Society,  it cannot tolerate closed societies,  closed individuals nor closed collectives.\n\nAnd so in their pursuit of spreading \"freedom and democracy\" to the \"backwards\" \"totalitarian\" countries,  the liberal himself becomes the totalitarian that he perceives in the world,  and begins to cannibalize and destroy the very same classical-liberal ideals that he once ushered into existence.\n\"In the pursuit of spreading \"enlightened secular humanism\" to the \"backward fanatical Islamic Jihadists\",  to create a world free of atrocities committed by Jihad,  the liberal himself engages in a Jihad for which he will commit atrocities.\" -- Logo Daedalus\n\nThe only positive liberty that you truly have in the capitalist West is:  freedom to be a slave,  freedom to live as undignified cattle,  freedom to be perpetually demoralized about your real human existence,  freedom to get pimped by NGOs and robbed by banks,  freedom to be a prostitute for the highest bidder.",
        "like_count": 2,
        "published_at": "2025-06-25T23:40:05Z",
        "is_reply": true
      },
      {
        "id": "Ugyk5ze5llC5U_Pf0JN4AaABAg.AJka7R6RdCnAJo_7GYm_s9",
        "author": "@homieslice1996",
        "text": "@ClassWarMatrix my comment disappeared mysteriously. I didn’t touch it.",
        "like_count": 1,
        "published_at": "2025-06-26T01:00:30Z",
        "is_reply": true
      },
      {
        "id": "Ugyk5ze5llC5U_Pf0JN4AaABAg.AJka7R6RdCnAJo_BMaaFau",
        "author": "@homieslice1996",
        "text": "@ClassWarMatrixlike I gave a good explanation of liberty being the abolition of exploiting humans, but somehow it disappeared.",
        "like_count": 1,
        "published_at": "2025-06-26T01:01:04Z",
        "is_reply": true
      },
      {
        "id": "Ugyk5ze5llC5U_Pf0JN4AaABAg.AJka7R6RdCnAJp16STkm_g",
        "author": "@DjVortex-w",
        "text": "@ClassWarMatrix  What a huge load of BS.\n\nWhen it comes to countries, governments and citizen rights, \"freedom\" means, among other things: Freedom of speech (being able to express your opinions in public, including criticism of the government and its rules and laws, without punishment from the government), freedom of the press, freedom of religious beliefs and practices, freedom of movement (including out of the country), freedom of association (for example, among other things, to form associations for sociopolitical activism, without governmental control), freedom to form your own political party and run for government.\n\nNorth Korea has none of that.",
        "like_count": 1,
        "published_at": "2025-06-26T05:13:48Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx3m54ptdN9lqAWWCl4AaABAg",
    "author": "@Tarvell",
    "author_channel_id": "UCtjbSVqII7YVSN0QJdGK45A",
    "text": "Democracy in a dictatorship? Are you serious?  I remind you that Marxist ideology is responsible for murdering  100-150 million people in the past 80 years. Fact! Besides, who really knows what's going on inside North Korea?",
    "like_count": 1,
    "published_at": "2025-06-24T12:28:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxEAAYN6ti7fswbP354AaABAg",
    "author": "@Kvint-kh12345",
    "author_channel_id": "UCA3nRvpSBxCQYsHnCuJGE4w",
    "text": "Ragebait used to be believable, smh",
    "like_count": 2,
    "published_at": "2025-06-24T17:09:23Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxEAAYN6ti7fswbP354AaABAg.AJl9Pogp3WpAJoRM4Y9z7H",
        "author": "@ClassWarMatrix",
        "text": "When Eastern \"authoritarian\" Communist countries speak of freedom--   they're speaking of a definite social freedom of a particular determinate country/civilization:\nFreedom to be free to define & uphold their own cultures and laws,\nFreedom to insist upon their own People's historical record and their own particular truths,\nFreedom to pursue their own sovereign (partial) (illiberal) paths of political-economic development that aren't dictated by transnational Western bankers, monopolists, governments, and social-engineering NGOs.\n\nWhen you-- Western liberals--  speak of freedom,  y'all are speaking of an indefinite, indeterminate, hyper-individualist freedom:\nFreedom to be free from assuming any authentic political partiality or partisanship;  freedom from having any vested interest in state authority,\nFreedom to be free from any and all particular social mores and cultural realities;  free from all personal inhibitions and collective obligations and accountabilities;  free from social-regulation by any morality or religion,  freedom from any definite existence attached to any particular society;  freedom from the social grounds of your own individuality;  freedom from your own dignity,\nfreedom from any necessity to establish a concrete manifestation of freedom.\n\nFreedom for  vs  freedom from.\nThis is why the East is now rising -  while the West is experiencing profound cultural decay and spiritual crisis as it slips back into fascism and perpetual state of emergency.\n\nThe Cartesian metaphysics of liberal philosophy have fully exhausted their world-historic capacity for real progress and now their furthest logical conclusions have led to:\nReddit, atheistic pagan satanism,  a fundamental distrust of reality,  anti-human Malthusianism,  racial-science,  something called a \"gene\",  the reduction of the essence of all human existence down to one-sided biology and \"reproduction of genes\",  the Marvel cinematic universe,  Hitlerism,  anti-Communism,  'wokeism',  eugenics, diversity-equity-inclusion,  elevation of cultural and sexual deviancy to the status of supreme norm of all society,  Epstein islands, the Maidan Revolution,  something called \"Israel\",  de-growth and d3p0pulation agendas, \"War on Terror\",  and all manner of other intellectual and ideological perversions.\n\nBecause the Open Society cannot tolerate enemies of the Open Society,  it cannot tolerate closed societies,  closed individuals nor closed collectives.\n\nAnd so in their pursuit of spreading \"freedom and democracy\" to the \"backwards\" \"totalitarian\" countries,  the liberal himself becomes the totalitarian that he perceives in the world,  and begins to cannibalize and destroy the very same classical-liberal ideals that he once ushered into existence.\n\"In the pursuit of spreading \"enlightened secular humanism\" to the \"backward fanatical Islamic Jihadists\",  to create a world free of atrocities committed by Jihad,  the liberal himself engages in a Jihad for which he will commit atrocities.\" -- Logo Daedalus\n\nThe only positive liberty that you truly have in the capitalist West is:  freedom to be a slave,  freedom to live as undignified cattle,  freedom to be perpetually demoralized about your real human existence,  freedom to get pimped by NGOs and robbed by banks,  freedom to be a prostitute for the highest bidder.",
        "like_count": 0,
        "published_at": "2025-06-25T23:43:53Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx2LMB80U2IIws2yvl4AaABAg",
    "author": "@Earthman99999",
    "author_channel_id": "UCTMkL2kCFOnqX6UnUwdJ02A",
    "text": "I have come around to realize that the DPRK (North Korea) had the right idea all along of never trusting the West. Had they did that... North Korea would become a vassal state of the West and be occupied just like South Korea today.",
    "like_count": 0,
    "published_at": "2025-06-27T11:06:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwq4Oy9Q_Hoy_pw8Ft4AaABAg",
    "author": "@DanielCrispy",
    "author_channel_id": "UCUo4RGmR1gk8MQ5Le-uQIXw",
    "text": "I can smell rage bait",
    "like_count": 1,
    "published_at": "2025-06-24T15:42:16Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "Ugwq4Oy9Q_Hoy_pw8Ft4AaABAg.AJl-RleK6NpAJoQNJJqqTq",
        "author": "@ClassWarMatrix",
        "text": "When Eastern \"authoritarian\" Communist countries speak of freedom--   they're speaking of a definite social freedom of a particular determinate country/civilization:\nFreedom to be free to define & uphold their own cultures and laws,\nFreedom to insist upon their own People's historical record and their own particular truths,\nFreedom to pursue their own sovereign (partial) (illiberal) paths of political-economic development that aren't dictated by transnational Western bankers, monopolists, governments, and social-engineering NGOs.\n\nWhen you-- Western liberals--  speak of freedom,  y'all are speaking of an indefinite, indeterminate, hyper-individualist freedom:\nFreedom to be free from assuming any authentic political partiality or partisanship;  freedom from having any vested interest in state authority,\nFreedom to be free from any and all particular social mores and cultural realities;  free from all personal inhibitions and collective obligations and accountabilities;  free from social-regulation by any morality or religion,  freedom from any definite existence attached to any particular society;  freedom from the social grounds of your own individuality;  freedom from your own dignity,\nfreedom from any necessity to establish a concrete manifestation of freedom.\n\nFreedom for  vs  freedom from.\nThis is why the East is now rising -  while the West is experiencing profound cultural decay and spiritual crisis as it slips back into fascism and perpetual state of emergency.\n\nThe Cartesian metaphysics of liberal philosophy have fully exhausted their world-historic capacity for real progress and now their furthest logical conclusions have led to:\nReddit, atheistic pagan satanism,  a fundamental distrust of reality,  anti-human Malthusianism,  racial-science,  something called a \"gene\",  the reduction of the essence of all human existence down to one-sided biology and \"reproduction of genes\",  the Marvel cinematic universe,  Hitlerism,  anti-Communism,  'wokeism',  eugenics, diversity-equity-inclusion,  elevation of cultural and sexual deviancy to the status of supreme norm of all society,  Epstein islands, the Maidan Revolution,  something called \"Israel\",  de-growth and d3p0pulation agendas, \"War on Terror\",  and all manner of other intellectual and ideological perversions.\n\nBecause the Open Society cannot tolerate enemies of the Open Society,  it cannot tolerate closed societies,  closed individuals nor closed collectives.\n\nAnd so in their pursuit of spreading \"freedom and democracy\" to the \"backwards\" \"totalitarian\" countries,  the liberal himself becomes the totalitarian that he perceives in the world,  and begins to cannibalize and destroy the very same classical-liberal ideals that he once ushered into existence.\n\"In the pursuit of spreading \"enlightened secular humanism\" to the \"backward fanatical Islamic Jihadists\",  to create a world free of atrocities committed by Jihad,  the liberal himself engages in a Jihad for which he will commit atrocities.\" -- Logo Daedalus\n\nThe only positive liberty that you truly have in the capitalist West is:  freedom to be a slave,  freedom to live as undignified cattle,  freedom to be perpetually demoralized about your real human existence,  freedom to get pimped by NGOs and robbed by banks,  freedom to be a prostitute for the highest bidder.",
        "like_count": 2,
        "published_at": "2025-06-25T23:35:19Z",
        "is_reply": true
      },
      {
        "id": "Ugwq4Oy9Q_Hoy_pw8Ft4AaABAg.AJl-RleK6NpAJoXTZlQmBu",
        "author": "@DanielCrispy",
        "text": "@ClassWarMatrixI ain’t reading all that also I’m not a liberal I’m fairly conservative. Also your ragebait is so bad that I could tell it was ragebait from reading only the last line in your essay.",
        "like_count": 0,
        "published_at": "2025-06-26T00:37:20Z",
        "is_reply": true
      },
      {
        "id": "Ugwq4Oy9Q_Hoy_pw8Ft4AaABAg.AJl-RleK6NpAJod4-jmJdu",
        "author": "@ClassWarMatrix",
        "text": "​​@DanielCrispypolitically you are a liberal to me.\nIt's not bait,  it's the truth.",
        "like_count": 1,
        "published_at": "2025-06-26T01:35:00Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxUQJs9zWUTcvZecLB4AaABAg",
    "author": "@slopeisdope2293",
    "author_channel_id": "UCJzw8-ZFfaX4QHtgYmatuKw",
    "text": "War is peace. Freedom is slavery. Ignorance is strength.",
    "like_count": 1,
    "published_at": "2025-07-03T05:10:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwaCGK3IFbpdpZWeoh4AaABAg",
    "author": "@isaaccollson",
    "author_channel_id": "UCyssomOuC1JdaxZIMPPVCAg",
    "text": "are you getting paid for this bullshit",
    "like_count": 1,
    "published_at": "2025-06-28T11:05:50Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwaCGK3IFbpdpZWeoh4AaABAg.AJunz_fPX1iARPN753rmUv",
        "author": "@fineproductions18929",
        "text": "i heard he got paid $7000",
        "like_count": 0,
        "published_at": "2025-12-31T16:57:47Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyL687kaWarwei1BhB4AaABAg",
    "author": "@MTanks24",
    "author_channel_id": "UCuF4RCiy8nFV29WYdKyOhDg",
    "text": "North Korea = Best Korea, I get that the skeptics in the comment section may have their doubts but it is worth looking into how the DPRK gets around sanctions to provide for their people, the high participation rate of the population in their political process, etc., etc. All things considered, especially given the constant threat of military force being used against them by the US through South Korea and Japan, I definitely think the title of this video is defensible 💪 💯 🫡",
    "like_count": 32,
    "published_at": "2025-06-24T08:26:39Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgyL687kaWarwei1BhB4AaABAg.AJkDaCQcFItAJoNauZwFIP",
        "author": "@ClassWarMatrix",
        "text": "It's not just best Korea, it's the REAL Korea. The ONLY Korea.\n\nDPRK was founded by guerilla partisans who fought against Japanese occupation for decades.\nROK was founded by former Japanese colonial administrators who were empowered by the US.\nDPRK founding had overwhelming popular support.\nROK founding was widely contested and majority of the country boycotted the 1948 election.\nEnough said",
        "like_count": 2,
        "published_at": "2025-06-25T23:11:05Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzxwhgRfbceuklSWQN4AaABAg",
    "author": "@failedbirthcontrol8995",
    "author_channel_id": "UCJ9ij1qF8NbudMdtX8GfpXg",
    "text": "based",
    "like_count": 3,
    "published_at": "2025-06-24T11:38:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  }
]