{
  "video_id": "PdGkGxISSBU",
  "title": "Mentally Challenged Trump supporter Tortured in Chicago (Rant)",
  "description": "Minutes after I put away all of my fancy film equipment I stumbled onto a Jeff Holiday video about a racial/political attack on someone, for allegedly being a Donald Trump supporter. The accused in this case are in custody, and the victim has been identified as a mentally ill youth. The four attackers bound and beat the victim, repeatedly mocked them and broadcast it with FaceBook Live. \n\nMy rant is related to the incident, the ideology that I believe inspired it, misinformation, the misattribution of blame, and why Social Justice types seem to attack themselves.\n\nNews Source: http://www.fox32chicago.com/news/crime/227116738-story\n\nHere is a link to Jeff's video on the attack: https://www.youtube.com/watch?v=zzb9FjbgXbg\n\nFull video (it may be difficult to watch): https://www.youtube.com/watch?v=D5Hjr93KB1A\n\nHugh Mungus Reference video: https://www.youtube.com/watch?v=RzA4dCT4X0I\n\nFAIR USE NOTICE\nThis video may contain copyrighted material; the use of which has not been specifically authorized by the copyright owner. We are making such material available for the purposes of criticism, comment, review and news reporting which constitute the 'fair use' of any such copyrighted material as provided for in section 107 of the US Copyright Law. Not withstanding the provisions of sections 106 and 106A, the fair use of a copyrighted work for purposes such as criticism, comment, review and news reporting is not an infringement of copyright.",
  "channel_id": "UCzzLIhDbFYU46T4VFBz_m_g",
  "channel_title": "Actual Justice Warrior",
  "published_at": "2017-01-05T07:57:32Z",
  "tags": [
    "Actual Justice Warrior",
    "Iamsean90",
    "Sean",
    "Actual",
    "Justice",
    "AJWSean",
    "Trump",
    "Trump Supporter",
    "Trump Supporter attacked",
    "Social media",
    "Mentally challenged Trump supporter tortured",
    "Black Lives Matter",
    "FaceBook live",
    "Social Justice",
    "Social Justice Warrior",
    "SJW",
    "Regressive",
    "Live Stream",
    "Facebook",
    "Political Violence",
    "Jeff Holiday",
    "Literally like 5 seconds of Jeff Holiday so this tag makes no sense",
    "BLm",
    "Kidnapping",
    "Torture",
    "Left Wing Violence",
    "Hate Crime",
    "Violence",
    "Rant",
    "Zarna Joshi"
  ],
  "category_id": "25",
  "duration": "PT7M35S",
  "view_count": 1799,
  "like_count": 67,
  "comment_count": 10,
  "privacy_status": "public",
  "made_for_kids": false,
  "channel_name": "Actual Justice Warrior",
  "starting_ads": "No",
  "mid_roll_ads": "No",
  "ad_breaks_detected": "No",
  "notes": "No ads - pilot video 13"
}