[
  {
    "id": "UgznWLA0WW-QljmHMWp4AaABAg",
    "author": "@Mr.9x19mm",
    "author_channel_id": "UCF0PBkikIS1r1FYiXpSFXWQ",
    "text": "“We know they are lying, they know they are lying, they know we know they are lying, we know they know we know they are lying, but they are still lying.”",
    "like_count": 46,
    "published_at": "2023-11-11T16:33:44Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgznWLA0WW-QljmHMWp4AaABAg.9wzJXahUzEN9x0mfGQK_e-",
        "author": "@codychickadee5095",
        "text": "Fucking mind boggling isn't it",
        "like_count": 1,
        "published_at": "2023-11-12T15:35:33Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwOovsUf3Xt4JOx9mt4AaABAg",
    "author": "@DarkstarArchangel",
    "author_channel_id": "UCTtdVYywdJ_n08TRrqe7aVQ",
    "text": "One example is when they say \"most gun victims are children\" but when they say \"children\" they are including up to *19-YEAR-OLDS* in that statistic and most of those *children* are close to the 19-year range to INFLATE those \"children gun death\" numbers.",
    "like_count": 432,
    "published_at": "2023-11-11T16:37:25Z",
    "is_reply": false,
    "reply_count": 30,
    "replies": [
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29wzNnGQ9VEz",
        "author": "@treborkroy5280",
        "text": "And it's only true for the black community. The community that's is 13% of population. It's incredibly misleading to just say \"children\"",
        "like_count": 69,
        "published_at": "2023-11-11T17:10:58Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29wzNq3l1582",
        "author": "@BPF80MCar-vi1pg",
        "text": "And most are actually suicide",
        "like_count": 34,
        "published_at": "2023-11-11T17:11:21Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29wzOOhM0Wxc",
        "author": "@treborkroy5280",
        "text": "@BPF80MCar-vi1pg for the white demographics yes, but not blacks, it's homicide. The two leading causes of deaths relating to firearms is black men using them on others when they are mad, and white men using them on themselves when they are sad.",
        "like_count": 0,
        "published_at": "2023-11-11T17:16:13Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29wzPO7ePzY1",
        "author": "@Shishomuru",
        "text": "​@BPF80MCar-vi1pgthis, if you delve deep into the actual numbers, roughly 80% of annual gun homicides are suicides, and roughly 12% of gun homicides take place in 3 cities(Chicago, Detroit, Baltimore).\n\nMy favorite is how hard the left attacks AR-15's when rifles in general account for less than 0.5% of gun related homicides every year.",
        "like_count": 0,
        "published_at": "2023-11-11T17:24:52Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29wzPpODXqJO",
        "author": "@MachineMan-mj4gj",
        "text": "And the classic bit of deception; counting suicides by gunshot as a gun death alongside actual crime.",
        "like_count": 65,
        "published_at": "2023-11-11T17:28:44Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29wzR1Uvlyqu",
        "author": "@treborkroy5280",
        "text": "@MachineMan-mj4gj What you mean overdosing isn't pharmaceutical violence? Jumping off a bridge isn't gravity violence? Hold on your telling me when someone hangs themselves it isn't recorded as rope violence???",
        "like_count": 0,
        "published_at": "2023-11-11T17:39:16Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29wzTUH_VGGP",
        "author": "@Julesy980",
        "text": "@treborkroy5280 I swear, it feels like they are more than 13% now.",
        "like_count": 12,
        "published_at": "2023-11-11T18:00:40Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29wzUNX2dRuC",
        "author": "@treborkroy5280",
        "text": "@Julesy980 Section 8 has spread them from inner cities to rural areas for decades.",
        "like_count": 15,
        "published_at": "2023-11-11T18:08:29Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29wzVF2KkX3D",
        "author": "@Julesy980",
        "text": "@treborkroy5280 Got to mess with the farming, which relies on people being VERY respectful of property to function. Not like you can make farming areas into fortresses.",
        "like_count": 10,
        "published_at": "2023-11-11T18:16:04Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29wzY4MNtjGe",
        "author": "@debanydoombringer1385",
        "text": "@treborkroy5280 I'm so surprised by how many people don't seem to remember Obama making it a priority to drastically increase government housing in the suburbs and other areas and created huge incentives for developers to do so. I remember because it struck me as not a good idea. Not because of not wanting them there but just basic facts like those areas don't usually have public transportation for that they'll need. If they can't afford rent they aren't going to own a car either. So it would be even more difficult for them to have access to goods and services like groceries.",
        "like_count": 28,
        "published_at": "2023-11-11T18:40:49Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29wzZn2pSuZb",
        "author": "@somethingsomething8511",
        "text": "And no mention that most of those \"children\" are in drug gangs in blue cities.",
        "like_count": 0,
        "published_at": "2023-11-11T18:55:48Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29wzi9hUCMHs",
        "author": "@kommisar.",
        "text": "@debanydoombringer1385 And here they are now complaining about food deserts as they drive out supermarkets and other retailers with their cultural crime problems.",
        "like_count": 15,
        "published_at": "2023-11-11T20:17:40Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29wzn5JgsYUX",
        "author": "@pickeljarsforhillary102",
        "text": "New York counts 21 year old as children.",
        "like_count": 0,
        "published_at": "2023-11-11T21:00:45Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29wzqhveEOGd",
        "author": "@poodlescone9700",
        "text": "And the people who are kids doing the shootings are 16 -17 yr old black inner city youths.  That means laws like background checks and waiting periods are useless to stop gun violence because no legitimate gun store would even sell to anyone under 18.",
        "like_count": 0,
        "published_at": "2023-11-11T21:32:23Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29wzvFtNLOoa",
        "author": "@robertgray1365",
        "text": "14-18 year old gangbangers are categorized as \"children\" and make up the VAST majority of the child gun victim statistic. But guns are totally the problem.",
        "like_count": 0,
        "published_at": "2023-11-11T22:12:06Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29x-95JKT_rZ",
        "author": "@Vaga-Bard",
        "text": "You think that something? \nYou heard the talking point about America and mass shootings? Only in America they say. \nAccording to the definition of mass shooter, an American must be shot in order for it to be a “mass shooting”. \n\nSeriously, check the definition. \nHilarious. 😂🎉",
        "like_count": 0,
        "published_at": "2023-11-12T00:21:44Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29x-AP8x7Rqd",
        "author": "@Vaga-Bard",
        "text": "@Julesy980well, that probably is an old stat, but also, it’s far less than 13%. Even if that stat is old and overall the total population of black folk has risen, the current percentage would still be below 13%.\nThat 13% is the entire black population. That includes children, women and elders. None of which are involved in gang culture. For that number we have to remove at least 4/5 of the whole population to deduce that actual number. Probably closer to 3%-5% do the actual work. \nThat 13% is lumping in a lot of folks who don’t do anything wrong.",
        "like_count": 7,
        "published_at": "2023-11-12T00:33:11Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29x-BO3S8aMS",
        "author": "@Julesy980",
        "text": "@Vaga-Bard It doesn't matter. There are a lot of 'nice' (or at least 'not overtly bad') people in say, post apartheid South Africa. For example. Doesn't matter.",
        "like_count": 4,
        "published_at": "2023-11-12T00:41:46Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29x-TZ6xoZpP",
        "author": "@crookedmoon7243",
        "text": "Probably bc of over representation. @Julesy980",
        "like_count": 2,
        "published_at": "2023-11-12T03:20:34Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29x-zHf9a9MI",
        "author": "@GamingProspector84",
        "text": "@Vaga-Bardthat might be but their culture promotes doing/selling drugs and gangbanger activity. It’s few and far between one will grow up without those constant influences and become a productive member of society.",
        "like_count": 6,
        "published_at": "2023-11-12T08:06:33Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29x3Ijuam-Hy",
        "author": "@ge2719",
        "text": "@BPF80MCar-vi1pg well that's their other tactic. When comparing democrats States on \"gun deaths\" not gun murders. In order to try make democrat states look better by comparison. Yet they have more gun murders and they have more self forever sleep via methods other than guns. \nThey intentionally mislead people. Its disgusting",
        "like_count": 0,
        "published_at": "2023-11-13T15:03:01Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29x5Vu4407u3",
        "author": "@KingDJ524",
        "text": "​@BPF80MCar-vi1pgso suicide is good? That's your point?",
        "like_count": 0,
        "published_at": "2023-11-14T11:36:29Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29x5s8BNcrOv",
        "author": "@ShiniGuraiJoker",
        "text": "Legally, they are adults, but they are still in the teenage years. May ir Maynor be out of high-school, so yeah. They are definitely kids by definition of a teenager and a general consensus except when societies has deemed they have to be adults.",
        "like_count": 0,
        "published_at": "2023-11-14T14:59:31Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29x987wKV6t-",
        "author": "@ericb6390",
        "text": "They also dont count kids under 1 yr old",
        "like_count": 4,
        "published_at": "2023-11-15T21:25:46Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29x98dtY8Dhr",
        "author": "@ge2719",
        "text": "@ericb6390 exactly. And nor do they count medically unnecessary abortions. Which would be the biggest cause by far.",
        "like_count": 5,
        "published_at": "2023-11-15T21:30:15Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29xG4mJk4M5w",
        "author": "@bobsburgers6002",
        "text": "​@ShiniGuraiJoker their use of the word \"kid\" is disingenuous and you know it",
        "like_count": 3,
        "published_at": "2023-11-18T14:11:09Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29xHcfNWNQv3",
        "author": "@RaccAttack77",
        "text": "@MachineMan-mj4gjDon’t forget that when it comes to school shootings, that includes said suicides in their car in the parking lot or somewhere else on the grounds with no other victims AND shootings that happen up to something like a mile away that have nothing to do with the school",
        "like_count": 0,
        "published_at": "2023-11-19T04:35:16Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29xTOLvjNQSk",
        "author": "@godzilla2k26",
        "text": "​@Julesy980Actually they are Eleven and a half percent now. Their population is actually decreasing as planned parenthood fulfills its mission. And to think Sanger thought she had to be secretive about it.",
        "like_count": 4,
        "published_at": "2023-11-23T18:12:18Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29xTQrGSNVmA",
        "author": "@Julesy980",
        "text": "@godzilla2k26 Unfortunately, that could be because of mass immigration :/ In other words, their numbers could be stable or increasing, but their percentage of the population could still go down. Haven't checked though.",
        "like_count": 3,
        "published_at": "2023-11-23T18:34:11Z",
        "is_reply": true
      },
      {
        "id": "UgwOovsUf3Xt4JOx9mt4AaABAg.9wzJxY3s9d29xjjgaJWhGn",
        "author": "@AnthonyRMaradin",
        "text": "​@ShiniGuraiJoker  - No, young adult teenagers are not by any definition a child. Perhaps just by liberal types who skew reality on pretty much any topic.\n\n\nThe arbitrary age of consent for young adult teenagers varies throughout time and regions. Not too far in the past, young adult teenagers fought wars, had farms, etc. \n\n\nThey are also able to plan crimes and lure people who may be in a temporary or permanent weakened state of mind, such as an adult. \n\n\nKeep in mind, the human brain doesn't stop developing until the late twenties, child or adult!? \n\n\nInteraction between a young adult teenager and adult is not pedophilia, but rather ephebophilia. I'm not advocating for or against this behavior.\n\n\nThe nonsense to deem a young adult teenager a child stems from a criminal case decades ago, where a defense for a young adult teenager was successfully made. However, what is observed now is reverting back to treating them as adults in court.",
        "like_count": 0,
        "published_at": "2023-11-30T11:54:35Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx_xrvSdwgt6nu_n4R4AaABAg",
    "author": "@bpooboi",
    "author_channel_id": "UC-xfy8HAOlW4RMfQYK6XPxQ",
    "text": "\"Crime is down!!\" **ignores all data. Sue's in court to keep it from hitting public. Purposefully hires people that actively manipulate it**",
    "like_count": 84,
    "published_at": "2023-11-11T17:49:20Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "Ugx_xrvSdwgt6nu_n4R4AaABAg.9wzSBHy6QV-9x4Kiun3yJ8",
        "author": "@mkv2718",
        "text": "that apostrophe in “sues” shouldn’t be there.",
        "like_count": 2,
        "published_at": "2023-11-14T00:39:36Z",
        "is_reply": true
      },
      {
        "id": "Ugx_xrvSdwgt6nu_n4R4AaABAg.9wzSBHy6QV-9x5StTDeCz6",
        "author": "@attemptedunkindness3632",
        "text": "@mkv2718 Yeah Sue is my mother and is a wonderful woman, if ever she was in court it was to cover for her renegade child.  But I got his point, and more to the point we have enough actual nazis running around these days, don't need grammar nazis.",
        "like_count": 2,
        "published_at": "2023-11-14T11:10:11Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzCsClrgTwiuPm5etB4AaABAg",
    "author": "@robertparnell4619",
    "author_channel_id": "UCIaKuyp0KEQloSNkMQ7UYEA",
    "text": "Started it back in 08 in NC. We were called in to do a audit, and we found that they were “padding” the books. Basically, if multiple crimes were committed within a certain area (under 1sq mile) it was assigned a single report. Virtually car theft, assaults, robberies, were all lumped in a “area activity report”. Recently went to Uptown Charlotte, and it’s dead. No nightlife in an area that was booming 2-4 years ago. Just homeless and drug addicts.",
    "like_count": 360,
    "published_at": "2023-11-11T16:21:12Z",
    "is_reply": false,
    "reply_count": 22,
    "replies": [
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9wzK6uqwRlN",
        "author": "@John33Steve",
        "text": "Most likely, due to the elevated rates of white supremacy and lbqgtMap hate crimes, duh.",
        "like_count": 0,
        "published_at": "2023-11-11T16:38:50Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9wzL8_co7HS",
        "author": "@MyzoryMaiq",
        "text": "I lived in Jacksonville man, i completely agree with you, driving up to Charlotte is sad the state has been hit hard with the opiate fentanyl one two punch. So many cities are completely decimated only places that have any sort of economic security is Methadone clinics i suppose, either way its sad to see.",
        "like_count": 20,
        "published_at": "2023-11-11T16:47:48Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9wzLtC-TqH3",
        "author": "@robertparnell4619",
        "text": "@MyzoryMaiq Sad indeed. Uptown Charlotte was full of life. Museums, concerts, bars, restaurants, and CMPD walking patrols. Had to walk 3 blocks to find a restaurant that didn’t have a “Closed Indefinitely” or “Available for Lease”. Needles piled next to the Catholic Church, people crapping on sidewalks, and a dude that was standing still, but bent over. No police in sight.",
        "like_count": 22,
        "published_at": "2023-11-11T16:54:18Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9wzMz3rEeUK",
        "author": "@gyromurphy",
        "text": "I suppose thats the same as an individual committing multiple assaults on different people over the course of a few days, finally getting arrested, and they get charged for those assaults, but it's all lumped into a single court docket? So it would read as a single case of assault? Even if multiple assault charges were applied to that individual court docket?",
        "like_count": 12,
        "published_at": "2023-11-11T17:03:50Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9wzNvoDyPqP",
        "author": "@robertparnell4619",
        "text": "@gyromurphy Yup. From my understand  ing the assigned PD would get the smaller charges dropped, and then lessen say “Malicious Wounding” to “Simple Assault”. They now have this new one called “Medical Assault”. If the suspect is only arrested if medical intervention is sought by the victim. If they refuse or don’t go, the suspect is given a fine. It’s hilarious.",
        "like_count": 17,
        "published_at": "2023-11-11T17:12:08Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9wzPKbZAftv",
        "author": "@geek593",
        "text": "@MyzoryMaiq Opioids burned through NC like a wildfire.",
        "like_count": 0,
        "published_at": "2023-11-11T17:24:24Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9wzQuugt41H",
        "author": "@badlaamaurukehu",
        "text": "​@robertparnell4619The issue isn't with the class of addicts so much as it is an issue with the class of public officials voted into office in these deteriorating areas who are supposed to manage these issues.\n\nWhen your mayor, DA and police chiefs are all from the same block you'll end up with a block mentality screwing up the whole city.",
        "like_count": 5,
        "published_at": "2023-11-11T17:38:13Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9wzR6u_Gk4e",
        "author": "@SockieTheSockPuppet",
        "text": "'08............Oh look, that's when Obama started to be in charge. _wHaT a CoInCiDeNcE._",
        "like_count": 10,
        "published_at": "2023-11-11T17:40:00Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9wzRJUxNDeW",
        "author": "@robertparnell4619",
        "text": "@badlaamaurukehu I completely agree. I hadn’t kept up on Charlotte politics, just seeing the evidence of a once thriving area. But I have no doubt the cause is exactly that.",
        "like_count": 2,
        "published_at": "2023-11-11T17:41:43Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9wzRkW0W1D-",
        "author": "@robertparnell4619",
        "text": "@SockieTheSockPuppet Yup. We had a guy named Carson that was a rising star. Dude was early, he stayed late, he loved to take on new agents. We had a meeting right after the 08 Election. He comes walking in, shirt untucked, and bragging that Obama won and “things were gonna change around here! I’m the man now!”. Last I heard he’s washing cars at his father in laws used car lot.",
        "like_count": 8,
        "published_at": "2023-11-11T17:45:33Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9wzTCmEHbje",
        "author": "@TheControlBlue",
        "text": "They will be right with the Data but they will still live in Hell.",
        "like_count": 1,
        "published_at": "2023-11-11T17:58:16Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9wzZTMdzPi-",
        "author": "@somethingsomething8511",
        "text": "In Baltimore it's called juking the stats",
        "like_count": 5,
        "published_at": "2023-11-11T18:52:58Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9wzbPyNyDMw",
        "author": "@rash9488",
        "text": "I lived in the area almost 2 decades ago, Huntersville, and remember going down to Charlotte frequently for the active night life. Glad I left.",
        "like_count": 2,
        "published_at": "2023-11-11T19:18:43Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9wzezoRgTvY",
        "author": "@DirtyMeat",
        "text": "Live there, I can confirm that uptown Charlotte is a dead shithole now only a few years away from becoming another classic lefty shit hole\n\nAlso cmpd is desperate for new officers. No one wants to join up, they cut pay, and tie your hands behind your back when it comes to enforcing the law.",
        "like_count": 0,
        "published_at": "2023-11-11T19:49:58Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9wzqWXGWSjg",
        "author": "@McKae00",
        "text": "Drug addicts and blacks quite literally are the ones that vote for these dog shit politicians @badlaamaurukehu",
        "like_count": 0,
        "published_at": "2023-11-11T21:30:41Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9wzv9174WXl",
        "author": "@waltermh111",
        "text": "Remind me about when people want to inflate the concept of a school shooting. They claim it and I forget the exact distance. But like any shooting within five hundred feet of a school or within one mile of a school and counts anything from suicide to a misfire.",
        "like_count": 0,
        "published_at": "2023-11-11T22:11:10Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9x2ySj_Yk1K",
        "author": "@wakinglife7065",
        "text": "@robertparnell4619I saw a body cam video and a guy with a warrant was calling for an ambulance even thought there was nothing wrong with him. He even said I’m going to deny services when they get here just to play the system",
        "like_count": 0,
        "published_at": "2023-11-13T11:57:02Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9x3wdgkSbml",
        "author": "@TheoHawk316",
        "text": "I'm in NC, and I hate Charlotte.\n\nBeen there for a concert or two, and I'm always looking over my shoulder.",
        "like_count": 1,
        "published_at": "2023-11-13T21:00:26Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9x5oPWYHOYp",
        "author": "@kylejohnson8447",
        "text": "It started way before that.",
        "like_count": 1,
        "published_at": "2023-11-14T14:26:56Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9x9fmDtyDbz",
        "author": "@BroTheDude",
        "text": "@TheoHawk316 Best to go hangout in South End, Noda, Plaza or Montford.... Not uptown unless they make improvements there",
        "like_count": 1,
        "published_at": "2023-11-16T02:28:30Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9xVx4Y7Jp-b",
        "author": "@mw6346",
        "text": "I left Charlotte in 2016. Went back to uptown last year for the first time since I left. A homeless guy tried to force his way into my car at a stop light. I won't be back.",
        "like_count": 1,
        "published_at": "2023-11-24T18:02:58Z",
        "is_reply": true
      },
      {
        "id": "UgzCsClrgTwiuPm5etB4AaABAg.9wzI5llEzLp9xVxbeO2MGy",
        "author": "@robertparnell4619",
        "text": "@mw6346 Damn sorry about that. Hate to say I got my Springfield under the steering column for that exact scenario. Better to be proactive than reactive.",
        "like_count": 1,
        "published_at": "2023-11-24T18:07:38Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw59fA1pAuZ-i2fMoJ4AaABAg",
    "author": "@tjmiller9567",
    "author_channel_id": "UCyFAcaNBKd5EOH9r4XBycjA",
    "text": "We all know they lie. Thanks for showing how",
    "like_count": 191,
    "published_at": "2023-11-11T16:04:44Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "Ugw59fA1pAuZ-i2fMoJ4AaABAg.9wzGDDZi4sm9wzQ_97tFpK",
        "author": "@killgoretrout877",
        "text": "they have to cause it's minorities and white democrats committing almost all the crime in the country",
        "like_count": 0,
        "published_at": "2023-11-11T17:35:15Z",
        "is_reply": true
      },
      {
        "id": "Ugw59fA1pAuZ-i2fMoJ4AaABAg.9wzGDDZi4sm9wzTOj4ALKt",
        "author": "@TheControlBlue",
        "text": "The evidence of our own eyes is always the better one.",
        "like_count": 8,
        "published_at": "2023-11-11T17:59:54Z",
        "is_reply": true
      },
      {
        "id": "Ugw59fA1pAuZ-i2fMoJ4AaABAg.9wzGDDZi4sm9wzbDcu1H0V",
        "author": "@tongla9447",
        "text": "​@TheControlBlueyet, \"Fact checkers\" still think they can fool us.",
        "like_count": 0,
        "published_at": "2023-11-11T19:17:02Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw2k1yDemNUcwyafV94AaABAg",
    "author": "@iplz",
    "author_channel_id": "UCP_78ct17pwWYbdeQXrK4vQ",
    "text": "People not reporting the crime because they know it wont get prosecuted anyway",
    "like_count": 87,
    "published_at": "2023-11-11T16:07:55Z",
    "is_reply": false,
    "reply_count": 13,
    "replies": [
      {
        "id": "Ugw2k1yDemNUcwyafV94AaABAg.9wzG_UBdfFe9wzN_Gfam3X",
        "author": "@arkgaharandan5881",
        "text": "knowing people in south america, this is exactly how they say it is there, we are becoming south america.",
        "like_count": 7,
        "published_at": "2023-11-11T17:09:03Z",
        "is_reply": true
      },
      {
        "id": "Ugw2k1yDemNUcwyafV94AaABAg.9wzG_UBdfFe9wzg7Xphf2m",
        "author": "@giovalladares1022",
        "text": "Victims survey catches MOST of these unreported crimes in the stats so we have a rough idea of the real numbers",
        "like_count": 0,
        "published_at": "2023-11-11T19:59:54Z",
        "is_reply": true
      },
      {
        "id": "Ugw2k1yDemNUcwyafV94AaABAg.9wzG_UBdfFe9wzicpaisRG",
        "author": "@cypherreport",
        "text": "The police in general are bad at catching people after the fact and always have been",
        "like_count": 0,
        "published_at": "2023-11-11T20:21:47Z",
        "is_reply": true
      },
      {
        "id": "Ugw2k1yDemNUcwyafV94AaABAg.9wzG_UBdfFe9wzob1g8wxE",
        "author": "@TheFredmac",
        "text": "​@arkgaharandan5881when immigrants don't assimilate their culture becomes dominant, who would have thought.",
        "like_count": 0,
        "published_at": "2023-11-11T21:13:58Z",
        "is_reply": true
      },
      {
        "id": "Ugw2k1yDemNUcwyafV94AaABAg.9wzG_UBdfFe9wzvsl-TiO3",
        "author": "@sole__doubt",
        "text": "@giovalladares1022 If you really beleive that I still have a nice bridge for sale in city near you.  ;)",
        "like_count": 1,
        "published_at": "2023-11-11T22:17:33Z",
        "is_reply": true
      },
      {
        "id": "Ugw2k1yDemNUcwyafV94AaABAg.9wzG_UBdfFe9x-vuzBz_m0",
        "author": "@Gitn2it",
        "text": "Oddly enough, there are quite a few far left white people who won't report being victimized by a black perp because they don't want to be responsible for putting another black person in prison.",
        "like_count": 0,
        "published_at": "2023-11-12T07:37:06Z",
        "is_reply": true
      },
      {
        "id": "Ugw2k1yDemNUcwyafV94AaABAg.9wzG_UBdfFe9x0czOW0gHY",
        "author": "@YouMissedBro",
        "text": "Just like when they calculate illegal immigrants at the border, they only talk about the ones they catch and then poorly guess a random ass number that they didn't catch",
        "like_count": 0,
        "published_at": "2023-11-12T14:10:55Z",
        "is_reply": true
      },
      {
        "id": "Ugw2k1yDemNUcwyafV94AaABAg.9wzG_UBdfFe9x5lPZsVBvg",
        "author": "@jason200912",
        "text": "Unlikely seeing how you can easily report a crime anonymously. I do it all the time and say I'd rather not give my contact info and the dispatcher said sure",
        "like_count": 1,
        "published_at": "2023-11-14T14:00:44Z",
        "is_reply": true
      },
      {
        "id": "Ugw2k1yDemNUcwyafV94AaABAg.9wzG_UBdfFe9x5mPcWa5py",
        "author": "@sole__doubt",
        "text": "@jason200912 thats true but if the cops want to figure out who you are they easily can.",
        "like_count": 0,
        "published_at": "2023-11-14T14:09:29Z",
        "is_reply": true
      },
      {
        "id": "Ugw2k1yDemNUcwyafV94AaABAg.9wzG_UBdfFe9x6TOuIT2Aw",
        "author": "@jason200912",
        "text": "@sole__doubt of course they want to. But I already did my part helping them by reporting it.  I'm not required to stick around and also give them my ID and such",
        "like_count": 0,
        "published_at": "2023-11-14T20:33:51Z",
        "is_reply": true
      },
      {
        "id": "Ugw2k1yDemNUcwyafV94AaABAg.9wzG_UBdfFe9x6ZOUdKeZV",
        "author": "@sole__doubt",
        "text": "@jason200912 They dont need your ID, just the metadata from the call will be enough for them to figure out who called if they really want to.",
        "like_count": 0,
        "published_at": "2023-11-14T21:26:14Z",
        "is_reply": true
      },
      {
        "id": "Ugw2k1yDemNUcwyafV94AaABAg.9wzG_UBdfFeA7ZjWnNBt3w",
        "author": "@EphemeralWealth",
        "text": "Cops not pursuing criminals because they know it won't get prosecuted anyway",
        "like_count": 0,
        "published_at": "2024-08-25T15:06:48Z",
        "is_reply": true
      },
      {
        "id": "Ugw2k1yDemNUcwyafV94AaABAg.9wzG_UBdfFeAQBxYnyDHnx",
        "author": "@samgoff5289",
        "text": "How do we get our crime numbers down? “Sir what if we stop prosecuting so people stop reporting? Genius!”",
        "like_count": 0,
        "published_at": "2025-12-01T15:24:07Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxqbAs_qN-IpgKln2N4AaABAg",
    "author": "@user-hm1zb8js5i",
    "author_channel_id": "UCxHybesaXRkrcqkFWtSNtww",
    "text": "There are three types of lies: Lies, damned lies, and statistics.",
    "like_count": 120,
    "published_at": "2023-11-11T16:15:05Z",
    "is_reply": false,
    "reply_count": 11,
    "replies": [
      {
        "id": "UgxqbAs_qN-IpgKln2N4AaABAg.9wzHOyv0j7A9wzNyONABaa",
        "author": "@mrborgeusborg1541",
        "text": "Good thing I was looking over comments before typing one myself. was about to type this myself.",
        "like_count": 3,
        "published_at": "2023-11-11T17:12:29Z",
        "is_reply": true
      },
      {
        "id": "UgxqbAs_qN-IpgKln2N4AaABAg.9wzHOyv0j7A9wzPuYN-pnN",
        "author": "@MachineMan-mj4gj",
        "text": "Always, always, always check the methodology.",
        "like_count": 7,
        "published_at": "2023-11-11T17:29:26Z",
        "is_reply": true
      },
      {
        "id": "UgxqbAs_qN-IpgKln2N4AaABAg.9wzHOyv0j7A9wzQuPbdRNz",
        "author": "@meekmeads",
        "text": "You forgot one: Leftist",
        "like_count": 7,
        "published_at": "2023-11-11T17:38:10Z",
        "is_reply": true
      },
      {
        "id": "UgxqbAs_qN-IpgKln2N4AaABAg.9wzHOyv0j7A9wzluX0VWIV",
        "author": "@BrotherHood-xh9sg",
        "text": "You can't name the main category as a type of that category.",
        "like_count": 1,
        "published_at": "2023-11-11T20:50:24Z",
        "is_reply": true
      },
      {
        "id": "UgxqbAs_qN-IpgKln2N4AaABAg.9wzHOyv0j7A9x-9pU3DIGw",
        "author": "@Savssmiles",
        "text": "Statistics aren’t lies. It’s how they manipulate the stats that is the lie. So leftists/Democrats",
        "like_count": 0,
        "published_at": "2023-11-12T00:28:11Z",
        "is_reply": true
      },
      {
        "id": "UgxqbAs_qN-IpgKln2N4AaABAg.9wzHOyv0j7A9x-BllkPpKn",
        "author": "@amibrainwashed",
        "text": "​@meekmeadsredundant, damned lies was already listed.",
        "like_count": 0,
        "published_at": "2023-11-12T00:45:09Z",
        "is_reply": true
      },
      {
        "id": "UgxqbAs_qN-IpgKln2N4AaABAg.9wzHOyv0j7A9x0J8X57k8o",
        "author": "@meekmeads",
        "text": "@amibrainwashed Major difference is, if you call them out, they will call every -ist there is, and cancel you.",
        "like_count": 1,
        "published_at": "2023-11-12T11:08:48Z",
        "is_reply": true
      },
      {
        "id": "UgxqbAs_qN-IpgKln2N4AaABAg.9wzHOyv0j7A9x0aqHhlLVj",
        "author": "@redashea3004",
        "text": "Reagan",
        "like_count": 0,
        "published_at": "2023-11-12T13:52:11Z",
        "is_reply": true
      },
      {
        "id": "UgxqbAs_qN-IpgKln2N4AaABAg.9wzHOyv0j7A9x1et-SBQya",
        "author": "@readhistory2023",
        "text": "@redashea3004 Nope. Not Ronny. Mark Twain made the phrase \"There three kinds of lies. Lies, damned lies, and statistics.\" famous but he didn't come up with it. Twain attributes the quote to Benejamin Disraeli, however there's no record of Disraeli ever saying it.\n Another guy who has a sharp  wit is Will  Rogers. A politicial humorist from the early 1900's. \n\"“There are three kinds of men. The ones that learn by readin’. The few who learn by observation. The rest of them have to pee on the electric fence for themselves.”\n― Will Rogers",
        "like_count": 1,
        "published_at": "2023-11-12T23:46:46Z",
        "is_reply": true
      },
      {
        "id": "UgxqbAs_qN-IpgKln2N4AaABAg.9wzHOyv0j7A9xiaRRIBVSD",
        "author": "@emberfist8347",
        "text": "@BrotherHood-xh9sg You realizing he quoting Mark Twain right?",
        "like_count": 0,
        "published_at": "2023-11-30T01:14:29Z",
        "is_reply": true
      },
      {
        "id": "UgxqbAs_qN-IpgKln2N4AaABAg.9wzHOyv0j7A9xjRAeiAq2z",
        "author": "@BrotherHood-xh9sg",
        "text": "@emberfist8347 no I did/do not. I don't see how that matters though? I simply told the fact that you can't use the same name for the sub category & the category itself.\n\n\"There are multiple types of chairs; Part chairs, chairs, etc.\", is basically what they said. Makes no sense.",
        "like_count": 0,
        "published_at": "2023-11-30T09:04:03Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugz004x8jjouUSTOLT94AaABAg",
    "author": "@Terminarch",
    "author_channel_id": "UCLnxz3VNYb4WF9dzVae_U5Q",
    "text": "The thing I hate most about our failing society... People only care about appearances, never about reality.",
    "like_count": 57,
    "published_at": "2023-11-11T21:29:26Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "Ugz004x8jjouUSTOLT94AaABAg.9wzqNM9ZmA29xDZ-BNGAKp",
        "author": "@liwojenkins",
        "text": "It's one of the highest markers of a failed society.",
        "like_count": 1,
        "published_at": "2023-11-17T14:37:27Z",
        "is_reply": true
      },
      {
        "id": "Ugz004x8jjouUSTOLT94AaABAg.9wzqNM9ZmA29xEfuT9BMgi",
        "author": "@alericc1889",
        "text": "Leftist Socialist you mean NOT people.....",
        "like_count": 0,
        "published_at": "2023-11-18T01:05:49Z",
        "is_reply": true
      },
      {
        "id": "Ugz004x8jjouUSTOLT94AaABAg.9wzqNM9ZmA29xGFRF8H8jR",
        "author": "@MidlifeCrisisJoe",
        "text": "I mean, that's WHY it's failing. Not taking care of fundamentals and only taking care of the surface level is what causes the damage to society.",
        "like_count": 0,
        "published_at": "2023-11-18T15:44:15Z",
        "is_reply": true
      },
      {
        "id": "Ugz004x8jjouUSTOLT94AaABAg.9wzqNM9ZmA29xRaI9Bt_0W",
        "author": "@RogerDarns",
        "text": "Narcissistic society",
        "like_count": 0,
        "published_at": "2023-11-23T01:26:54Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxiqRBPs9DMeSDeC7N4AaABAg",
    "author": "@TheBigAEC",
    "author_channel_id": "UCgwgQIXYnoQZBm4HTUo2Iaw",
    "text": "The problem i have with them acting like trends dont exist is that they'd never accept this argument for anything else. If this year the atmosphere cooled 2°C on average vs last year they'd say EXACTLY what you're saying. CEO's salaries same thing but then when you bring up crime or immigration all of a sudden simple math concepts become esoteric, ancient knowledge lost to time. It's so dishonest and aggravating",
    "like_count": 93,
    "published_at": "2023-11-11T16:34:22Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgxiqRBPs9DMeSDeC7N4AaABAg.9wzJbF1cdbb9wzOj6P6xxG",
        "author": "@13ANANANAMAN",
        "text": "Stats are only relevant when they support \"The Narative\" you biggot, why do you hate black people or something huh? 😂",
        "like_count": 0,
        "published_at": "2023-11-11T17:19:08Z",
        "is_reply": true
      },
      {
        "id": "UgxiqRBPs9DMeSDeC7N4AaABAg.9wzJbF1cdbb9wzVe5x6Dbi",
        "author": "@samael4550",
        "text": "At this point it’s extremely tiring to call out the double standards, they have them for literally everything, it’s a joke.",
        "like_count": 10,
        "published_at": "2023-11-11T18:19:37Z",
        "is_reply": true
      },
      {
        "id": "UgxiqRBPs9DMeSDeC7N4AaABAg.9wzJbF1cdbb9wzou89jGV-",
        "author": "@TheFredmac",
        "text": "Math is racist.",
        "like_count": 0,
        "published_at": "2023-11-11T21:16:34Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzUYaKYOL_DG6ZFtsV4AaABAg",
    "author": "@JustaGuy_Gaming",
    "author_channel_id": "UCmQzAnhcAkW6CMtS0484JnQ",
    "text": "A big one is they just stop making something a felony. Like raising the shop lifting cap to 1k or more in California.",
    "like_count": 29,
    "published_at": "2023-11-11T19:16:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg",
    "author": "@wolfskull_wardagger",
    "author_channel_id": "UCXDo2NYwjyBhzT19h_AE27w",
    "text": "How disgraceful that they knowingly give cover for and intentionally fail to combat crime in our society only to gain political points. Are they just apathetic towards the real criminality around them?",
    "like_count": 238,
    "published_at": "2023-11-11T16:32:18Z",
    "is_reply": false,
    "reply_count": 30,
    "replies": [
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9wzQuZf6LFc",
        "author": "@katosushihisa1029",
        "text": "Some of them even believe that certain criminals have a right to do what they do. They think of it as a form of “reparation”.",
        "like_count": 35,
        "published_at": "2023-11-11T17:38:11Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9wzRcqSqWwU",
        "author": "@katiek.8808",
        "text": "No, I believe the theory is that we are to devolve into complete chaos and then somehow magically we will have a unanimous epiphany to build a socialist paradise. That’s why it appears all they know what to do is destroy.",
        "like_count": 1,
        "published_at": "2023-11-11T17:44:30Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9wzSdoR_N89",
        "author": "@wolfskull_wardagger",
        "text": "​@katiek.8808Even their \"socialist paradise\" would be hell to me.",
        "like_count": 9,
        "published_at": "2023-11-11T17:53:22Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9wzTa5baBYz",
        "author": "@katiek.8808",
        "text": "@wolfskull_wardagger well yeah because you would have to pretend to not be human. I personally don’t know how they do it.",
        "like_count": 5,
        "published_at": "2023-11-11T18:01:36Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9wzUf3kzW1x",
        "author": "@wolfskull_wardagger",
        "text": "@katiek.8808 I doubt they know how they'd do it, they're delusional and bitter.",
        "like_count": 5,
        "published_at": "2023-11-11T18:11:01Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9wzVGoqnzmR",
        "author": "@katiek.8808",
        "text": "@wolfskull_wardagger that’s the only kind of person that buys into Marxism. In order to promote Marxism you have to be completely selfish and self centered. Completely focused in the material and filled with envy.",
        "like_count": 1,
        "published_at": "2023-11-11T18:16:18Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9wzXRnkvcX1",
        "author": "@oblivionsa7973",
        "text": "It wouldn't work if the people they were lying to weren't so unbelievably stupid or willfully ignorant. At least half the blame lies on their voters, who may or may not even exist at this point with how much voter fraud they commit.",
        "like_count": 1,
        "published_at": "2023-11-11T18:35:17Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9wzZMoVF9gX",
        "author": "@_lithp",
        "text": "They believe people are only committing crimes because of the conditions caused by capitalism and institutional oppression, the criminal justice system being an extension of both. So their focus is on changing the system, not holding criminals accountable.",
        "like_count": 1,
        "published_at": "2023-11-11T18:52:04Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9wz_Aycn2zH",
        "author": "@theprophet9428",
        "text": "They then blame it on capitalism 💀",
        "like_count": 6,
        "published_at": "2023-11-11T18:59:12Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9wzaW5yp4bZ",
        "author": "@katiek.8808",
        "text": "@theprophet9428 well capitalism appears to not be the free market. Capitalism does appear to be another form of Marxism which I guess makes sense since he coined the term.",
        "like_count": 2,
        "published_at": "2023-11-11T19:10:49Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9wzcmsVjYMh",
        "author": "@wolfskull_wardagger",
        "text": "@katiek.8808 If free markets aren't capitalism then what are they?",
        "like_count": 5,
        "published_at": "2023-11-11T19:30:44Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9wzfBl28jjy",
        "author": "@katiek.8808",
        "text": "@wolfskull_wardagger reality. Free markets are the way our world always operated. Tim even talked about it in this episode. Capitalism is a system for unremarkable people to stay wealthy and in power just like Marxism as a whole. A free market is like what the owner of my company is doing. He worked hard is whole life and decided to take his retirement and start a factory. He owns the factory and it’s a private company. I believe capitalism is the same as speculative markets. The founders warned heavily of this style of economy being allowed to become primary and who would bring it to us. This is not a new fight.",
        "like_count": 4,
        "published_at": "2023-11-11T19:51:44Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9x-7067Ol5H",
        "author": "@grantwithers",
        "text": "Didn't you hear?  The Criminals are the Victims bro.",
        "like_count": 0,
        "published_at": "2023-11-12T00:03:33Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9x-CeLUXkBc",
        "author": "@Solon_The_Lich",
        "text": "​@grantwithersThey Chose Barabbas as their Messiah",
        "like_count": 0,
        "published_at": "2023-11-12T00:52:52Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9x0hgEGYgNu",
        "author": "@Lorekeeper72",
        "text": "A lot of them live in low crime areas where they don't have to see this kind of thing in person, just read it in statistics and articles or hear about it on the news. Makes it easy for them to deny the reality because they don't encounter it often enough.",
        "like_count": 4,
        "published_at": "2023-11-12T14:51:59Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9x0tTMfQhu8",
        "author": "@NeglectfulSausage",
        "text": "In the UK they hide data on assaults of 12-14 year old girls because \"it'd incite racism if people knew\". Because one group moved from middle east and started doing mass assaults on these girls. This is colonialist behavior.",
        "like_count": 0,
        "published_at": "2023-11-12T16:34:57Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9x1AUFW23jj",
        "author": "@jimpearson399",
        "text": "It's not apathy, it is a blood hatred. Those that have the ability to stop crime do not because they want to see us victimized.  Read the Protocols",
        "like_count": 3,
        "published_at": "2023-11-12T19:12:22Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9x1FKXBoHj8",
        "author": "@Zyzzyyx",
        "text": "Leftists are postmodernists, they dont believe in statistics, data, or facts.",
        "like_count": 0,
        "published_at": "2023-11-12T19:54:43Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9x2xp4Oqihc",
        "author": "@wakinglife7065",
        "text": "@wolfskull_wardaggeramen! Socialist utopia is my dystopian nightmare",
        "like_count": 1,
        "published_at": "2023-11-13T11:51:29Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9x3R3dgh7We",
        "author": "@moistjohn",
        "text": "They do not care about the minorities who are overwhelmingly the victims of these crimes, because they were commited by another, much smaller pool, of minorities",
        "like_count": 0,
        "published_at": "2023-11-13T16:15:45Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9x3xeROKR7Z",
        "author": "@kaigamble7353",
        "text": "I think as soon as you accept money to push ideas/bills/laws by wealthy entities in hopes of further enriching them and yourself you have already lost a part of your soul and will continue doing so the deeper you get. I think thats why alot of politicians left or right become numb to criticism and to lying.",
        "like_count": 0,
        "published_at": "2023-11-13T21:09:17Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9x5TpPCKKbI",
        "author": "@attemptedunkindness3632",
        "text": "@katosushihisa1029 Have a lady, nicest in the world, reeeeally buys into CNNarrative. Had a bowl of candies for halloween, the rule was 'just say trick or treat and take what you want' I forgot to ask, and she sweetly reminded me 'what do you ask?' so I jokingly said 'Reparations'. Mood got weirdly serious, she opened her drawer revealing kit kats, snickers, and reeses (the good stuff) and was going about it like I was mugging her but she was somehow doing the correct thing in her mind.  I personally was taken aback.",
        "like_count": 0,
        "published_at": "2023-11-14T11:18:22Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9xAG2WMv_NC",
        "author": "@imadogsass6717",
        "text": "Gotta take it to the politicians’ and bureaucrats’ doorsteps.",
        "like_count": 0,
        "published_at": "2023-11-16T07:54:10Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9xAgaGMkIJ0",
        "author": "@cassady7169",
        "text": "@Lorekeeper72it’s even crazier than that as most of these people are lefty’s and live in large cities with a ton of homelessness, drug use, crime and poverty. They see it every day, they just blame it on capitalism and use it as a way to justify their political views. “Oh that black guy had no choice but to kill that other black guy because of the racist, capitalist system that we are forced to live in. If we had my perfect system, this would never happen”.",
        "like_count": 0,
        "published_at": "2023-11-16T11:54:50Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9xDo--MnbQV",
        "author": "@hectorzero8545",
        "text": "​@katosushihisa1029 even worse many think crime is moral because,  as communists, they think crime is just \"redistribution of wealth by other means\". So if you wonder why it looks like new left wing laws seem as if they're designed to protect criminals, it's because they literally do.",
        "like_count": 0,
        "published_at": "2023-11-17T16:57:15Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9xDoTbWhGnd",
        "author": "@hectorzero8545",
        "text": "​@katiek.8808 you sound just like a monarchist. A system for \"unremarkable people to stay in power\". Unremarkable by what standard? It's a meritocracy which is inherently anti-marxist. Just because Marx coined a term doesn't make it Marxist. Shakespeare coined many terms and phrases that doesn't make all their definitions centralized to mean the same thing.",
        "like_count": 0,
        "published_at": "2023-11-17T17:01:25Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9xDodTcEeAq",
        "author": "@hectorzero8545",
        "text": "​​@katiek.8808Free markets are literally not how the world has always operated. By that definition slavery is freedom because it's how the world has always operated until very recently. Ignoring the obvious coercion and force involved in the slave-master relationship and calling it \"freedom\" because it was the default state of the world for so long is ignorant at best and dishonest at worst.",
        "like_count": 0,
        "published_at": "2023-11-17T17:02:54Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9xDpXUdsKeM",
        "author": "@katiek.8808",
        "text": "@hectorzero8545 yes the act of slavery is not a free market at least not chattel slavery. You are aware for the majority of slavery people were selling themselves? No of course not because that would ruin the commie perspective. I’ll be honest not sure what exactly you are responding too but the progressives and their Marxism is the system for the unremarkable. Collectivism as a whole is for the unremarkable. You are aware monarchy is original collectivism. No probably not.",
        "like_count": 0,
        "published_at": "2023-11-17T17:10:41Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9xE8-q4JJPW",
        "author": "@sovietunion7643",
        "text": "they aren't apathetic, its the same thing totilarian governments do: remove any public information  that would indicate that things aren't going well so the population doesn't get angry.",
        "like_count": 0,
        "published_at": "2023-11-17T20:00:51Z",
        "is_reply": true
      },
      {
        "id": "Ugy3QoTYfFh4dIIFsNZ4AaABAg.9wzJN55NOTP9xEfx5CiS_b",
        "author": "@alericc1889",
        "text": "Its their VOTER BASE...",
        "like_count": 1,
        "published_at": "2023-11-18T01:06:11Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxsGry8Re-jUEt7WOF4AaABAg",
    "author": "@CaddyJim",
    "author_channel_id": "UCuzq5yoXxuj8IgbKSEZ_kAg",
    "text": "People...\nGoogle California and New York not giving federal government crime date",
    "like_count": 4,
    "published_at": "2023-11-15T18:14:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxfJOMpe0GE1fOiz7d4AaABAg",
    "author": "@NinjaKittyBonks",
    "author_channel_id": "UCBBDxxsbJjGmlHxrEAW7Xhg",
    "text": "No question that data is manipulated. What is so sad is that people SEE the horror stories, but dismiss them and continue to vote for the same politicians anyway!",
    "like_count": 463,
    "published_at": "2023-11-11T16:14:32Z",
    "is_reply": false,
    "reply_count": 30,
    "replies": [
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9wzJypG-jEv",
        "author": "@bobbob-gx1iq",
        "text": "It is until it happens to them. Case in point see Anas turn around after she was robbed or whatever happened to her to make her rethink everything",
        "like_count": 24,
        "published_at": "2023-11-11T16:37:35Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9wzMfpwocqv",
        "author": "@bigbangrafa8435",
        "text": "That's why I hate Destiny. Before my 20's I was more optmistic about humanity, and because of that skeptical about the existance of objective evil. That changed the first time I've seem Destiny looking at people's eyes and lying to them with no doubt or hesitation. The sickening and fanatical way he gloats about Biden and how inflation is under control while me and pretty much everyone I know is struggling to buy groceries. He's the most twisted and evil sociopath I ever had the displeasure to know on the internet, to the point that It seriously changed how I view life and the world around me.",
        "like_count": 28,
        "published_at": "2023-11-11T17:01:13Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9wzN_ZlQ7N7",
        "author": "@NinjaKittyBonks",
        "text": "@bobbob-gx1iq ... DING DING DING [+25 purr credits to you] Exactly! We have all been saying this for some time and Ana is a perfect example of FINALLY seeing that the left has gone WAY too far, even for her. \n.\nI think the absolute #1 enemy of the people is mainstream leftist news. Were they to _actually_ report accurately and fairly on ALL that they see happening, these \"leaders\" would not get the passive \"pass\" they continually get. Now, zero question that the voters are freakin' moroon's of the highest order, but if they pressed on Hunter Biden laptop, what had motivated \"Russia, Russia, Russia\" and the 10 billion other things they lie, obfuscate, spin until we are all dizzy or simply not cover at all, these \"leaders\" would have their feet to the fire on the daily and never be able to escape their HORRENDOUS acts. \n.\nSo long as people live within an information bubble, we will have blind loyalty.",
        "like_count": 0,
        "published_at": "2023-11-11T17:09:06Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9wzOMrq31_u",
        "author": "@NinjaKittyBonks",
        "text": "@bigbangrafa8435 .. What is even more sad... Destiny is NOWHERE in the stratosphere the worst offender out there. Cenk is among the most vile of them all, but even people like Ethan were at one time fantastic, but once they sell their soul to the devil that is WOKE... one has to have MASSIVE influence to escape.\n.\nThen there are people like Howard Stern, who DO have massive influence, though not nearly what it was 10+ years ago, who have sold that soul, so as to have everlasting protection from cancellation. Sam Harris is another who comes to mind. \n.\nSelling out empties ones being of its essence, so how can one live so empty?",
        "like_count": 1,
        "published_at": "2023-11-11T17:15:58Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9wzPbuiJYlZ",
        "author": "@LyteMo",
        "text": "​@bobbob-gx1iquntil it happens to them, but then they forgive the attacker because it's just a poor underprivileged homeless person",
        "like_count": 6,
        "published_at": "2023-11-11T17:26:54Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9wzRBYfsHLi",
        "author": "@katiek.8808",
        "text": "Correction: they vote for the same ideology.",
        "like_count": 1,
        "published_at": "2023-11-11T17:40:38Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9wzTs1XrMHJ",
        "author": "@bobbob-gx1iq",
        "text": "@bigbangrafa8435 I am sorry but I hard disagree on destiny. Not saying I agree with the man but I have seen him way more open to at least listening to other people's opinion on may topics then most YouTube or twitch commentators that just scream at the other side. I would say the most sick and twisted person though is actually Hassan. I think Destiny believes most of what he says while Hasan it is just an act to get the most money out of his audience.",
        "like_count": 4,
        "published_at": "2023-11-11T18:04:03Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9wzU6U6T-ue",
        "author": "@bobbob-gx1iq",
        "text": "@LyteMo you haven't been keeping up. No they flip to the opposite side. Look at all the sanctuary cities flipping now.",
        "like_count": 0,
        "published_at": "2023-11-11T18:06:09Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9wzYOiK6rOh",
        "author": "@oblivionsa7973",
        "text": "You mean I didn't fall on a knife 3 times while losing my wallet, phone, and watch?",
        "like_count": 3,
        "published_at": "2023-11-11T18:43:36Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9wzbdz2SoR2",
        "author": "@NinjaKittyBonks",
        "text": "​@oblivionsa7973 ... Yes. Just the other day, I was walking along and suddenly, I accosted myself and attempted to throw myself in front of the subway train, but was fortunate enough to fend off myself. Of course, I now am facing prosecution of a hate crime, because I am black, but police say I \"identified\" as white during the time of self-attack 😿",
        "like_count": 1,
        "published_at": "2023-11-11T19:20:46Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9wzdw2VTwSJ",
        "author": "@lashlarue59",
        "text": "If voting really mattered they wouldn't let you do it.",
        "like_count": 1,
        "published_at": "2023-11-11T19:40:43Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9wzeoM3C0hI",
        "author": "@NinjaKittyBonks",
        "text": "@lashlarue59 ... You are making excuses for citizens who fail themselves. These \"leaders\" made their way up the ranks from mayors of small towns and such. Clearly some were bitten by the WOKE bug and sold it all over night, but if the people ALL showed up at the Mayors, governors office to demand change and NOT leave until they got it (yes... make the cops arrest 500 people!), this WOULD change.\n.\nPeople do not have the balls of earlier generations and why this society is on the brink of total collapse.",
        "like_count": 0,
        "published_at": "2023-11-11T19:48:24Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9wzqcMi8Gdl",
        "author": "@HeilDoge",
        "text": "It doesn’t matter if it happens to them or not Soybloods will always vote Democrat, no matter what….",
        "like_count": 0,
        "published_at": "2023-11-11T21:31:37Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9wztdtmlT8X",
        "author": "@TheBestKees",
        "text": "FBI data is based on verdicts, the other on arrests and self reports. Tells you enough, sure self reporting can inflate the numbers, but it is well known they deliberately have been dropping charges and lowering senteces over the past decades to manipulate these numbers.\nThe real question is: Do you have more faith in the victims? Or the bureaucrats.",
        "like_count": 0,
        "published_at": "2023-11-11T21:58:03Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9wzwucyKhXM",
        "author": "@navaerick86",
        "text": "ANYTHING but the evil orange man! 🤕",
        "like_count": 0,
        "published_at": "2023-11-11T22:26:33Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9x-7FB3aY8-",
        "author": "@MrLuffy9131",
        "text": "The thing is crime doesn't exist if they simply don't report it lol or report none of the other crimes unless it involves a violent encounter",
        "like_count": 1,
        "published_at": "2023-11-12T00:05:36Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9x-OvA_VoEP",
        "author": "@UltraKardas",
        "text": "@bobbob-gx1iqYou need to rethink your life. \n\nThe truth is that you are similar to Destiny. Because of that, you are biased in favor of him and advocate for him.\n\nHe’s only open minded to his way of thinking. The way of thinking you both share.\n\nOpen minded means considering ideas typically opposed to your way of thinking. Logically considering the pros and cons of the suggestion and being able to try them out.\n\nThat’s not you. That’s not Destiny.",
        "like_count": 5,
        "published_at": "2023-11-12T02:40:02Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9x-UnavB-Ko",
        "author": "@user-im2pn4zq2v",
        "text": "@bigbangrafa8435soy",
        "like_count": 0,
        "published_at": "2023-11-12T03:31:25Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9x-_3mr16LZ",
        "author": "@trublgrl",
        "text": "Do they?  After Dominion was exposed, do you really believe that elections determine who wins in this country?",
        "like_count": 0,
        "published_at": "2023-11-12T04:17:27Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9x-zNb3LobY",
        "author": "@LabTech41",
        "text": "There's a significant portion of the public that doesn't want to admit what their instincts and suspicions tell them:  that the Republic fell years ago, and they're living in a totalitarian dystopia in all but name.  They know things are in serious decline, but they're too afraid to accept the notion that so much of what they believe is wrong, so they just accept the lie as sort of a security blanket.\n\nIt'll take something truly bad, worse than what we've got now, to shake enough people out of complacency, and even then plenty of people are largely going to sit on the sidelines and wait to see who wins, then follow them.",
        "like_count": 0,
        "published_at": "2023-11-12T08:07:21Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9x0e_ugd27r",
        "author": "@lowtdave",
        "text": "It's so frustrating. I know people who ignore the stats and talk about privilege and all sorts of bs. Something very common to the people who ignore crime stats and scream privilege is they usually come from affluent areas sheltered from reality and they only see what it's like to be \"priviliged\" and assume everyone like them lives that way because there is no way they'd ever travel anywhere that isn't wealthy and sheltered from real life problems.",
        "like_count": 1,
        "published_at": "2023-11-12T14:24:55Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9x1zmbPQouu",
        "author": "@bigbangrafa8435",
        "text": "@bobbob-gx1iq That's a matter of perspective. I always stick with obvious and \"on your face\" psychos than the insidious ones. A person outside of the progressive bubble can easily perceive Hasan as the monster he actually is. \nDestiny on the other hand is manipulative, he will do EVERYTHING in his power to project an image of being an honest and rational person how's only trying to understand the world and create positive change. Thanks to that most people would leave their guard down, and by doing that would allow themselves to buy into his destructive ideas. It takes A LOT of knowledge to catch one of his lies, the type of knowledge most people lacks, and that's what makes him so dangerous. You would usually have already bought into his ideas at that point, blocking you from seeing the manipulation. \nI still remember that during gamergate, a moment in which most people were opening their eyes for the first time about the stablishment and MSM lying to your face, Destiny was inside gamer circles converting people to what today is the progressive cult.",
        "like_count": 1,
        "published_at": "2023-11-13T02:49:23Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9x35aqLkgI6",
        "author": "@UltraKardas",
        "text": "@lowtdave Its called \"facts vs feelings\". You prefer facts. Gee. I wonder why you would be so frustrated by feelings not supported by reality.\n\nSome people think white people are privileged because they were born. \n\nThe biggest privilege in America? Greater than all others? Having a father. \n\nFather Privilege surpasses all others. Doesn't matter what race you are, what gender you are. Having a father? not being taken care of by a single mother? Is the single greatest privilege money can't buy.",
        "like_count": 0,
        "published_at": "2023-11-13T13:08:11Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9x3wjLRlC9X",
        "author": "@ethanhinton4549",
        "text": "@bobbob-gx1iq he's the best of the worst, not exactly the most impressive bar to clear",
        "like_count": 2,
        "published_at": "2023-11-13T21:01:13Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9x6KxdGBNGz",
        "author": "@OperationOffensive",
        "text": "​@bigbangrafa8435They also cover the facts about the forbidden word the \"R\" word.",
        "like_count": 0,
        "published_at": "2023-11-14T19:20:06Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9xAfL6Bw9pj",
        "author": "@cassady7169",
        "text": "@UltraKardasDestiny is way more open minded than most “lefty’s” online. I bet Sean would even agree to that. He has changed his stance on several things and is seen by many on the left as a radical alt right fascist because he has decent takes on trans women in sports, capitalism, the Israel/Palestine conflict and he defended Kyle Rittenhouse from the start. He changed his mind about media coverage of police killing black people, that they intentionally lie in their reporting and cause further harm and violence. He’s not perfect, but as far as online political “debate bros”, he’s the most fair and honest one that I have seen.",
        "like_count": 1,
        "published_at": "2023-11-16T11:43:54Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9xBAWjj03uE",
        "author": "@iammrpositive5108",
        "text": "Sean would definitely agree. The idea that Destiny is the most evil sociopath on the internet is completely unhinged.",
        "like_count": 2,
        "published_at": "2023-11-16T16:25:06Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9xShXN0KHJa",
        "author": "@KingBarnaDuke",
        "text": "I don't believe he's a \"sociopath\", that diagnosis is more suited to Cenk and Cenk's nephew.\nBut I also do not believe that Destiny is \"honest\". He has had very good engagement with right wing creators, much more so than most of his debates with people on the Left. Yet, he will STILL say that ALL conservatives/republicans are \"stupid\" \"ignorant\" \"conspiracy theorists\" \"science deniers\" \"fascists\" etc etc.\nI lost a lot of respect for him after he joined forces with some tankies to put Adam & Sitch through a pretty disturbing purity/struggle session over the msm bias.\nThe final straw was the recent debate with Sean over Trump v Biden.\n(I'm neither Right or Left, just observant). 👍",
        "like_count": 0,
        "published_at": "2023-11-23T11:49:22Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkC9yx9BUU2A5R",
        "author": "@DerpyRedneck",
        "text": "@bigbangrafa8435 Yep, grifting fuck",
        "like_count": 0,
        "published_at": "2023-12-30T13:27:39Z",
        "is_reply": true
      },
      {
        "id": "UgxfJOMpe0GE1fOiz7d4AaABAg.9wzHKwnjjkCA7UvEva-NVI",
        "author": "@MARS_BATTLLE_IS_ON_COINBASE",
        "text": "That's wrong, they don't see the data. Only people in Internet echo chambers  see the data, the rest of the population has no idea what the real data is.",
        "like_count": 0,
        "published_at": "2024-08-23T18:13:01Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx7AJkAuo-GEIxbbOR4AaABAg",
    "author": "@zaqzilla1",
    "author_channel_id": "UCN7rzE37QYMEy1BQFkpMZ_w",
    "text": "My favorite is when they downgrade a crime from a felony to a misdemeanor so there are fewer felonies.",
    "like_count": 3,
    "published_at": "2023-11-21T14:16:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgysUZLSAqyb4FQ7FkJ4AaABAg",
    "author": "@jk3jk35",
    "author_channel_id": "UCE51ax5hJ79dCtvRY5Kg-Vw",
    "text": "If the police don't respond they don't record the incident in their data.",
    "like_count": 3,
    "published_at": "2023-12-01T00:04:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyr0A2elwNiR3aoAmF4AaABAg",
    "author": "@seantyler7401",
    "author_channel_id": "UClyvhmxbn27w47mIt9k0IkA",
    "text": "Well, when they tell people to report it online and they don’t have cops, eventually people quit filing the paperwork because the cops won’t do anything anyway. Reporting goes down. Not actual crime",
    "like_count": 62,
    "published_at": "2023-11-11T16:11:37Z",
    "is_reply": false,
    "reply_count": 5,
    "replies": [
      {
        "id": "Ugyr0A2elwNiR3aoAmF4AaABAg.9wzH-blyrIs9wzam6GJjYV",
        "author": "@ronintsukebin9163",
        "text": "so true",
        "like_count": 3,
        "published_at": "2023-11-11T19:13:09Z",
        "is_reply": true
      },
      {
        "id": "Ugyr0A2elwNiR3aoAmF4AaABAg.9wzH-blyrIs9wzgjkuyZc1",
        "author": "@Br3ttM",
        "text": "Even when it is reported, prosecutors and judges do nothing in many places unless it fits their politics.  Repeat offenders getting a few months in jail for felonies, and evidence sent to a lab has years of backlog, so even if these prosecutors are willing to prosecute things like rape, one of the few crimes that their side cares about, the evidence just sits on a shelf.",
        "like_count": 4,
        "published_at": "2023-11-11T20:05:15Z",
        "is_reply": true
      },
      {
        "id": "Ugyr0A2elwNiR3aoAmF4AaABAg.9wzH-blyrIs9wzilhHE65B",
        "author": "@kommisar.",
        "text": "@Br3ttM Well, duh, that's the reason why people stop bothering reporting crimes.  It's also a big reason why police quit a department and that department then has problems finding replacements.",
        "like_count": 1,
        "published_at": "2023-11-11T20:22:59Z",
        "is_reply": true
      },
      {
        "id": "Ugyr0A2elwNiR3aoAmF4AaABAg.9wzH-blyrIs9wzoIvp56gx",
        "author": "@TheFredmac",
        "text": "Colion Noir interviewed a guy in LA who was assaulted at his front door. There was a shoot out, no one was hurt. Of the cops that showed up only one was interested in finding out what happened. The next day the guy found shell casings, and clothing left by the attackers. The police didn't bother to  collect evidence. Eventually he had to threaten a police captain with going to the local media before the police would do their jobs.",
        "like_count": 0,
        "published_at": "2023-11-11T21:11:21Z",
        "is_reply": true
      },
      {
        "id": "Ugyr0A2elwNiR3aoAmF4AaABAg.9wzH-blyrIs9x-9ii9mPSp",
        "author": "@Savssmiles",
        "text": "💯. I still reported it online when my purse was stolen from my car but all they had to do was go look at footage of the fast food restaurant I parked at and went into.",
        "like_count": 0,
        "published_at": "2023-11-12T00:27:15Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxJxEP5RRWtYQGe1u54AaABAg",
    "author": "@Scryyn",
    "author_channel_id": "UC664QilJWYmuEjSJic0OpRQ",
    "text": "\"Compared to what?\"\n\nAn economist's favorite phrase.",
    "like_count": 1,
    "published_at": "2025-10-20T22:52:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwelCYdaYhS4MIQlQt4AaABAg",
    "author": "@joeschneider3894",
    "author_channel_id": "UC0Gb35kqSbtuwxAlnxOLq0w",
    "text": "I live in Manhattan. I’ve been physically assaulted four times in the last three years. I reported zero of these incidents to the police because I know it will take a huge amount of my time and precisely nothing will happen. \n\nI have multiple friends and family who have shared that they’ve had one or more similar instances happen. \n\nPlus…\nNone of this takes into account behavioral change. I constantly have my head on a swivel. At least a dozen times during the last three years I’ve seen something incredibly sketchy in front of me and intentionally changed direction or crossed the street to avoid it. I’ve also made sure to walk female friends home at night after an evening out to make sure they’re not alone. Multiple male friends tell me they feel just as safe today as they did five to ten years ago… yet they also admit they always wait for the train with their back against the wall and won’t stand near the tracks anymore and/or now carry knives, pepper spray, or other defensive items. \n\nIf New Yorkers weren’t taking more defensive measures and were bothering to report every violent encounter or assault… I guarantee you the reported numbers would skyrocket. Like… “add an extra zero” to every violent crime stat reported levels.",
    "like_count": 15,
    "published_at": "2023-11-11T18:46:11Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwelCYdaYhS4MIQlQt4AaABAg.9wzYghDFCoF9wz_DFwe--0",
        "author": "@oblivionsa7973",
        "text": "I'd suggest getting a firearm, but we both know that's never going to happen in NY. Obviously the police are doing such an outstanding job you don't need to protect yourself.",
        "like_count": 2,
        "published_at": "2023-11-11T18:59:30Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxRz08akTPhtdUU7_d4AaABAg",
    "author": "@Defme374",
    "author_channel_id": "UCfs142xuxdeenL2FP4KA14g",
    "text": "Haha my brother worked for NORC on the police brutality data, where they compiled data from all over the country into a single format. They wound up finding no major revelations, they were honest about it, and they published their data. Nobody even covered the release of this data and their report because it literally didn’t change the conversation at all. They did it because so many people were saying that the real police brutality numbers are hidden behind opaque publication practices by different policing organizations. When they got all the data it basically reflected FBI numbers.",
    "like_count": 71,
    "published_at": "2023-11-11T16:17:28Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxRz08akTPhtdUU7_d4AaABAg.9wzHfNgNKkh9x-8eMd4n7k",
        "author": "@TheMelnTeam",
        "text": "Civil forfeiture and false charging are much bigger police issues than excessive force.  Channels like audit the audit do show that the legal system fails to charge police committing felonies goes unpunished though.\n\nIt's forfeiture that has the largest scale.  It's openly in budgets and is widely practiced, state sanctioned banditry.  Until that changes and QI stops blocking felony charges, policing in states that practice these deserve no respect.  Those need to be fixed, period.",
        "like_count": 12,
        "published_at": "2023-11-12T00:17:55Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxgK7RF2Iq40FaMOOB4AaABAg",
    "author": "@HowToFindHappinesssurvival",
    "author_channel_id": "UCL42bQyNebO6jCanrXKftDQ",
    "text": "Im glad you covered the variance of data and its manipulation for low iq political reasons. Its a pretty affluential topic that everyone seems to ignore before diving into whatever cherry picked statistics they quote.",
    "like_count": 47,
    "published_at": "2023-11-11T16:25:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxUx_kXIHmi1s-WLjp4AaABAg",
    "author": "@zonatedspore97acamas",
    "author_channel_id": "UCsL_N6GDtyk4V4BgyxMvGQg",
    "text": "If you're a grifter doing whatever gets you clout and money then you can conclude that crime has indeed gone down.",
    "like_count": 35,
    "published_at": "2023-11-11T16:17:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgymA0S3mZQTj2XHFhV4AaABAg",
    "author": "@StockA4",
    "author_channel_id": "UCLg_oGudQdQ71z47L9F1VTw",
    "text": "The biggest problem, (outside of the actual problem addressed here) is that no one who needs to see this will actually see it. And they will go on ignoring facts and enjoying living exclusively in their feelings.",
    "like_count": 16,
    "published_at": "2023-11-11T18:04:33Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgymA0S3mZQTj2XHFhV4AaABAg.9wzTvm34-Ze9x-dxjdHuhh",
        "author": "@StrongandGrand",
        "text": "They can live there all they want... I just don't want to hear whining when they meet the thing they've been denying.  They chose to ignore reality.  They can deal with the consequences of doing that.",
        "like_count": 2,
        "published_at": "2023-11-12T05:00:11Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwkgVScsyk9KNQn1ZV4AaABAg",
    "author": "@RScott413",
    "author_channel_id": "UCsIk-3aP9YTJoTOA3xZxZ7A",
    "text": "At least two major retailers in my area are shoplifted at minimum 15 times a day EACH.  Not single item stuff but FULL CARTS leaving the stores.  Both of those stores are instructed not to report it to police.  The management has been ordered to only collect the most basic information and pass it on to Loss Prevention who does nothing but factor in the loss.  In several cases there is a \"coordinator\" that brings different actors to the store to load a cart and roll it out the door.   It is unreported and the thieves are only stealing more.    I am talking about two VERY common stores, my daughter is a manager at one of them and they have met with the staff from the other store to compare notes.   The theft often takes place within the last 2 hours of business and rather than have police just show up where they could arrest multiple thieves in a short time they are told not to pursue.    The people aren't reporting it, the police aren't reporting it to the feds and it is going to destroy businesses in a GREAT area that never had these problems prior to 2020.",
    "like_count": 22,
    "published_at": "2023-11-11T16:58:35Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgwkgVScsyk9KNQn1ZV4AaABAg.9wzMNV8dQyB9wzZVLUaMDE",
        "author": "@oblivionsa7973",
        "text": "They don't arrest criminals anymore. But god help anyone who decides to stop the criminals... We've entered the stage of collapse where the police spend more time going after normal people because it's easier than dealing with the criminals.",
        "like_count": 0,
        "published_at": "2023-11-11T18:53:14Z",
        "is_reply": true
      },
      {
        "id": "UgwkgVScsyk9KNQn1ZV4AaABAg.9wzMNV8dQyB9x7RQanyMm7",
        "author": "@hardinmichael1981",
        "text": "So why is management/ownership wanting their own stores to eventually go out of business?",
        "like_count": 0,
        "published_at": "2023-11-15T05:35:51Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzeOQ1mVb1xW91BXWB4AaABAg",
    "author": "@JJawsyW",
    "author_channel_id": "UCvvsEx3F88r3VpEHNO1QnhA",
    "text": "I'm a retired Deputy Sheriff and law enforcement agencies are reporting to the UCR less and less. Not all departments send their stats to the FBI.",
    "like_count": 7,
    "published_at": "2023-11-11T19:25:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyyoQFKtd7-UQ_BRH94AaABAg",
    "author": "@zachkieri1185",
    "author_channel_id": "UCE5zb6CRqI1V56zv8UTmBbA",
    "text": "Always a pleasure to get a dose of reality from someone who JUST wants us to know the truth",
    "like_count": 23,
    "published_at": "2023-11-11T17:00:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwrErx4zz-o_CjfSF54AaABAg",
    "author": "@zonatedspore97acamas",
    "author_channel_id": "UCsL_N6GDtyk4V4BgyxMvGQg",
    "text": "If you get a lobotomy, crime has indeed gone down.",
    "like_count": 6,
    "published_at": "2023-11-11T16:15:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzLo2XPsDqyxX1JlRJ4AaABAg",
    "author": "@joecampbell4336",
    "author_channel_id": "UCSB80I86Tfveaq3ft8pk7DA",
    "text": "How would crime NOT be rising since criminals know there is virtually NO punishment for criminal activity?",
    "like_count": 1,
    "published_at": "2023-11-12T21:35:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgykevWMPYVwW-77TUp4AaABAg",
    "author": "@darkma1ice",
    "author_channel_id": "UC4pWjLoU76WHdwJb3uRwWyA",
    "text": ">change what is considered a crime\n\n>cheer the reduction in crime \n\nProgress",
    "like_count": 151,
    "published_at": "2023-11-11T16:17:28Z",
    "is_reply": false,
    "reply_count": 15,
    "replies": [
      {
        "id": "UgykevWMPYVwW-77TUp4AaABAg.9wzHfQKTjX79wzK2bYgrLq",
        "author": "@starplatinum5311",
        "text": "The CCP: Hey, that my technique!",
        "like_count": 12,
        "published_at": "2023-11-11T16:38:15Z",
        "is_reply": true
      },
      {
        "id": "UgykevWMPYVwW-77TUp4AaABAg.9wzHfQKTjX79wzKKx7CDry",
        "author": "@linusgustafsson2629",
        "text": "They usually do the opposite with sex crimes. First change it so that \"If a woman changes her mind and calls it rape, it is rape\" and then they claim rape is on the rise.",
        "like_count": 14,
        "published_at": "2023-11-11T16:40:45Z",
        "is_reply": true
      },
      {
        "id": "UgykevWMPYVwW-77TUp4AaABAg.9wzHfQKTjX79wzOC01Ipr4",
        "author": "@arewestilldoingphrasing6490",
        "text": "Call them unhoused then there is no more homeless",
        "like_count": 11,
        "published_at": "2023-11-11T17:14:29Z",
        "is_reply": true
      },
      {
        "id": "UgykevWMPYVwW-77TUp4AaABAg.9wzHfQKTjX79wzQkvmfg4w",
        "author": "@TooLegit_ToQuit",
        "text": "Also : Don't take reports for offenses that they don't want to consider as crimes",
        "like_count": 4,
        "published_at": "2023-11-11T17:36:52Z",
        "is_reply": true
      },
      {
        "id": "UgykevWMPYVwW-77TUp4AaABAg.9wzHfQKTjX79wz_58uUO6p",
        "author": "@Puzzlesocks",
        "text": "Changing definitions is the name of the game. That's why Autism got changed to \"Autism Spectrum Disorder\" as well, because they found out their test for Autism was giving false positives to a huge number of people and instead of creating a better test they just expanded the definition. The number of examples of definitions changing for dubious reasons in the modern day is astounding.",
        "like_count": 8,
        "published_at": "2023-11-11T18:58:24Z",
        "is_reply": true
      },
      {
        "id": "UgykevWMPYVwW-77TUp4AaABAg.9wzHfQKTjX79wzidndh9IA",
        "author": "@kommisar.",
        "text": "@Puzzlesocks They change definitions as well as change the terms to refer to the same thing as something else entirely.  For example, they don't call them \"illegal aliens\", but \"undocumented immigrants\".  Both terms refer to the same thing, but one sounds nicer and less immoral or problematic.  They also outright falsely label things, and look no further than their constant referrals to the BLM riots as \"protests\", all the more highlighted by their double standard of calling the Capitol riot an \"insurrection\".  The left constantly tries to change and manipulate the language to suit their agenda.  Just watch them in any argument over transgenderism.",
        "like_count": 0,
        "published_at": "2023-11-11T20:21:55Z",
        "is_reply": true
      },
      {
        "id": "UgykevWMPYVwW-77TUp4AaABAg.9wzHfQKTjX79wzvV1Vgf-G",
        "author": "@echobase6372",
        "text": ">YouTube\n>Meme arrows",
        "like_count": 0,
        "published_at": "2023-11-11T22:14:11Z",
        "is_reply": true
      },
      {
        "id": "UgykevWMPYVwW-77TUp4AaABAg.9wzHfQKTjX79x0dNE72VxI",
        "author": "@YouMissedBro",
        "text": "​@linusgustafsson2629  while also saying \"only 4/10 rapes are reported\" like in that old Lauren Southern interview with feminists. How do you know how many are unreported if nobody reports them?😂\n\nAlso include the Trump/Kavanaugh \"mean man raped me 30 years ago in a place and time I dont remember. Also have no evidence or witnesses. And yes, I'm coming out at a politically convenient time\" accusations to sex crime stats",
        "like_count": 0,
        "published_at": "2023-11-12T14:14:18Z",
        "is_reply": true
      },
      {
        "id": "UgykevWMPYVwW-77TUp4AaABAg.9wzHfQKTjX79x0tsRj5Nw3",
        "author": "@NeglectfulSausage",
        "text": ">mfw commenting @echobase6372",
        "like_count": 0,
        "published_at": "2023-11-12T16:38:31Z",
        "is_reply": true
      },
      {
        "id": "UgykevWMPYVwW-77TUp4AaABAg.9wzHfQKTjX79x5lYYMvyH-",
        "author": "@jason200912",
        "text": "They can also simply stop taking crime reports too",
        "like_count": 0,
        "published_at": "2023-11-14T14:01:57Z",
        "is_reply": true
      },
      {
        "id": "UgykevWMPYVwW-77TUp4AaABAg.9wzHfQKTjX79x9gyrMG7Te",
        "author": "@MrDj232",
        "text": "Also\n>break felonies into multiple misdemeanors\n\n>don't report numerous crimes\n\n>cheer the reduction in crime rates",
        "like_count": 0,
        "published_at": "2023-11-16T02:38:57Z",
        "is_reply": true
      },
      {
        "id": "UgykevWMPYVwW-77TUp4AaABAg.9wzHfQKTjX79x9iQkZgbvC",
        "author": "@jason200912",
        "text": "@MrDj232 I don't think so since crime is measured by property crime. Burglary robbery. Homicide and violent crime, Rape categories.",
        "like_count": 0,
        "published_at": "2023-11-16T02:51:38Z",
        "is_reply": true
      },
      {
        "id": "UgykevWMPYVwW-77TUp4AaABAg.9wzHfQKTjX79x9rLVzH9MR",
        "author": "@MrDj232",
        "text": "@jason200912  Armed robbery is a felony.  In California cities they'll get called about muggings and if they respond they file it as 2 reports.  One for misdemeanor robbery and one for misdemeanor brandishing a weapon.  This lowers felony crime rates and armed robbery reports even as muggings go up.",
        "like_count": 1,
        "published_at": "2023-11-16T04:09:34Z",
        "is_reply": true
      },
      {
        "id": "UgykevWMPYVwW-77TUp4AaABAg.9wzHfQKTjX79x9uXaCno6N",
        "author": "@jason200912",
        "text": "@MrDj232 I've never see crime stats per 100k for felony only. I believe it's for both misdemea or felony.\nI believe the distinction is only important  for a judge to determine length of prison time and for the atf nics to reject a 4473 application.  But the atf can also denies for dui and domestic conflict",
        "like_count": 1,
        "published_at": "2023-11-16T04:37:26Z",
        "is_reply": true
      },
      {
        "id": "UgykevWMPYVwW-77TUp4AaABAg.9wzHfQKTjX79x9xbSjDJqQ",
        "author": "@MrDj232",
        "text": "@jason200912  What crime stats are you looking at that include misdemeanors?  They're usually left out of national stats and media reports.  Unless you're looking at specific crimes.  Nobody cares how many people per 100k are jaywalking.",
        "like_count": 0,
        "published_at": "2023-11-16T05:04:19Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxW3kz_qTbtRW0UTx94AaABAg",
    "author": "@DamitTucker",
    "author_channel_id": "UCxCFnlY1Ru6JHb8-yIswsvg",
    "text": "Now, they will call Sean the crime denier.",
    "like_count": 14,
    "published_at": "2023-11-11T16:35:55Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxW3kz_qTbtRW0UTx94AaABAg.9wzJmX5uwDK9x-CMJeUwAC",
        "author": "@amibrainwashed",
        "text": "Name calling is all they have left.",
        "like_count": 0,
        "published_at": "2023-11-12T00:50:16Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg",
    "author": "@ArtyTrolls",
    "author_channel_id": "UCOsgq0tFqNQOD5koDr9sV_w",
    "text": "No way, leftists lying? I am shocked ;D",
    "like_count": 218,
    "published_at": "2023-11-11T16:13:16Z",
    "is_reply": false,
    "reply_count": 26,
    "replies": [
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzI9RVIv8v",
        "author": "@Max_Ohm",
        "text": "Get back to the studio, slacker.",
        "like_count": 0,
        "published_at": "2023-11-11T16:21:42Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzM4Jf3lKt",
        "author": "@Vragnarax",
        "text": "I'm more concerned about left wing Jews promoting the death of their own and the rest of us.",
        "like_count": 0,
        "published_at": "2023-11-11T16:55:57Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzN8acn_O7",
        "author": "@mynameisharlan",
        "text": "The right lie on a daily basis",
        "like_count": 2,
        "published_at": "2023-11-11T17:05:17Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzNVCzvJSq",
        "author": "@cheesecakeisgross4645",
        "text": "​@mynameisharlanDeflect unsuccessful.",
        "like_count": 44,
        "published_at": "2023-11-11T17:08:22Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzO0zfpLDe",
        "author": "@mynameisharlan",
        "text": "@cheesecakeisgross4645 Keep telling yourself that",
        "like_count": 2,
        "published_at": "2023-11-11T17:12:59Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzPROxCChJ",
        "author": "@geek593",
        "text": "@mynameisharlan Name some examples of lies this harmful that the right is perpetrating against the people.",
        "like_count": 24,
        "published_at": "2023-11-11T17:25:19Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzPn7ASpSX",
        "author": "@JampsD3",
        "text": "@mynameisharlan Any info behind that or was that just a \"no u\" response from being triggered that people you sheep behind are proven lying grifters?",
        "like_count": 0,
        "published_at": "2023-11-11T17:28:25Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzQZxiVwNG",
        "author": "@Mitzoplick",
        "text": "It is funny that people so able to think utopian when speaking about communism, are completely unable to think that any crime above 0% should be considered to be a problem.  They can see crime as being a given, but are unable to see the other myriad of human realities that make true communism an impossibility.",
        "like_count": 0,
        "published_at": "2023-11-11T17:35:13Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzRAm7d4wf",
        "author": "@cheesecakeisgross4645",
        "text": "@geek593 Don't bother, they aren't interested. The only goal is to derail the conversation.",
        "like_count": 24,
        "published_at": "2023-11-11T17:40:32Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzRoMdnxym",
        "author": "@JampsD3",
        "text": "@cheesecakeisgross4645 They're subbed to TYT, Hasan, and other braindead shit like The View/Kelly Clarkson show/jimmy fallon on top of a bunch of typical annoying youtuber personalities and degenerate weeb crap.",
        "like_count": 0,
        "published_at": "2023-11-11T17:46:04Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzShgdbhWx",
        "author": "@mynameisharlan",
        "text": "@geek593 The lies that conservatives spew every single day:\r\n1)\tThe dems didn’t win the election in 2020\r\n2)\tVaccines don’t work\r\n3)\tClimate change doesn’t exist\r\n4)\tDownplaying the reality of slavery in American history\r\n5)\tAnti wokeism as a disguise to distract people from dealing the actual problems in America (health care, minimum wage for workers and yes…crime)\r\n6)\tUsing second amendment to fight gun control, and lying to the American people that the widespread use and easy access to guns are the cause of gun violence in America\r\n7)\tUsing religion to promote their sick agenda (this alone affects many different aspects of average American citizens\r\n8)\tI can go on and on and on",
        "like_count": 0,
        "published_at": "2023-11-11T17:53:54Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzSzEPMQ48",
        "author": "@mynameisharlan",
        "text": "@cheesecakeisgross4645 Derailing actual conversations about the problems America is facing is conservatives' forte.",
        "like_count": 0,
        "published_at": "2023-11-11T17:56:17Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzTHxiedje",
        "author": "@Pwn3540",
        "text": "​@mynameisharlanthey don't lie on a crime",
        "like_count": 10,
        "published_at": "2023-11-11T17:58:59Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzTdK_jvvA",
        "author": "@larrywells7692",
        "text": "Just a another normal day for Demorats",
        "like_count": 11,
        "published_at": "2023-11-11T18:02:02Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzUg8gCAtA",
        "author": "@mynameisharlan",
        "text": "@geek593 The lies that conservatives spew every single day: The dems didn’t win the election in 2020 2)Vaccines don’t work. 3) Climate change doesn’t exist. 4) Downplaying the reality of slavery in American history. 4)Anti wokeism as a disguise to distract people from dealing the actual problems in America (health care, minimum wage for workers and yes…crime). 5) Using second amendment to fight gun control, and lying to the American people that the widespread use and easy access to guns are the cause of gun violence in America). 6) Using religion to promote their sick agenda (this alone affects many aspects average Americans’ lives). I can go on and on and on",
        "like_count": 0,
        "published_at": "2023-11-11T18:11:10Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzUuEgKcmK",
        "author": "@mynameisharlan",
        "text": "@geek593 The lies that conservatives spew every single day: The dems didn’t win the election in 2020 2)Vaccines don’t work. 3) Climate change doesn’t exist. 4) Downplaying the reality of slavery in American history. 4)Anti wokeism as a disguise to distract people from dealing the actual problems in America (health care, minimum wage for workers and yes…crime). 5) Using second amendment to fight gun control, and lying to the American people that the widespread use and easy access to guns are the cause of gun violence in America). 6) Using religion to promote their sick agenda (this alone affects many aspects average Americans’ lives). I can go on and on and on",
        "like_count": 0,
        "published_at": "2023-11-11T18:13:05Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzV--9Y4A1",
        "author": "@DC-gh6dy",
        "text": "​@mynameisharlanlike what. Be specific",
        "like_count": 5,
        "published_at": "2023-11-11T18:13:52Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzV8GZlM19",
        "author": "@scorchclasstitan6727",
        "text": "@mynameisharlan\nGr8 b8 m8.",
        "like_count": 2,
        "published_at": "2023-11-11T18:15:08Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzVU0aGEN8",
        "author": "@mynameisharlan",
        "text": "@DC-gh6dy The lies that conservatives spew every single day: The dems didn’t win the election in 2020 2) Vaccines don’t work. 3) Climate change doesn’t exist. 4) Downplaying the reality of slavery in American history. 4) Anti wokeism as a disguise to distract people from dealing the actual problems in America (health care, minimum wage for workers and yes…crime). 5) Using second amendment to fight gun control, and lying to the American people that the widespread use and easy access to guns are the cause of gun violence in America). 6) Using religion to promote their sick agenda (this alone affects many aspects average Americans’ lives). I can go on and on and on",
        "like_count": 0,
        "published_at": "2023-11-11T18:18:06Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzVayBv5WC",
        "author": "@BoogerlyPlops",
        "text": "​@DC-gh6dyare you seriously asking a lefty to be specific? They know nothing but what their overlords allow them to think. Sad thing is they love it that way because it keeps them from having to think on their own.",
        "like_count": 0,
        "published_at": "2023-11-11T18:19:11Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzVi6hm2E-",
        "author": "@mynameisharlan",
        "text": "@DC-gh6dy The lies that conservatives spew every single day: The dems didn’t win the election in 2020 2) Vaccines don’t work. 3) Climate change doesn’t exist. 4) Downplaying the reality of slavery in American history. 4) Anti wokeism as a disguise to distract people from dealing with the actual problems in America (health care, minimum wage for workers and yes…crime). 5) Using second amendment to fight gun control, and lying to the American people that the widespread use and easy access to guns are the cause of gun violence in America). 6) Using religion to promote their sick agenda (this alone affects many aspects average Americans’ lives). I can go on and on and on",
        "like_count": 0,
        "published_at": "2023-11-11T18:20:10Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzb0aaGuW0",
        "author": "@tongla9447",
        "text": "Hey! That's my catchphrase.",
        "like_count": 1,
        "published_at": "2023-11-11T19:15:15Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzbvB-ThFT",
        "author": "@paulbentley1705",
        "text": "@mynameisharlanYou guys couldn’t win an election without lying and cheating.",
        "like_count": 0,
        "published_at": "2023-11-11T19:23:07Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9wzvkEeKi00",
        "author": "@sole__doubt",
        "text": "Its really just America haters, they arent really the left since they are so pro authoritarian.",
        "like_count": 0,
        "published_at": "2023-11-11T22:16:23Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9x-AxmKumB_",
        "author": "@JampsD3",
        "text": "@mynameisharlan typical \"no you can't just punish criminals, the real problem is why they're forced to steal those nikes and trying to deter theft in the first place isn't helping anyone, donate money to this garbage foundation to fix the criminals real problems!\"",
        "like_count": 2,
        "published_at": "2023-11-12T00:38:03Z",
        "is_reply": true
      },
      {
        "id": "UgwV8p3fpSqs0Lzh4pV4AaABAg.9wzHBhGZLMp9x17GeZ5GQX",
        "author": "@ArtyTrolls",
        "text": "@mynameisharlan  well that didn't go well :p yes the right does lie, everyone lies, but the left is the only side that can't go one second telling the truth.....",
        "like_count": 0,
        "published_at": "2023-11-12T18:44:17Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyI2zpsBCD8OibuNbp4AaABAg",
    "author": "@oldladybast5292",
    "author_channel_id": "UC7HGLP-4DYdiWePHc5eA-xg",
    "text": "Not only are they not reported, less and less is being done about it.",
    "like_count": 2,
    "published_at": "2023-11-12T19:45:26Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxKvsaHTZEU-7iOMHR4AaABAg",
    "author": "@datgumkirby4477",
    "author_channel_id": "UCOKiVMob8HfkQNjCazrqSvQ",
    "text": "My question is how much crime isn't being reported and how much was once crime (crazy drug usage in public for example) that isn't classified as crime now but still on the rise.",
    "like_count": 19,
    "published_at": "2023-11-11T16:36:38Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgxKvsaHTZEU-7iOMHR4AaABAg.9wzJriB5fYt9wzcfkjqoe9",
        "author": "@podunkest",
        "text": "Hell yeah, that's a brilliant way to combat crime, 0% crime rate if everything is legal lol",
        "like_count": 3,
        "published_at": "2023-11-11T19:29:45Z",
        "is_reply": true
      },
      {
        "id": "UgxKvsaHTZEU-7iOMHR4AaABAg.9wzJriB5fYt9wzr2-0prKh",
        "author": "@TheFredmac",
        "text": "​@podunkestthe criminal justice system exists to protect criminals from society. If an individual is inclined to take advantage of their fellow humans, they will quickly learn that just because something is not illegal doesn't mean they can get away with it. That lesson will be learned from others' mistakes.",
        "like_count": 3,
        "published_at": "2023-11-11T21:35:15Z",
        "is_reply": true
      },
      {
        "id": "UgxKvsaHTZEU-7iOMHR4AaABAg.9wzJriB5fYt9wzuUeVYHa8",
        "author": "@podunkest",
        "text": "@TheFredmac I take your point but there's a lot of people who could and would get away with a lot more shit if the simple threat of actual state sanctioned punishment was removed. And if someone gets away with a crime you won't ever know it happened nor would they be dealt with by society because they got away. People aren't going to do the leg work to catch average, small time criminals, nor do they have the resources to do it  thoroughly and correctly. Criminals, for the most part, will prey on the weak and most vulnerable, they aren't going to go after the people who can defend or avenge their transgressions. And I wouldn't say it's \"designed\" to protect criminals from society, it's designed to protect the integrity of the concept of Justice and to dissuade and deincentivize immoral behavior. And vigilantism, although very gratifying and satisfying, is often as wrong as it is right. I think the Justice system is designed to protect everyone from everything in theory, it's just not perfect nor will it ever be, but it sure could be a hell of a lot better. I appreciate Libertarian and Anarchist ideas in theory and on paper, but in practice they fall flat because they make far too many positive assumptions about the average human or how things will magically self-correct.",
        "like_count": 0,
        "published_at": "2023-11-11T22:05:23Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgylgcIHfilVIk9okWV4AaABAg",
    "author": "@snowboarddan5899",
    "author_channel_id": "UCHfDER-6rWDwyfR8fA6UdWA",
    "text": "It’s so\nIronic how all three in the main photo have such a smug looking face",
    "like_count": 5,
    "published_at": "2023-11-11T16:09:46Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxYMXqn19LTDUlGK5V4AaABAg",
    "author": "@ivercingetorix1367",
    "author_channel_id": "UCHbHRVIlx0DIYJ5lD1S-qmg",
    "text": "I thought for sure you were gonna cover Eric Adams having his phones seized for investigation.",
    "like_count": 16,
    "published_at": "2023-11-11T16:04:14Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxYMXqn19LTDUlGK5V4AaABAg.9wzG9XpJV3o9wzGY1EqHhV",
        "author": "@221Prohunter",
        "text": "It’s probably best to wait and see what the results of that are before hyping it up.",
        "like_count": 4,
        "published_at": "2023-11-11T16:07:35Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugyhrb6u7orZ5RSj3l54AaABAg",
    "author": "@stephenburr9836",
    "author_channel_id": "UCULga7_IM0M4mc81WE1SlKA",
    "text": "\"I spent 15 minutes on Lance's 60 second video.\"\n\nIt always takes 10x the effort to respond to the bull$h1t than it does for the purveyor to spew it.",
    "like_count": 2,
    "published_at": "2023-11-12T23:46:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwfzFcPiXdhjhghprR4AaABAg",
    "author": "@metoonunyabidness1391",
    "author_channel_id": "UCw6AUutgCDgXgRLT3vc_hMA",
    "text": "I don’t need a single report to know that my neighbors all put up security cameras because catalytic converter theft has hit every neighborhood around me",
    "like_count": 4,
    "published_at": "2023-11-11T17:10:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx7Lxfp2XwNNwujZeh4AaABAg",
    "author": "@OG_Sneert0130",
    "author_channel_id": "UCxBTZO0o9GBaCT_kHmkSBlw",
    "text": "This thumbnail is an actual jump-scare.",
    "like_count": 1,
    "published_at": "2023-11-12T08:36:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzrmsZ0Hk6cBTChcgV4AaABAg",
    "author": "@jacobray7494",
    "author_channel_id": "UCW-c3mYTIyFBvqjZ9t0muGg",
    "text": "I love Sean points out there was a 47% increase and Emma goes that's a small increase. Like damn Emma, what do you consider to be a large increase then?",
    "like_count": 10,
    "published_at": "2023-11-11T18:46:22Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgzrmsZ0Hk6cBTChcgV4AaABAg.9wzYi1CmFp39wz_awswQo-",
        "author": "@somethingsomething8511",
        "text": "A 10 billion percent increase, everyone in the city of NYC would have to be killed for her to admit it was a large increase😂",
        "like_count": 0,
        "published_at": "2023-11-11T19:02:53Z",
        "is_reply": true
      },
      {
        "id": "UgzrmsZ0Hk6cBTChcgV4AaABAg.9wzYi1CmFp39wzgFFodIAP",
        "author": "@Laneous14",
        "text": "The same increase in Emma's hair dye budget I guess.  She needs to up it to 100% because she's getting that Taylor Lorenz look.  \nWTF hasn't Tim Pool fired her is beyond me.  Ian brings more to the table than that moron.",
        "like_count": 0,
        "published_at": "2023-11-11T20:00:57Z",
        "is_reply": true
      },
      {
        "id": "UgzrmsZ0Hk6cBTChcgV4AaABAg.9wzYi1CmFp39wzrR5PO624",
        "author": "@TheFredmac",
        "text": "​@somethingsomething8511even then it would not be a problem because it was localized to NYC.",
        "like_count": 0,
        "published_at": "2023-11-11T21:38:41Z",
        "is_reply": true
      },
      {
        "id": "UgzrmsZ0Hk6cBTChcgV4AaABAg.9wzYi1CmFp39x-1-ZEQ6f_",
        "author": "@Under_the_Iceberg",
        "text": "@TheFredmac If everyone in NYC was killed, it would certainly be due to an outside force and she'd blame that instead which really just exposes the way she thinks about these things; not a large enough increase to matter to her until it's big enough that it has to be due to outside factors, then she'll blame those instead.",
        "like_count": 0,
        "published_at": "2023-11-11T23:11:03Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzCaQU3HZAPnDkG-r14AaABAg",
    "author": "@sshoel",
    "author_channel_id": "UCScAwCUX3KZA8dr837NvgvA",
    "text": "A guy has a heart attack and pushes on the accelerator and causes a crash.. Government chalks it up as speed being a factor..",
    "like_count": 1,
    "published_at": "2023-11-11T21:40:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgznVdmRLvOl-kZiwI14AaABAg",
    "author": "@SockieTheSockPuppet",
    "author_channel_id": "UCLp_eTb1sMpxfuGYUXkDpcA",
    "text": "12:35 - I love how Sam has this slightly annoyed and defeated look on his face when the Surveys are mentioned.",
    "like_count": 3,
    "published_at": "2023-11-11T17:38:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwrzBbMntWV-pHh3dt4AaABAg",
    "author": "@mattmelton2561",
    "author_channel_id": "UCpzwoUmsFmyLRNlH1DStMZQ",
    "text": "Me when I see Lance from The Serfs: 🤢🤮🤬",
    "like_count": 2,
    "published_at": "2023-11-11T20:48:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwwt0W9bY2nT8tza2F4AaABAg",
    "author": "@reaccionapr",
    "author_channel_id": "UCXI_GBHh44KmiteTd-Y1i3w",
    "text": "13:47 homicide stats are down b/c of advances in medicine, not necessarily bc less people are getting shot.",
    "like_count": 7,
    "published_at": "2023-11-11T16:35:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxGvDZkSuY12l1evPJ4AaABAg",
    "author": "@justinjones5296",
    "author_channel_id": "UCXya3RjPRdP2hpj8yuBEiBA",
    "text": "Over 20 years ago I went into someone's garage and took a bag of golf clubs and a baseball sporting bag...I got charged with 18 felonies when they found me with the evidence because they charged me with all garage burglaries in the area so they could say the crime was solved...I pled guilty to 1 count of burglary (the 1 that I did) and got sued by 4 different people that got burgled by someone else because I was charged with the burglaries...I won all 4 lawsuits because the plantiffs didn't realize there was absolutely 0 evidence that I had anything to do with any of those burglaries....basically the police screwed over 15 different families to get their burglaries off of their books...",
    "like_count": 40,
    "published_at": "2023-11-11T19:00:16Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgxGvDZkSuY12l1evPJ4AaABAg.9wz_IqVwEGd9x0z4jdhENp",
        "author": "@thatlittlevoice6354",
        "text": "Can you believe that? They charged a fucking thief with fucking theft.",
        "like_count": 0,
        "published_at": "2023-11-12T17:24:01Z",
        "is_reply": true
      },
      {
        "id": "UgxGvDZkSuY12l1evPJ4AaABAg.9wz_IqVwEGd9x209VQE_ai",
        "author": "@fajile5109",
        "text": "😂😂😂",
        "like_count": 0,
        "published_at": "2023-11-13T03:01:23Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugx42vn0QPZTL-xlM2x4AaABAg",
    "author": "@DansterClatter",
    "author_channel_id": "UCetv4iiLGKU4B4gwLBMOUcw",
    "text": "It is easy to make crime look less when not reporting it",
    "like_count": 2,
    "published_at": "2023-11-11T19:47:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwjwdwW65wfdpyzD954AaABAg",
    "author": "@ShiftyKen08",
    "author_channel_id": "UCvXScmZYQF6i8gKZRqpUwUQ",
    "text": "This is why such things as context,\n and accuracy are so important. Anyone with a functioning brain and a lick of common sense can see the disparities and draw a conclusion that while crime is in the rise, crime reporting is in the decline. You explained this very well with clear and concise data.",
    "like_count": 5,
    "published_at": "2023-11-11T18:31:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwgX_MJHGQICEpUslB4AaABAg",
    "author": "@BearMcHoneypots",
    "author_channel_id": "UCsiOItWuEGfvZhf4skuEflA",
    "text": "@ 6:20 “FEWER* departments…” \n— “Less” is for non-integer amounts like “less water”, “less crime”\n— “Fewer” is for integer amounts like “fewer people”, “fewer planes”",
    "like_count": 1,
    "published_at": "2023-11-11T17:40:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzuSsqTi88m7Nk3T8h4AaABAg",
    "author": "@byzmack1334",
    "author_channel_id": "UCuxc3IQHc8VLnsmsoKan5hA",
    "text": "It's the same with inflation. They say its down but it's still up from where it should be.",
    "like_count": 3,
    "published_at": "2023-11-11T17:20:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyRtO-Gj6_r2DHuJPx4AaABAg",
    "author": "@ryancampbell2192",
    "author_channel_id": "UC1QUdzdTzivu80Pci6Syscg",
    "text": "As the saying goes - There are lies, damn lies & statistics.",
    "like_count": 1,
    "published_at": "2023-11-11T17:49:27Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwYROrXeINX4e2AImR4AaABAg",
    "author": "@skaterdudeabides",
    "author_channel_id": "UCvt-jORO4mqkrcA9_2RfH9A",
    "text": "They're playing this same game with inflation. \nTheir logic is inflation is decreasing, therefore prices are decreasing, but inflation is the positive rate of change in prices. When inflation decreases, it only means that prices are increasing at a slower rate than before. Deflation is when prices decrease, and we don't have deflation.",
    "like_count": 3,
    "published_at": "2023-11-11T18:30:34Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyP_UMhhYWv6VC3zFZ4AaABAg",
    "author": "@trev6664",
    "author_channel_id": "UCb08EOWWOiQuPOCVFVdqwdA",
    "text": "There are three kinds of lies.\n\nLies, damned lies, and statistics",
    "like_count": 0,
    "published_at": "2023-11-11T23:48:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy8s-3CYeceG3xiwZJ4AaABAg",
    "author": "@Rob-rx3jw",
    "author_channel_id": "UCwzeKZTR-tMNrwREZWcY-Eg",
    "text": "Sean, I appreciate you and like minded people who totally understand that the numbers are misconstrued.",
    "like_count": 8,
    "published_at": "2023-11-11T16:58:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzoAUyZU64OX5aV1dB4AaABAg",
    "author": "@killcat1971",
    "author_channel_id": "UC-tUVrUv7aMHQKe39PSv69g",
    "text": "TBF the rape numbers specifically are misleading because the PECEPTION of what IS rape has changed so much.",
    "like_count": 1,
    "published_at": "2023-11-11T23:13:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwcPLW7KdUWTtc0PXR4AaABAg",
    "author": "@radagast7200",
    "author_channel_id": "UCmWdOSEcflu28H6UGQzD2qg",
    "text": "Saying crime is down in NY is like saying that inflation  is down in the US.",
    "like_count": 6,
    "published_at": "2023-11-11T17:02:26Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgwcPLW7KdUWTtc0PXR4AaABAg.9wzMolbOicq9wzfp7M38qC",
        "author": "@Laneous14",
        "text": "It is!  See inflation was at 38%, but now it has gown DOWN to 37.5% therefore I am technically correct and inflation just had a massive drop!",
        "like_count": 1,
        "published_at": "2023-11-11T19:57:15Z",
        "is_reply": true
      },
      {
        "id": "UgwcPLW7KdUWTtc0PXR4AaABAg.9wzMolbOicq9wzi5fl_Wjn",
        "author": "@radagast7200",
        "text": "@Laneous14 the steep slope is less steep than it was after I made the slope incredibly steep!! Now clap, you stupid B*****ds.",
        "like_count": 0,
        "published_at": "2023-11-11T20:17:07Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzlkQfEJV2hzWdub514AaABAg",
    "author": "@RaccAttack77",
    "author_channel_id": "UCBwn90H8PIg_XAEHfJOrdug",
    "text": "Even if that one guy wasn’t intentionally misinterpreting the numbers, how in gods name does he think a 1% drop after a 30% jump is a good thing?",
    "like_count": 1,
    "published_at": "2023-11-19T04:33:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzEYKFtm4VV2VP17DF4AaABAg",
    "author": "@TheCentristChad",
    "author_channel_id": "UCCmF0anZJAzttCIGOIhRDrw",
    "text": "Sam will never change his mind. He convinced himself he’s always right because 20 years ago he predicted the Iraq war would be a mistake 😂",
    "like_count": 84,
    "published_at": "2023-11-11T16:18:00Z",
    "is_reply": false,
    "reply_count": 12,
    "replies": [
      {
        "id": "UgzEYKFtm4VV2VP17DF4AaABAg.9wzHjLWcslu9wzIJp4SyCH",
        "author": "@notallowedtobehonest2539",
        "text": "I bet you live in a nice town, far from any bwack ppl",
        "like_count": 5,
        "published_at": "2023-11-11T16:23:07Z",
        "is_reply": true
      },
      {
        "id": "UgzEYKFtm4VV2VP17DF4AaABAg.9wzHjLWcslu9wzIwpTcgIX",
        "author": "@visionforetold4568",
        "text": "That wouldn’t even be a prediction lol. 12 years ago the Iraq war had already been ongoing for about 8 years.",
        "like_count": 20,
        "published_at": "2023-11-11T16:28:35Z",
        "is_reply": true
      },
      {
        "id": "UgzEYKFtm4VV2VP17DF4AaABAg.9wzHjLWcslu9wzJwISX3sT",
        "author": "@JacksFuriousPaperclip",
        "text": "​@visionforetold4568Stop using linear time. That's racist or something.",
        "like_count": 25,
        "published_at": "2023-11-11T16:37:15Z",
        "is_reply": true
      },
      {
        "id": "UgzEYKFtm4VV2VP17DF4AaABAg.9wzHjLWcslu9wzLmVFK0hy",
        "author": "@TheCentristChad",
        "text": "@notallowedtobehonest2539 You're right. I don't think I've ever seen a bwack person in my town",
        "like_count": 18,
        "published_at": "2023-11-11T16:53:23Z",
        "is_reply": true
      },
      {
        "id": "UgzEYKFtm4VV2VP17DF4AaABAg.9wzHjLWcslu9wzPYdkohdK",
        "author": "@geek593",
        "text": "I don't think he believes he's always right. He's a sophist who will spread whatever narrative is convenient for him and his people.",
        "like_count": 5,
        "published_at": "2023-11-11T17:26:19Z",
        "is_reply": true
      },
      {
        "id": "UgzEYKFtm4VV2VP17DF4AaABAg.9wzHjLWcslu9wzPpRut0e1",
        "author": "@Formerericblair",
        "text": "Yes but back when he was arguing it was a mistake he was wrong given the facts at the time",
        "like_count": 4,
        "published_at": "2023-11-11T17:28:44Z",
        "is_reply": true
      },
      {
        "id": "UgzEYKFtm4VV2VP17DF4AaABAg.9wzHjLWcslu9wzSfeqrUKV",
        "author": "@TheCentristChad",
        "text": "@Formerericblair True, Leftists assume the military and Conservatives are inherently wrong. It's really biting them in the butt now with the Ukraine and Hamas wars 😂",
        "like_count": 0,
        "published_at": "2023-11-11T17:53:37Z",
        "is_reply": true
      },
      {
        "id": "UgzEYKFtm4VV2VP17DF4AaABAg.9wzHjLWcslu9wzTeGkwOVw",
        "author": "@notallowedtobehonest2539",
        "text": "@TheCentristChad exactwy as I expected",
        "like_count": 0,
        "published_at": "2023-11-11T18:02:10Z",
        "is_reply": true
      },
      {
        "id": "UgzEYKFtm4VV2VP17DF4AaABAg.9wzHjLWcslu9wzVFIO0Wi1",
        "author": "@DC-gh6dy",
        "text": "​@TheCentristChadlol",
        "like_count": 0,
        "published_at": "2023-11-11T18:16:06Z",
        "is_reply": true
      },
      {
        "id": "UgzEYKFtm4VV2VP17DF4AaABAg.9wzHjLWcslu9wzfduAD2Xa",
        "author": "@Laneous14",
        "text": "Sam and every other person who ever studied history or just watched a History Channel show.  What a genius.",
        "like_count": 1,
        "published_at": "2023-11-11T19:55:43Z",
        "is_reply": true
      },
      {
        "id": "UgzEYKFtm4VV2VP17DF4AaABAg.9wzHjLWcslu9wzj4DSDHyg",
        "author": "@kommisar.",
        "text": "I finally got around to watching the whole debate and was rather disappointed.  It was more an interview than a debate.  Same didn't even bother TRYING to rebut Sean's positions 95% of the time.  He would just play devil's advocate, and when Sean gave a good response Sam had no rebuttal.  It was very civil, don't get me wrong, and I guess I'm glad I can't say Sam was trying any bullshit like you see from the likes of his co-host (Emma) or The Serf, but he also didn't at all prove himself to be \"The Great Debater\" as he claims since he didn't even really debate.",
        "like_count": 1,
        "published_at": "2023-11-11T20:25:39Z",
        "is_reply": true
      },
      {
        "id": "UgzEYKFtm4VV2VP17DF4AaABAg.9wzHjLWcslu9x0SaRFYNYZ",
        "author": "@notallowedtobehonest2539",
        "text": "@KeithK410 people who value their life live near bwack ppl? Id argue the opposite",
        "like_count": 0,
        "published_at": "2023-11-12T12:31:23Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwS9LHT6IQe_qolawx4AaABAg",
    "author": "@WorldxTracer",
    "author_channel_id": "UCnlbwOH539wbo4OK3hnqYPw",
    "text": "This is why I hate the use of percentages regarding crime of any kind. It’s so disingenuous.",
    "like_count": 0,
    "published_at": "2023-11-11T21:38:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzuw1d8f6bhUFhohix4AaABAg",
    "author": "@TheMagnificentMongoSlade",
    "author_channel_id": "UCUe0eIPxg-VScg9hR8hwzpw",
    "text": "CompStat Data should be compiled for every city\n\nCity CompStat data compiled for the States\n\nState CompStat data compiled for the country \n\n\nAnd this should all be mandatory and treated like legal documents where they are certified under threat of perjury.",
    "like_count": 7,
    "published_at": "2023-11-11T16:46:16Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugzuw1d8f6bhUFhohix4AaABAg.9wzKyKEZnCZ9wzskv5HNoN",
        "author": "@cp1cupcake",
        "text": "LoL, imagine perjury being taken seriously in the US.\n\nI just wonder how much of that is just because the US needs a lot more judges to cover cases.",
        "like_count": 0,
        "published_at": "2023-11-11T21:50:16Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxNH5eEbpVoPBU9Lr14AaABAg",
    "author": "@DigitalNomadOnFIRE",
    "author_channel_id": "UCdL9bJ8M1nF7Sia5crL0LAg",
    "text": "Police districts where crime is down have an incentive to report.\nThose where it's up (doing a bad job) have an incentive not to report.",
    "like_count": 1,
    "published_at": "2023-11-12T14:43:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwA2jeUgi_xjRPwzG94AaABAg",
    "author": "@deadprivacy",
    "author_channel_id": "UC0bDlvCm4PzQ9fUWCzAIzhQ",
    "text": "Lance is something else.\nHis entire schtick os openly stating hes going to lie to himself to feel \"super safe\" so you can too.\nHes completely bonkers.",
    "like_count": 3,
    "published_at": "2023-11-12T09:56:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwLHAPlhs_ThhooMg94AaABAg",
    "author": "@bobross8569",
    "author_channel_id": "UCMrjzUWWUlvImeXKG5fg_IQ",
    "text": "\"Crime is down\",when you are no longer arresting or convicting people who are committing crime,yea statistically speaking crime is down.",
    "like_count": 1,
    "published_at": "2023-11-11T20:04:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzhzbt8zY8eCiytmE14AaABAg",
    "author": "@IXArcanine",
    "author_channel_id": "UCkEmMjSCy01Z9gmDTJ34Vsg",
    "text": "Sean, you always keep it real dude. You've become a must watch or listen to on podcast creator for me. You did great with those two debates the other day. I really appreciate how data driven you are. Keep up the great work. Also where are the goosebumps videos man I thought this was going to be a goosebumps channel after October thirteenth.",
    "like_count": 6,
    "published_at": "2023-11-11T16:56:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwNEiQDTazXrEdbkBJ4AaABAg",
    "author": "@theimmortal4718",
    "author_channel_id": "UCEigqxpMo7BJ3KCwi9ei9kA",
    "text": "They do the same thing with inflation and unemployment",
    "like_count": 2,
    "published_at": "2023-11-11T18:46:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzcCKExnUayltptMwB4AaABAg",
    "author": "@marohan",
    "author_channel_id": "UCtAgHAFkPqwOT5Pg1rETQxQ",
    "text": "I believe you shared that car theft has to be reported for insurance purposes, so that would be a good indicator of crime in particular areas",
    "like_count": 10,
    "published_at": "2023-11-11T16:52:35Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgzcCKExnUayltptMwB4AaABAg.9wzLg_1gDd89wzV_YySuRK",
        "author": "@TheTetsuHai",
        "text": "Just look where Insurance company's don't even cover anymore, because there are tons of places that just can't get insurance because of how bad it is.",
        "like_count": 3,
        "published_at": "2023-11-11T18:19:00Z",
        "is_reply": true
      },
      {
        "id": "UgzcCKExnUayltptMwB4AaABAg.9wzLg_1gDd89wzWZH353oz",
        "author": "@michaelsorensen7567",
        "text": "Only if car theft is a reliably consistent proxy, which it almost certainly won't work out to be.",
        "like_count": 0,
        "published_at": "2023-11-11T18:27:34Z",
        "is_reply": true
      },
      {
        "id": "UgzcCKExnUayltptMwB4AaABAg.9wzLg_1gDd89wzhfYf864d",
        "author": "@Br3ttM",
        "text": "You don't even need to use it as a proxy.  It's relatively common in some places, it seriously harms the victim, and many innocent people are injured or killed by the thieves driving incredibly fast down suburban streets.  The direct effects alone make it worth serious consideration.@michaelsorensen7567",
        "like_count": 0,
        "published_at": "2023-11-11T20:13:25Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxpsOBb5mFIiVrXlVN4AaABAg",
    "author": "@TheKlamminator",
    "author_channel_id": "UCzux1xcN21lKtcg0B6MxQqg",
    "text": "It's just bizarre why they even try to deny it",
    "like_count": 5,
    "published_at": "2023-11-11T16:10:21Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgxpsOBb5mFIiVrXlVN4AaABAg.9wzGrJEdZY69wzOz4iAOT0",
        "author": "@treborkroy5280",
        "text": "It isn't bizarre. To address crime objectively, pragmatically...theyvwould have to admit a truth they ideologically cannot. That black people are commiting crimes, and are victimizing others far more than the rhetoric that they themselves are being victimized by \"white racismszsz\" same as why they can't tackle immigration. They can't as white people tell brown people \"No.\" Even when it's violating laws.",
        "like_count": 0,
        "published_at": "2023-11-11T17:21:19Z",
        "is_reply": true
      },
      {
        "id": "UgxpsOBb5mFIiVrXlVN4AaABAg.9wzGrJEdZY69wzVZLau33_",
        "author": "@stanhunt8543",
        "text": "They're ego maniac sycophants hell bent on party power. These people have flawed mental states that are not in line with reality yet their lack of self awareness will not permit them to see it.",
        "like_count": 0,
        "published_at": "2023-11-11T18:18:50Z",
        "is_reply": true
      },
      {
        "id": "UgxpsOBb5mFIiVrXlVN4AaABAg.9wzGrJEdZY69wz_RUngILa",
        "author": "@oblivionsa7973",
        "text": "Because they don't care how many innocent people they need to sacrifice on the altar of their ideology.",
        "like_count": 4,
        "published_at": "2023-11-11T19:01:27Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw3kfXoJcwm67CqgP14AaABAg",
    "author": "@Memorywholed",
    "author_channel_id": "UCRu6rXPYD5DLZA0XdJAtzqw",
    "text": "\"I'm going to make you feel super safe. Crime increased by 30%, but it also decreased by 1%\"\nThanks Serfs, I totally feel safer by a 29% increase as opposed to a 30% increase.",
    "like_count": 2,
    "published_at": "2023-11-13T13:23:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyuh7jfmZwPXRMJTN14AaABAg",
    "author": "@foolish.intellectual9967",
    "author_channel_id": "UCFS_GcRAUpVdrMCUtBIpbCA",
    "text": "Thank you Sean I like the videos covering slightly more broad topics the local news stories are great as well they clearly demonstrate a larger pattern but I’ve been waiting for a video like this",
    "like_count": 5,
    "published_at": "2023-11-11T16:09:38Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxIfflU-WUBWyoyo854AaABAg",
    "author": "@Whatever4690",
    "author_channel_id": "UCQ_JF6H-wvN9VU1u26rzeLg",
    "text": "I suspect alot more crimes aren't being reported.",
    "like_count": 1,
    "published_at": "2023-11-15T21:51:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzJUzUiEGMEPK86yuN4AaABAg",
    "author": "@Ryo7_7",
    "author_channel_id": "UCo1esNIAWU0lCZtxFofd-NA",
    "text": "Good job on the debates.",
    "like_count": 5,
    "published_at": "2023-11-11T16:28:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgywZxfON8lm0qDz2md4AaABAg",
    "author": "@Distrusted_Citizen",
    "author_channel_id": "UC6Wg6W0lSc89O6xsRu64XEw",
    "text": "Good video decoding the malpractices of departments to not report, skewing the data in the initial reporting period.",
    "like_count": 0,
    "published_at": "2023-11-13T20:21:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwUoSe1vYqJoy53ZXZ4AaABAg",
    "author": "@GeneRic01",
    "author_channel_id": "UCF9M_Uu8BkBRgWom5f747lg",
    "text": "The anti Asian spike. Did you know that in many US jurisdictions  in 2020, orders  were given to check over police databases and see whether any previous crimes could be recategorised as anti-Asian? \nMore generally, many databases  had an extra anti-Asian tag _added_ to the system as a unique category, aside from the catchall HC definition.\nSo how much of that 2020 spike 'based upon actual statistics' really was part of a sudden increase and how much was 'suddenly choosing to notice'?\nMy belief is that most of those crimes _were happening all along_ and  have been growing for years, but it simply wasn't politic to notice until Trump said the magic word:\n \"Chy-nah\".",
    "like_count": 4,
    "published_at": "2023-11-11T18:04:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyfZyqW6FrkGvQU1gt4AaABAg",
    "author": "@economath8164",
    "author_channel_id": "UCe1jJ4gaLP-KG_OOQTad0hQ",
    "text": "AJW: \"...less...\"\nStannis: FEWER.",
    "like_count": 0,
    "published_at": "2023-11-11T18:52:26Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwi8HuJZbjvaZqobS94AaABAg",
    "author": "@theburntbanana9875",
    "author_channel_id": "UCAQZa7J0_0mO0_eG7wXEsiw",
    "text": "Good job homie",
    "like_count": 3,
    "published_at": "2023-11-11T16:12:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyjwyH2-KigYDoPsC54AaABAg",
    "author": "@Willchannel90",
    "author_channel_id": "UCbzlMmBnoMQOTkiA4GuvZBg",
    "text": "They made an oops for hiring psychopaths and sociopaths.",
    "like_count": 0,
    "published_at": "2023-11-11T22:31:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxiT0bChyDh9qcIGn54AaABAg",
    "author": "@reecedrystek2992",
    "author_channel_id": "UC5IBWBsGq3gVzvw-A-iuB9g",
    "text": "I would love to be Lance's financial advisor. Lance you are going to give me 30 dollars now, and then I'm going to give you a dollar in a year. See Lance this is how you get rich because you made a dollar.",
    "like_count": 4,
    "published_at": "2023-11-11T18:03:00Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgxiT0bChyDh9qcIGn54AaABAg.9wzTkOkj9sA9wzXI7dgzC2",
        "author": "@michaelsorensen7567",
        "text": "Except he was citing percentages. More accurate would be \"give me 30% of your income, and at the end of the year I'll give you 1% of what I made off it\"",
        "like_count": 0,
        "published_at": "2023-11-11T18:33:58Z",
        "is_reply": true
      },
      {
        "id": "UgxiT0bChyDh9qcIGn54AaABAg.9wzTkOkj9sA9wzn3MUOMVE",
        "author": "@3namechangezalowdevry90day7",
        "text": "If it's a dollar a year for life, that's called an annuity!",
        "like_count": 0,
        "published_at": "2023-11-11T21:00:29Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyWkBubfS05CauuHn94AaABAg",
    "author": "@ZyloxDragon1",
    "author_channel_id": "UCucJPgFM2DhQbIfNSUPzbPQ",
    "text": "It's like how self deletions and accidents get lumped into the stats for gun violence. It massively inflates the number.",
    "like_count": 51,
    "published_at": "2023-11-11T17:44:14Z",
    "is_reply": false,
    "reply_count": 7,
    "replies": [
      {
        "id": "UgyWkBubfS05CauuHn94AaABAg.9wzRavC0GU99x-mgMIhVlM",
        "author": "@GeneRic01",
        "text": "And how gangbangers aged 19y 364d suddenly became 'children ' along with robbers shot by cops and suicides by 19 yr olds to make \"gun violence the #1 cause of childhood death in the USA\".\n A colossal lie that ran in newspapers around the world.",
        "like_count": 0,
        "published_at": "2023-11-12T06:16:27Z",
        "is_reply": true
      },
      {
        "id": "UgyWkBubfS05CauuHn94AaABAg.9wzRavC0GU99x2nyUW-fA0",
        "author": "@chreg89",
        "text": "Is self deletion a crime? If not. Why is it in the crime statistic?",
        "like_count": 2,
        "published_at": "2023-11-13T10:25:24Z",
        "is_reply": true
      },
      {
        "id": "UgyWkBubfS05CauuHn94AaABAg.9wzRavC0GU99x5cLAi-V9R",
        "author": "@harpiessnow",
        "text": "​@chreg89It's only a crime to the government because they miss out on your sweet sweet tax payer dollars when you self delete.",
        "like_count": 3,
        "published_at": "2023-11-14T12:41:29Z",
        "is_reply": true
      },
      {
        "id": "UgyWkBubfS05CauuHn94AaABAg.9wzRavC0GU99x8BPFhBKJC",
        "author": "@lorebanjo8516",
        "text": "​@chreg89 it's not added to \"crime\" numbers, it's added to \"gun violence\" or \"gun deaths\" numbers",
        "like_count": 7,
        "published_at": "2023-11-15T12:35:06Z",
        "is_reply": true
      },
      {
        "id": "UgyWkBubfS05CauuHn94AaABAg.9wzRavC0GU99xBNy-DwMjH",
        "author": "@Hailtothebreak",
        "text": "​@harpiessnowthat is almost a plot line from the game The Outer Worlds where alt+f4 is a crime because you are damaging company property.",
        "like_count": 3,
        "published_at": "2023-11-16T18:22:34Z",
        "is_reply": true
      },
      {
        "id": "UgyWkBubfS05CauuHn94AaABAg.9wzRavC0GU99xia7fkZRKT",
        "author": "@emberfist8347",
        "text": "@chreg89 It's only a crime so police and respond and stop you.",
        "like_count": 0,
        "published_at": "2023-11-30T01:11:47Z",
        "is_reply": true
      },
      {
        "id": "UgyWkBubfS05CauuHn94AaABAg.9wzRavC0GU99xiaAmV14Df",
        "author": "@emberfist8347",
        "text": "Or they pull a Micheal Moore and add officer involved shootings as well.",
        "like_count": 0,
        "published_at": "2023-11-30T01:12:13Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwgKZg2KDPhqVzPmVJ4AaABAg",
    "author": "@mikeslemonade",
    "author_channel_id": "UClRc2TZswswWNkWBpxLAXoQ",
    "text": "Just living in San Francisco from 2020 to 2023 you knew crime went up and because of why.",
    "like_count": 1,
    "published_at": "2023-11-17T18:34:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxoDu8jrsSG8loV5nd4AaABAg",
    "author": "@feipo4699",
    "author_channel_id": "UC2hg_z8S5C7fT8sBVoud6gg",
    "text": "hey bro, you had an actblue AD right before your video! lol",
    "like_count": 2,
    "published_at": "2023-11-11T16:15:18Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxoDu8jrsSG8loV5nd4AaABAg.9wzHQYd5zlW9wzIe8oClcP",
        "author": "@mariawhite7337",
        "text": "He doesn't control the ads. YouTube does.",
        "like_count": 0,
        "published_at": "2023-11-11T16:26:02Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyWSD49BwLExHXNuhB4AaABAg",
    "author": "@SkylarWaska",
    "author_channel_id": "UCmOKK5CD6Luhd5-uGG-VkKw",
    "text": "In other words, its like a pool being 1/4 filled, then it gets filled up to full the next year. Then 1 cup of water is removed the next year. Viola!! The pool water is down guys!",
    "like_count": 1,
    "published_at": "2023-11-12T03:22:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyfJ1637iDhYCNYQF54AaABAg",
    "author": "@mikeg8447",
    "author_channel_id": "UCufOj4bkcXetDvbCRWU90Ng",
    "text": "commenting to feed the algorithm",
    "like_count": 4,
    "published_at": "2023-11-11T16:05:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy-8Vx_vkvEoqDy9Ah4AaABAg",
    "author": "@santinomunguia3138",
    "author_channel_id": "UCi7-TBqDvslG3strchj2c7Q",
    "text": "Their are three types of lies: lies, damned lies, and statistics\n-Mark Twain",
    "like_count": 0,
    "published_at": "2023-11-19T23:44:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxsOME3u6NO87LFpnx4AaABAg",
    "author": "@xy1101",
    "author_channel_id": "UCPKd6Z2gn-qvyrCwwY1pDgw",
    "text": "It was me.  I did allll the crime.  PS sorry.",
    "like_count": 5,
    "published_at": "2023-11-11T16:09:07Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxsOME3u6NO87LFpnx4AaABAg.9wzGiDN5hDL9wzHeqJr2Sr",
        "author": "@ShinFahima",
        "text": "You're not sorry. >:(\nSaying that is just what gets the DA to let you out the next day!",
        "like_count": 2,
        "published_at": "2023-11-11T16:17:23Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyBnnDgy6zOtIX6iml4AaABAg",
    "author": "@OJsLeftGlove",
    "author_channel_id": "UCi3-0wQNgw8xEwyNEo3Hrsg",
    "text": "They have to lie to themselves.\n\nOtherwise, they'd have to admit that the lies they bought into did nothing but damage...",
    "like_count": 1,
    "published_at": "2023-11-13T13:48:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxVgGaA_nQWb3sAnep4AaABAg",
    "author": "@memosanchez8916",
    "author_channel_id": "UCr9anGPv6rSpVyFNHKGQTyw",
    "text": "Colin Flaherty faced the same problem in debates the left would deny or skew numbers in their favor when they debated him all the time",
    "like_count": 20,
    "published_at": "2023-11-11T16:23:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgygO8M4KTGiyTxhTbl4AaABAg",
    "author": "@DeepWebDiary",
    "author_channel_id": "UCoFTjfz03fTEUM521aFVpOQ",
    "text": "Redrum goes down the most when the person doing the redrum has been redrumed.",
    "like_count": 1,
    "published_at": "2023-11-11T17:11:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxhGl1juko5MZYOPj54AaABAg",
    "author": "@HostileTakeover555",
    "author_channel_id": "UCbzvVbJbdD8zTefsCcDPBPw",
    "text": "We really should create a mandatory database by law. This is something we should definitely be tracking.",
    "like_count": 12,
    "published_at": "2023-11-11T16:19:57Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgxhGl1juko5MZYOPj54AaABAg.9wzHx_mL9J09wzOV2piP3C",
        "author": "@Jaslath",
        "text": "It still would require the crimes to be input into the database.  For example, the Sutherland Springs shooter wouldn't not have been able to buy firearms if the Air Force had properly reported his domestic abuse record like they were supposed to.",
        "like_count": 5,
        "published_at": "2023-11-11T17:17:05Z",
        "is_reply": true
      },
      {
        "id": "UgxhGl1juko5MZYOPj54AaABAg.9wzHx_mL9J09wzWdO8L5_c",
        "author": "@HexKitty",
        "text": "The US has that, it's run by our unbiased objective fellow travelers in the DoJ. I'll let you guess how accurate it is....",
        "like_count": 0,
        "published_at": "2023-11-11T18:28:16Z",
        "is_reply": true
      },
      {
        "id": "UgxhGl1juko5MZYOPj54AaABAg.9wzHx_mL9J09wzYo4ofaUz",
        "author": "@oblivionsa7973",
        "text": "@HexKitty The saddest part is that it's 130% accurate for Trump's term but 57% accurate for Biden's. At least if it was just poorly reported you could work with that, but the accuracy is entirely based on politics. How can you trust a system that intentionally lies to you, especially when it puts you at risk?",
        "like_count": 1,
        "published_at": "2023-11-11T18:47:12Z",
        "is_reply": true
      },
      {
        "id": "UgxhGl1juko5MZYOPj54AaABAg.9wzHx_mL9J09x-_6-xuowN",
        "author": "@burmy1552",
        "text": "@oblivionsa7973 Explain \"130% accurate\".  Cite sources.",
        "like_count": 0,
        "published_at": "2023-11-12T04:17:46Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwammDpdlUJEVw8ZrN4AaABAg",
    "author": "@oldgysgt",
    "author_channel_id": "UCU_UMgau_Bm08fnZVkJW7IQ",
    "text": "Figures don't lie, but liars figure.",
    "like_count": 0,
    "published_at": "2023-11-12T19:52:33Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyVNR_mzpBPbnLtmeh4AaABAg",
    "author": "@master2uall88",
    "author_channel_id": "UCpW8-EE10XMw4NslXIzKJsg",
    "text": "It's actually manipulated for real? As a certified conspiracy theorist we already fucking knew this because we said this years and years and years ago I'll give you one for free enjoy your Black Flag Friday for the flag event",
    "like_count": 2,
    "published_at": "2023-11-11T16:11:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzldl8Q-XluvpYBF1x4AaABAg",
    "author": "@evanabbott2737",
    "author_channel_id": "UCf3Rj1lCbX_jo7P9SvMRt0w",
    "text": "Manipulating crime stats sounds like something that SHOULD land you in prison for.  The truth should be protected.🤔",
    "like_count": 0,
    "published_at": "2023-11-15T19:50:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzg6PfDslwg_M8ix5J4AaABAg",
    "author": "@windblownleaf6450",
    "author_channel_id": "UCuZYoOTtVj7y60YhE_s4NiA",
    "text": "Yep. And most apologists know this, but don't care. They keep peddling their nonsense because winning arguments online is more important than actually making a difference.",
    "like_count": 5,
    "published_at": "2023-11-11T16:59:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxfz7fhcxl3FpD-oFB4AaABAg",
    "author": "@ericorange2654",
    "author_channel_id": "UC7FBWAB-7g0XEnYo2XHhSbw",
    "text": "That thumbnail really is a collection of bugger eaters",
    "like_count": 1,
    "published_at": "2023-11-11T21:29:33Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyBWXaZjDRvVRnx1MN4AaABAg",
    "author": "@6eightss",
    "author_channel_id": "UC2HGFppWbqB2ojYDBAZd-RQ",
    "text": "Crime stats drop when you decrease the actions considered a crime.",
    "like_count": 0,
    "published_at": "2023-11-11T22:20:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyuN2syIN7JDFzQQId4AaABAg",
    "author": "@timsexton",
    "author_channel_id": "UCUfIkH0fFzAg9YoYqZS0tdw",
    "text": "Sean, please instantly habituate and rehabilitate yourself about whether your script might sound better if the word *_less_* can be substituted with the word *_fewer._* I promise, I'm not a full time grammar nazi (actually, I'm only part-time), but I want to see you do better and sound more professional.\n*_TRUST !!_*",
    "like_count": 5,
    "published_at": "2023-11-11T16:32:18Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgyuN2syIN7JDFzQQId4AaABAg.9wzJN2uN10y9wzKEOikYpn",
        "author": "@PapaTanGh0stNI9htM4R3S0nMaInSt",
        "text": "It's touyube save grammar for the penpals and granny.",
        "like_count": 0,
        "published_at": "2023-11-11T16:39:51Z",
        "is_reply": true
      },
      {
        "id": "UgyuN2syIN7JDFzQQId4AaABAg.9wzJN2uN10y9wzTRJzVsIm",
        "author": "@TooLegit_ToQuit",
        "text": "So I'm not alone in that pet peeve 😂",
        "like_count": 0,
        "published_at": "2023-11-11T18:00:16Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwxsB0uFilvcpKMFqp4AaABAg",
    "author": "@smudge7057",
    "author_channel_id": "UC60wNw9KsbHkpnFkblBOr8A",
    "text": "Why do they do this? Why do they want rampant crime? Why do they empathize with criminals over the victims?",
    "like_count": 1,
    "published_at": "2023-11-15T20:58:25Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwxsB0uFilvcpKMFqp4AaABAg.9x95-d-dJP99xE4T_erN0P",
        "author": "@FlipWilson-k1h",
        "text": "Communists use criminals as a tool of destabilization. They want them causing as much chaos as possible",
        "like_count": 1,
        "published_at": "2023-11-17T19:29:58Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyLf2V70B2zgnZIHUV4AaABAg",
    "author": "@MrJohnnymarlboro",
    "author_channel_id": "UCl5sUoYuNAd5MMu04-V_EAg",
    "text": "I live in Flint MI...... whenever there isn't a body on the front page I know they omitted it",
    "like_count": 0,
    "published_at": "2023-11-11T19:41:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwx6_FwlvYidx-_RGt4AaABAg",
    "author": "@Ewil.Bluetooth",
    "author_channel_id": "UCUNikts8wt2VME1SdlErojg",
    "text": "I'm shocked!\nWell not that shocked...",
    "like_count": 0,
    "published_at": "2023-11-11T18:02:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgylLqtqXjcxmwO65XB4AaABAg",
    "author": "@simplegarak",
    "author_channel_id": "UC9Hv68TRt7y0iSZVWFqsoxw",
    "text": "Whoa. I remember when i studied criminology back in college the discussion about these reports and their stats. I have never seen a divergence this great in my life. Thanks for the nightmares, Sean.",
    "like_count": 0,
    "published_at": "2023-11-19T15:18:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyr9cUDom3sr3vQsHh4AaABAg",
    "author": "@whollymindless",
    "author_channel_id": "UCVa3WxX2WBzopxrPJbR0M8g",
    "text": "This math makes sense if you accept that math is racist. Even I can't make a jump that stupid.",
    "like_count": 1,
    "published_at": "2023-11-12T03:03:31Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyKFIIviYhj7opXq4B4AaABAg",
    "author": "@TheFredmac",
    "author_channel_id": "UCOmB_XXaPWuMH2HuCZxSDkQ",
    "text": "Not long ago a majority of crime was concentrated in a dozen or so counties. I would like to know if that has changed.",
    "like_count": 0,
    "published_at": "2023-11-11T22:02:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz18fc0SD9_9x9msxJ4AaABAg",
    "author": "@betornween",
    "author_channel_id": "UCKVjReywcMFk0mh_4MEM5kQ",
    "text": "Figures don't lie but liars can figure.\nIf you don't think you are being manipulated, you already were.",
    "like_count": 0,
    "published_at": "2023-12-30T21:27:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzq80OQ_Cg2IpOqxjh4AaABAg",
    "author": "@WarriorNoldor",
    "author_channel_id": "UC0QuqpLBJYFRpv4IVzV9vAA",
    "text": "Why am I not surprised.",
    "like_count": 0,
    "published_at": "2023-11-11T18:29:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxI8O7stZsreKC8U3Z4AaABAg",
    "author": "@humangrowthhormone4576",
    "author_channel_id": "UCjgNt0IEgR-qC7FaPvtTw2Q",
    "text": "You don’t need data or someone telling you crime is up when you witness it either first hand or through video.",
    "like_count": 0,
    "published_at": "2023-11-12T00:06:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzfCAQ-VO5x_chiCIN4AaABAg",
    "author": "@fefnireindraer144",
    "author_channel_id": "UCy4ZP_2sD2wjh6cdZdNmmzA",
    "text": "LA not sharing their data should be a crime.",
    "like_count": 0,
    "published_at": "2023-11-11T19:18:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz-IY-g5ODZ_B7Wfkh4AaABAg",
    "author": "@humbertocobian4740",
    "author_channel_id": "UCDrvgeq3mBFDBBAxGG-KTDQ",
    "text": "Bro never give up never back down! Keep talking about this isht its gonna wake ppl up !",
    "like_count": 0,
    "published_at": "2023-11-11T20:28:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz1B0N-w6ng5M_-BiN4AaABAg",
    "author": "@Edaloy27",
    "author_channel_id": "UCy06UqdH8i5S6f5vB8mywHA",
    "text": "20 year old gangbangers are considered children somehow",
    "like_count": 1,
    "published_at": "2023-11-17T02:15:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw69Gp_ecV6yGYxBoJ4AaABAg",
    "author": "@tigerburn81",
    "author_channel_id": "UCmlHrKFGrl07OMiVBYWde9g",
    "text": "I want to watch 27 episodes of Calculon do his taxes.",
    "like_count": 1,
    "published_at": "2023-11-11T16:22:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwZTwC2Yl025kQG3vd4AaABAg",
    "author": "@tomsetberg4746",
    "author_channel_id": "UCKlwk1tbqdwktkFdJhhuKEg",
    "text": "One technical point to note, you don't need to say anyone on the left who doesn't want to tell the truth, you can just say anyone on the left as none of them want to tell the truth.",
    "like_count": 0,
    "published_at": "2023-11-11T23:33:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy4mEpuVx22YQXMOgp4AaABAg",
    "author": "@trailertrish2587",
    "author_channel_id": "UC6RHNRWOJlHOtHI82XTGkbw",
    "text": "All the newspeak in the world won't prevent you being victimized.",
    "like_count": 0,
    "published_at": "2023-11-16T05:34:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwDCefj6KDZ_fWkdvF4AaABAg",
    "author": "@manty5",
    "author_channel_id": "UCi8yxS3tNJOKgLFrBvCGTlA",
    "text": "A note in a possible problem in victimization surveys:  With the massive increase in tent cities, how would they send surveys to the \"residents\"?\n\nAlthough given the festering crime craphole that tent cities are, this likely results in the survey under-rating crime.",
    "like_count": 1,
    "published_at": "2023-11-12T04:11:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzIIQOr-sFoV3HMWg54AaABAg",
    "author": "@YedolfSacrosanctAvantgarde",
    "author_channel_id": "UCH2T_R5Y0w1xPUrUkoLyJNA",
    "text": "Even the fact checking is manipulated.",
    "like_count": 0,
    "published_at": "2023-11-11T23:37:34Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwKeCVZnGbtNyXKUKt4AaABAg",
    "author": "@cc_tw",
    "author_channel_id": "UC0KDNV25RbgEbx3aclSdGmw",
    "text": "If it's not reported, it doesn't exist!",
    "like_count": 1,
    "published_at": "2023-11-11T17:49:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxOMdKhDq6WcuQ1_zR4AaABAg",
    "author": "@dragunov815",
    "author_channel_id": "UC8acpO2nKFwRPCqjzJ5QzaQ",
    "text": "The Gold Standard!",
    "like_count": 0,
    "published_at": "2023-11-11T21:04:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw2pM6EvxH9lMRNVaV4AaABAg",
    "author": "@ChromaToneMusic",
    "author_channel_id": "UCFHR0s1iHUCym9EBTxI_Cog",
    "text": "I feel super safe, thanx lance!",
    "like_count": 0,
    "published_at": "2023-11-11T21:00:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxqRc65_acM3DkBLHZ4AaABAg",
    "author": "@DanFeske",
    "author_channel_id": "UChsBSd50gcszCSRB6GT1QFA",
    "text": "Lies, Damned Lies, & Statistics",
    "like_count": 0,
    "published_at": "2023-11-13T18:37:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz3as9Wpy8FdycNwEV4AaABAg",
    "author": "@crimsonking440",
    "author_channel_id": "UClhbuXn3wzzWh1tEn75svnA",
    "text": "Im constantly fucking baffled that people take a look at that face and go \"Yeah, Sam looks like he knows his stuff. I should listen to him\".",
    "like_count": 0,
    "published_at": "2023-11-11T17:36:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzkyX2XVd4fnTvTkzp4AaABAg",
    "author": "@Neighbor618",
    "author_channel_id": "UCBZxnnpLRdVz8W6ab6YUzMw",
    "text": "\"The party told you to reject the evidence of your eyes and ears. It was their final and most essential command.\" ~ George Orwell 1984",
    "like_count": 0,
    "published_at": "2023-11-13T02:32:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgziB8RUmUqlAyRiOMp4AaABAg",
    "author": "@adorablydeplorable7580",
    "author_channel_id": "UCTtjM9KlBenJRUXzckSLMAw",
    "text": "Unless you need a police report for insurance reasons there is no way I’m wasting my time waiting for the police. Not only do they not bother with non serious crimes, but the judge and prosecutors will never even let it get to trial.",
    "like_count": 0,
    "published_at": "2023-11-11T22:54:36Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzphu2eGZLTEEj9tQR4AaABAg",
    "author": "@RONNIEJNZN",
    "author_channel_id": "UCjoEQdZ0gEoduNyeDgU5QgQ",
    "text": "Shocked Pakman didn't make the thumbnail.",
    "like_count": 0,
    "published_at": "2023-11-13T01:59:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxXn8LzxbFv1YXPyDp4AaABAg",
    "author": "@josephs1728",
    "author_channel_id": "UCoEkBJvCKcfIsxIQ-klSQrw",
    "text": "It would be cool to have a series explaining the different surveys and data bases and how they are made/collected.",
    "like_count": 0,
    "published_at": "2023-11-11T23:20:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwfug1_bFTZCKD7buh4AaABAg",
    "author": "@ZoruaZorroark",
    "author_channel_id": "UCQ3uD4IB4D540N12PYJ4YcA",
    "text": "it's getting gnarly with the amount of crime in my are from gangs moving in and also from the amount of homeless moving into the city, this is my states capitol with it not being a major city. i want to move out to somewhere better, but due to my income being too low as well as me being taxed to heck.",
    "like_count": 0,
    "published_at": "2023-11-11T20:26:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgysReVLZujZ53C9cBt4AaABAg",
    "author": "@71Z28",
    "author_channel_id": "UCT6IIArKyvbHaXCOMR7LxCA",
    "text": "Years ago, customer of mine at a gun shop I used to own, was a retired SFPD Lt., and we would talk about how bad San Francisco had gotten(its even worse now). He explained how the Mayor would gently persuade the PD to soften the yearly crime statistics, so as not to disrupt tourism. Assaults would be reclassified as mutual combat, sexual assault to battery, etc.",
    "like_count": 2,
    "published_at": "2023-11-11T18:07:44Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgysReVLZujZ53C9cBt4AaABAg.9wzUI33Ahf39x-_M1VCemG",
        "author": "@burmy1552",
        "text": "Mutual combat...🤣.  I wonder how many police confrontations were classified as \"mutual combat\"?",
        "like_count": 0,
        "published_at": "2023-11-12T04:19:57Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugz87kZj4_LN2n_jkdB4AaABAg",
    "author": "@willh4340",
    "author_channel_id": "UCYWf70rXM_owooOzNVz93iw",
    "text": "There are 3 types of lies:\n1. Lies\n2. Damned lies and\n3. Statistics",
    "like_count": 0,
    "published_at": "2023-11-11T19:35:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzyQIhjk_N85VESdjt4AaABAg",
    "author": "@michaelz3666",
    "author_channel_id": "UCQP3AsH3ZMTy06bjaD_vCvw",
    "text": "I would like 27 more videos explaining all of this",
    "like_count": 0,
    "published_at": "2023-11-12T15:36:35Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxzBbqyvb65pJlQs2l4AaABAg",
    "author": "@s3.14dervision",
    "author_channel_id": "UC8mZ59YaCk0wMAi-NZUDj_A",
    "text": "A little bump? That's nearly double, sweetie! Gurl math....😢",
    "like_count": 0,
    "published_at": "2023-11-11T19:51:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy86ET9Aityn5Fcvv94AaABAg",
    "author": "@Darthdoodoo",
    "author_channel_id": "UCZPoZUh7OtRLy0ngsyePL9A",
    "text": "These idiots would say your a bad guy if u defended yourself with a bigger knife than the bad guy. Nothing they say is legit",
    "like_count": 0,
    "published_at": "2023-11-12T00:05:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzYv7_vPdut6izEPyl4AaABAg",
    "author": "@olaftheblack4543",
    "author_channel_id": "UC1Gz0JXbdPt8WtvAiGBIJOQ",
    "text": "They do the same with inflation numbers.",
    "like_count": 0,
    "published_at": "2023-11-12T16:00:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyOTShRHKqriK1OsWR4AaABAg",
    "author": "@bddaawwgg",
    "author_channel_id": "UCFsnEnXsxF_zFm0X3HB8Bow",
    "text": "Do we have access to the raw data sets and the methodology for data analysis? I'm looking for how they impute missing data, detect and treat outliers, and what statistical analysis they perform specifically.",
    "like_count": 0,
    "published_at": "2023-11-16T14:20:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyzjWbUSRRvu2Bi77p4AaABAg",
    "author": "@VolvoImpala",
    "author_channel_id": "UC40k6a01y9XuinvzIsuYV4Q",
    "text": "Excellent information- this is diabolical.",
    "like_count": 0,
    "published_at": "2023-11-13T04:17:38Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxhRW3w5_E5lWbqT1x4AaABAg",
    "author": "@foxboi6309",
    "author_channel_id": "UCxKam3icrgWIZDL579AWPVQ",
    "text": "I see Lance in the thumbnail, I gotta see this 😂",
    "like_count": 0,
    "published_at": "2023-11-11T17:54:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxlwQukmVIUx4QoB1t4AaABAg",
    "author": "@kingjonathan7773",
    "author_channel_id": "UCb7IxYl6b1WaLFzr4IRS2Ww",
    "text": "As a statistics teacher, I can tell you that you can make numbers say whatever you want.",
    "like_count": 0,
    "published_at": "2023-11-12T13:12:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugys4Zbq_hHBWW3JdMl4AaABAg",
    "author": "@whaddup691",
    "author_channel_id": "UCDa00QRX2ssdQXndV9f0v-A",
    "text": "27? Nah I need 28, king",
    "like_count": 0,
    "published_at": "2023-11-12T02:11:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgztpHfbAVWvwAPXsG54AaABAg",
    "author": "@josueveguilla9069",
    "author_channel_id": "UC8lrt2S0ziI1MhjCifBNMxw",
    "text": "Are we really surprised? HELL TO THE NO!",
    "like_count": 0,
    "published_at": "2023-11-11T16:32:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzpBwJj3pMFaUmyMF14AaABAg",
    "author": "@johnp9402",
    "author_channel_id": "UC_pGu5tTQc66NTxckJV4NgQ",
    "text": "Lol this coming from a Canadian where the worst thing that happens is maple syrup theft",
    "like_count": 0,
    "published_at": "2023-11-11T17:14:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyyn200M3HdJnqvj4p4AaABAg",
    "author": "@nomandatoryvaxing7433",
    "author_channel_id": "UCSLNipDkOZRjs6qxOcWJAdg",
    "text": "Isn’t it wild that these people are so invested in not being wrong that they literally double down on known lies? That’s like the epitome of an echo chamber “ends justify the means” psychopath mentality.",
    "like_count": 1,
    "published_at": "2023-11-11T17:55:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxnbxGHcyM7vgTu4FR4AaABAg",
    "author": "@sancofasmoov5739",
    "author_channel_id": "UCN-ncbj1hpfL9IsgtVVh4pA",
    "text": "I wouldn't put to much stock in to the NCVS. They only ask around 240k people a year about their experience with crime. The FBI and federal government for sure needs to do more to force every law enforcement agency to report their stats",
    "like_count": 1,
    "published_at": "2023-11-12T17:48:20Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxFinxDPLwJGD4q1JB4AaABAg",
    "author": "@EphemeralWealth",
    "author_channel_id": "UCBKB4lSi8pY7yFRFuNmq_Uw",
    "text": "Crime has gone down so much that governor newsome introduced legislation to combat the rampant crime.",
    "like_count": 0,
    "published_at": "2024-08-25T15:04:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxbgXh7_GQaSUh6gu94AaABAg",
    "author": "@jack-q8y8b",
    "author_channel_id": "UCzpJqJEZNeWRQdA9NogitqQ",
    "text": "I don't know how anyone could intuitively accept that crime as a reality has gone down based on all that's gone on nationally. States and cities decriminalizing drugs and theft? the massive increase of homeless encampments? and just the general feeling of urban decay? It really is pissing on someone's leg and telling them it's raining.",
    "like_count": 0,
    "published_at": "2023-11-12T15:37:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwe1vQR8XX7r7mKbXt4AaABAg",
    "author": "@phann860",
    "author_channel_id": "UCRia03F4f7KAD8pyWmJBLRw",
    "text": "So does that mean if you downgrade a couple of murders as a DA then a murder becomes manslaughter or something less?",
    "like_count": 0,
    "published_at": "2023-11-12T13:54:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyI1c8ZLXPadWlF-Ad4AaABAg",
    "author": "@GoatHubDotCom",
    "author_channel_id": "UC1Ma2N6yRZK3JkkztPYqCLw",
    "text": "27 more videos please!!!!",
    "like_count": 0,
    "published_at": "2023-11-11T19:42:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzeNkCC9iHPDHwZlUt4AaABAg",
    "author": "@PhilosophyofDataScience",
    "author_channel_id": "UCWwM20XqKl5iz2XGo_bvCWw",
    "text": "Always appreciate solid analysis. Obviously no analysis takes everything into account, but this is leaps and bounds more accurate and therefore helpful than the vast majority that makes it to mainstream media and listeners.",
    "like_count": 0,
    "published_at": "2023-11-15T22:02:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwF4dYhTi-fxt5E6y94AaABAg",
    "author": "@henrikaugustsson4041",
    "author_channel_id": "UClCuxDWWB87Ed-LpmHzVfww",
    "text": "I would also just suggest that one year is not a trend, it has to be at least two or three years to be considered to be a trend.",
    "like_count": 0,
    "published_at": "2023-11-12T13:17:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyPoleVC-wfwi-Kjux4AaABAg",
    "author": "@legion2k988",
    "author_channel_id": "UCz0Lc1Tq9HX7ch505-Ueodw",
    "text": "HEADS UP! Pamela Price recall petition has surpassed the needed signatures. People said there were lines of people waiting to sign the recall petition.",
    "like_count": 0,
    "published_at": "2023-11-11T23:06:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw9Jt4fEDpV_kffoxV4AaABAg",
    "author": "@mfdoom1898",
    "author_channel_id": "UCbZ0ScDzo9S9f6-pDY4eXVQ",
    "text": "Every they do is a lie",
    "like_count": 0,
    "published_at": "2023-11-11T17:33:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxbq0eejXJTo4by6Wh4AaABAg",
    "author": "@snowhare1",
    "author_channel_id": "UCTSsoal5YGcVQwTT2eJWbhg",
    "text": "Idk, I might need another 15 videos explaining it Sean 😉",
    "like_count": 0,
    "published_at": "2023-11-19T16:16:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxZSRYWNCzFH4Zx0QJ4AaABAg",
    "author": "@M4rioL",
    "author_channel_id": "UCQ8ay4B3yDtIdFaZGOduKCQ",
    "text": "Statistics don’t lie. Liars use statistics",
    "like_count": 0,
    "published_at": "2023-11-11T17:33:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxrbxCqu1knOxmvqut4AaABAg",
    "author": "@mikelee9886",
    "author_channel_id": "UCoy02FCA679ZII0p-YX4M-Q",
    "text": "We really should make reporting crime statistics mandatory, and uniform. They don't even have to try to categorize it, the FBI can do that part. Just raw reports. This wouldn't be difficult",
    "like_count": 0,
    "published_at": "2025-11-24T19:46:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzzPO-GH-UzpyCwNI14AaABAg",
    "author": "@SonofScandia",
    "author_channel_id": "UCvsdr4XXcdBMpUChkBwzhUg",
    "text": "You mean to tell me that Emma and Buckets are dishonest!? I am shocked",
    "like_count": 0,
    "published_at": "2023-11-11T18:11:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyAOuEo8zyt39Q8Gz14AaABAg",
    "author": "@Kehvan",
    "author_channel_id": "UCekP9aGYW7Ug3Fl5rDd9FYQ",
    "text": "You can only have accurate crime statistics if crimes are reported.",
    "like_count": 0,
    "published_at": "2023-11-11T17:33:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwgE0FnLe7fL2-kKCB4AaABAg",
    "author": "@poodlescone9700",
    "author_channel_id": "UC01DRiaZew3vLQJboS_T89w",
    "text": "For real data, just look at the financial statements of insurance companies.  If they are losing money from payouts on crime related damages, then crime is going up.  It is pretty hard to fudge data for people beholden to shareholders.",
    "like_count": 0,
    "published_at": "2023-11-11T21:30:31Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwqz6-O9xDWnaKCULR4AaABAg",
    "author": "@davidvonkettering204",
    "author_channel_id": "UCTk2YewOCwTaEWhflU9FoAQ",
    "text": "If you have the time, as I do, you can go around the nation and visit local news channel's reports on crime and gain a pretty good feeling about what is actually going on. In city after city they are raising the alarm about the spike in Youth Crime and changing their laws to address it where the Politicians aren't standing in the way. As an example, the DC Council's rewrite of the Law Code was shot down by the GOP in Congress--and now the city is seeking to increase incarceration and penalties for Juveniles--which is the exact opposite of the direction their rewrite attempted to impose. Everywhere the criminal codes were softened for Juveniles there has been a huge spike in Juvenile offenses. Sam Seder and Emma Vigeland just cannot admit that they have been so wrong for so long.\nLove,\nDavid",
    "like_count": 0,
    "published_at": "2023-11-12T00:46:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz6WvXYm9EJTGqIzjJ4AaABAg",
    "author": "@Individual_Lives_Matter",
    "author_channel_id": "UCFzfZToQMdEPGXxDBH6DI6Q",
    "text": "If crime is trending upward, a one year slight decline would not necessarily disprove an upward trend.",
    "like_count": 0,
    "published_at": "2023-11-11T23:19:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx36JECwfz_oy4Y15l4AaABAg",
    "author": "@jimbob7773",
    "author_channel_id": "UC9DdJ1aWkez2E3xbu8l_Kpw",
    "text": "Seems like Lance will have to be a victim of rising crime before he acknowledges it.",
    "like_count": 1,
    "published_at": "2023-11-11T18:30:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyhKAwcS4kX5vh6mEF4AaABAg",
    "author": "@mfspectacular",
    "author_channel_id": "UCX-Ivoxz96Iq9EKIfnrpc0g",
    "text": "\"There's lies, damned lies, & there's statistics.\" - Woodrow Wilson(?) I dont actually remember who said this lol",
    "like_count": 0,
    "published_at": "2023-11-11T23:33:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzFjt8V1Vea8_NOGZZ4AaABAg",
    "author": "@alelectric2767",
    "author_channel_id": "UC51s6QsL4ZFk9AAQPKHbNLQ",
    "text": "Correct! Ex: if multiple  cars on your street are vandalized  over night it used to be logged as multiple instances. Now because it’s determined as the same event it’s now one, not 3 or 4 etc…",
    "like_count": 0,
    "published_at": "2023-11-11T21:40:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy3I_h5KLhTtWMYe0t4AaABAg",
    "author": "@SilkyJohnson7",
    "author_channel_id": "UCvS0I77-gfLffj1hTKZqACA",
    "text": "Ah yes, the 3 prime suspects. Love the thumbnail lol",
    "like_count": 0,
    "published_at": "2023-11-11T17:40:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwWU76Zb24qtv-yPXB4AaABAg",
    "author": "@Taluien",
    "author_channel_id": "UCD9JYvVUhA4jKKshdbG584g",
    "text": "To Lance:\nLet us make a hypothetical. The Serfs and I get into an advertisement relationship. First month, I pay them 1000 USD for a 10 minute total adread on each episode. Second month, I slash the budget by 99%, to 10 USD, same adread length & frequency. Then in month three, I find myself able to assuage their budgetary concerns by increasing it by 50%, to 15 USD. According to Lance, that means they should not be concerned about their budget this month.",
    "like_count": 0,
    "published_at": "2023-11-12T06:54:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy5Qp7MufBk9RyS9i14AaABAg",
    "author": "@Rakschas666",
    "author_channel_id": "UCpJ2Sy3QEP2hHSkWvb4U3lg",
    "text": "Why is it that when someone says \"So you are saying...\" it is almost never followed up by what the person actually said, either verbatim or contentual? \nThese debates with Lance or Sam drove me up the wall, like fingernails on a chalkboard. Absolutely insufferable people.",
    "like_count": 0,
    "published_at": "2023-11-12T07:45:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzfWjEQO6IeQPShNdN4AaABAg",
    "author": "@captainphoenix",
    "author_channel_id": "UCTaZEftHRSc1Aid4oGNwnrw",
    "text": "\"...Lance, who doesn't _ever_ know what he's talking about...\"\nLol TRUE haha Lance's entire career in eight words.",
    "like_count": 0,
    "published_at": "2023-11-15T13:26:34Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzMgHPyCV8gSef0_IV4AaABAg",
    "author": "@chris.3711",
    "author_channel_id": "UCBWsFKW4uLFf1AA81Cd0Isw",
    "text": "Most of the time from ehat I have learned, is that often the static is true, but the manner of which it is being used in is entirely false. It's truth that is adjusted and manipulted to agree to a specific narrative that is wrong in most arguments.",
    "like_count": 0,
    "published_at": "2023-11-15T04:22:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzGprZOYvOKPGah8QZ4AaABAg",
    "author": "@JonLand__x",
    "author_channel_id": "UCU45XodvxDu9RERjMX9eqPQ",
    "text": "Thank you. I knew their arguments didnt make sense. Our area here has a “luxury mall”. And yet there has been shootings all over and inside it. And stores robbed in daylight all over area. The guy at my tmobile store said they cannot keep demo models on the floor anymore. They are locked in back until you purchase. Theres no way\nThat crime is truly “down” and “safer than ever”.",
    "like_count": 1,
    "published_at": "2023-11-12T21:38:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzazE7VKwx81gRBYWJ4AaABAg",
    "author": "@normsti000",
    "author_channel_id": "UC4Jb7qMECa5FrfjRtsCJtdg",
    "text": "So the police departments continuing to report the crimes in their city are those who are either more appropriately staffed or which have lower crime...",
    "like_count": 0,
    "published_at": "2023-11-11T19:21:33Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyA77xabAIOMGXyCJR4AaABAg",
    "author": "@mkv2718",
    "author_channel_id": "UC6IZSRMdXmA8ISsXGGwNyVg",
    "text": "why does every face they make in photographs look so fake?",
    "like_count": 0,
    "published_at": "2023-11-14T00:36:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzPkcTfFk2y9l9m17l4AaABAg",
    "author": "@Punkertoon",
    "author_channel_id": "UCO2IZj5LqHuEt_5HRw2jJCQ",
    "text": "I love the thumbnail. Makes Lance look like the weirdo grapist at Emma. And it makes Sam look like professor masking as a feminist grapist.",
    "like_count": 0,
    "published_at": "2023-11-11T17:28:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxniP4IdOOIwdOw7YF4AaABAg",
    "author": "@davidatlas40",
    "author_channel_id": "UCEmO1w9rw88XWD7gRQM4uBQ",
    "text": "Very well stated & explained Sean. Thanks",
    "like_count": 0,
    "published_at": "2023-11-12T06:51:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyCWUSFVhGuuVP_ag14AaABAg",
    "author": "@FUNktshnl",
    "author_channel_id": "UCXKLsIZH4fBavxjjHCjbh6Q",
    "text": "In Germany we are constantly told that right-wing extremism is the most dangerous development. With the recent pro-palestine and anti-semitic protests it became clear, that those problems were added to right-wing by default, not confronting the real problem of migrant extremism.",
    "like_count": 1,
    "published_at": "2023-11-14T06:39:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyj1Nawfy7m3xJFezh4AaABAg",
    "author": "@mr.normalguy69",
    "author_channel_id": "UCMvFGZGMOyf0fTITjKUEAQA",
    "text": "When ideologies take priority over reality...",
    "like_count": 0,
    "published_at": "2023-11-12T02:35:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwFtQ0VJu0u6QwV0Up4AaABAg",
    "author": "@slice1208",
    "author_channel_id": "UCDLZ2x6piTOfG6hfFAiB8Zw",
    "text": "When I called the police about my truck being broken into they said what do you want use to do about it.\n\nI live in Tennessee.",
    "like_count": 0,
    "published_at": "2023-11-11T17:43:29Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwFtQ0VJu0u6QwV0Up4AaABAg.9wzRWS8pmc49wzY2TLzlIf",
        "author": "@michaelsorensen7567",
        "text": "Could always just tell them \"well my insurance will want a police report before they cover it, and it'd be nice to have the stolen property listed in your database just in case someone happens to catch the criminal\" with an implied \".... Cause we all know you're not going to do a damn thing to try and catch them.\"",
        "like_count": 0,
        "published_at": "2023-11-11T18:40:34Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwbakH87dbOjpkBm_N4AaABAg",
    "author": "@rahn45",
    "author_channel_id": "UCVpNhQn3DsGkdJSAEXHOchQ",
    "text": "When you don't care about the context, you can make data and statistics say anything.",
    "like_count": 0,
    "published_at": "2023-11-11T19:00:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwEMKCU19Q4P3kXvo14AaABAg",
    "author": "@mac1991seth",
    "author_channel_id": "UCUx6PANnULGjdkA86cVrUNg",
    "text": "30% increase means that for every 100 crimes last year you get 130 crimes this year. 1% decrease means that for every 130 crimes last year you get 128 crimes this year. If the chart was linear, it would take 15 years to get back to the baseline of 100.",
    "like_count": 0,
    "published_at": "2023-11-13T08:49:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwoExvSSTyW3Ceg4sl4AaABAg",
    "author": "@philliplewis3754",
    "author_channel_id": "UCvPWdPc2td1CEvYYDDXahPA",
    "text": "I hope they are factoring population, these statistics are typically per 100,000 people.",
    "like_count": 0,
    "published_at": "2023-11-12T01:38:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxY7QqF2VP0UX2_JV14AaABAg",
    "author": "@JacksFuriousPaperclip",
    "author_channel_id": "UC5k4uZdsWGco2duVbOHEpfg",
    "text": "Is it become less reliable, or are we discovering flaws that have always been there? Maybe I should finish watching.",
    "like_count": 0,
    "published_at": "2023-11-11T16:33:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz7FTL9rlGkf5mKSjN4AaABAg",
    "author": "@YedolfSacrosanctAvantgarde",
    "author_channel_id": "UCH2T_R5Y0w1xPUrUkoLyJNA",
    "text": "Anyone with eyes can see that crime has exploded since Floyd",
    "like_count": 1,
    "published_at": "2023-11-11T23:40:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx2MqPELhfrYpcTlyV4AaABAg",
    "author": "@PeterDivine",
    "author_channel_id": "UCgSLoCJtilRxGbshnkHHVjQ",
    "text": "Amazing. 1000 likes and not a single dislike. I've legitimately never seen that before.",
    "like_count": 0,
    "published_at": "2023-11-12T02:09:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzJBI4fQwQaqJJ-7o54AaABAg",
    "author": "@Angelique8559",
    "author_channel_id": "UCpFSN_gbo5iOM840v2fWw2w",
    "text": "Keep up the great work AJW!",
    "like_count": 1,
    "published_at": "2023-11-11T16:49:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxCS5H1Il5B1yNDB1N4AaABAg",
    "author": "@hamsunshine9394",
    "author_channel_id": "UCvawOCm9WoWKv3vPheNDy0w",
    "text": "Boom!",
    "like_count": 0,
    "published_at": "2023-11-11T16:27:31Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyv3Tn--Urs5NcRXEp4AaABAg",
    "author": "@OH_MY_DOGGG",
    "author_channel_id": "UC-i2qb4sL10OdR6PyMEU_5Q",
    "text": "Im surprised Sean never mentions that pipsqueak Rick Strom at tyt sports",
    "like_count": 0,
    "published_at": "2023-11-11T16:32:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy1WE8WuOSKEK0yjyN4AaABAg",
    "author": "@AaronJNeal",
    "author_channel_id": "UCCu-cDqT8-dljxL1sgVhdzA",
    "text": "I think you need to continue making these videos breaking down the data. Also if you could show the source name in the bottom of the image that would be cool too. I like taking screenshots to send to people.",
    "like_count": 1,
    "published_at": "2023-11-11T17:37:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxp9fP48LqVG9qVUU54AaABAg",
    "author": "@donworland",
    "author_channel_id": "UCqRkTZ4G1r1eSPvZaui8Upg",
    "text": "GOT IT! Use that Gun Victim Registry Page, and cross reference by location, boom, you have a somewhat accurate image of what is really happening.",
    "like_count": 0,
    "published_at": "2023-11-11T23:36:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyOIvwSMRCnbciChaN4AaABAg",
    "author": "@leighbee1764",
    "author_channel_id": "UC26kdeAXeSjFmBQ7daJzDBw",
    "text": "id be curious if the rise in crime also coincided with any gun buy back times?",
    "like_count": 0,
    "published_at": "2024-01-05T19:17:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwUJXJUMqn9faTra594AaABAg",
    "author": "@joesullivan3400",
    "author_channel_id": "UC21qUkn2rKpecw_VCxJpSeA",
    "text": "Sean, have you ever charted which departments that participate in the UCR vs the ones that don't. \nI think it would look interesting on a map.",
    "like_count": 0,
    "published_at": "2023-11-11T20:36:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzA3ctyl-LN1bdNh2R4AaABAg",
    "author": "@lostboy8084",
    "author_channel_id": "UC9nDjkTrB2nRh_HlLHWAMqg",
    "text": "Worked doing statistical analysis which taking the sample data from a small or large sample and then using it to figure out various conclusions. One of the most fundamental things you will find is data manipulation is very easy.  For example crime rates in a city just say you want to see a drop in the percentage. You will take your multiple crime population samples from different areas and they can be a large sample or small sample size which can also determine the statistical data. You take the data samples in the city where you know know there is lesser crime in that area.  Now supposed to be randomly but that just means you don't see the data but you can generally figure out how to do it and even then with the power of mathematically manipulation you can adjust the things so the answer which is what is seen how accurate of a prediction which is what statistical data analysis is is it 90% accurate with a 10% error or maybe 80% accurate with a 20% error one may show a jump in  crime while the other will show a drop in crime.  Funny enough the full raw data may even give a total different answer. Especially depending on where you get the data. For example say murder is it actually raw murder thay police cases, or murder based on court cases, or murder based on conviction and sent to prison.  I can pretty much assure you that one of these raw data will allow me to truthfully state something as factual never having to lie about murder being down.",
    "like_count": 1,
    "published_at": "2023-11-11T23:21:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzWdp9I1Xba_Qy_34h4AaABAg",
    "author": "@pcojedi",
    "author_channel_id": "UC7xnpVV4wEiXBUgJ3LfLi9w",
    "text": "Excellent video today",
    "like_count": 0,
    "published_at": "2023-11-11T21:19:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw8RHLm_ITGzuNv9A14AaABAg",
    "author": "@muskaos",
    "author_channel_id": "UCvwsA55IJrYvFDODK5vbUkQ",
    "text": "The FBI changed the way crime data was collected in 2020, iirc, and some departments were not able to submit data to the FBI. The last year the UCR was valid was 2020. 2021 and later UCR are missing data from large cities, and is therefore not a valid report.",
    "like_count": 0,
    "published_at": "2023-11-11T23:48:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxtxTx4uUd7vO2CFMl4AaABAg",
    "author": "@aperfectcircle0219",
    "author_channel_id": "UChRtwvrHtdoLqgLXt6UOEug",
    "text": "Calling 47% a “small bump” is nuts. Would she consider a 47% raise a “small bump?”",
    "like_count": 0,
    "published_at": "2023-11-17T15:12:59Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzsS3xfVhmK6ONz6rV4AaABAg",
    "author": "@dawnemile7499",
    "author_channel_id": "UCmDsu7Kv-l6ktl7SiI-M4cA",
    "text": "Vigland is completely delusional.",
    "like_count": 0,
    "published_at": "2023-11-16T06:17:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgywcNpgxxWWN6eWlgN4AaABAg",
    "author": "@FTORanger",
    "author_channel_id": "UCM6LwQJM8NljGDCKQwjgzGw",
    "text": "Sean, I can get you in contact with a highly skilled and seasoned CAD analyst. Wealth of knowledge, let me know.",
    "like_count": 2,
    "published_at": "2023-11-11T18:46:09Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyKg62Uc15y3453Pgh4AaABAg",
    "author": "@Rick8191-tv8pg",
    "author_channel_id": "UCdUkucBj96hph1JUjItEIZw",
    "text": "Many dem big cities don't give there crime numbers to the Feds.",
    "like_count": 0,
    "published_at": "2023-11-11T20:21:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzHM-g5ET1ufMwAdMl4AaABAg",
    "author": "@hercules5813",
    "author_channel_id": "UCUXCO3pNBn9yns_ZVc41NYA",
    "text": "Of course reported crime goes down when you stop reporting it.",
    "like_count": 0,
    "published_at": "2023-11-11T22:31:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzT5G4jV7zooDwtmT94AaABAg",
    "author": "@goatofdeath",
    "author_channel_id": "UCraiiMho2iJDmVc_GwSMAMg",
    "text": "I get why the stats would vary so much. In many areas I think people have just given up reporting crimes to the police because it never seems to amount to anything. I personally experienced this when we were the victim of burglary. I found my items on offer up with pictures of them and provided the links to the police. To the best of my knowledge nothing was done even though that should have been an easy win for them. We have homeless causing issues all around to the point that compassion fatigue has set firmly in and our leaders seem useless and toothless. In that environment it makes sense why fewer crimes would be reported, because collectively we don't see a point in going through the trouble or reporting them. Look at all the retail theft for example. It's so completely rampant and virulent, there is no way all of that is getting reported and making it into the stats.",
    "like_count": 0,
    "published_at": "2023-11-19T03:36:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgybIrlugn17NJM00rh4AaABAg",
    "author": "@jmarino09",
    "author_channel_id": "UCmlDvkV3m4JPLDWvnRKuzdw",
    "text": "Thanks",
    "like_count": 0,
    "published_at": "2023-11-18T01:29:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx4YT7oXIVQu-tCJhF4AaABAg",
    "author": "@WaynerTheGamer",
    "author_channel_id": "UC8c2gZFu-6SN3SCXz1uuXRg",
    "text": "10k more and ya reach 300k 😎",
    "like_count": 0,
    "published_at": "2023-11-11T16:50:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxBFHcOuGQH-e5R81F4AaABAg",
    "author": "@TheGeneReyva",
    "author_channel_id": "UC3gLBSGbLYUdnckOKfCMA1A",
    "text": "\"Yes. Very nice that crime is down 7% from last year. Bring up the 4 years before it.\"",
    "like_count": 0,
    "published_at": "2023-11-11T18:27:11Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgxBFHcOuGQH-e5R81F4AaABAg.9wzWWVdcfii9wz_q35oB_F",
        "author": "@oblivionsa7973",
        "text": "\"Why are conservatives so focused on the past?!?!?\" They've got responses for everything, because every single one of them gets their talking points from the same places. And most of those \"rebuttals\" are appeals to emotion or name calling.",
        "like_count": 0,
        "published_at": "2023-11-11T19:04:56Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugwzm0tPi2t_ZX0r0gV4AaABAg",
    "author": "@Ariott13121",
    "author_channel_id": "UCDThbKvLLYuehHy43cEAytQ",
    "text": "Sean, I totally see your point of view and agree, however I still would love 25 more videos of crime breakdown simply because a lot of the terminology and policies go over my head, and it would be good to know how to rebuttal some of the common talking points about crime (am I alone in this lol?😅). Thanks for the awesome video as always!",
    "like_count": 1,
    "published_at": "2023-11-11T19:06:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwVMfLcW4vE82nN2_94AaABAg",
    "author": "@HavocHerseim",
    "author_channel_id": "UCGTC371K1kJPOqAHiQrPmWQ",
    "text": "It hurts when Americans say maths... so british. It's math, or mathematics.",
    "like_count": 1,
    "published_at": "2023-11-11T19:05:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwG9PC1XR5h58xEJod4AaABAg",
    "author": "@kevinmills7067",
    "author_channel_id": "UCZwlyNuKL388Z4atytI0rYA",
    "text": "If you decriminalize crime, crime rates go down...",
    "like_count": 0,
    "published_at": "2023-11-11T17:31:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugztz0v1SqdiscktOGp4AaABAg",
    "author": "@ImAnIslandBoy",
    "author_channel_id": "UCrAHt3B2xorIwur6XhVlBeQ",
    "text": "I have first hand experience with this working for the criminal justice system in Illinois. They love to say our juvenile recidivism rate went down from 60 to 20% and our juvenile prison population went from several thousand to only 150 in the entire state. Won't they won't tell you is they've changed the laws making prosecutors exhaust all options (restorative justice bs) before sending kids to juvenile prison, and made the standards of evidence much more difficult so judges will commonly dismiss the charges or lower them, so I'll now see kids with 10-15 violent crime charges before they are ever sent to us. They've also put no cap on the amount of cut time you can get so kids will be out within 4-6 months so the population is always low. To make it even better they've changed the laws for parole, where as before if you had several violations your sent back to juvie. Now kids can pretty much violate all their conditions of parole with zero consequences and will only come back to us if they're officially charged with a crime. So our department loves to brag about recidivism is declining and so is the prison population but in reality it's because they changed the laws and this is the trend in a majority of the states. It's pretty insane the state of Illinois has less than 200 juveniles in prison but yet in Chicago you'll see hundreds of juvenile crime stories on the news within a month. That should tell you something doesn't smell right.",
    "like_count": 1,
    "published_at": "2023-11-12T16:25:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwthKFV_0tsM8Anoa14AaABAg",
    "author": "@Pwn3540",
    "author_channel_id": "UCqs4hYNEkL45K5RuAco6J-Q",
    "text": "After watching clockwork orange its weird how similar that movie is to live in the US right now",
    "like_count": 0,
    "published_at": "2023-11-11T17:55:44Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwthKFV_0tsM8Anoa14AaABAg.9wzSvAB6I3p9wzXqSP7Zpf",
        "author": "@michaelsorensen7567",
        "text": "And Idiocracy\n\nAnd demolition man",
        "like_count": 0,
        "published_at": "2023-11-11T18:38:47Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwLx-4DFNHiqj-nC014AaABAg",
    "author": "@AmericanWithTheTruth",
    "author_channel_id": "UC4wzMxEemEMu_t_6njGe2Og",
    "text": "Bravo, my friend. Sean now that’s the way you do a video referencing statistics and legitimate data..",
    "like_count": 0,
    "published_at": "2023-11-16T11:54:09Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx6tjVuy-rv5d-EcM54AaABAg",
    "author": "@nickjohnson6368",
    "author_channel_id": "UCT1lzuePXuzJKPP551EvQVA",
    "text": "Mah dawgh",
    "like_count": 0,
    "published_at": "2023-11-12T02:32:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw6xHjLyZfdE9435Mp4AaABAg",
    "author": "@baldisaerodynamic9692",
    "author_channel_id": "UC1tqEjyWw9U0o8GfJsQ2i6A",
    "text": "i literally had a black man starting to charge at me and yelling at me, right in front of a 2 cops here in vegas.\n\nMe:  hey officer can i get a hand here with this\ncops:  call 911, you are parked illegally by the way.  \n\nyeahhhhhhh......wonder why theres distrust with cops?",
    "like_count": 1,
    "published_at": "2023-11-11T21:47:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyeXVk_vmknS3MvoGh4AaABAg",
    "author": "@philharmonicestuary",
    "author_channel_id": "UCoRt10bckQcs40fcIO4Czyg",
    "text": "Lance's \"debunking\" is insane, it feels like a parody.  He actually thinks he making a point",
    "like_count": 0,
    "published_at": "2023-11-13T22:22:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  }
]