[
  {
    "text": "Hello everyone",
    "start": 0.549,
    "duration": 1.331
  },
  {
    "text": "It's Oscar season again",
    "start": 1.88,
    "duration": 1.5
  },
  {
    "text": "Which doesn't have anything to do with today's topic",
    "start": 3.38,
    "duration": 2.528
  },
  {
    "text": "But it gives me an excuse to talk about a movie",
    "start": 5.91,
    "duration": 2.73
  },
  {
    "text": "Which will probably receive a couple of awards",
    "start": 8.64,
    "duration": 2.7
  },
  {
    "text": "The movie I want to talk about is",
    "start": 11.34,
    "duration": 1.64
  },
  {
    "text": "Christopher Nolan's Dunkirk",
    "start": 12.98,
    "duration": 1.96
  },
  {
    "text": "Specifically",
    "start": 15.26,
    "duration": 0.98
  },
  {
    "text": "About a take on it by a certain YouTube person",
    "start": 16.24,
    "duration": 2.76
  },
  {
    "text": "The video we'll be looking at is made by a guy called",
    "start": 19.0,
    "duration": 3.02
  },
  {
    "text": "Brooks",
    "start": 22.02,
    "duration": 1.04
  },
  {
    "text": "Who does news, comedy, commentary, freedom",
    "start": 23.06,
    "duration": 3.76
  },
  {
    "text": "And also hosts the YouTube channel",
    "start": 26.82,
    "duration": 2.86
  },
  {
    "text": "No Bullshit",
    "start": 29.7,
    "duration": 0.92
  },
  {
    "text": "His video on Dunkirk is titled",
    "start": 30.62,
    "duration": 2.26
  },
  {
    "text": "Dunkirk is problematic",
    "start": 32.88,
    "duration": 1.86
  },
  {
    "text": "Which I encourage you to look up",
    "start": 34.74,
    "duration": 1.76
  },
  {
    "text": "To make sure I'm not misrepresenting him",
    "start": 36.5,
    "duration": 1.8
  },
  {
    "text": "If you can make it through the video that is",
    "start": 38.3,
    "duration": 2.2
  },
  {
    "text": "Now I personally don't have any big problems with the movie Dunkirk",
    "start": 40.5,
    "duration": 3.54
  },
  {
    "text": "and very much enjoyed it so the focus of this video doesn't lie on the movie itself so much",
    "start": 44.04,
    "duration": 4.62
  },
  {
    "text": "But more about the outrage by Brooks as you will see shortly",
    "start": 48.73,
    "duration": 3.169
  },
  {
    "text": "let's have a look at what he has to say about the movie",
    "start": 52.239,
    "duration": 3.022
  },
  {
    "text": "Brooks: Dunkirk tells the story of the",
    "start": 55.261,
    "duration": 1.639
  },
  {
    "text": "1940 Battle of Dunkirk where French and British soldiers",
    "start": 57.0,
    "duration": 2.96
  },
  {
    "text": "Struggled to evacuate the city in the beginnings of World War two",
    "start": 60.16,
    "duration": 3.74
  },
  {
    "text": "3Arrows:Sorry to interrupt here",
    "start": 63.909,
    "duration": 1.22
  },
  {
    "text": "But this will be important later on the movie Dunkirk doesn't tell the story of the Battle of Dunkirk",
    "start": 65.129,
    "duration": 5.669
  },
  {
    "text": "It tells the story of the British evacuation during the battle. It's more about Operation Dynamo than anything else",
    "start": 71.049,
    "duration": 6.56
  },
  {
    "text": "It's a minor point, but keep that in mind for later",
    "start": 77.799,
    "duration": 2.33
  },
  {
    "text": "Brooks: And while the movie was masterfully done with wonderful acting, directions, score, and pacing there's still a few problems for",
    "start": 80.14,
    "duration": 6.889
  },
  {
    "text": "starters",
    "start": 87.189,
    "duration": 0.5
  },
  {
    "text": "There's no black people in it. How dare Christopher Nolan make his movie historically accurate what an asshole?",
    "start": 87.689,
    "duration": 5.49
  },
  {
    "text": "That's not gonna fly in this day and age not in",
    "start": 93.34,
    "duration": 2.6
  },
  {
    "text": "2017 we need to black or brown wash at least one of the",
    "start": 96.0,
    "duration": 3.26
  },
  {
    "text": "sympathetic main characters in order to be politically correct in current year I",
    "start": 99.36,
    "duration": 3.8
  },
  {
    "text": "Suggest they replace the commander Bolton character. Sure he was played beautifully like Kenneth Brown off",
    "start": 103.36,
    "duration": 5.0
  },
  {
    "text": "But we don't want this Shakespearean trained",
    "start": 108.36,
    "duration": 2.0
  },
  {
    "text": "Oscar-nominated actor in there. EW. Let's put a random minority celebrity in there, someone like 50 Cent or Shaquille",
    "start": 110.36,
    "duration": 6.96
  },
  {
    "text": "O'Neal would be much better",
    "start": 117.32,
    "duration": 1.1
  },
  {
    "text": "Sure, they can't act but at least their skins not white",
    "start": 118.48,
    "duration": 3.1
  },
  {
    "text": "3 Arrows: Now besides the point that there are black people in the movie although only very",
    "start": 121.589,
    "duration": 3.93
  },
  {
    "text": "Briefly Brooks doesn't seem to know that they are like real black actors other than 50 cent and Shaquille",
    "start": 125.52,
    "duration": 6.78
  },
  {
    "text": "O'Neal whatever, maybe it's a joke. At this point you might be asking yourself what someone might have said to make Brooks get this unhinged",
    "start": 132.3,
    "duration": 7.86
  },
  {
    "text": "Well let him explain",
    "start": 140.68,
    "duration": 1.503
  },
  {
    "text": "Brooks: But back to Dunkirk",
    "start": 142.183,
    "duration": 1.427
  },
  {
    "text": "Here's what one reporter from the USA Today had to say about the movie the trio of time lines can be jarring as you figure",
    "start": 143.61,
    "duration": 6.27
  },
  {
    "text": "Out how they all fit and the fact that there are only a couple of women and no lead actors of color",
    "start": 149.88,
    "duration": 5.489
  },
  {
    "text": "May rub some the wrong way *sarcastic laugh*",
    "start": 155.44,
    "duration": 2.6
  },
  {
    "text": "But in all seriousness for real now clearly this guy at USA Today isn't concerned with being historically accurate in nonfiction stories",
    "start": 158.22,
    "duration": 7.82
  },
  {
    "text": "3 Arrows: Unfortunately, this is the only thing Brooks cites from this review and USA Today",
    "start": 166.78,
    "duration": 3.82
  },
  {
    "text": "Which is titled Christopher Nolan's Dunkirk examines World War two heroism up close",
    "start": 170.61,
    "duration": 4.619
  },
  {
    "text": "And I know exactly why because the sentence right after the one he cites in this obnoxious voice is",
    "start": 175.23,
    "duration": 6.389
  },
  {
    "text": "Still Nolan's feat is undeniable",
    "start": 182.44,
    "duration": 2.63
  },
  {
    "text": "He's made an immersive war movie that celebrates the good of mankind while also making it clear that no victory is without sacrifice",
    "start": 185.41,
    "duration": 7.099
  },
  {
    "text": "In fact the part that Brooks features in his video is the only one in the entire review",
    "start": 192.88,
    "duration": 5.66
  },
  {
    "text": "Which could be seen as negative and the part about not enough minority representation",
    "start": 198.54,
    "duration": 4.229
  },
  {
    "text": "Is phrased in a way that it's not even a critique of the movie really",
    "start": 202.93,
    "duration": 3.86
  },
  {
    "text": "The fact that there are only a couple of women and no lead actors of color",
    "start": 206.95,
    "duration": 4.759
  },
  {
    "text": "May rub some the wrong way this isn't criticism of the movie",
    "start": 211.989,
    "duration": 3.89
  },
  {
    "text": "But only a suggestion for moviegoers who might expect something different",
    "start": 215.88,
    "duration": 4.049
  },
  {
    "text": "How outrages of USA Today to even suggest?",
    "start": 219.93,
    "duration": 2.61
  },
  {
    "text": "That people who care for this stuff might not enjoy the movie as much",
    "start": 222.79,
    "duration": 3.349
  },
  {
    "text": "If you read the full review it becomes very clear that the writer",
    "start": 226.209,
    "duration": 3.77
  },
  {
    "text": "Loves the movie as is showcased in the original title which you can see in the link",
    "start": 230.11,
    "duration": 4.639
  },
  {
    "text": "review Christopher Nolan excellent Dan Kirk explores heroism innovative fashion",
    "start": 235.15,
    "duration": 4.339
  },
  {
    "text": "But Brooks doesn't seem to care about that if he needs something to be outraged about",
    "start": 239.62,
    "duration": 4.279
  },
  {
    "text": "You can be sure he will find it but besides on that his suggestion about the Navy officer being played by a rapper",
    "start": 244.0,
    "duration": 6.919
  },
  {
    "text": "Sounded kind of familiar when I heard it the first time and then I remembered where I read something like this",
    "start": 251.29,
    "duration": 5.059
  },
  {
    "text": "It was in the Breitbart article about the exact same thing which reads",
    "start": 256.78,
    "duration": 4.579
  },
  {
    "text": "Also, it would definitely have added a new dimension had James Earl Jones",
    "start": 261.97,
    "duration": 3.559
  },
  {
    "text": "been cast",
    "start": 265.63,
    "duration": 1.04
  },
  {
    "text": "The salty old royal naval officer called out of retirement for one last trip across the English Channel, or if Ice T and Snoop Dogg",
    "start": 266.67,
    "duration": 6.66
  },
  {
    "text": "Had been given the role of two ageing rappers who parachute from the Dakota to administer weed to the desperate troops",
    "start": 273.33,
    "duration": 6.11
  },
  {
    "text": "Or if Oprah appeared in a cameo as Queen Mary welcoming the returning troops after their desperate voyage",
    "start": 279.66,
    "duration": 5.46
  },
  {
    "text": "but it wouldn't have been historically authentic",
    "start": 285.12,
    "duration": 2.96
  },
  {
    "text": "Now I'm not saying that Brooks stumbled over this article in his favorite fake news outlet and just copied",
    "start": 288.16,
    "duration": 5.66
  },
  {
    "text": "What's in it with a couple of slight changes?",
    "start": 293.82,
    "duration": 2.0
  },
  {
    "text": "It's just a weird coincidence, probably",
    "start": 296.14,
    "duration": 2.84
  },
  {
    "text": "although the article was released four days before Brooks videos uploaded",
    "start": 299.06,
    "duration": 3.6
  },
  {
    "text": "Make of that what you want",
    "start": 302.76,
    "duration": 1.58
  },
  {
    "text": "The Breitbart article finishes with the sentence",
    "start": 304.34,
    "duration": 2.9
  },
  {
    "text": "The guy from USA Today. He does know its history, right?",
    "start": 307.24,
    "duration": 3.94
  },
  {
    "text": "Well, I know its history, so let's listen to Brooks for a bit more and look at some of the claims he makes",
    "start": 311.42,
    "duration": 6.32
  },
  {
    "text": "Brooks: because I can't think of anything that would bring me out of a world war two movies immersion more than seeing a",
    "start": 317.84,
    "duration": 5.16
  },
  {
    "text": "woman in the French or British military",
    "start": 323.22,
    "duration": 1.99
  },
  {
    "text": "Because guess what guys those armies were almost",
    "start": 325.21,
    "duration": 2.509
  },
  {
    "text": "Completely made up of white men",
    "start": 327.88,
    "duration": 1.92
  },
  {
    "text": "3 Arrows: Now Brooke starts off by saying he can't think of anything that would take him out of the movie more than seeing a woman in",
    "start": 329.8,
    "duration": 6.799
  },
  {
    "text": "the British or French military",
    "start": 336.6,
    "duration": 1.47
  },
  {
    "text": "which is really weird because there were women in uniform at Dunkirk as part of the",
    "start": 338.07,
    "duration": 4.67
  },
  {
    "text": "ATS which was the woman's branch of the British military not only that they were",
    "start": 342.84,
    "duration": 4.08
  },
  {
    "text": "Dunkirk a part of them was even evacuate alongside the men on our most women of the ATS were evacuated later an operation area",
    "start": 347.06,
    "duration": 7.24
  },
  {
    "text": "It's weird that he picks",
    "start": 354.31,
    "duration": 1.37
  },
  {
    "text": "This as a deal-breaker for him and not things like you know",
    "start": 355.68,
    "duration": 3.46
  },
  {
    "text": "These guys not wearing helmets in an active battle zone or that this are supposed to be",
    "start": 359.4,
    "duration": 4.8
  },
  {
    "text": "300,000 people or that the pamphlets and the movie looked nothing like the real ones",
    "start": 364.2,
    "duration": 4.6
  },
  {
    "text": "Almost like he's the one being obsessed with gender and race",
    "start": 369.04,
    "duration": 3.529
  },
  {
    "text": "Anyway, he then goes on to say that the British and French army were almost completely made up of white men",
    "start": 373.15,
    "duration": 5.419
  },
  {
    "text": "Which I can only assume stems from an assumption that a lot of people have about these armies",
    "start": 378.58,
    "duration": 4.82
  },
  {
    "text": "It weren't really only France and Britain who were at war with the axis it was the French and British",
    "start": 383.4,
    "duration": 5.58
  },
  {
    "text": "Empire in 1939 the population of the British Empire was about 25% of the entire worlds population and",
    "start": 389.06,
    "duration": 8.26
  },
  {
    "text": "Naturally they drew a lot of their forces from there",
    "start": 397.7,
    "duration": 2.32
  },
  {
    "text": "Just like the French did even when talking specifically about Dunkirk, which was fairly early in the war so Britain",
    "start": 400.34,
    "duration": 5.85
  },
  {
    "text": "Hadn't fully mobilized its Dominion forces yet there were still about four contingents from British India",
    "start": 406.19,
    "duration": 4.739
  },
  {
    "text": "You know the part of the British Empire which provided the largest volunteer army in history making up about",
    "start": 411.0,
    "duration": 5.92
  },
  {
    "text": "2.5 million men of the British forces by the end of the war one of, them named Jim Adam maole that can even earned an",
    "start": 417.1,
    "duration": 7.32
  },
  {
    "text": "Indian Distinguished Service Medal for gallantry at Dunkirk for quote \"showing magnificent courage",
    "start": 424.42,
    "duration": 5.4
  },
  {
    "text": "Coolness and decision when his troops was shelled from the ground and bombed from the air by an enemy",
    "start": 430.24,
    "duration": 5.14
  },
  {
    "text": "He promptly reorganized his men and animals, got them off the road and under cover under extremely difficult conditions",
    "start": 435.38,
    "duration": 6.029
  },
  {
    "text": "It was due to this initiative and the confidence he inspired that it was possible to extricate his troops without loss and men or animals\"",
    "start": 441.87,
    "duration": 6.98
  },
  {
    "text": "Now the Indians only made up a fraction of the troops at the beaches of Dunkirk",
    "start": 449.22,
    "duration": 3.859
  },
  {
    "text": "But this doesn't extrapolate to the fact that the armies of World War 2 were almost",
    "start": 453.08,
    "duration": 4.02
  },
  {
    "text": "Completely made up of white men and because he hasn't embarrassed himself enough yet Brooks doubles down and in saying",
    "start": 457.28,
    "duration": 5.9
  },
  {
    "text": "Brooks: 1940 soldiers in these battles were almost all white men. I'm sorry, but it's true",
    "start": 463.48,
    "duration": 5.14
  },
  {
    "text": "3 Arrows: Well, I'm not sorry, and it's not true, and I really have no idea which battles",
    "start": 468.74,
    "duration": 5.06
  },
  {
    "text": "He is talking about here. Is he talking about the Battle of Dunkirk like he claimed the movie was about?",
    "start": 473.81,
    "duration": 4.69
  },
  {
    "text": "If he had taken the time to not even open a history book",
    "start": 478.74,
    "duration": 3.71
  },
  {
    "text": "But just take a quick look at the Wikipedia page for the Battle of Dunkirk",
    "start": 482.45,
    "duration": 3.07
  },
  {
    "text": "he would have seen that a significant part of the French forces",
    "start": 485.58,
    "duration": 2.64
  },
  {
    "text": "who were the ones holding of the Nazis to make the evacuation even possible came",
    "start": 488.68,
    "duration": 4.32
  },
  {
    "text": "from French Africa and these troops later went on to form two-thirds of the Free French",
    "start": 493.0,
    "duration": 4.48
  },
  {
    "text": "army under Charles de Gaulle and would continue to fight for the liberation of France from Nazi rule",
    "start": 497.6,
    "duration": 5.04
  },
  {
    "text": "and even if I would grant Brooks the Battle of Dunkirk",
    "start": 502.94,
    "duration": 2.7
  },
  {
    "text": "In 1940 there were still the East and West African campaign,",
    "start": 505.72,
    "duration": 3.3
  },
  {
    "text": "the Mediterranean Middle Eastern theater, and the Chinese front",
    "start": 509.22,
    "duration": 3.76
  },
  {
    "text": "World War two was not a white man's war. It was a world war, in every meaning of the term",
    "start": 513.16,
    "duration": 5.64
  },
  {
    "text": "Let's listen to Brooks for a bit more",
    "start": 519.12,
    "duration": 1.88
  },
  {
    "text": "Brooks: so with that said I really don't see how having only a couple women in the Dunkirk",
    "start": 521.16,
    "duration": 3.78
  },
  {
    "text": "Movie was even a problem, but",
    "start": 525.02,
    "duration": 1.78
  },
  {
    "text": "I knew if we looked hard enough someone would complain about it",
    "start": 526.8,
    "duration": 2.76
  },
  {
    "text": "3 Arrows: if he looked hard enough Someone would complain about it.",
    "start": 529.56,
    "duration": 3.2
  },
  {
    "text": "Brooks himself just gave away the purpose of his video there",
    "start": 532.94,
    "duration": 2.94
  },
  {
    "text": "He desperately needs something to be outraged about that",
    "start": 536.12,
    "duration": 2.98
  },
  {
    "text": "He can sell to his audience as another sign that the sjw's are taking over",
    "start": 539.1,
    "duration": 4.26
  },
  {
    "text": "Even if it's just a suggestion in an otherwise extremely positive review",
    "start": 543.36,
    "duration": 4.16
  },
  {
    "text": "Brooks: The real problem is SJW's have gotten away with this complaining so much",
    "start": 547.7,
    "duration": 4.22
  },
  {
    "text": "that they're finally jumping the shark you give them an inch and they take a mile",
    "start": 551.92,
    "duration": 3.58
  },
  {
    "text": "Just like the Nazis did in 1940.",
    "start": 555.66,
    "duration": 2.24
  },
  {
    "text": "3 Arrows:Oh wow. I thought the people on the left were the ones falsely accusing people of being Nazis",
    "start": 557.9,
    "duration": 4.34
  },
  {
    "text": "and besides that what is this give a thing take a mile",
    "start": 562.46,
    "duration": 2.98
  },
  {
    "text": "comparison to the Nazis he was supposed to mean",
    "start": 565.67,
    "duration": 2.15
  },
  {
    "text": "the only thing I can think of where this would fit is the annexation of",
    "start": 567.82,
    "duration": 3.14
  },
  {
    "text": "Czechoslovakia by the Nazis following the Munich Agreement,",
    "start": 570.96,
    "duration": 3.28
  },
  {
    "text": "but that happened two years before 1940 in the Battle of Dunkirk",
    "start": 574.24,
    "duration": 3.48
  },
  {
    "text": "Anyway. let's listen to one last clip from the video",
    "start": 577.74,
    "duration": 2.5
  },
  {
    "text": "Brooks: ( I) Personally think fiction and nonfiction",
    "start": 580.3,
    "duration": 2.02
  },
  {
    "text": "Movie should both be free to cast whoever the fuck they want it can be all white or all black or diverse or whatever",
    "start": 582.32,
    "duration": 6.18
  },
  {
    "text": "whatever they like",
    "start": 588.64,
    "duration": 1.12
  },
  {
    "text": "Sjw's and film critics who focus on the skin colors of actors this much are just sad sad people",
    "start": 589.8,
    "duration": 5.68
  },
  {
    "text": "Desperate losers who have nothing better to talk about",
    "start": 595.7,
    "duration": 2.62
  },
  {
    "text": "3 Arrows: Yeah, It's totally the writer of the review and USA Today whose",
    "start": 598.48,
    "duration": 3.44
  },
  {
    "text": "Overly focused on race and gender and who is a sad sad person with nothing to talk about",
    "start": 602.06,
    "duration": 4.6
  },
  {
    "text": "not the person who makes a six and a half minute video about how outrageous it is to even suggest",
    "start": 606.74,
    "duration": 5.16
  },
  {
    "text": "Such a thing and don't ask me about the sudden change of backdrop",
    "start": 611.94,
    "duration": 3.48
  },
  {
    "text": "This doesn't look like a beach in northern France",
    "start": 615.43,
    "duration": 1.85
  },
  {
    "text": "But maybe he has a hard time keeping his audience attention and that's pretty much it folks",
    "start": 617.28,
    "duration": 4.5
  },
  {
    "text": "Because besides the wrong",
    "start": 621.92,
    "duration": 1.68
  },
  {
    "text": "Unsourced claims about world war II his video is more or less just a rehash of the Breitbart article mixing with the trailer for Dunkirk",
    "start": 623.6,
    "duration": 6.859
  },
  {
    "text": "It's really a great example of lazy pandering to an audience who has no idea about Dunkirk",
    "start": 630.459,
    "duration": 5.07
  },
  {
    "text": "But gets outraged at the mere suggestion that someone might not enjoy because of reasons they don't acknowledge as legitimate",
    "start": 635.529,
    "duration": 6.39
  },
  {
    "text": "Now as I already said?",
    "start": 642.5,
    "duration": 1.31
  },
  {
    "text": "I liked the movie Dunkirk despite its historical inaccuracies",
    "start": 643.81,
    "duration": 2.609
  },
  {
    "text": "the focus of the movie lies on the British perspective so the ethnic",
    "start": 646.88,
    "duration": 3.62
  },
  {
    "text": "Representation in the movie is fairly accurate",
    "start": 650.58,
    "duration": 1.72
  },
  {
    "text": "It is this blatant misinformation that I dislike",
    "start": 652.3,
    "duration": 2.94
  },
  {
    "text": "Especially by people like Brooks who clearly have no idea what they are talking about",
    "start": 655.52,
    "duration": 4.5
  },
  {
    "text": "and on top of that being this ignorant",
    "start": 660.02,
    "duration": 2.1
  },
  {
    "text": "about that movie about Dunkirk could very well star a ton of black or Indian people depending on what the part of the event is focused on.",
    "start": 662.2,
    "duration": 6.9
  },
  {
    "text": "To make matters worse",
    "start": 669.28,
    "duration": 1.06
  },
  {
    "text": "this framing of World War II as a war of white men was even partially done during World War II",
    "start": 670.44,
    "duration": 5.06
  },
  {
    "text": "when the Allies seek to liberate Paris in August 1944",
    "start": 675.5,
    "duration": 3.0
  },
  {
    "text": "The commander of the Free French Army Charles de Gaulle  requested that French forces would lead the charge",
    "start": 678.5,
    "duration": 5.92
  },
  {
    "text": "the response to this by the American leadership and form of Major General Walter Bedell Smith was",
    "start": 684.42,
    "duration": 4.74
  },
  {
    "text": "it is more desirable that the division mentioned above",
    "start": 689.16,
    "duration": 2.72
  },
  {
    "text": "Consists of white personnel which (Charles) de Gaulle than yielded to even going as far as to staff the French",
    "start": 692.19,
    "duration": 5.629
  },
  {
    "text": "division leading the liberation of Paris with Spaniards",
    "start": 697.949,
    "duration": 3.02
  },
  {
    "text": "Because they didn't have enough white Frenchmen available in the area",
    "start": 701.22,
    "duration": 3.58
  },
  {
    "text": "now Brooks is just another",
    "start": 704.8,
    "duration": 1.54
  },
  {
    "text": "reactionary on YouTube who sells outrage so his opinion doesn't really matter",
    "start": 706.34,
    "duration": 3.66
  },
  {
    "text": "it just leaves a bad taste in my mouth when people downplay the",
    "start": 710.0,
    "duration": 3.14
  },
  {
    "text": "sacrifices by certain groups of the Armed Forces who fought to liberate Europe from Nazi tyranny",
    "start": 713.31,
    "duration": 4.729
  },
  {
    "text": "And that's it for today folks. I hope you enjoyed this one, and if you grown to like Brooks",
    "start": 718.56,
    "duration": 4.519
  },
  {
    "text": "You can rest assured that this probably isn't the last time you will see him on this channel",
    "start": 723.089,
    "duration": 4.13
  },
  {
    "text": "If you haven't seen Dunkirk definitely check it out. It's worth a watch",
    "start": 727.22,
    "duration": 3.15
  },
  {
    "text": "As always you will find my sources in the description and feel free to subscribe and to follow me on Twitter",
    "start": 731.01,
    "duration": 5.0
  },
  {
    "text": "until next time have a good one",
    "start": 736.5,
    "duration": 2.329
  }
]