[
  {
    "text": "Hey, what's up, everyone?",
    "start": 0.0,
    "duration": 2.08
  },
  {
    "text": "Today we're going to talk about Fox News, the Iraq War, and PMCs (private miliatary contractors),",
    "start": 2.08,
    "duration": 7.16
  },
  {
    "text": "which is a fancy way of saying \"mercenaries\".",
    "start": 9.24,
    "duration": 2.74
  },
  {
    "text": "They are guns for hire that are deployed all around the world, especially by the United States.",
    "start": 11.98,
    "duration": 5.08
  },
  {
    "text": "Hiring a company to send out mercenaries tasked with, for instance,",
    "start": 17.06,
    "duration": 3.74
  },
  {
    "text": "protecting a convoy in an occupied country instead of official soldiers has several benefits.",
    "start": 20.8,
    "duration": 4.98
  },
  {
    "text": "Firstly, it doesn't really matter how long their mission takes, or how many of them die during that time,",
    "start": 25.78,
    "duration": 4.72
  },
  {
    "text": "since these casualties don't have to be reported.",
    "start": 30.5,
    "duration": 2.56
  },
  {
    "text": "And also, the average population doesn't care as much about people whose sole motivation is money.",
    "start": 33.06,
    "duration": 4.92
  },
  {
    "text": "Because of this, the government can lower the risk of major backlash against an ongoing military involvement,",
    "start": 37.98,
    "duration": 5.38
  },
  {
    "text": "like at the end of the Vietnam War.",
    "start": 43.36,
    "duration": 1.94
  },
  {
    "text": "This practice also has significant downsides, though, like lowering the morale of official soldiers,",
    "start": 45.3,
    "duration": 4.62
  },
  {
    "text": "since it's not rare that PMCs get 3–4 times the average salary of a regular US soldier for doing a similar job.",
    "start": 49.92,
    "duration": 6.76
  },
  {
    "text": "Another drawback is that a lot of them act like drunken frat boys with guns.",
    "start": 56.68,
    "duration": 4.36
  },
  {
    "text": "For instance, in late December 2006, a very drunk private military contractor left a Christmas party",
    "start": 61.04,
    "duration": 5.8
  },
  {
    "text": "and stumbled through Baghdad's Green Zone, eventually encountering a bodyguard of the Iraqi vice president.",
    "start": 66.84,
    "duration": 5.56
  },
  {
    "text": "Some argument ensued, and the military contractor pulled out his gun and killed the bodyguard.",
    "start": 72.4,
    "duration": 4.7
  },
  {
    "text": "A bit earlier than that, in November 2004, two private contractors were tasked with",
    "start": 77.1,
    "duration": 4.28
  },
  {
    "text": "delivering a couple of US military officials to some location in Afghanistan.",
    "start": 81.38,
    "duration": 3.96
  },
  {
    "text": "A later investigation showed the two pilots deliberately flying the nonstandard route",
    "start": 85.34,
    "duration": 4.24
  },
  {
    "text": "low through the valley for fun.",
    "start": 89.58,
    "duration": 1.64
  },
  {
    "text": "Now, the airplane they used for this job had a cockpit voice recorder installed,",
    "start": 91.22,
    "duration": 3.42
  },
  {
    "text": "so we have a transcript of what was said inside the plane.",
    "start": 94.64,
    "duration": 2.48
  },
  {
    "text": "For instance, \"Yeah, this is fun!\" and \"Yeah, you're an X-wing fighter Star Wars man!\"",
    "start": 97.12,
    "duration": 6.62
  },
  {
    "text": "as well as \"I swear to god, they wouldn't pay me if they knew how much fun this was!\"",
    "start": 103.74,
    "duration": 4.36
  },
  {
    "text": "that last sentence being the literal last sentence of the pilot in charge",
    "start": 108.1,
    "duration": 4.32
  },
  {
    "text": "before the airplane crashed into a mountain range, killing all 6 passengers.",
    "start": 112.42,
    "duration": 3.76
  },
  {
    "text": "The contractors used in these 2 examples were employed by the company Blackwater.",
    "start": 116.18,
    "duration": 4.12
  },
  {
    "text": "More on these guys later.",
    "start": 120.3,
    "duration": 1.44
  },
  {
    "text": "Now, what does this have to do with the American news network Fox News?",
    "start": 121.74,
    "duration": 4.26
  },
  {
    "text": "Well, firstly, Fox News is a disgraceful hate-for-profit racket with no redeeming qualities.",
    "start": 126.0,
    "duration": 5.48
  },
  {
    "text": "This is not going to be one of those videos where I pretend that there are 2 legitimate sides to an issue,",
    "start": 131.48,
    "duration": 4.36
  },
  {
    "text": "because there aren't. While all for-profit media is biased in some form or another,",
    "start": 135.84,
    "duration": 4.58
  },
  {
    "text": "they are not all equally as biased.",
    "start": 140.42,
    "duration": 2.48
  },
  {
    "text": "Fox News, at this point in 2019, for the most part only serves the agenda of the Republican Party.",
    "start": 142.9,
    "duration": 4.66
  },
  {
    "text": "to distract their base with nonsense like kneeling football players or whipping up white racial panic,",
    "start": 147.56,
    "duration": 5.14
  },
  {
    "text": "so they don't pay too much attention to the Republicans real agenda, which is serving the mega-wealthy.",
    "start": 152.7,
    "duration": 5.72
  },
  {
    "text": "It's also the reason your uncle can't stop talking about Hillary Clinton selling uranium to Russia",
    "start": 158.74,
    "duration": 4.54
  },
  {
    "text": "over Thanksgiving dinner, while you sit there in silence trying to remember the good times you had together",
    "start": 163.28,
    "duration": 5.1
  },
  {
    "text": "before Fox News and Facebook melted his brain.",
    "start": 168.38,
    "duration": 2.64
  },
  {
    "text": "I think this clip sums the network up nicely:",
    "start": 171.02,
    "duration": 2.54
  },
  {
    "text": "We saw in Charlottesville fringe fanatics who don't represent this country.",
    "start": 173.92,
    "duration": 4.04
  },
  {
    "text": "America is not a racist nation. It's time we stop acting like it is.",
    "start": 177.96,
    "duration": 4.64
  },
  {
    "text": "Not sure what we're gonna do next, but we have a great show.",
    "start": 183.54,
    "duration": 4.42
  },
  {
    "text": "Are Maxine Waters and Susan Rice siding with the North Korean dictator? We'll debate it next.",
    "start": 187.96,
    "duration": 5.64
  },
  {
    "text": "And later, guys with guns threatening President Trump over food stamps.",
    "start": 193.6,
    "duration": 3.88
  },
  {
    "text": "There are a bunch of things one can criticize Fox News for,",
    "start": 197.74,
    "duration": 2.94
  },
  {
    "text": "hosting Tucker Carlson's white power hour 5 times a week surely being very high up on the list,",
    "start": 200.68,
    "duration": 4.96
  },
  {
    "text": "but from time to time they outdo themselves.",
    "start": 205.64,
    "duration": 2.46
  },
  {
    "text": "Over the last couple of months, there have been multiple appearances on Fox News by 2 people named",
    "start": 208.1,
    "duration": 4.82
  },
  {
    "text": "Gina Keating and Michael Flaherty, who just launched a podcast called Raven 23: Presumption of Guilt.",
    "start": 212.92,
    "duration": 6.56
  },
  {
    "text": "But before we go any further, I should clarify that this is about much more than some shitty podcast.",
    "start": 219.48,
    "duration": 4.74
  },
  {
    "text": "After seeing this segment, I fell down a rabbit hole. It turns out this segment is much more relevant",
    "start": 224.22,
    "duration": 4.3
  },
  {
    "text": "to current politics than you might initially think. Anyway, let's take a look:",
    "start": 228.52,
    "duration": 4.04
  },
  {
    "text": "Back in 2007, 4 Blackwater contractors were tasked with defending American diplomats",
    "start": 233.16,
    "duration": 5.94
  },
  {
    "text": "at the height of the Iraq War. Remember, 2007, dangerous times.",
    "start": 239.1,
    "duration": 3.38
  },
  {
    "text": "The men were found guilty of killing Iraqi civilians. They maintained their innocence, saying they were ambushed.",
    "start": 242.48,
    "duration": 5.78
  },
  {
    "text": "Our next guests are telling the Blackwater story in the brand-new podcast, out today,",
    "start": 248.26,
    "duration": 4.7
  },
  {
    "text": "Raven 23: Presumption of Guilt.",
    "start": 252.96,
    "duration": 3.06
  },
  {
    "text": "The creators and producers, Michael Flaherty and Gina Keating, join us now. Thank you both for being here.",
    "start": 256.02,
    "duration": 5.2
  },
  {
    "text": "I've learned a lot about this story. This show has covered Eddie Gallagher, Matt Golsteyn, Clint Lorance,",
    "start": 261.22,
    "duration": 5.92
  },
  {
    "text": "guys in prison for questionable situations. This one's as bad as it gets.",
    "start": 267.14,
    "duration": 5.28
  },
  {
    "text": "So, it's pretty clear what Fox News presents this as:",
    "start": 272.74,
    "duration": 3.38
  },
  {
    "text": "4 guys questionably imprisoned for actions committed overseas.",
    "start": 276.12,
    "duration": 3.62
  },
  {
    "text": "The real meat of this segment comes when one of the producers attempts to explain",
    "start": 279.74,
    "duration": 4.18
  },
  {
    "text": "what these guys have been prosecuted for.",
    "start": 283.92,
    "duration": 2.1
  },
  {
    "text": "Explain what happened. Raven 23 is the call sign of these 4 contractors. What happened in Iraq that day?",
    "start": 286.52,
    "duration": 5.66
  },
  {
    "text": "They were called to clear a route so that a diplomat who was at a location that had just been bombed",
    "start": 292.68,
    "duration": 5.74
  },
  {
    "text": "could come through and go safely to the Green Zone.",
    "start": 298.42,
    "duration": 2.56
  },
  {
    "text": "That person had just been bombed and they're evacuating?",
    "start": 300.98,
    "duration": 2.14
  },
  {
    "text": "Exactly. And this is in September, when there was an average of 2 attacks a day.",
    "start": 303.12,
    "duration": 4.32
  },
  {
    "text": "They had developed a great new technique where they would detonate a car bomb,",
    "start": 307.44,
    "duration": 5.12
  },
  {
    "text": "people would swarm to go protect people, and then they would ambush them.",
    "start": 312.56,
    "duration": 3.34
  },
  {
    "text": "A secondary ambush?",
    "start": 315.9,
    "duration": 1.82
  },
  {
    "text": "Exactly. So they get to this traffic circle in Nisour Square and are immediately fired upon.",
    "start": 317.76,
    "duration": 6.16
  },
  {
    "text": "And then a car comes through the stopped traffic, and they believe it's a car bomb.",
    "start": 323.92,
    "duration": 5.22
  },
  {
    "text": "They fire at it, they neutralize the threat, and then one of their vehicles is disabled,",
    "start": 329.14,
    "duration": 7.34
  },
  {
    "text": "they tow it out, go back to the Green Zone, don't think anything about it.",
    "start": 336.48,
    "duration": 3.82
  },
  {
    "text": "Because this sort of thing happens every day in Iraq.",
    "start": 340.3,
    "duration": 2.7
  },
  {
    "text": "Another day on the job in Iraq. I was in Iraq '05–06, encountered situations just like this.",
    "start": 343.0,
    "duration": 5.64
  },
  {
    "text": "Split-second decisions, violence happened fast, enemy using nasty tactics.",
    "start": 348.64,
    "duration": 4.72
  },
  {
    "text": "Hmm, that's odd.",
    "start": 354.0,
    "duration": 1.58
  },
  {
    "text": "From what Gina Keating is saying, it seems like there isn't even any space",
    "start": 355.58,
    "duration": 3.08
  },
  {
    "text": "where these people could have theoretically acted criminally.",
    "start": 358.66,
    "duration": 2.94
  },
  {
    "text": "They enter a square, are fired upon, and take out a car that they believe to be a car bomb.",
    "start": 361.6,
    "duration": 4.5
  },
  {
    "text": "Apparently, this happened every single day in Iraq,",
    "start": 366.1,
    "duration": 2.78
  },
  {
    "text": "and the Fox News host even reiterates that he encountered situations just like this.",
    "start": 368.88,
    "duration": 4.5
  },
  {
    "text": "Nothing out of the ordinary, it would seem.",
    "start": 373.38,
    "duration": 3.42
  },
  {
    "text": "Where it gets more interesting, though, is when you realize what's omitted.",
    "start": 376.8,
    "duration": 3.28
  },
  {
    "text": "Because Gina Keating does not say that the car they believed to be a car bomb was not a car bomb",
    "start": 380.08,
    "duration": 5.26
  },
  {
    "text": "but was driven by a 19-year-old medical student.",
    "start": 385.34,
    "duration": 2.66
  },
  {
    "text": "And if you're unfamiliar with this fateful day in Iraq, this is where you probably suspect there's something fishy",
    "start": 388.0,
    "duration": 5.4
  },
  {
    "text": "about this story as it's presented, and you would be right to do so.",
    "start": 393.4,
    "duration": 3.58
  },
  {
    "text": "Because this everyday occurrence that there is definitely nothing special about",
    "start": 396.98,
    "duration": 4.42
  },
  {
    "text": "went down in history as the Nisour Square massacre,",
    "start": 401.42,
    "duration": 2.76
  },
  {
    "text": "which Gina Keating calls \"the Nisour Square incident\" on their podcast, by the way.",
    "start": 404.18,
    "duration": 4.24
  },
  {
    "text": "In short, what Gina Keating described as \"neutralizing the threat\" ended with the death of 17 Iraqi civilians,",
    "start": 408.42,
    "duration": 6.46
  },
  {
    "text": "one among them a 9-year-old boy who died of a gunshot wound to the head.",
    "start": 414.88,
    "duration": 3.9
  },
  {
    "text": "None of that is mentioned in this segment.",
    "start": 418.78,
    "duration": 2.42
  },
  {
    "text": "In fact, you could come away from this not even being aware that there were any victims—",
    "start": 421.2,
    "duration": 4.38
  },
  {
    "text": "besides the four noble mercenaries, of course.",
    "start": 425.58,
    "duration": 3.14
  },
  {
    "text": "So just for the record, Gina Keating's account of this massacre is greatly skewed",
    "start": 428.72,
    "duration": 4.08
  },
  {
    "text": "to make the people in question look innocent.",
    "start": 432.8,
    "duration": 2.42
  },
  {
    "text": "For instance, the claim that the Blackwater mercenaries were immediately fired upon entering Nisour Square",
    "start": 435.22,
    "duration": 5.28
  },
  {
    "text": "does not corroborate with eyewitness accounts and could not be proven in court.",
    "start": 440.5,
    "duration": 4.2
  },
  {
    "text": "Later in the segment, Gina Keating alleges the investigation was outsourced to an Iraqi jihadist,",
    "start": 444.7,
    "duration": 5.56
  },
  {
    "text": "obviously trying to discredit the findings of the Iraqi investigation into the massacre.",
    "start": 450.26,
    "duration": 3.86
  },
  {
    "text": "Unfortunately for her, though, the findings of the investigation done by Iraqi authorities",
    "start": 454.12,
    "duration": 4.4
  },
  {
    "text": "largely match with the findings of an inspection by the US military.",
    "start": 458.52,
    "duration": 3.6
  },
  {
    "text": "Quoting from a Washington Post article:",
    "start": 462.12,
    "duration": 1.98
  },
  {
    "text": "And while this person wanted to remain anonymous, US Army soldiers arriving at Nisour Square",
    "start": 482.94,
    "duration": 4.68
  },
  {
    "text": "roughly 20 minutes after the massacre paint a similar image:",
    "start": 487.62,
    "duration": 3.32
  },
  {
    "text": "So it appears Gina Keating is lying, which she is in an exceptionally disgusting way, if I may say so.",
    "start": 533.88,
    "duration": 5.8
  },
  {
    "text": "But if she was pushed to explain what she is basing her account on,",
    "start": 539.68,
    "duration": 2.98
  },
  {
    "text": "it would most likely be the findings in a leaked report by the US State Department.",
    "start": 542.66,
    "duration": 3.84
  },
  {
    "text": "This report actually did state that the Blackwater contractors were fired upon by 8–10 people,",
    "start": 546.5,
    "duration": 5.4
  },
  {
    "text": "partially disguised as civilians, shortly after entering Nisour Square.",
    "start": 551.9,
    "duration": 3.66
  },
  {
    "text": "Strangely, this report doesn't speak of any civilian casualties or injuries.",
    "start": 555.56,
    "duration": 4.76
  },
  {
    "text": "And given that the report apparently was drafted on the same day as the shooting took place,",
    "start": 560.32,
    "duration": 4.06
  },
  {
    "text": "it being based on a thorough investigation seems, let's say, unlikely.",
    "start": 564.38,
    "duration": 3.9
  },
  {
    "text": "So why would the State Department draft this report? It seems somewhat unprofessional.",
    "start": 568.28,
    "duration": 4.24
  },
  {
    "text": "Until you realize that this leaked report was written by a different Blackwater contractor",
    "start": 572.52,
    "duration": 4.62
  },
  {
    "text": "and is not based on an official investigation by the US government.",
    "start": 577.14,
    "duration": 3.44
  },
  {
    "text": "And we'll get back to the State Department's role in this later, but now let's listen to the next attempt",
    "start": 580.58,
    "duration": 4.4
  },
  {
    "text": "to convince Fox News viewers that there's some conspiracy at play here.",
    "start": 584.98,
    "duration": 4.08
  },
  {
    "text": "Initially they were exonerated from this. Am I correct?",
    "start": 589.5,
    "duration": 2.4
  },
  {
    "text": "Oh, yes. In a scathing, 90-page opinion, a federal judge that President Clinton appointed to the bench",
    "start": 591.9,
    "duration": 9.24
  },
  {
    "text": "talked about all of the prosecutorial misconduct that happened and the withholding of the evidence",
    "start": 601.14,
    "duration": 5.8
  },
  {
    "text": "and how the defendants' civil rights were violated.",
    "start": 606.94,
    "duration": 4.12
  },
  {
    "text": "Again, getting back to one of the themes of this video, what is important is what producer Michael Flaherty",
    "start": 611.06,
    "duration": 5.34
  },
  {
    "text": "is not saying in his statement here and what information he chooses to give us.",
    "start": 616.4,
    "duration": 4.1
  },
  {
    "text": "Initially the case was dismissed, by a judge appointed by Bill Clinton in a \"scathing\" report",
    "start": 620.5,
    "duration": 5.92
  },
  {
    "text": "detailing misconduct on the part of the prosecutors.",
    "start": 626.42,
    "duration": 2.4
  },
  {
    "text": "What he does not really reveal is why the case was dismissed.",
    "start": 628.82,
    "duration": 3.82
  },
  {
    "text": "The way he presents this would lead you to believe these people are being framed for crimes they didn't commit.",
    "start": 632.64,
    "duration": 4.56
  },
  {
    "text": "In reality, the case was not thrown out because it was demonstrable",
    "start": 637.2,
    "duration": 2.96
  },
  {
    "text": "that these defendants didn't commit a crime, but because of something else.",
    "start": 640.16,
    "duration": 3.62
  },
  {
    "text": "As part of this indictment, the government prosecutors introduced statements given by the involved",
    "start": 643.78,
    "duration": 4.46
  },
  {
    "text": "Blackwater contractors to the State Department directly after the shooting.",
    "start": 648.24,
    "duration": 3.58
  },
  {
    "text": "Now, normally when a group of people is being questioned for gunning down 17 unarmed civilians,",
    "start": 651.82,
    "duration": 5.68
  },
  {
    "text": "they are informed that they have the right to remain silent and that everything they say",
    "start": 657.5,
    "duration": 3.3
  },
  {
    "text": "can be used against them. In our case, it was the other way around.",
    "start": 660.8,
    "duration": 4.36
  },
  {
    "text": "These statements were made under the assumption given by the State Department",
    "start": 665.16,
    "duration": 3.28
  },
  {
    "text": "that they wouldn't be used in a court of law. A military law expert by the name of Scott Horton",
    "start": 668.44,
    "duration": 4.96
  },
  {
    "text": "had the following to say about this rather odd practice by the State Department:",
    "start": 673.4,
    "duration": 4.26
  },
  {
    "text": "And Scott Horton was correct in his assessment. The case was thrown out because the prosecutors",
    "start": 707.64,
    "duration": 4.42
  },
  {
    "text": "could not demonstrate a legitimate reason for using these specific statements. According to the judge:",
    "start": 712.06,
    "duration": 5.16
  },
  {
    "text": "This judge's decision was later overturned, by the way.",
    "start": 729.28,
    "duration": 2.72
  },
  {
    "text": "But anyhow, let me just emphasize that this is now the second time the State Department,",
    "start": 732.0,
    "duration": 4.9
  },
  {
    "text": "which is to say the US government, is involved in questionable activities regarding Blackwater.",
    "start": 736.9,
    "duration": 5.08
  },
  {
    "text": "The reason why I think this is important to note is because Gina Keating and Michael Flaherty",
    "start": 741.98,
    "duration": 4.14
  },
  {
    "text": "do their best to present the sentencing of these four Blackwater contractors",
    "start": 746.12,
    "duration": 3.36
  },
  {
    "text": "as some witch hunt by the government, when it's demonstrable that actions by the State Department",
    "start": 749.48,
    "duration": 4.26
  },
  {
    "text": "have actually benefited them and arguably prevented an earlier sentencing.",
    "start": 753.74,
    "duration": 3.82
  },
  {
    "text": "Here's what the House Oversight Committee wrote about the line of action by the State Department",
    "start": 757.56,
    "duration": 4.04
  },
  {
    "text": "in an investigation regarding Nisour Square:",
    "start": 761.6,
    "duration": 2.46
  },
  {
    "text": "After this investigation, the State Department's inspector general was forced to resign",
    "start": 778.92,
    "duration": 4.62
  },
  {
    "text": "because he was accused of interfering with investigations regarding Blackwater.",
    "start": 783.54,
    "duration": 3.96
  },
  {
    "text": "To pretend the State had it out for our four Blackwater contractors is preposterous.",
    "start": 787.52,
    "duration": 5.68
  },
  {
    "text": "For most of the occupation of Iraq, private military contractors were even completely immune",
    "start": 793.2,
    "duration": 4.56
  },
  {
    "text": "from prosecution in Iraq, and thus held to a much lower standard than regular US soldiers.",
    "start": 797.76,
    "duration": 4.78
  },
  {
    "text": "And you can guess three times which company was tasked with protecting State Department diplomats in Iraq.",
    "start": 802.54,
    "duration": 5.0
  },
  {
    "text": "A last clip from this Fox News segment, and then we'll turn to something else.",
    "start": 807.54,
    "duration": 3.84
  },
  {
    "text": "So they're making tough calls on the battlefield.",
    "start": 811.98,
    "duration": 1.4
  },
  {
    "text": "Today, though, however, three of the four, and soon to be four, are in jail for 30 years, convicted by a civilian court.",
    "start": 813.38,
    "duration": 7.08
  },
  {
    "text": "Part of the reason that happened is Joe Biden and Hillary Clinton stepped in",
    "start": 820.46,
    "duration": 4.28
  },
  {
    "text": "when there was politics being played about Iraq.",
    "start": 824.74,
    "duration": 1.96
  },
  {
    "text": "Here's a portion of what former vice president Biden said at the time. Watch:",
    "start": 826.7,
    "duration": 3.3
  },
  {
    "text": "Let me take this opportunity to express my personal regret (excuse me) for the violence in Kisour [sic]",
    "start": 831.34,
    "duration": 8.6
  },
  {
    "text": "involving Blackwater employees in 2007. The United States is determined, determined to hold accountable",
    "start": 839.94,
    "duration": 8.1
  },
  {
    "text": "anyone who commits crimes against the Iraqi people.",
    "start": 848.04,
    "duration": 3.9
  },
  {
    "text": "While we fully respect the independence and integrity of the US judicial system,",
    "start": 851.94,
    "duration": 4.82
  },
  {
    "text": "we were disappointed by the judge's decision to dismiss the indictment.",
    "start": 856.76,
    "duration": 4.9
  },
  {
    "text": "Today I'm announcing that the United States government will appeal this decision.",
    "start": 861.66,
    "duration": 5.92
  },
  {
    "text": "So it's called Raven 23, but you could call them the Biden 4, because because of political negotiations",
    "start": 867.92,
    "duration": 4.96
  },
  {
    "text": "President Biden [sic] and others reopened this case and made these guys vulnerable.",
    "start": 872.88,
    "duration": 4.02
  },
  {
    "text": "So, despite the State Department repeatedly acting to the benefit of Blackwater contractors",
    "start": 877.4,
    "duration": 4.92
  },
  {
    "text": "and the United States denying Iraq to put these men on trial—you know, because it happened there",
    "start": 882.32,
    "duration": 4.22
  },
  {
    "text": "and the victims were Iraqi citizens—Joe Biden vowing to appeal the previous ruling is supposedly evidence",
    "start": 886.54,
    "duration": 5.64
  },
  {
    "text": "that this case is just a chip in a political poker game.",
    "start": 892.18,
    "duration": 2.9
  },
  {
    "text": "Sadly, we don't even get an explanation of why Biden would want to appeal the case.",
    "start": 895.08,
    "duration": 4.5
  },
  {
    "text": "Fox just shows him saying that they are disappointed and that they will appeal.",
    "start": 899.58,
    "duration": 3.36
  },
  {
    "text": "Now, it's not that Biden didn't give a reason.",
    "start": 902.94,
    "duration": 2.6
  },
  {
    "text": "Maybe you noticed that little transition effect there in the middle of the clip.",
    "start": 905.54,
    "duration": 3.24
  },
  {
    "text": "It's not unusual for news channels to cut out parts of a politician's speech so the segment doesn't drag,",
    "start": 908.78,
    "duration": 4.74
  },
  {
    "text": "or because that specific part is not relevant. This is not the case here.",
    "start": 913.52,
    "duration": 4.02
  },
  {
    "text": "Fox News only cut out half of two highly relevant sentences.",
    "start": 917.54,
    "duration": 4.66
  },
  {
    "text": "Let's just play the relevant part back-to-back and you'll see what I mean.",
    "start": 922.2,
    "duration": 3.52
  },
  {
    "text": "We were disappointed by the judge's decision to dismiss the indictment.",
    "start": 925.72,
    "duration": 4.64
  },
  {
    "text": "Today I'm announcing that the United States government will appeal this decision.",
    "start": 930.36,
    "duration": 5.68
  },
  {
    "text": "And now let's watch the uncut version of what he said.",
    "start": 936.04,
    "duration": 2.52
  },
  {
    "text": "We were disappointed by the judge's decision to dismiss the indictment,",
    "start": 938.56,
    "duration": 5.12
  },
  {
    "text": "which was based on the way in which some evidence had been acquired.",
    "start": 943.68,
    "duration": 5.94
  },
  {
    "text": "A dismissal, I want to make clear, is not an acquittal. And today, I'm announcing",
    "start": 949.62,
    "duration": 5.9
  },
  {
    "text": "that the United States government will appeal this decision.",
    "start": 955.52,
    "duration": 3.98
  },
  {
    "text": "This is probably the most obvious giveaway that Fox News and the guests in this segment",
    "start": 959.5,
    "duration": 4.5
  },
  {
    "text": "want to point their audience in a specific direction.",
    "start": 964.0,
    "duration": 2.36
  },
  {
    "text": "Sometimes that's unavoidable when reporting on a set of objective facts,",
    "start": 966.36,
    "duration": 4.12
  },
  {
    "text": "but it's clear that the viewer shouldn't even be introduced to the idea",
    "start": 970.48,
    "duration": 2.92
  },
  {
    "text": "that this conviction might be the result of a legitimate atrocity.",
    "start": 973.4,
    "duration": 3.38
  },
  {
    "text": "Also, that Joe Biden, who was an ardent supporter of the Iraq War,",
    "start": 976.78,
    "duration": 3.96
  },
  {
    "text": "is now this anti-American figure doing the bidding of the Iraqi government is absurd.",
    "start": 980.74,
    "duration": 4.86
  },
  {
    "text": "You know, I talk a lot about events being dishonestly framed on this channel,",
    "start": 985.6,
    "duration": 3.56
  },
  {
    "text": "but the extent here is honestly some next-level stuff.",
    "start": 989.16,
    "duration": 2.72
  },
  {
    "text": "There are plenty of legitimate reasons to detest Hillary Clinton or Joe Biden,",
    "start": 991.88,
    "duration": 4.04
  },
  {
    "text": "but Fox News isn't going for legitimate critique here. They want the viewer to come away from this",
    "start": 995.92,
    "duration": 4.92
  },
  {
    "text": "thinking that Joe Biden wanted to lock up 4 highly decorated veterans, just because.",
    "start": 1000.84,
    "duration": 5.22
  },
  {
    "text": "In fact, that the first court didn't clear the Blackwater contractors of wrongdoing,",
    "start": 1006.06,
    "duration": 4.18
  },
  {
    "text": "but threw out the case because of the prosecution's alleged misconduct, stays omitted in this entire segment.",
    "start": 1010.24,
    "duration": 5.5
  },
  {
    "text": "Now we're going to put Fox News to the side for a second and talk about the Nisour Square massacre",
    "start": 1015.74,
    "duration": 3.82
  },
  {
    "text": "and how it happened. Descriptions of graphic violence ahead, folks.",
    "start": 1019.56,
    "duration": 3.48
  },
  {
    "text": "The story of what is also called Iraq's Bloody Sunday is partially the story of Blackwater,",
    "start": 1023.04,
    "duration": 4.66
  },
  {
    "text": "which originally started out as a small company in the swamps of North Carolina,",
    "start": 1027.7,
    "duration": 3.94
  },
  {
    "text": "but by the time its employees committed the massacre at Nisour Square",
    "start": 1031.64,
    "duration": 2.88
  },
  {
    "text": "had become a frightening new face of the US war machine.",
    "start": 1034.52,
    "duration": 3.58
  },
  {
    "text": "Now, in my mind the relevant history of this company starts with a speech by the US Secretary of Defense",
    "start": 1038.1,
    "duration": 5.22
  },
  {
    "text": "Donald Rumsfeld warning of a great new enemy for the United States.",
    "start": 1043.32,
    "duration": 3.94
  },
  {
    "text": "Now, what Rumsfeld is warning of in such a dramatic way isn't al-Qaeda or Saddam Hussein but bureaucracy.",
    "start": 1079.08,
    "duration": 6.18
  },
  {
    "text": "This was his way of announcing the sweeping privatization of the US Department of Defense.",
    "start": 1085.26,
    "duration": 4.64
  },
  {
    "text": "What is perhaps the most important thing about this speech is when it was held,",
    "start": 1089.9,
    "duration": 4.4
  },
  {
    "text": "that being September 10, 2001, one day before the 9/11 attacks.",
    "start": 1094.3,
    "duration": 5.04
  },
  {
    "text": "To cut things short, the ensuing war on terror was a welcome opportunity for Rumsfeld, as well as others,",
    "start": 1099.34,
    "duration": 5.2
  },
  {
    "text": "to privatize the war business, and what followed was a new gold rush for private companies providing services",
    "start": 1104.54,
    "duration": 5.36
  },
  {
    "text": "usually left to the military. And few of these companies had such a meteoric rise as Blackwater",
    "start": 1109.9,
    "duration": 5.0
  },
  {
    "text": "and its founder Erik Prince, who is a rabid Christian fundamentalist, by the way.",
    "start": 1114.9,
    "duration": 4.02
  },
  {
    "text": "And when I say \"meteoric rise\", I'm not exaggerating.",
    "start": 1118.92,
    "duration": 3.44
  },
  {
    "text": "According to an investigation by the Congressional Oversight Committee,",
    "start": 1122.36,
    "duration": 3.08
  },
  {
    "text": "Blackwater had about $737,000 in federal contracts in 2001. By 2006, that number had risen to $593 million.",
    "start": 1125.44,
    "duration": 9.92
  },
  {
    "text": "About an increase of 80,000% in five years.",
    "start": 1135.36,
    "duration": 4.3
  },
  {
    "text": "Coalition of the willing? More like \"coalition of the billing\", am I right?",
    "start": 1139.66,
    "duration": 4.44
  },
  {
    "text": "In the summer of 2007, there were actually more private military contractors on behalf of the US government",
    "start": 1144.1,
    "duration": 5.36
  },
  {
    "text": "in Iraq than actual US soldiers. When it comes to Blackwater, they were mostly tasked with",
    "start": 1149.46,
    "duration": 5.74
  },
  {
    "text": "protecting US diplomats going from point A to point B,",
    "start": 1155.2,
    "duration": 2.92
  },
  {
    "text": "and here's where we can get to the massacre at Nisour Square. The account you're going to hear from me",
    "start": 1158.12,
    "duration": 4.18
  },
  {
    "text": "is largely based on the work of investigative journalist Jeremy Scahill,",
    "start": 1162.3,
    "duration": 3.32
  },
  {
    "text": "who wrote multiple articles as well as a book on Blackwater.",
    "start": 1165.62,
    "duration": 3.1
  },
  {
    "text": "On September 16, 2007, a Blackwater convoy entered Nisour Square shortly after 12pm,",
    "start": 1168.72,
    "duration": 6.26
  },
  {
    "text": "seeking to clear the congested intersection so a US diplomat could pass through.",
    "start": 1174.98,
    "duration": 4.02
  },
  {
    "text": "Nearby Iraqi police officers direct the traffic to stop, including a white sedan",
    "start": 1179.0,
    "duration": 4.44
  },
  {
    "text": "driven by a young medical student named Ahmed with his mother Mahassin in the passenger seat.",
    "start": 1183.44,
    "duration": 4.6
  },
  {
    "text": "According to the Blackwater contractors, the white sedan aggressively approached their convoy",
    "start": 1188.04,
    "duration": 5.14
  },
  {
    "text": "and did not react to hand signs, a claim contradicted by scores of eyewitnesses.",
    "start": 1193.18,
    "duration": 4.78
  },
  {
    "text": "One of the present Iraqi police officers named Ali Khalaf Salman",
    "start": 1197.96,
    "duration": 3.52
  },
  {
    "text": "remembers the Blackwater convoy coming to an abrupt halt",
    "start": 1201.48,
    "duration": 2.94
  },
  {
    "text": "and the gun on top of the vehicle, marked with a little \"4\" on this reconstruction,",
    "start": 1204.42,
    "duration": 3.6
  },
  {
    "text": "began to fire his weapon, quote, \"randomly\".",
    "start": 1208.02,
    "duration": 2.7
  },
  {
    "text": "In this moment, police officer Salman looks toward Yarmouk Street, sees the white sedan",
    "start": 1210.72,
    "duration": 4.6
  },
  {
    "text": "with a busted windshield, and hears a woman screaming \"My son, my son!\" and runs towards the car.",
    "start": 1215.32,
    "duration": 5.28
  },
  {
    "text": "Another police officer nearby named Sarhan Thiab also runs to the sedan wanting to help the people inside.",
    "start": 1220.6,
    "duration": 5.58
  },
  {
    "text": "\"I saw the left side of his head was destroyed and his mother was crying out 'My son, my son, help me!' \"",
    "start": 1226.18,
    "duration": 6.2
  },
  {
    "text": "Officer Khalaf now raises his left arm to signal the Blackwater convoy to stop shooting.",
    "start": 1232.38,
    "duration": 4.52
  },
  {
    "text": "As of this moment, Ahmed's dead body is still in the driver's seat, perhaps with his foot on the accelerator,",
    "start": 1236.9,
    "duration": 5.34
  },
  {
    "text": "and while the two police officers are standing next to the car, it begins to roll forward.",
    "start": 1242.24,
    "duration": 4.46
  },
  {
    "text": "It is also noteworthy that this sedan had an automatic transmission, which is why the engine didn't immediately stall.",
    "start": 1246.7,
    "duration": 5.44
  },
  {
    "text": "Quoting from Jeremy Scahill's book directly now:",
    "start": 1252.14,
    "duration": 2.72
  },
  {
    "text": "The last eyewitness account we're going to take a look at is from Mohammed Abdul Razaaq,",
    "start": 1338.92,
    "duration": 4.14
  },
  {
    "text": "who is the father of the 9-year-old boy who was killed in the shooting.",
    "start": 1343.06,
    "duration": 3.38
  },
  {
    "text": "After this, Razzaq returned to Nisour Square to collect pieces of his son's head",
    "start": 1389.76,
    "duration": 4.24
  },
  {
    "text": "and bury them in the Shiite holy city of Najaf.",
    "start": 1394.0,
    "duration": 2.8
  },
  {
    "text": "I'm sorry we had to go through this in such excruciating detail, but now you might have an idea",
    "start": 1396.8,
    "duration": 4.28
  },
  {
    "text": "of what hides behind Gina Keating's statement when she says \"neutralized the threat\".",
    "start": 1401.08,
    "duration": 5.06
  },
  {
    "text": "So, what happened at Nisour Square?",
    "start": 1406.14,
    "duration": 2.02
  },
  {
    "text": "Only the people involved will ever truly know, but if we go by what multiple United States juries went by,",
    "start": 1408.16,
    "duration": 4.5
  },
  {
    "text": "Nicholas Slatten acted recklessly in firing his gun from one of the Blackwater trucks at the sedan",
    "start": 1412.66,
    "duration": 5.18
  },
  {
    "text": "which didn't pose a threat to him or anyone else.",
    "start": 1417.84,
    "duration": 2.48
  },
  {
    "text": "His colleagues, like the turret gunner, panicked and started firing at everything that moved",
    "start": 1420.32,
    "duration": 4.64
  },
  {
    "text": "out of the fear of becoming the target of an attack by insurgents.",
    "start": 1424.96,
    "duration": 3.38
  },
  {
    "text": "According to some eyewitnesses, there were attempts by at least one of the contractors",
    "start": 1428.34,
    "duration": 3.84
  },
  {
    "text": "to get his colleagues to stop firing, and the words \"cease fire\" were allegedly yelled multiple times,",
    "start": 1432.18,
    "duration": 5.18
  },
  {
    "text": "but seemingly to no effect.",
    "start": 1437.36,
    "duration": 1.64
  },
  {
    "text": "As our Fox News host says, sometimes in war you have to make split-second decisions.",
    "start": 1439.0,
    "duration": 5.0
  },
  {
    "text": "But judging from aerial pictures taken of Nisour Square, we can see that the white sedan",
    "start": 1444.0,
    "duration": 4.24
  },
  {
    "text": "didn't even reach the square when it came to a standstill, after Nicholas Slatten had already fired his gun",
    "start": 1448.24,
    "duration": 5.82
  },
  {
    "text": "and the car started moving forward.",
    "start": 1454.06,
    "duration": 1.86
  },
  {
    "text": "Now, why did he act so recklessly, you might ask.",
    "start": 1455.92,
    "duration": 3.0
  },
  {
    "text": "Well, why don't we read a short paragraph from the court documents of United States v. Slatten",
    "start": 1458.92,
    "duration": 5.24
  },
  {
    "text": "from September 2019.",
    "start": 1464.16,
    "duration": 1.78
  },
  {
    "text": "Slatten's response to these accusations was not to deny them but to claim they are irrelevant",
    "start": 1517.02,
    "duration": 4.68
  },
  {
    "text": "since it was pretty common around his colleagues to hate Iraqis. To which the court replied:",
    "start": 1521.7,
    "duration": 4.54
  },
  {
    "text": "And I don't think I have to add anything to that.",
    "start": 1541.78,
    "duration": 2.24
  },
  {
    "text": "Although, in Slatten's defense, maybe hating Iraqis was an unofficial company policy,",
    "start": 1544.02,
    "duration": 4.94
  },
  {
    "text": "since Erik Prince, the founder of Blackwater, described them as \"chanting barbarians\" in his memoir",
    "start": 1548.96,
    "duration": 5.84
  },
  {
    "text": "Civilian Warriors: the Inside Story of Blackwater and the Unsung Heroes of the War on Terror.",
    "start": 1554.8,
    "duration": 6.16
  },
  {
    "text": "Unsung heroes!",
    "start": 1560.96,
    "duration": 1.52
  },
  {
    "text": "After Nisour Square, Blackwater underwent a PR campaign to,",
    "start": 1562.48,
    "duration": 3.5
  },
  {
    "text": "you know, be less of a stand-in for war criminals,",
    "start": 1565.98,
    "duration": 2.64
  },
  {
    "text": "in which they changed the name and logo of the company several times.",
    "start": 1568.62,
    "duration": 3.14
  },
  {
    "text": "They also released a video game for the Xbox 360,",
    "start": 1571.76,
    "duration": 3.76
  },
  {
    "text": "and no, that video game didn't turn out to be Spec Ops: The Line...",
    "start": 1575.52,
    "duration": 4.44
  },
  {
    "text": "We didn't have a choice, he turned us into fucking killers!",
    "start": 1580.2,
    "duration": 3.92
  },
  {
    "text": "That's enough! That's enough!",
    "start": 1584.12,
    "duration": 2.2
  },
  {
    "text": "...but a Kinect game in which you, yes you, can dive into the experience of being a Blackwater mercenary.",
    "start": 1586.98,
    "duration": 5.12
  },
  {
    "text": "In a review of the game for Giant Bomb, Alex Navarro writes:",
    "start": 1592.1,
    "duration": 3.34
  },
  {
    "text": "I also love the sentence, \"If you buy Blackwater, the terrorists don't win.",
    "start": 1616.84,
    "duration": 5.04
  },
  {
    "text": "However, the next step below terrorists (mercenaries) do.",
    "start": 1621.88,
    "duration": 3.82
  },
  {
    "text": "Ultimately, Erik Prince sold the company, but he's far from being out of the mercenary business.",
    "start": 1625.7,
    "duration": 4.04
  },
  {
    "text": "As the Intercept reported in May 2019:",
    "start": 1629.74,
    "duration": 2.54
  },
  {
    "text": "Prince has good connections to the Trump administration, being the brother of Betsy DeVos,",
    "start": 1647.34,
    "duration": 3.88
  },
  {
    "text": "current United States Secretary of Education, and he himself is a political adviser to Trump.",
    "start": 1651.22,
    "duration": 4.54
  },
  {
    "text": "There isn't that much money to be made off the Iraq War now, though, so he switched his focus",
    "start": 1655.76,
    "duration": 4.04
  },
  {
    "text": "to trying to privatize the still-ongoing US involvement in Afghanistan.",
    "start": 1659.8,
    "duration": 3.92
  },
  {
    "text": "According to an op-ed he wrote, his pitch for the country is based on the historical model",
    "start": 1663.72,
    "duration": 3.98
  },
  {
    "text": "of the British East India Company, employing a viceroy in charge of the country.",
    "start": 1667.7,
    "duration": 4.7
  },
  {
    "text": "Now, I know this sounds bad, but it gets worse.",
    "start": 1672.4,
    "duration": 2.82
  },
  {
    "text": "According to a leaked presentation published by Buzzfeed News, Prince's idea to make his plan profitable",
    "start": 1675.22,
    "duration": 5.44
  },
  {
    "text": "is to exploit the country's large rare earth deposits, which, according to him,",
    "start": 1680.66,
    "duration": 4.26
  },
  {
    "text": "offer a value of up to 1 trillion US dollars.",
    "start": 1684.92,
    "duration": 2.58
  },
  {
    "text": "You really got to admire the transparency, though, because this, this is some real movie-villain stuff.",
    "start": 1687.5,
    "duration": 4.64
  },
  {
    "text": "Not that exploiting a country for resources hasn't been US policy before, but being that open about it",
    "start": 1692.14,
    "duration": 5.06
  },
  {
    "text": "and framing it explicitly as a colonialist endeavor is remarkable.",
    "start": 1697.2,
    "duration": 4.32
  },
  {
    "text": "Anyway, speaking of the Trump administration, here's where we get to why this is all even relevant",
    "start": 1701.52,
    "duration": 4.52
  },
  {
    "text": "and why I wanted to make this video. There's a reason Fox News gives a platform to this podcast",
    "start": 1706.04,
    "duration": 4.64
  },
  {
    "text": "and why conservative news sites like the National Review are now publishing articles",
    "start": 1710.68,
    "duration": 4.16
  },
  {
    "text": "arguing for the pardoning of these convicted war criminals.",
    "start": 1714.84,
    "duration": 2.92
  },
  {
    "text": "It is because with Trump in the White House, they have a chance for these guys to walk free.",
    "start": 1717.76,
    "duration": 4.06
  },
  {
    "text": "Trump has already pardoned other Americans convicted of war crimes, and the case of Nicholas Slatten,",
    "start": 1721.82,
    "duration": 5.06
  },
  {
    "text": "the first one to fire at Nisour Square, is among multiple cases the White House has requested",
    "start": 1726.88,
    "duration": 4.74
  },
  {
    "text": "to evaluate for a potential pardon.",
    "start": 1731.62,
    "duration": 2.0
  },
  {
    "text": "So I kind of want to get ahead of the narrative here.",
    "start": 1733.62,
    "duration": 2.22
  },
  {
    "text": "It is true that the conviction of Nicholas Slatten and his colleagues took a long time",
    "start": 1735.84,
    "duration": 3.5
  },
  {
    "text": "due to a number of mistrials and other delays, none of which speak to their innocence though.",
    "start": 1739.34,
    "duration": 4.06
  },
  {
    "text": "When this case was presented to a jury, they repeatedly reached the decision",
    "start": 1743.4,
    "duration": 3.28
  },
  {
    "text": "that Slatten is guilty of murder and his colleagues of manslaughter.",
    "start": 1746.68,
    "duration": 3.08
  },
  {
    "text": "He can call himself a \"prisoner of war in his own country\" all he wants.",
    "start": 1749.76,
    "duration": 3.96
  },
  {
    "text": "The truth is that, as judge and Vietnam War veteran Royce Lamberth put it,",
    "start": 1753.72,
    "duration": 3.94
  },
  {
    "text": "\"The jury got this one exactly right. This was murder.\"",
    "start": 1757.66,
    "duration": 3.54
  },
  {
    "text": "Another aspect when it came to making this video was that it seems like the Iraq War",
    "start": 1761.2,
    "duration": 3.84
  },
  {
    "text": "is undergoing this intellectualization at the moment, where the judgement in the mainstream is either",
    "start": 1765.04,
    "duration": 5.06
  },
  {
    "text": "the war was justified or the war was a mistake. Words like \"atrocity\" or any kind of analysis",
    "start": 1770.12,
    "duration": 5.54
  },
  {
    "text": "that considers the Iraqi people is almost completely missing from mainstream discourse.",
    "start": 1775.66,
    "duration": 4.08
  },
  {
    "text": "And you've seen this play out, where some \"analyst\" says the Iraq War was a horrible mistake,",
    "start": 1779.74,
    "duration": 4.5
  },
  {
    "text": "it destabilized the region, gave rise to ISIS, etc., but they don't go the rest of the way and admit",
    "start": 1784.24,
    "duration": 4.92
  },
  {
    "text": "that the main victims of US policy on Iraq have been innocent people.",
    "start": 1789.16,
    "duration": 3.84
  },
  {
    "text": "And not just after the invasion but before that, due to sanctions under Bill Clinton and other means.",
    "start": 1793.0,
    "duration": 4.42
  },
  {
    "text": "It's judged in a very detached and analytical manner, calculating the pros and cons for the United States.",
    "start": 1797.42,
    "duration": 5.52
  },
  {
    "text": "And this understanding of the Iraq War as a mistake at best is another reason",
    "start": 1802.94,
    "duration": 4.46
  },
  {
    "text": "why this podcast has been given a place on one of America's biggest news networks.",
    "start": 1807.4,
    "duration": 3.9
  },
  {
    "text": "Because the implication is that we Western nations act upon countries like Iraq,",
    "start": 1811.3,
    "duration": 4.88
  },
  {
    "text": "and if it's the other way around, like is the case for Nicholas Slatten and others, something must be afoul.",
    "start": 1816.18,
    "duration": 5.42
  },
  {
    "text": "So that's the political side to the motivation for this video. The other one is rather personal,",
    "start": 1821.6,
    "duration": 5.08
  },
  {
    "text": "because I could not get the wording that Gina Keating used to describe the Nisour Square massacre out of my head.",
    "start": 1826.68,
    "duration": 5.06
  },
  {
    "text": "\"They neutralized the threat.\"",
    "start": 1831.78,
    "duration": 2.16
  },
  {
    "text": "And she didn't misspeak here. She used the same wording in a different segment a couple of weeks earlier.",
    "start": 1833.94,
    "duration": 4.34
  },
  {
    "text": "So far, a lot of space on their podcast has been given to the family members of the Blackwater contractors.",
    "start": 1838.28,
    "duration": 5.5
  },
  {
    "text": "They talk about how much they suffer because their partner, son, or brother has been put in prison",
    "start": 1843.78,
    "duration": 4.24
  },
  {
    "text": "and get very emotional. And I can't really blame them for how they feel, since it's probably horrifying",
    "start": 1848.02,
    "duration": 4.46
  },
  {
    "text": "if a person you hold dear is involved in the killing of over a dozen innocent people.",
    "start": 1852.48,
    "duration": 3.96
  },
  {
    "text": "What is absolutely worth condemnation, though, is Gina Keating's and Michael Flaherty's decision",
    "start": 1856.44,
    "duration": 4.36
  },
  {
    "text": "to make this the center point of their version of the Nisour Square massacre.",
    "start": 1860.8,
    "duration": 4.28
  },
  {
    "text": "In the so-far-released episodes, or the already-aired Fox News segments,",
    "start": 1865.08,
    "duration": 3.58
  },
  {
    "text": "not a single victim is given even a sentence of remembrance. They seemingly don't matter in this story.",
    "start": 1868.66,
    "duration": 5.88
  },
  {
    "text": "But I think they do. For instance, not only was the driver of the white sedan a medical student,",
    "start": 1874.54,
    "duration": 4.8
  },
  {
    "text": "but both his parents were doctors. They could have left the country if they wanted to,",
    "start": 1879.34,
    "duration": 3.74
  },
  {
    "text": "but decided against it because they felt they were needed there.",
    "start": 1883.08,
    "duration": 3.1
  },
  {
    "text": "I can't talk about all of the victims here, but I'll leave some links in the description to interviews",
    "start": 1886.18,
    "duration": 3.8
  },
  {
    "text": "with the father of Ali Kinani and others so that you can hear their stories.",
    "start": 1889.98,
    "duration": 3.86
  },
  {
    "text": "So when you hear the story the next time, be it on Fox News, other conservative outlets,",
    "start": 1893.84,
    "duration": 4.72
  },
  {
    "text": "or through a pardon by Trump, keep in mind that the real tragedy here are the people left dead",
    "start": 1898.56,
    "duration": 4.46
  },
  {
    "text": "or maimed on the streets of Baghdad, so they don't end up becoming background characters",
    "start": 1903.02,
    "duration": 4.18
  },
  {
    "text": "in supposedly every-day-occurring events.",
    "start": 1907.2,
    "duration": 3.5
  },
  {
    "text": "Thank you for watching, everyone.",
    "start": 1912.0,
    "duration": 2.0
  },
  {
    "text": "I don't really have an outro for this one, but I have to keep talking so the credits can roll by.",
    "start": 1914.0,
    "duration": 4.72
  },
  {
    "text": "I'm very sorry for mispronouncing some of the Iraqi names, which I'm sure I did, but I did my best.",
    "start": 1918.72,
    "duration": 4.96
  },
  {
    "text": "If you want to be part of these credits, you can head over to Patreon via the link in the description.",
    "start": 1923.68,
    "duration": 4.82
  },
  {
    "text": "I also started uploading some content limited to patrons recently, which are mostly commentary tracks.",
    "start": 1928.5,
    "duration": 5.06
  },
  {
    "text": "Sometimes they are things I'd love to talk about in a video but which don't end up making the cut,",
    "start": 1933.56,
    "duration": 4.28
  },
  {
    "text": "so that's what these patron videos are for.",
    "start": 1937.84,
    "duration": 1.9
  },
  {
    "text": "As usual, you can hit me up on Twitter or Instagram if you have a question. Yeah, that's all for today.",
    "start": 1939.74,
    "duration": 6.28
  },
  {
    "text": "I hope to see you the next time. Have a good one!",
    "start": 1946.02,
    "duration": 4.3
  }
]