[
  {
    "text": "Hey everyone, today's video is going to be a little different.",
    "start": 0.345,
    "duration": 3.35
  },
  {
    "text": "A bit of a ramble maybe, even. But",
    "start": 4.095,
    "duration": 2.37
  },
  {
    "text": "first I have to get a bunch of disclaimers out of the way.",
    "start": 6.465,
    "duration": 3.02
  },
  {
    "text": "Most things I say in this video are going to be based on personal experience",
    "start": 9.485,
    "duration": 3.13
  },
  {
    "text": "for a change and I'm not necessarily in any way",
    "start": 12.615,
    "duration": 2.84
  },
  {
    "text": "representative of a broader experience of people",
    "start": 15.455,
    "duration": 2.82
  },
  {
    "text": "getting invested in political Youtube. Also when",
    "start": 18.275,
    "duration": 3.08
  },
  {
    "text": "talking about this niche of Youtube you are destined to make generalizations",
    "start": 21.355,
    "duration": 3.09
  },
  {
    "text": "since no two content creators are really the same.",
    "start": 24.445,
    "duration": 3.01
  },
  {
    "text": "So that said, what is today's video about?",
    "start": 27.455,
    "duration": 3.02
  },
  {
    "text": "Well, I get a lot of people coming forward to me telling me",
    "start": 30.475,
    "duration": 3.46
  },
  {
    "text": "how they used to watch various anti-SJW Youtubers",
    "start": 33.98,
    "duration": 2.98
  },
  {
    "text": "and used to buy into this worldview",
    "start": 36.96,
    "duration": 2.88
  },
  {
    "text": "of, say, SJWs and feminism",
    "start": 39.84,
    "duration": 2.54
  },
  {
    "text": "being this huge problem, and who are also",
    "start": 42.385,
    "duration": 2.65
  },
  {
    "text": "very ashamed of their former beliefs.",
    "start": 45.035,
    "duration": 1.88
  },
  {
    "text": "And I'll also talk about this report recently released by",
    "start": 46.94,
    "duration": 3.32
  },
  {
    "text": "Data & Society. And regarding our first topic,",
    "start": 50.26,
    "duration": 2.98
  },
  {
    "text": "I always respond with saying there is really no reason",
    "start": 53.24,
    "duration": 2.56
  },
  {
    "text": "to feel a sense of shame or embarrassment",
    "start": 55.86,
    "duration": 3.015
  },
  {
    "text": "because you used to hold a set of beliefs you now deem unsubstantiated.",
    "start": 58.875,
    "duration": 3.03
  },
  {
    "text": "And here's why: I, and I'm sure many others",
    "start": 61.905,
    "duration": 3.08
  },
  {
    "text": "got introduced to Political Youtube about two-to-three years ago,",
    "start": 64.985,
    "duration": 3.11
  },
  {
    "text": "without even intending to. Maybe you're",
    "start": 68.1,
    "duration": 2.54
  },
  {
    "text": "just looking for some tips regarding a hobby of yours - and out of the blue",
    "start": 70.64,
    "duration": 2.84
  },
  {
    "text": "you see a recommended video in the corner of the screen",
    "start": 73.64,
    "duration": 2.495
  },
  {
    "text": "that's titled, let's say:",
    "start": 76.135,
    "duration": 1.95
  },
  {
    "text": "\"Why People Hate Feminism Part 12\"",
    "start": 78.085,
    "duration": 2.995
  },
  {
    "text": "Now, you may not be on the Right, or conservative at all.",
    "start": 81.08,
    "duration": 3.74
  },
  {
    "text": "Maybe you're kind of Center-Left because that's pretty much the default of where you live.",
    "start": 84.82,
    "duration": 4.16
  },
  {
    "text": "But the image the word \"feminism\" conjurs up in your head is",
    "start": 88.98,
    "duration": 3.3
  },
  {
    "text": "Women complaining who don't really have a reason to...",
    "start": 92.28,
    "duration": 2.88
  },
  {
    "text": "or that it's just about hating men.",
    "start": 95.16,
    "duration": 2.4
  },
  {
    "text": "So, out of curiosity, you click the video and find out that",
    "start": 97.56,
    "duration": 3.32
  },
  {
    "text": "your previous assumption was not only correct",
    "start": 100.88,
    "duration": 2.84
  },
  {
    "text": "but that it even goes farther than that-",
    "start": 103.72,
    "duration": 1.78
  },
  {
    "text": "with intersectional social justice warriors holding various positions of power",
    "start": 105.52,
    "duration": 4.26
  },
  {
    "text": "and supposedly seeing everything through an \"Oppressor VS. Oppressed\" mindset.",
    "start": 109.78,
    "duration": 4.34
  },
  {
    "text": "So you continue to watch hours of content like this",
    "start": 114.14,
    "duration": 2.94
  },
  {
    "text": "and find other creators who talk about these topics through Youtube's Recommended feature",
    "start": 117.1,
    "duration": 3.76
  },
  {
    "text": "or collaborations between different channels.",
    "start": 120.86,
    "duration": 2.26
  },
  {
    "text": "And at first, it feels pretty good.",
    "start": 123.12,
    "duration": 2.36
  },
  {
    "text": "It seems like you discovered this entire new spectrum of content that's not only informative, but also really entertaining.",
    "start": 125.48,
    "duration": 5.92
  },
  {
    "text": "with different creators bringing their own personalities to the table.",
    "start": 131.4,
    "duration": 3.18
  },
  {
    "text": "You learn about new viewpoints you previously weren't exposed to, and",
    "start": 134.62,
    "duration": 2.88
  },
  {
    "text": "also have the ability to exchange your thoughts with a giant group of people through the comments section, or subreddits.",
    "start": 137.5,
    "duration": 6.14
  },
  {
    "text": "It's like you stumbled into a big community that values the same things you do:",
    "start": 143.64,
    "duration": 4.08
  },
  {
    "text": "free speech, common sense, and putting facts over emotions.",
    "start": 147.72,
    "duration": 3.52
  },
  {
    "text": "It might even give you a boost in confidence seeing how laughable the opposition is",
    "start": 151.24,
    "duration": 3.96
  },
  {
    "text": "and how embarassing they behave.",
    "start": 155.2,
    "duration": 2.0
  },
  {
    "text": "Instead of checking out new Netflix series for entertainment, you watch Can't Stop Milo on Youtube and don't even have to",
    "start": 157.2,
    "duration": 6.72
  },
  {
    "text": "select a new video once one is over, since the autoplay feature just serves you more of what you enjoy.",
    "start": 163.92,
    "duration": 4.84
  },
  {
    "text": "Then you might see this clip of Real Time with Bill Maher where Ben Affleck calls a guy named Sam Harris a racist",
    "start": 168.76,
    "duration": 5.84
  },
  {
    "text": "for seemingly just making rational arguments against the downsides of Islam.",
    "start": 174.6,
    "duration": 4.32
  },
  {
    "text": "By that point in time, you know that when someone calls pretty much anything \"racist\" these days...",
    "start": 178.92,
    "duration": 4.64
  },
  {
    "text": "They really don't have an argument, and that's why they resort to this kind of stuff.",
    "start": 183.56,
    "duration": 3.84
  },
  {
    "text": "Not you though!",
    "start": 187.4,
    "duration": 1.16
  },
  {
    "text": "You're all about being rational... no matter how controversial the topic at hand is.",
    "start": 188.56,
    "duration": 4.46
  },
  {
    "text": "You're going to check out more of Sam Harris and maybe even buy a book of his.",
    "start": 193.02,
    "duration": 3.755
  },
  {
    "text": "You get to learn about this video...",
    "start": 196.78,
    "duration": 2.12
  },
  {
    "text": "and this video...",
    "start": 198.92,
    "duration": 1.94
  },
  {
    "text": "and this video- and many, many more.",
    "start": 200.86,
    "duration": 2.38
  },
  {
    "text": "Over time you see that this stuff you laughed at in Cringe Compilations is actually",
    "start": 203.24,
    "duration": 4.12
  },
  {
    "text": "a phenomenon much more represented in mainstream culture than you would have thought at first.",
    "start": 207.36,
    "duration": 3.84
  },
  {
    "text": "The Left seems to have rejected the notion of being Pro-Worker and traded it in for",
    "start": 211.205,
    "duration": 4.335
  },
  {
    "text": "identity politics and virtue signaling.",
    "start": 215.54,
    "duration": 2.78
  },
  {
    "text": "Which puts you somewhat on the same side as someone like Ben Shapiro",
    "start": 218.32,
    "duration": 3.4
  },
  {
    "text": "The more you learn from all these new people you discover,",
    "start": 221.72,
    "duration": 3.12
  },
  {
    "text": "the better you feel about your new political identity.",
    "start": 224.845,
    "duration": 2.87
  },
  {
    "text": "People like Dave Rubin who seemingly had the same political awakening as you reaffirm that this is really the way things are.",
    "start": 227.715,
    "duration": 7.365
  },
  {
    "text": "The uncomplicated answers these people deliver to societal problems which previously seemed impenetrable to you",
    "start": 235.08,
    "duration": 6.06
  },
  {
    "text": "don't only sound agreeable, but are complimentary.",
    "start": 241.14,
    "duration": 2.88
  },
  {
    "text": "When Ben Shapiro says the 3 things you have to do to not screw up your life are:",
    "start": 244.02,
    "duration": 4.285
  },
  {
    "text": "finish school, get a job, and not have kids out of wedlock",
    "start": 248.305,
    "duration": 2.85
  },
  {
    "text": "it feels good. You already managed to do all of this stuff, or you're in the process of doing so.",
    "start": 251.155,
    "duration": 5.33
  },
  {
    "text": "And while you continue to take part int he discussion around feminism, Islam, and political correctness...",
    "start": 256.485,
    "duration": 5.495
  },
  {
    "text": "There's a set of beliefs that you acquire:",
    "start": 261.98,
    "duration": 2.52
  },
  {
    "text": "like \"Black Lives Matter\" is a regressive movement,",
    "start": 264.5,
    "duration": 2.88
  },
  {
    "text": "or that the Anti-Fascists are the real Fascists,",
    "start": 267.38,
    "duration": 2.94
  },
  {
    "text": "or that Feminism in the Western World is an antiquated idea.",
    "start": 270.32,
    "duration": 3.04
  },
  {
    "text": "Over time, the scale of this \"Culture War\" gets broadened even further,",
    "start": 273.36,
    "duration": 3.84
  },
  {
    "text": "and things like Cultural Marxism, Post-Modernism, and the likes make their way into the discussion.",
    "start": 277.2,
    "duration": 4.675
  },
  {
    "text": "A Professor comes forward who seems to confirm everything that the people you have been listening to already say.",
    "start": 281.88,
    "duration": 5.14
  },
  {
    "text": "And maybe it stops for you there. Or maybe it doesn't,",
    "start": 287.02,
    "duration": 2.98
  },
  {
    "text": "and you go on to learn about things like \"The Great Replacement\" and other Far-Right talking points.",
    "start": 290.0,
    "duration": 5.04
  },
  {
    "text": "Now, what's my problem with all of this?",
    "start": 295.04,
    "duration": 2.62
  },
  {
    "text": "Well, it doesn't have to be a problem at all, since what I described doesn't have  to be the case for everyone.",
    "start": 297.66,
    "duration": 5.56
  },
  {
    "text": "In my time on Youtube, though, I have seen a fair share of people get sucked into this Anti-SJW Vortex -",
    "start": 303.22,
    "duration": 7.205
  },
  {
    "text": "and who come out the other side as just another reactionary.",
    "start": 310.425,
    "duration": 3.06
  },
  {
    "text": "That's not to say that every Anti-SJW Youtuber that ever existed is a reactionary, though.",
    "start": 313.485,
    "duration": 5.995
  },
  {
    "text": "They may be Liberals or even Leftists for all I know.",
    "start": 319.54,
    "duration": 2.785
  },
  {
    "text": "What is key here is the mindset that consumption of this content over a long period of time puts you in.",
    "start": 322.325,
    "duration": 5.23
  },
  {
    "text": "Let's pick the biggest in the bunch:",
    "start": 327.555,
    "duration": 1.965
  },
  {
    "text": "supposedly Center Left Youtuber, \"Sargon of Akkad\", as an example.",
    "start": 329.52,
    "duration": 4.125
  },
  {
    "text": "What are some opinions you learn when consuming his vast amount of work?",
    "start": 333.66,
    "duration": 3.24
  },
  {
    "text": "To only name a few examples:",
    "start": 336.9,
    "duration": 2.1
  },
  {
    "text": "The EU sucks, Feminism sucks, Brexit is good,",
    "start": 339.0,
    "duration": 3.48
  },
  {
    "text": "Trump is good because he makes the left mad,",
    "start": 342.48,
    "duration": 2.58
  },
  {
    "text": "that Merkel invited millons of migrants because  Germans still feel guilty for the holocaust,",
    "start": 345.06,
    "duration": 4.28
  },
  {
    "text": "and that Black people in the US are in a bad position due to broken families,",
    "start": 349.34,
    "duration": 4.22
  },
  {
    "text": "which stems out of the introduction of the welfare state.",
    "start": 353.56,
    "duration": 2.76
  },
  {
    "text": "Now, Carl might be Center-Left in his heart - I have no idea.",
    "start": 356.32,
    "duration": 3.86
  },
  {
    "text": "But the positions he mostly advocates for and passes onto his viewership are",
    "start": 360.185,
    "duration": 2.99
  },
  {
    "text": "the ones of a conservative talk-radio host, with the occasional Far-Right conspiracy theory woven in.",
    "start": 363.18,
    "duration": 6.5
  },
  {
    "text": "I would say the boom of this kind of anti-feminist, ant-sjw content happened",
    "start": 369.68,
    "duration": 4.645
  },
  {
    "text": "right up until the election of Donald Trump, but I may be in the wrong there,",
    "start": 374.325,
    "duration": 3.11
  },
  {
    "text": "since I joined the party a bit late.",
    "start": 377.44,
    "duration": 2.72
  },
  {
    "text": "What makes the spiral i described so seductive, in my opinion,",
    "start": 380.16,
    "duration": 3.155
  },
  {
    "text": "is that the people you are getting your politics from",
    "start": 383.315,
    "duration": 2.84
  },
  {
    "text": "are very different than, let's say, a newspaper, or the radio.",
    "start": 386.16,
    "duration": 3.88
  },
  {
    "text": "The people on your computer screen are Average Joes - often broadcasting from their own homes",
    "start": 390.04,
    "duration": 4.575
  },
  {
    "text": "and who are accountable only to you and the rest of their fanbase.",
    "start": 394.62,
    "duration": 3.26
  },
  {
    "text": "It's a much more intimate and direct interaction than watching your average political commentator on evening TV.",
    "start": 397.88,
    "duration": 6.26
  },
  {
    "text": "This kind of interaction makes it much easier to develop a parasocial relationship with the people you're getting your worldview from.",
    "start": 404.14,
    "duration": 6.6
  },
  {
    "text": "\"Parasocial\", meaning a one-sided bond with a media figure, or in this case, Youtube figure.",
    "start": 410.74,
    "duration": 5.18
  },
  {
    "text": "And here's where the heart of the problem lies, in my opinion:",
    "start": 415.92,
    "duration": 3.0
  },
  {
    "text": "as you substitute more and more of your media diet with videos talking about how the SJWs ruin everything,",
    "start": 418.92,
    "duration": 5.885
  },
  {
    "text": "you're becoming part of this hivemind of people viewing politics through the lense of what they watch on Youtube every day.",
    "start": 424.805,
    "duration": 6.175
  },
  {
    "text": "You're taking on the \"Anti-SJW\"identity.",
    "start": 430.98,
    "duration": 3.5
  },
  {
    "text": "To you, it's a community of rational truth-tellers that don't shy away from discourse,",
    "start": 434.48,
    "duration": 5.26
  },
  {
    "text": "and is also often the underdog against things like the mainstream media.",
    "start": 439.74,
    "duration": 3.28
  },
  {
    "text": "To me, there is really no other connection between the various Anti-SJW Youtubers or Skeptic Youtubers, or whatever you want to call it,",
    "start": 443.1,
    "duration": 6.4
  },
  {
    "text": "other than that they are against the nebulous concept of the sjw.",
    "start": 449.5,
    "duration": 4.12
  },
  {
    "text": "Media scholar Daniel Kreiss , in the book \"Trump and the Media\", in the chapter",
    "start": 453.62,
    "duration": 4.24
  },
  {
    "text": "\"The Media are About Identity, Not Information\",",
    "start": 457.86,
    "duration": 2.36
  },
  {
    "text": "writes about this in the context of the 2016 presidential election.",
    "start": 460.22,
    "duration": 3.86
  },
  {
    "text": "\"For over 60 years, political scientists and political communication scholars have consistently",
    "start": 464.08,
    "duration": 5.065
  },
  {
    "text": "found that citizens know, and often care little about politics.",
    "start": 469.145,
    "duration": 3.435
  },
  {
    "text": "Citizens have little in the way of developed ideological frameworks for understanding politics or consistent policy preferences.\"",
    "start": 472.58,
    "duration": 7.3
  },
  {
    "text": "They vote based on their social identities, or how they perceive themselves and others, their partisan identities,",
    "start": 479.88,
    "duration": 5.94
  },
  {
    "text": "and their sense of the groups they believe the two political parties represent.",
    "start": 485.82,
    "duration": 3.8
  },
  {
    "text": "Politics, then, is primarily an identity-based phenomenon.",
    "start": 489.62,
    "duration": 3.9
  },
  {
    "text": "One way of thinking about it is akin to sports fandom, albeit with much higher stakes.",
    "start": 493.52,
    "duration": 4.9
  },
  {
    "text": "Citizens want their partisan and social group teams to be the \"winners\", and the other teams to be the \"losers\".",
    "start": 498.42,
    "duration": 5.82
  },
  {
    "text": "The political ideologies or policies at stake are largely unimportant",
    "start": 504.24,
    "duration": 3.395
  },
  {
    "text": "for most Americans compared with the success of the teams they affiliate with.",
    "start": 507.66,
    "duration": 3.64
  },
  {
    "text": "Now, to me, this is exactly what the Anti-SJW community was about in the time period I described earlier.",
    "start": 511.3,
    "duration": 6.42
  },
  {
    "text": "An example of this was the content released after the election of Donald Trump.",
    "start": 517.72,
    "duration": 4.095
  },
  {
    "text": "It wasn't about how shitty it is that a conservative is now president,",
    "start": 521.92,
    "duration": 3.44
  },
  {
    "text": "or how good it is that Donald Trump got elected so that he can he can finally get rid of the ACA, or DACA or any other policy position.",
    "start": 525.36,
    "duration": 6.6
  },
  {
    "text": "It was about how mad \"The Others\" were, its not really about policy or even politics as a whole.",
    "start": 531.96,
    "duration": 5.46
  },
  {
    "text": "You can also see this play out when someone goes against the grain, like when",
    "start": 537.42,
    "duration": 3.5
  },
  {
    "text": "anti-SJW Youtuber Thunderf00t made a series of videos about Brexit",
    "start": 540.92,
    "duration": 4.015
  },
  {
    "text": "in which he espoused his opposition to it.",
    "start": 544.935,
    "duration": 3.09
  },
  {
    "text": "It's not like part of his audience carefully weighed all of Thunderf00ts points",
    "start": 548.025,
    "duration": 2.955
  },
  {
    "text": "and voiced concerns about how his points are wrong in the comments section.",
    "start": 551.0,
    "duration": 3.56
  },
  {
    "text": "It's limited to mass dislikes and political quips, mostly.",
    "start": 554.56,
    "duration": 3.32
  },
  {
    "text": "Because he went against the anti-sjw dogma that part of his audience adheres to.",
    "start": 557.88,
    "duration": 4.695
  },
  {
    "text": "There is no real political discussion going on here.",
    "start": 562.58,
    "duration": 3.02
  },
  {
    "text": "The problem is that these creators are caught between being entertainers and political commentators.",
    "start": 565.6,
    "duration": 5.46
  },
  {
    "text": "You might watch the \"Social Justice the Musical\" video because it's funny and very competently made, and very competently made,",
    "start": 571.06,
    "duration": 5.08
  },
  {
    "text": "but it also delivers a very clear political agenda.",
    "start": 576.14,
    "duration": 2.78
  },
  {
    "text": "And that's usually the problem with this kind of content.",
    "start": 578.92,
    "duration": 2.72
  },
  {
    "text": "You come for the laughs and the entertainment,",
    "start": 581.64,
    "duration": 1.955
  },
  {
    "text": "but what sticks in your head isn't necessarily a pro-right agenda - but an anti-left one.",
    "start": 583.6,
    "duration": 5.52
  },
  {
    "text": "Of course, this isn't just true for Youtube. It's a general political phenomenon.",
    "start": 589.12,
    "duration": 3.94
  },
  {
    "text": "Where it gets even more worrisome, though, is when this kind of anti-SJW politics is sold as an alternative to the mainstream media.",
    "start": 593.06,
    "duration": 8.32
  },
  {
    "text": "I'll bet most of you remember when in February 2017,",
    "start": 601.38,
    "duration": 3.22
  },
  {
    "text": "the Wall Street Journal reported on PewDiePie's ironic antisemitism.",
    "start": 604.62,
    "duration": 4.18
  },
  {
    "text": "Now, of course you can take issue with how the newspaper reported the story,",
    "start": 608.8,
    "duration": 3.16
  },
  {
    "text": "But I remember very vividly how this was framed as an attack on alternative media",
    "start": 611.96,
    "duration": 4.305
  },
  {
    "text": "because traditional media outlets can't keep up with \"people in their bedrooms.\"",
    "start": 616.265,
    "duration": 4.715
  },
  {
    "text": "That's not my phrasing, by the way. That's taken from one of the videos.",
    "start": 620.98,
    "duration": 3.48
  },
  {
    "text": "I personally always found that quite silly, to be honest.",
    "start": 624.46,
    "duration": 3.34
  },
  {
    "text": "60% of the readership of the  Wall Street Journal belongs to the upper management, are over 55 years old,",
    "start": 627.805,
    "duration": 5.8
  },
  {
    "text": "and have an average net worth of over 2.1 Million dollars.",
    "start": 633.605,
    "duration": 3.515
  },
  {
    "text": "It's very hard to imagine, for me, that someone would cancel his Wall Street Journal Online access (which costs 75 dollars a year),",
    "start": 637.12,
    "duration": 6.96
  },
  {
    "text": "To substitute it with watching PewDiePie videos,",
    "start": 644.08,
    "duration": 2.58
  },
  {
    "text": "or listen to some dude talk about how SJWs ruined the Ghostbusters reboot.",
    "start": 646.66,
    "duration": 4.4
  },
  {
    "text": "And that's a good thing.",
    "start": 651.06,
    "duration": 1.66
  },
  {
    "text": "Someone who limits his political diet to anti-SJW content",
    "start": 652.72,
    "duration": 3.235
  },
  {
    "text": "will pretty soon start seeing the regressive left behind every street corner,",
    "start": 655.955,
    "duration": 4.405
  },
  {
    "text": "while being blinded to the truly worrisome political developments in the real world.",
    "start": 660.36,
    "duration": 4.355
  },
  {
    "text": "A good example of a person like this is displayed by the earlier-mentioned Sargon of Akkad in his recent debate with Richard Carrier.",
    "start": 664.715,
    "duration": 6.565
  },
  {
    "text": "To be fair, though, Carl has expressed regret over how he handled the debate and",
    "start": 671.28,
    "duration": 3.82
  },
  {
    "text": "ultimately made himself look stupid, because the person he was debating",
    "start": 675.1,
    "duration": 3.275
  },
  {
    "text": "wasn't the kind of person he imagines in his head an SJW to be, and which he sells his audience.",
    "start": 678.375,
    "duration": 5.22
  },
  {
    "text": "Seems a bit like Carl and like-minded folks mention the majority of social justice advocates like this:",
    "start": 683.6,
    "duration": 6.1
  },
  {
    "text": "\"Yeah!\"",
    "start": 689.7,
    "duration": 0.8
  },
  {
    "text": "\"This person just sexually harrassed me!\"",
    "start": 690.5,
    "duration": 1.92
  },
  {
    "text": "[MAN] \"I said I'm humongous!\"",
    "start": 692.42,
    "duration": 1.4
  },
  {
    "text": "[woman filming] Yeah, that's right! Humongous what?!\n[MAN] Just humongous!",
    "start": 693.82,
    "duration": 2.52
  },
  {
    "text": "[woman filming] Oh, oh, oh, so now you're actually pointing to yourself?",
    "start": 696.34,
    "duration": 4.2
  },
  {
    "text": "You're actually pointing to your body parts, and saying that you're humongous.",
    "start": 700.54,
    "duration": 6.88
  },
  {
    "text": "You're actually doing that!",
    "start": 707.42,
    "duration": 1.56
  },
  {
    "text": "Looking at the current political landscape, though, where are all those people?",
    "start": 709.12,
    "duration": 3.86
  },
  {
    "text": "Oh, right. There was this DNC candidate in January 2017, whose name you probably never heard of,",
    "start": 713.08,
    "duration": 5.625
  },
  {
    "text": "who said \"white people should shut up.\"",
    "start": 718.705,
    "duration": 1.955
  },
  {
    "text": "Well, I guess then it's all true.",
    "start": 720.66,
    "duration": 2.38
  },
  {
    "text": "Pack your bags, Marxist college professors wanting to subvert western civilization.",
    "start": 723.04,
    "duration": 4.24
  },
  {
    "text": "You've been caught.",
    "start": 727.28,
    "duration": 1.36
  },
  {
    "text": "Jokes aside, I can't help but see the resemblance to a crowd of people who just bought into a massive conspiracy theory.",
    "start": 728.64,
    "duration": 5.94
  },
  {
    "text": "And this goes hand-in-hand with other conspiracy theories.",
    "start": 734.58,
    "duration": 2.86
  },
  {
    "text": "Be it cultural marxists wanting to destroy western civilization,",
    "start": 737.44,
    "duration": 3.44
  },
  {
    "text": "intersectionality being a weapon of the Post-Modernists,",
    "start": 740.88,
    "duration": 3.12
  },
  {
    "text": "or that people will be jailed for accidentally misgendering someone under Canada's Bill C16.",
    "start": 744.0,
    "duration": 5.34
  },
  {
    "text": "Not that there aren't crazy people on the left side of the spectrum,",
    "start": 749.38,
    "duration": 3.215
  },
  {
    "text": "But I fail to see how this minority justifies this laser-focus and massive outrage.",
    "start": 752.6,
    "duration": 5.22
  },
  {
    "text": "And I don't think I'm the only one noticing this.",
    "start": 757.82,
    "duration": 2.64
  },
  {
    "text": "Because one criticism that frequently is brought forward towards these anti-sjw creators...",
    "start": 760.46,
    "duration": 4.82
  },
  {
    "text": "is their selective outrage.",
    "start": 765.28,
    "duration": 1.82
  },
  {
    "text": "Why do you go nuclear on a stupid MTV video, or a Buzzfeed article,",
    "start": 767.1,
    "duration": 3.785
  },
  {
    "text": "but fail to criticize actual legislation that has a real effect on people's lives, brought forward by the right?",
    "start": 770.885,
    "duration": 6.035
  },
  {
    "text": "How can you be so principled on free speech,",
    "start": 776.92,
    "duration": 2.6
  },
  {
    "text": "but also like or at least not criticize Donald Trump,",
    "start": 779.52,
    "duration": 3.36
  },
  {
    "text": "who repeatedly shows his disdain for it?",
    "start": 782.88,
    "duration": 2.38
  },
  {
    "text": "In my opinion, the answer to that is partially what I said earlier - about it not really being about politics -",
    "start": 785.26,
    "duration": 5.1
  },
  {
    "text": "but also that being, or selling reactionary positions, is not a real ideology on its own.",
    "start": 790.36,
    "duration": 5.3
  },
  {
    "text": "There are no political principles behind laughing at college students freaking out,",
    "start": 795.66,
    "duration": 3.84
  },
  {
    "text": "or endlessly talking about a charicature of social justice advocacy.",
    "start": 799.5,
    "duration": 3.92
  },
  {
    "text": "To be fair, though, this whole thing isn't solely the fault of the individual creators,",
    "start": 803.46,
    "duration": 3.98
  },
  {
    "text": "but also partially because of how Youtube's algorithm works, and the nature of the medium.",
    "start": 807.44,
    "duration": 4.38
  },
  {
    "text": "Once you have acquired a certain audience, this kind of thing is what they expect from you.",
    "start": 811.82,
    "duration": 4.18
  },
  {
    "text": "Failing to deliver on that might even make you lose a significant part of your income.",
    "start": 816.0,
    "duration": 4.16
  },
  {
    "text": "I'm sure a good portion don't have sinister motives behind their content, or just somehow stumbled into this.",
    "start": 820.16,
    "duration": 5.46
  },
  {
    "text": "But I'm not completely gonna miss out on some judgement in this video,",
    "start": 825.62,
    "duration": 3.08
  },
  {
    "text": "and this is where we get to this report,",
    "start": 828.7,
    "duration": 2.16
  },
  {
    "text": "Which was recently released by Data & Society, called",
    "start": 830.86,
    "duration": 3.16
  },
  {
    "text": "\"Alternative Influence: Broadcasting the Reactionary Right on Youtube\" by Rebecca Lewis.",
    "start": 834.02,
    "duration": 5.32
  },
  {
    "text": "The argument the report puts forward is that there is a web of conservative to far-right personalities on Youtube",
    "start": 839.34,
    "duration": 5.76
  },
  {
    "text": "who frequently collaborate, or appear side-by-side.",
    "start": 845.1,
    "duration": 2.9
  },
  {
    "text": "The report claims that these reactionary Youtubers demonize and discredit orthodox worldviews and the mainstream media,",
    "start": 848.0,
    "duration": 6.225
  },
  {
    "text": "which they sometimes follow up with introducing their viewership to alternative worldviews like White Nationalism,",
    "start": 854.225,
    "duration": 5.435
  },
  {
    "text": "which their audience is now more likely to be succeptible to",
    "start": 859.66,
    "duration": 2.865
  },
  {
    "text": "because of the previous damage done by this group of reactionary Youtubers.",
    "start": 862.525,
    "duration": 3.955
  },
  {
    "text": "It does not claim that everyone in this web is far-right.",
    "start": 866.48,
    "duration": 3.4
  },
  {
    "text": "It claims the nature of these connections is largely irrelevant,",
    "start": 869.88,
    "duration": 2.88
  },
  {
    "text": "because this group of Youtubers has already set their audience up to embrace unorthodox worldviews.",
    "start": 872.76,
    "duration": 5.08
  },
  {
    "text": "Now, do I actually think this report delivers enough evidence for this claim to ring true?",
    "start": 877.84,
    "duration": 4.485
  },
  {
    "text": "No, I don't think so - and I wouldn't cite it trying to prove a point.",
    "start": 882.325,
    "duration": 3.895
  },
  {
    "text": "I have some issues with the methodology and the presented sample sizes.",
    "start": 886.22,
    "duration": 3.72
  },
  {
    "text": "That doesn't mean that the phenomenon, described in the report as radicalization, doesn't exist...",
    "start": 889.94,
    "duration": 4.54
  },
  {
    "text": "but in my experience, it works a little different.",
    "start": 894.48,
    "duration": 2.44
  },
  {
    "text": "This dogmatic anti-leftism sets you up to be more susceptible to right-wing talking points,",
    "start": 896.92,
    "duration": 5.34
  },
  {
    "text": "partially because your image of the left stems out of a caricature sold by Anti-SJW Youtubers.",
    "start": 902.26,
    "duration": 5.6
  },
  {
    "text": "Repeating far-right conspiracy theories like Cultural Marxism,",
    "start": 907.86,
    "duration": 3.5
  },
  {
    "text": "that Heather Heyer died of a heart attack, or that Ireland plans to import 1 million Middle-Easterners,",
    "start": 911.36,
    "duration": 4.86
  },
  {
    "text": "also probably plays a significant role.",
    "start": 916.22,
    "duration": 2.56
  },
  {
    "text": "The reason I bring up this report is twofold:",
    "start": 918.8,
    "duration": 2.36
  },
  {
    "text": "mainly I wanted as much people as possible from the earlier described viewer base to watch this video,",
    "start": 921.16,
    "duration": 4.98
  },
  {
    "text": "so I made it look like I would endorse this flawed report, which they then could hold over my head.",
    "start": 926.14,
    "duration": 4.44
  },
  {
    "text": "Pulled a little sneaky one on you there, but I'm sure there will be another opportunity in the near future for you folks.",
    "start": 930.58,
    "duration": 5.12
  },
  {
    "text": "The second reason is that the main chunk of people named in this report  who actually made a response to it",
    "start": 935.7,
    "duration": 5.24
  },
  {
    "text": "even failed to criticize the primary claim of this flawed report.",
    "start": 940.94,
    "duration": 3.52
  },
  {
    "text": "They just can't help themselves not to instantly jump into the victimizing loop of \"help, I'm being smeared as far-right\",",
    "start": 944.475,
    "duration": 5.9
  },
  {
    "text": "when the report never made that assessment.",
    "start": 950.38,
    "duration": 2.34
  },
  {
    "text": "If they even read the conclusion, that is.",
    "start": 952.72,
    "duration": 2.595
  },
  {
    "text": "Because most of them don't even seem to have read the entire report.",
    "start": 955.315,
    "duration": 3.09
  },
  {
    "text": "One of the biggest connectors in this web, Sargon of Akkad, made a short video titled",
    "start": 958.405,
    "duration": 4.555
  },
  {
    "text": "\"The Progressive Attack on the Youtube Political Sphere\"",
    "start": 962.96,
    "duration": 2.86
  },
  {
    "text": "in which he goes over a Guardian article, and states at the end that he will do a live stream going through the report in detail.",
    "start": 965.82,
    "duration": 6.72
  },
  {
    "text": "[Sargon] I'll leave a link in the description or in the comments to a video that i'm going through on my live-stream channel where",
    "start": 972.54,
    "duration": 4.54
  },
  {
    "text": "I actually go through the entire report, line by line.",
    "start": 977.08,
    "duration": 3.5
  },
  {
    "text": "And we'll see exactly what it is they think, exactly how they're misrepresenting us, and exactly what they think needs to be done.",
    "start": 980.58,
    "duration": 6.0
  },
  {
    "text": "True to his reputation though, it seems like in the meantime he saw that the report is over 60 pages long,",
    "start": 987.02,
    "duration": 5.14
  },
  {
    "text": "and that's a bit much to read, isn't it?",
    "start": 992.16,
    "duration": 1.88
  },
  {
    "text": "So during his 2-hour livestream, he went through the report and stopped at page 14.",
    "start": 994.04,
    "duration": 5.56
  },
  {
    "text": "[Sargon] Right, I don't know how much longer I'll be able to to go on with this.",
    "start": 1000.28,
    "duration": 2.595
  },
  {
    "text": "so we're basically at the end of this part... uhm...",
    "start": 1002.875,
    "duration": 2.61
  },
  {
    "text": "but yeah, I mean, I think we can see where this is going by now.",
    "start": 1006.025,
    "duration": 2.92
  },
  {
    "text": "A Youtuber called \"Some Black Guy\" doesn't even read the report, but only skims through the article mentioning it.",
    "start": 1009.355,
    "duration": 5.67
  },
  {
    "text": "\"Styxhexenhammer666\" and \"Computing Forever\" also completely missed the point the report is trying to make.",
    "start": 1015.025,
    "duration": 5.92
  },
  {
    "text": "Why are you folks always so lazy?",
    "start": 1020.995,
    "duration": 2.97
  },
  {
    "text": "And none of the people mentioned, with the exception of Tim Pool even tred to counter the claim that",
    "start": 1023.965,
    "duration": 4.495
  },
  {
    "text": "what the report calls the \"Alternative Influence Network\" serves as a pipeline from laughing at SJWs to repeating far-right talking points.",
    "start": 1028.46,
    "duration": 7.315
  },
  {
    "text": "Now, as I said in the beginning, this is only based on my personal observations - so take that as you will.",
    "start": 1035.775,
    "duration": 5.99
  },
  {
    "text": "But, in my view, this pipeline is very real.",
    "start": 1041.765,
    "duration": 2.515
  },
  {
    "text": "We can even look at some creators and how they moved further and further to the right",
    "start": 1044.28,
    "duration": 3.74
  },
  {
    "text": "For instance, Lauren Southern, who started off doing publicity stunts for The Rebel,",
    "start": 1048.02,
    "duration": 3.64
  },
  {
    "text": "who went on trying to stop boats in the Mediterranean setting sail to save possibly drowning refugees.",
    "start": 1051.66,
    "duration": 5.64
  },
  {
    "text": "Or, the previously mentioned Computing Forever.",
    "start": 1057.3,
    "duration": 2.56
  },
  {
    "text": "Initially just a channel about tech and mocking SJWs,",
    "start": 1059.86,
    "duration": 3.26
  },
  {
    "text": "which quickly spiraled into everything being a marxist conspiracy.",
    "start": 1063.12,
    "duration": 3.32
  },
  {
    "text": "Now let's jump to a video of his uploaded in late September, 2018.",
    "start": 1066.44,
    "duration": 4.375
  },
  {
    "text": "This is what happens when a society no longer values logic and reason, and instead",
    "start": 1071.125,
    "duration": 4.71
  },
  {
    "text": "prioritizes emotionally unhinged and irrational arguments and self-entitlement.",
    "start": 1075.835,
    "duration": 5.02
  },
  {
    "text": "The Great Replacement is taking place across Europe, through mass immigration",
    "start": 1084.58,
    "duration": 4.08
  },
  {
    "text": "and the fertility rates of immigrants are far higher than ours.",
    "start": 1088.66,
    "duration": 3.0
  },
  {
    "text": "Once abortion is paid for through our taxes,",
    "start": 1091.66,
    "duration": 2.68
  },
  {
    "text": "there will be no financial barriers to getting an abortion, because *we* will all have to pay for them, obviously.",
    "start": 1094.34,
    "duration": 6.015
  },
  {
    "text": "It seems like logic, reason, and rationality don't apply when it comes to far-right propaganda.",
    "start": 1100.36,
    "duration": 5.46
  },
  {
    "text": "But, wait. There's more.",
    "start": 1105.82,
    "duration": 1.76
  },
  {
    "text": "You know, it's almost like this was all by design.",
    "start": 1107.76,
    "duration": 3.32
  },
  {
    "text": "Hmmm...",
    "start": 1111.24,
    "duration": 1.06
  },
  {
    "text": "Anyway, this is certainly some food for thought for a lot of people.",
    "start": 1112.38,
    "duration": 3.34
  },
  {
    "text": "What's the matter, Dave? Why so politically correct all of a sudden?",
    "start": 1115.92,
    "duration": 4.08
  },
  {
    "text": "Please, tell me.",
    "start": 1120.0,
    "duration": 1.28
  },
  {
    "text": "Who designed the currently-taking-place Great Replacement?",
    "start": 1121.28,
    "duration": 3.32
  },
  {
    "text": "Was it the Jews? Was it Kalergi? Was it the EU?",
    "start": 1124.84,
    "duration": 3.1
  },
  {
    "text": "Please, don't shy away from discussing your ideas in detail, even if they might be offensive to some people.",
    "start": 1127.94,
    "duration": 5.825
  },
  {
    "text": "The previous statement also goes very well together with the video Computing Forever made regarding the Data&Society report.",
    "start": 1133.855,
    "duration": 7.06
  },
  {
    "text": "\"They function as political influencers who adopt the techniques of brand influencers to build audiences and sell them on far-right ideology.\"",
    "start": 1141.04,
    "duration": 7.2
  },
  {
    "text": "Examples please?",
    "start": 1148.24,
    "duration": 1.22
  },
  {
    "text": "Nothing! Alright? I have never promoted anything far-right, ever.",
    "start": 1149.46,
    "duration": 4.14
  },
  {
    "text": "And I can speak for myself!",
    "start": 1153.6,
    "duration": 1.92
  },
  {
    "text": "Didn't take long to prove that one right.",
    "start": 1155.52,
    "duration": 2.04
  },
  {
    "text": "Anyway, one more thing I want to talk about that came up in the context of the Data&Society report",
    "start": 1157.56,
    "duration": 5.26
  },
  {
    "text": "is the grouping of these creators.",
    "start": 1162.82,
    "duration": 2.035
  },
  {
    "text": "While I consider this web flawed and unconclusive,",
    "start": 1164.855,
    "duration": 2.59
  },
  {
    "text": "It's not like there isn't a point in claiming a connection between two Youtubers can serve right-wing radicalization.",
    "start": 1167.54,
    "duration": 5.64
  },
  {
    "text": "As an example: if you uncritically associate with or amplify someone who is obviously a far-right demagogue,",
    "start": 1173.18,
    "duration": 6.685
  },
  {
    "text": "like Lauren Southern or Stefan Molyneux,",
    "start": 1179.865,
    "duration": 2.455
  },
  {
    "text": "you are lending them some of the trust that your audience has built up to you.",
    "start": 1182.32,
    "duration": 3.695
  },
  {
    "text": "Why do you think an organization like Scientology is so eager to recruit famous actors who are well-known?",
    "start": 1186.015,
    "duration": 5.88
  },
  {
    "text": "It's because they can get in on the relationship between Tom Cruise and his fans.",
    "start": 1191.9,
    "duration": 4.12
  },
  {
    "text": "So, if part of your audience jumps from laughing at feminism to believing in The Great Replacement, because of one of your associations,",
    "start": 1196.02,
    "duration": 6.8
  },
  {
    "text": "You are partially on the hook for that.",
    "start": 1202.82,
    "duration": 1.84
  },
  {
    "text": "And no amount of screaming \"guilt by association\" is gonna make that fact not true.",
    "start": 1204.66,
    "duration": 5.52
  },
  {
    "text": "Okay, so, where do we go from here?",
    "start": 1210.56,
    "duration": 2.44
  },
  {
    "text": "It seems like the golden days of anti-sjws are coming to an end.",
    "start": 1213.0,
    "duration": 4.0
  },
  {
    "text": "Well, I actually don't know how it's gonna play out.",
    "start": 1217.0,
    "duration": 2.755
  },
  {
    "text": "That's a question for someone who has been doing this longer than me,",
    "start": 1219.755,
    "duration": 3.04
  },
  {
    "text": "and I'm sure this person could also address various factors I left out,",
    "start": 1222.795,
    "duration": 3.06
  },
  {
    "text": "like GamerGate and such.",
    "start": 1225.86,
    "duration": 1.62
  },
  {
    "text": "I never went nearly as far as I described earlier down the Anti-SJW Vortex,",
    "start": 1227.48,
    "duration": 4.255
  },
  {
    "text": "but that may have just been pure luck.",
    "start": 1231.74,
    "duration": 2.78
  },
  {
    "text": "One day I was working on something, with Youtube running in the background, and after about half an hour,",
    "start": 1234.52,
    "duration": 4.4
  },
  {
    "text": "I checked what it actually was that was running in the background while I wasn't paying attention.",
    "start": 1238.92,
    "duration": 4.595
  },
  {
    "text": "Youtube's algorithm, together, with the auto-play feature,",
    "start": 1243.515,
    "duration": 2.92
  },
  {
    "text": "had lead me to a compilation of Black Lives Matter protestors being run over by cars.",
    "start": 1246.44,
    "duration": 4.98
  },
  {
    "text": "And that led me to evaluate what kind of content I was watching,",
    "start": 1251.42,
    "duration": 3.38
  },
  {
    "text": "and how it might influence my political opinions - and if they hold any water.",
    "start": 1254.8,
    "duration": 3.475
  },
  {
    "text": "And to those who weren't as fortunate as me:",
    "start": 1258.28,
    "duration": 2.42
  },
  {
    "text": "There's really no reason to feel ashamed for buying into the whole anti-SJW thing in the past.",
    "start": 1260.7,
    "duration": 5.18
  },
  {
    "text": "The people who further this kind of stuff to the point of a conspiratorial worldview are the ones embarassing themselves.",
    "start": 1265.88,
    "duration": 6.195
  },
  {
    "text": "And, that's it for today, folks.",
    "start": 1272.36,
    "duration": 2.38
  },
  {
    "text": "I felt like doing a shorter video this month, since my last one got way longer than it should have been.",
    "start": 1274.74,
    "duration": 4.475
  },
  {
    "text": "Thank you to my lovely patrons for allowing me to make more videos, and to all of you for watching this one.",
    "start": 1279.565,
    "duration": 5.6
  },
  {
    "text": "You can catch me on twitter and instagram if you have any questions, or on Patreon if you would like to support the channel.",
    "start": 1285.165,
    "duration": 6.055
  },
  {
    "text": "If you find the concept of Parasocial relationships interesting, there are various articles online about it,",
    "start": 1291.54,
    "duration": 5.125
  },
  {
    "text": "and also a couple Youtube videos by Shannon Strucci,",
    "start": 1296.665,
    "duration": 3.015
  },
  {
    "text": "which are definitely worth your time.",
    "start": 1299.68,
    "duration": 1.74
  },
  {
    "text": "I hope all of you have a spooky Halloween - and to see you the next time.",
    "start": 1301.74,
    "duration": 3.86
  }
]