[
  {
    "id": "Ugxk8kZg8GXyBYxkhF54AaABAg",
    "author": "@gee8419",
    "author_channel_id": "UCySkJGCs10AgkChbQbs23BA",
    "text": "My rent in my 4th floor walk up single bedroom in Queens went up to $2100 per month this year. 2 years ago when I moved in the apartment was $1900 per month. I am a City employee making 88k a year, after taxes, the cheapest health insurance/FSA/dental, pretax transit it's around $2100 every two weeks I take home. Curiously I looked on Street Easy for single bedroom apartments $2000 a month and under. Less than 200 apartments are available at that cost in Manhattan, Queens, Brooklyn, and the Bronx COMBINED. This is why homelessness has increased so rapidly. There are so few apartments and rent is SKYROCKETING. If rent is half my income and I make an 88k salary what hope does a single mother on minimum wage have??",
    "like_count": 851,
    "published_at": "2025-01-09T20:09:26Z",
    "is_reply": false,
    "reply_count": 24,
    "replies": [
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2AD59dYM5Khv",
        "author": "@Darth_Bateman",
        "text": "…..”hope”?",
        "like_count": 22,
        "published_at": "2025-01-09T21:15:41Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2AD5A9Hhxp-c",
        "author": "@gee8419",
        "text": "@Darth_Bateman  chance? I am not sure what the issue is with the word hope, it is a very common expression indicating that a situation is bad.",
        "like_count": 60,
        "published_at": "2025-01-09T21:20:09Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2AD5DzhCznAJ",
        "author": "@Hazel4love",
        "text": "@gee8419 yet like here in Bay Area, it is sad, I also work for the City...",
        "like_count": 23,
        "published_at": "2025-01-09T21:53:40Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2AD5ELj6kbj5",
        "author": "@gee8419",
        "text": "@Hazel4love I’ve heard it is like this in the Bay Area as well. I am so sorry.",
        "like_count": 13,
        "published_at": "2025-01-09T21:56:49Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2AD5FaUat3Wi",
        "author": "@oddnegrozofficial3363",
        "text": "@gee8419 Thanks for thinking about what others may go through...too often I see people careless and blameful.  It's just hard for Americans these days and we're trying to figure how to fix all these mistakes that have taken too long to fix and now it's spinning out of control.   May TMH help us find the way out!",
        "like_count": 36,
        "published_at": "2025-01-09T22:07:42Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2AD5GMPeCG-M",
        "author": "@gee8419",
        "text": "@oddnegrozofficial3363 It really is so hard, I am LGBT so I know people struggling really hard to stay off the streets and my own support system is touch and go.",
        "like_count": 0,
        "published_at": "2025-01-09T22:14:23Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2AD5p5sZhSIt",
        "author": "@ivanivanovichrasputin3098",
        "text": "Don’t forget that you have to have like 10 times your rent payment in your bank account or some stupid sheet like that. And the rent payment can only be like 30% of your monthly income. Who tf is making $7.5k+ per month in NYC other than the barely hanging on by a threat middle class?! \n\n5 years ago we were paying $950 for a one bedroom apartment in Brooklyn. It went up to $1,200 the same year. Now single bedroom apartments are no less than $2,100 per month. Meanwhile, wages have not increased a goddam cent. The federal minimum wage is still effing $7.25 per hour!!! Minimum wage in New York is $15/hour, and only if the business has more than like 50 employees. This state and country as a whole are a total joke.",
        "like_count": 49,
        "published_at": "2025-01-10T03:26:41Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2AD7WaxZfmIT",
        "author": "@kevin2732",
        "text": "Wait till the congestion fees starts hitting businesses bottom line",
        "like_count": 6,
        "published_at": "2025-01-10T19:14:48Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2AD7YboIjyk5",
        "author": "@gee8419",
        "text": "@kevin2732 My landlord owns ten grocery stores and multiple rental properties, he can afford to lose profits.",
        "like_count": 27,
        "published_at": "2025-01-10T19:32:23Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2AD9pwBF8m3p",
        "author": "@MakesNoSense86",
        "text": "@gee8419 we are in this together. I hear you",
        "like_count": 4,
        "published_at": "2025-01-11T16:50:56Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2ADAJ-xpXmgM",
        "author": "@solidsnake8331",
        "text": "God Damm that's close to what I'm paying in Florida this is ridiculous",
        "like_count": 2,
        "published_at": "2025-01-11T21:13:44Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2ADANVnt5ooz",
        "author": "@jl3651",
        "text": "And all these developments going up with the bs \"affordable housing\" tag. NYC is hell.",
        "like_count": 3,
        "published_at": "2025-01-11T21:53:02Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2ADAOBEJlEM0",
        "author": "@gee8419",
        "text": "@jl3651 yes no matter my income I have never seen housing stock in the lottery that actually had rent I could afford. According to the housing lottery I can afford rent that is $2400 a month which is news to me",
        "like_count": 0,
        "published_at": "2025-01-11T21:58:58Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2ADB4BNbD-5p",
        "author": "@ThaRealShante",
        "text": "Exactly...the rent is unreasonable and if your not poor you don't qualify for any of the so call affordable units",
        "like_count": 1,
        "published_at": "2025-01-12T04:23:28Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2ADB58lR9tTD",
        "author": "@gee8419",
        "text": "@ThaRealShante According to the housing lottery I can afford rent that is $2400 a month LOL! Their income ranges are a joke. There's too few apartments period and the rent makes no sense for any of the income brackets.",
        "like_count": 5,
        "published_at": "2025-01-12T04:31:50Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2ADChOta3vH3",
        "author": "@IMFJP820",
        "text": "@gee8419 I live in a small studio in Brooklyn & my rent went from $1600 to $2550 since 2023! I've lived in NYC my whole life & I've never seen it this bad, even growing up in the 80's & 90's.",
        "like_count": 5,
        "published_at": "2025-01-12T19:34:04Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2ADCiPoialjK",
        "author": "@JG-tr9py",
        "text": "@jl3651 They're full crap with the affordable housing issue.",
        "like_count": 3,
        "published_at": "2025-01-12T19:42:56Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2ADDP94K7s-4",
        "author": "@gee8419",
        "text": "@sct4040 I'm not living in a box when it isn't much cheaper than an apartment with a second room. The price tradeoff to live in a literal box is not even good. You seem out of touch or you would know that.",
        "like_count": 1,
        "published_at": "2025-01-13T02:05:08Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2ADDPK3OPCgR",
        "author": "@gee8419",
        "text": "@sct4040 Rent is not a profit, rent is passive income on an investment. Congratulations on having the capital to buy an apartment but you are clearly wealthy and do not understand the lives of working people in this city.",
        "like_count": 2,
        "published_at": "2025-01-13T02:06:38Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2ADEjfl-aXtT",
        "author": "@TheNutCaseNetwork",
        "text": "@gee8419 The south isn’t much better, you’ll get more space for your money, but the average pay is less & it’s virtually impossible to get a job. Single mothers are becoming homeless. Not to mention the scams where the units charging extremely high rent either have pest infestation, or false advertising about amenities or even functionality of the unit. My water bill is $300 a month in a small 3 bedroom after living in a larger house where my water bill was $60-$100 a month. My electric bill is almost $400 a month because the windows and doors aren’t properly insulated. I moved in here and everything was broken during the summer, including the air conditioning. It was 100+ degrees inside during August in Georgia. They want us all to go on to glory, but they want black men and women to go first😮‍💨🙏🏽🫶🏽💜🧠💯",
        "like_count": 0,
        "published_at": "2025-01-13T14:32:28Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2ADEqKVdnBMZ",
        "author": "@MF-qf7bs",
        "text": "Actually, I watched a video where out of 25 apartments, two were rented and the others weren't listed. So there were 23 apartments available, but in order to hike the rents, they make it seem like there's a shortage.  If you own several apartment buildings, you can create a scarcity there really isn't, giving a fake reason to hike rents like yours.  It's a scam. Like health insurance is a scam.  Like a college education is a scam.  Like you're told the truth by Fox News outlets is a scam.  You have a con man as president. What did you think would happen?",
        "like_count": 0,
        "published_at": "2025-01-13T15:30:36Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2ADSfJjXkWjs",
        "author": "@DaRuddestTV",
        "text": "I average about 6 figures a year and am still struggling here. And I lucked up with a 2 bedroom for 1950.",
        "like_count": 2,
        "published_at": "2025-01-19T00:23:44Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2ADSoxLsxFGj",
        "author": "@gee8419",
        "text": "@DaRuddestTV If you have medical debt or student loan debt or kids or basically anything other than a debt free life with no other beings to support 100k doesn't get you that far anymore.",
        "like_count": 4,
        "published_at": "2025-01-19T01:47:56Z",
        "is_reply": true
      },
      {
        "id": "Ugxk8kZg8GXyBYxkhF54AaABAg.AD523I7cbd2AJ2KasK_Uq4",
        "author": "@gee8419",
        "text": "​@jasminebraham5160I am not sure what you think I am lying about tbh, or what you think I am first choice for in anything, the lottery housing system claims I can afford rent that's $2400 a month which is 70% of my take home pay.",
        "like_count": 0,
        "published_at": "2025-06-06T22:02:05Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzTm5twQg0dU0krI0Z4AaABAg",
    "author": "@zoewhite897",
    "author_channel_id": "UCQDT3n5kiTuYNaJ93OdKdBw",
    "text": "I used to sleep on the F train and i held 2 jobs. Thank you for bringing this to the surface.",
    "like_count": 156,
    "published_at": "2025-01-10T06:21:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyhWXyFo_STBc_30al4AaABAg",
    "author": "@satyasyasatyasya5746",
    "author_channel_id": "UCoCB28eBwZJMQwiKvrqwkjQ",
    "text": "i actually think the system isn't as scared of Luigi as it pretends to be, nor as much as we like to think. Because the only thing they're really afraid of is true collective action and solidarity, but this whole thing just feeds into myths of individual action, so really, even if a few people copy him, it won't change anything.\nTo some extent, he's controlled opposition, and that CEO was a price that not only is the system totally cool with paying, but wasn't he replaced in like a week? They even still had the meeting he was on his way to. Like, even the system don't care about the people running it. Its wild.",
    "like_count": 1989,
    "published_at": "2025-01-09T19:26:03Z",
    "is_reply": false,
    "reply_count": 38,
    "replies": [
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD4za6NATPG",
        "author": "@papertags",
        "text": "Precisely",
        "like_count": 110,
        "published_at": "2025-01-09T19:39:06Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD5-vk_rwui",
        "author": "@emmaa-m6c",
        "text": "Capitalism is a snake eating its own tail.",
        "like_count": 0,
        "published_at": "2025-01-09T19:50:48Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD52tOA-5JA",
        "author": "@JD-ny3vz",
        "text": "Yes someone sees this",
        "like_count": 82,
        "published_at": "2025-01-09T20:16:41Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD54aoBK2jX",
        "author": "@Rathdrgnknight",
        "text": "I wish more people could see this.",
        "like_count": 72,
        "published_at": "2025-01-09T20:31:37Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD57cd6xP-U",
        "author": "@abraxasjinx5207",
        "text": "That's the cost of doing business. Can't make an omelet without yadayada...",
        "like_count": 56,
        "published_at": "2025-01-09T20:58:05Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD59XKnTHCp",
        "author": "@Darth_Bateman",
        "text": "Why are we personifying the system? \n\nOf course it doesn’t feel. It’s a concept not a person.",
        "like_count": 37,
        "published_at": "2025-01-09T21:14:42Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD5A1sNHABH",
        "author": "@satyasyasatyasya5746",
        "text": "@Darth_Bateman its a hyperobject, and behaves like an organism.",
        "like_count": 118,
        "published_at": "2025-01-09T21:19:09Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD5D7jHZh2k",
        "author": "@smtpgirl",
        "text": "100%",
        "like_count": 5,
        "published_at": "2025-01-09T21:46:10Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD5DdU4T76b",
        "author": "@artosbear",
        "text": "100% correct.  And the dude is basically doing that old movie Falling Down.  Like, his targets happen to have some accuracy by coincidence, but other individualists will go target super innocent people, like the New Orleans attack.  It may encourage people to rally collectively because we love a folk hero but thats coming anyway for a lot of people.  Over a billion people at any given time on the earth in 2020 were actively fighting oppression en masse, and it still fell back.  We can certainly accomplish what is needed via mass action and as you said thats the true threat to power.  Handing out free food and getting everyone working together gets attacked even for more quickly even across privileged classes of people, than anything else.",
        "like_count": 48,
        "published_at": "2025-01-09T21:50:38Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD5Ij_S5LiK",
        "author": "@belle8732",
        "text": "totally. i think that a lot of americans hearing the story has brought class consciousness to many, but to be honest, the system doesn't see this as much of a threat as we might want to believe. their modes of suppressing it are endless.",
        "like_count": 45,
        "published_at": "2025-01-09T22:35:09Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD5QI0de1Y3",
        "author": "@Wandermidget",
        "text": "What terrifies rich people the most, is when the \"poors\" (anyone less wealthy than them) becomes aware.\nThat's why they're so quick to shut down these ideal. Remember Occupy Wall Street? Of course you don't!",
        "like_count": 52,
        "published_at": "2025-01-09T23:41:10Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD5WJztS9VI",
        "author": "@jimjimjimmy7793",
        "text": "Tbh the only real way to make these modern systems hurt is to protest by not buying, insurance is hard not to buy but in other fields we can put our money into business that actually care about people and not the money. The real problem is people are very individualistic these days so🤷🏾‍♂️",
        "like_count": 13,
        "published_at": "2025-01-10T00:33:51Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD5ZNN_pHoI",
        "author": "@NF-ru8on",
        "text": "I wonder if it also has the perk of being an internal displining mechanism for the CEO layer of the Capitalist class.",
        "like_count": 3,
        "published_at": "2025-01-10T01:00:32Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD5f5igJg33",
        "author": "@GlitteryGlitz",
        "text": "@satyasyasatyasya5746 It’s like how they taught us about Rosa Parks but didn’t teach us that she was part of an activist collective \nRIP Rosa Parks",
        "like_count": 28,
        "published_at": "2025-01-10T01:59:17Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD5gUVObFLm",
        "author": "@twontree",
        "text": "exactly",
        "like_count": 1,
        "published_at": "2025-01-10T02:11:25Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD5ijPz6cqn",
        "author": "@dylan6386",
        "text": "I’m genuinely concerned that they don’t have anything to fear at all. I’m noticing a trend where more people are asking questions like whether Luigi has a brother or if Luigi needs to strike again, rather than engaging in meaningful discussions.",
        "like_count": 14,
        "published_at": "2025-01-10T02:31:04Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD5mBmU-qGK",
        "author": "@rebelrabalmedia9524",
        "text": "I'm sorry, but wouldn't all the people shouting that this is class solidarity count as collective action? Was it really the shooter or our response that really triggered the media's panic over the situation or was it what was happening on social media that made them respond in fear? Olay is absolutely right to point out that racism could have contributed to why so many people empathize a lot with the alleged shooter. [Although I would point out that Olay herself mentioned that the NYPD tried to label the shooter as a \"light-skinned\" person to suggest that the shooter was a minority, but even then, no one cared that he killed a CEO. That being said, I would be remiss not to point out that the video CLEARLY indicated that the shooter was white]. But at some point, when the racists are selfishly correct, we should try and use them to the best as opposed to being the used.  I'm not saying that there won't be consequences for speaking out, but there are also consequences with being complicit with the system as well. You either die now on your feet or slowly on your knees, that's all that there is in a fascist society. All I'm trying to say is that this event was not about the shooter, but how mainstream media panicked when we celebrated. This is bigger than the horrors of the mass prison industrial complex, this is about the police state as a whole.",
        "like_count": 13,
        "published_at": "2025-01-10T03:01:17Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD6CiWUe3X3",
        "author": "@jinmushui1soul",
        "text": "I agree, to an extent. Most people have gained catharsis rather than motivation, yet the state will still throw everything they've got to send a clear message to anyone who might act the same. However, I don't think collective action must be centralized or that we all need to be doing the same thing at the same moment. Alternatively, our movements can be the accumulation of autonomous action in response to the accumulation of crisis. You may not kill a CEO, but you can certainly protest one, or work to create networks of lasting mutual aid. Work within your personal calculus of risk/reward and don't let other folks keep you from action because they don't agree (and on the flipside, we also need to stop policing folks who move different from us). This is the true meaning of diversity of tactics (not some lowest common denominator bs) and a \"world where many worlds fit\".",
        "like_count": 8,
        "published_at": "2025-01-10T07:01:49Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD6xSPv55y5",
        "author": "@arenomusic",
        "text": "Bro you SOUND like controlled opposition, actually crazy take",
        "like_count": 1,
        "published_at": "2025-01-10T13:58:55Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD6yCqM07fD",
        "author": "@arenomusic",
        "text": "\"The system isn't even scared of him or people like him, they actually don't even care, it won't change anything\"\nLiterally sounds like a scared billionaire trying to soothe themselves while they desperately search for the closest private security firm.",
        "like_count": 7,
        "published_at": "2025-01-10T14:05:32Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD72TB-XKYt",
        "author": "@rubberwoody",
        "text": "I disagree. The rallying behind Luigi IS collective action , or at least solidarity",
        "like_count": 2,
        "published_at": "2025-01-10T14:51:27Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD73jhBgHVt",
        "author": "@satyasyasatyasya5746",
        "text": "@rubberwoody no, it absolutely is not. it is aesthetic and discourse pretending at praxis. \n\nthere is no rallying, only vibes. as for collective action and solidarity, you're kidding right?\n\ni don't think you quite know what these words mean.",
        "like_count": 10,
        "published_at": "2025-01-10T15:02:35Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD7ABZUYmy_",
        "author": "@migi1019",
        "text": "i agree for the most part, but my indignant rage at the system makes me want to continue to embellish the class consciousness angle\ni honestly just don't believe that elites are as smart as they portray themselves as, but i also tend to have a streak of naivety",
        "like_count": 6,
        "published_at": "2025-01-10T15:58:57Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD7Rp4yTlqN",
        "author": "@rubberwoody",
        "text": "@satyasyasatyasya5746  well that's rude",
        "like_count": 3,
        "published_at": "2025-01-10T18:33:02Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD7rVNVqYTp",
        "author": "@gamewrit0058",
        "text": "But it's a system run by people,  and people can change it. ​@Darth_Bateman",
        "like_count": 0,
        "published_at": "2025-01-10T22:26:08Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD9JsoI_N-U",
        "author": "@jumpman366",
        "text": "Lol yall so scary thats why they continue to do what they want.",
        "like_count": 1,
        "published_at": "2025-01-11T12:02:07Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7AD9sr_1Kgcn",
        "author": "@deelee4639",
        "text": "I don't look at luigi, as the hero, but more of a rock that falls into the water and creates these waves. We are so close to class consciousness... i just think we are a tinderbox and over the next four years, it's gonna be very f****** interesting and I think it's going to be extremely hard for all of us, even of us that are doing well off, it's going to be really hard",
        "like_count": 2,
        "published_at": "2025-01-11T17:16:31Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7ADCJak9eny2",
        "author": "@robbycook4298isabot",
        "text": "The point isn't Luigi...its the reaction to Luigi. U said it...collective action and solidarity. We can't seclude him as if the reaction to him isn't part of the same story. \nIf the reaction was diff u wouldn't see fear. U wouldn't have seen an arrest from words over the phone...wouldn't see a hotline....wouldn't see pushback against a narrative by the people.",
        "like_count": 4,
        "published_at": "2025-01-12T15:57:22Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7ADD7L9mv7uC",
        "author": "@donventura2116",
        "text": "The media isn't afraid of Luigi or even vigilantes. They're freaking out because it shifts attention from the culture war and to the class war. That is something the media and our government truly does not want to be talked about.",
        "like_count": 0,
        "published_at": "2025-01-12T23:29:29Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7ADFBkpbDVak",
        "author": "@captainshadow3756",
        "text": "What does the system have to gain by playing such a risky game? What's the prize? They want copycats & Individual action? Possibly, to you know, have reasons to militarize the Popo even more, and justify it. Still seems like a lot to risk. Yes they are very very afraid of collective conscious turning into focused class solidarity. There are better, less risky ways of snuffing out a CEO for one reason or another. And to be clear, this American capitalized system is cannibalistic, so don't be surprised how that works. What do they win though that makes all this risk worth winning? If this is controlled opposition, they're asking for a type of chaos. Which would mean instead of controlled opposition they get chaotic opposition. If that's purposeful, what are the reasons they'd want that? Or is this maybe just what it appears to be?",
        "like_count": 0,
        "published_at": "2025-01-13T18:46:34Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7ADFGFVTfgXT",
        "author": "@lennard5393",
        "text": "But he moved the collection that matters it wont be enough but the fight is never over",
        "like_count": 0,
        "published_at": "2025-01-13T19:25:50Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7ADHmkai7O79",
        "author": "@Zappypaddles",
        "text": "how do you know this?",
        "like_count": 0,
        "published_at": "2025-01-14T18:57:04Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7ADKhHC6L2ns",
        "author": "@aTalkingPizza",
        "text": "​@rubberwoodyimagine thinking someone calmly pointing out the flaws in your argument and thinking that's \"rude\"",
        "like_count": 0,
        "published_at": "2025-01-15T22:06:57Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7ADKxsXp31VD",
        "author": "@Darth_Bateman",
        "text": "@satyasyasatyasya5746 Okay wait a minute, I am NOT familiar with the concept of a hyperobject. Googling now.",
        "like_count": 0,
        "published_at": "2025-01-16T00:31:59Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7ADLAtmuDcEq",
        "author": "@rubberwoody",
        "text": "@aTalkingPizza it was",
        "like_count": 0,
        "published_at": "2025-01-16T02:34:29Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7ADM1gLgzccJ",
        "author": "@apoet9144",
        "text": "They did not have the meeting without him, they cancelled it when they heard the news.That’s not true and has been debunked unless you can provide a source.",
        "like_count": 0,
        "published_at": "2025-01-16T10:33:15Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7ADReZQ-w1kw",
        "author": "@xvingar6318",
        "text": "Wow someone with actual awareness is on the internet, must be a bot you won't fool me!😭(nice comment)",
        "like_count": 1,
        "published_at": "2025-01-18T14:57:54Z",
        "is_reply": true
      },
      {
        "id": "UgyhWXyFo_STBc_30al4AaABAg.AD4y5ZO8Vm7ADSNB9wFl2f",
        "author": "@satyasyasatyasya5746",
        "text": "@xvingar6318 aww thanks hehe\nbut yes, very much beep boop",
        "like_count": 1,
        "published_at": "2025-01-18T21:36:32Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgziSPC2HRnkgA8RCwt4AaABAg",
    "author": "@Dystopia3030",
    "author_channel_id": "UCd93mCPoRYYfi5bHwzlKA7Q",
    "text": "I really like your take on all of this. You're the first person I've seen actually address the woman who was set on fire in the subway, gave her background, and didn't villify the perpetrator just for being an immigrant. Thank you for humanizing the homeless, and homeless women in particular with what they have to go through,  as someone who was once a homeless girl myself. Also I think that bringing up race in the discussion on class solidarity/consciousness that opened with the CEO murder makes the conversation more interesting and I think is very important. Overall, everything you said was very insightful and I really appreciate it.",
    "like_count": 219,
    "published_at": "2025-01-10T00:28:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxpKuUeLSRQS2DW3yN4AaABAg",
    "author": "@cameronoday5424",
    "author_channel_id": "UCXhXwFRoP9H080wro7zbvaw",
    "text": "There is some class solidarity about the injustices of healthcare, but I would agree it's not enough and even fragile. The same people  who praised mangione villified a mentally ill black man who clearly needed help from the same damn system.",
    "like_count": 337,
    "published_at": "2025-01-09T20:28:59Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgxpKuUeLSRQS2DW3yN4AaABAg.AD54IV8c-GkAD5jWdzUGqa",
        "author": "@arwelcecil5659",
        "text": "It's because they don't care about class solidarity, if Americans cared about getting rid of the system, they would've not elected Trump. The reality is that most Americans are selfish and hyper-individualistic, only care about themselves and if given the chance to become a billionaire, would promote the same class suppression they so \"hate\" right now",
        "like_count": 1,
        "published_at": "2025-01-10T02:37:55Z",
        "is_reply": true
      },
      {
        "id": "UgxpKuUeLSRQS2DW3yN4AaABAg.AD54IV8c-GkAD6a1glMZ2Q",
        "author": "@pizaclatonddd3081",
        "text": "We were able to connect the 2 events though. It was all healthcare related and the Popos record were ut to the test.",
        "like_count": 4,
        "published_at": "2025-01-10T10:34:17Z",
        "is_reply": true
      },
      {
        "id": "UgxpKuUeLSRQS2DW3yN4AaABAg.AD54IV8c-GkADCSipvSvHD",
        "author": "@evanjrclarke1079",
        "text": "One is politically motivated one is a random maniac, why should they be treated the same in anyway?",
        "like_count": 4,
        "published_at": "2025-01-12T17:17:07Z",
        "is_reply": true
      },
      {
        "id": "UgxpKuUeLSRQS2DW3yN4AaABAg.AD54IV8c-GkADF4OpTeS2D",
        "author": "@nearestivo6823",
        "text": "This!! 🎯🎯",
        "like_count": 0,
        "published_at": "2025-01-13T17:42:15Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzcTdLyxH7kSOvEiyx4AaABAg",
    "author": "@mbrambles24",
    "author_channel_id": "UCi0VqkrfAOveReSBQCO8kpw",
    "text": "Luigi gives a glimpse into what class solidarity could look like but...y’know, racism, sexism, etc etc",
    "like_count": 702,
    "published_at": "2025-01-09T21:26:09Z",
    "is_reply": false,
    "reply_count": 9,
    "replies": [
      {
        "id": "UgzcTdLyxH7kSOvEiyx4AaABAg.AD5AqD9GjYNAD6PJv-T2zQ",
        "author": "@sainttheresetaylor2054",
        "text": "@mbrambles24  you make it seem like those things are ‘unfortunate obstacles’ and not valid and equal forms of oppression.",
        "like_count": 18,
        "published_at": "2025-01-10T08:51:55Z",
        "is_reply": true
      },
      {
        "id": "UgzcTdLyxH7kSOvEiyx4AaABAg.AD5AqD9GjYNAD6W_ssJroW",
        "author": "@aerialdive",
        "text": "@sainttheresetaylor2054 they are equal and valid forms of oppression, and they are also unfortunate obstacles for class solidarity. the fact is that these modes of marginalization are used to stifle class solidarity in the first place.",
        "like_count": 117,
        "published_at": "2025-01-10T09:55:24Z",
        "is_reply": true
      },
      {
        "id": "UgzcTdLyxH7kSOvEiyx4AaABAg.AD5AqD9GjYNAD8FTCjQ_4Z",
        "author": "@devoncharles5174",
        "text": "@mbrambles24 ✊🏽",
        "like_count": 3,
        "published_at": "2025-01-11T02:04:17Z",
        "is_reply": true
      },
      {
        "id": "UgzcTdLyxH7kSOvEiyx4AaABAg.AD5AqD9GjYNAD8QHWF5pt8",
        "author": "@Paul_90000",
        "text": "You're just now noticing that from Luigi 😂 you're finally waking up",
        "like_count": 6,
        "published_at": "2025-01-11T03:38:49Z",
        "is_reply": true
      },
      {
        "id": "UgzcTdLyxH7kSOvEiyx4AaABAg.AD5AqD9GjYNAD9Iqy7ByyL",
        "author": "@makslargu5799",
        "text": "I honestly don’t think Luigi has as much class consciousness as people give him credit for. I think Angela Davis and Audre Lorde are better examples of people talking sense but not being heard because their gender and race became points of demonization",
        "like_count": 30,
        "published_at": "2025-01-11T11:53:08Z",
        "is_reply": true
      },
      {
        "id": "UgzcTdLyxH7kSOvEiyx4AaABAg.AD5AqD9GjYNAD9sDNR7tQ7",
        "author": "@rachels.4159",
        "text": "+ classism",
        "like_count": 4,
        "published_at": "2025-01-11T17:10:54Z",
        "is_reply": true
      },
      {
        "id": "UgzcTdLyxH7kSOvEiyx4AaABAg.AD5AqD9GjYNADCcJ_xKLvq",
        "author": "@maxzomick8733",
        "text": "The “ism”",
        "like_count": 0,
        "published_at": "2025-01-12T18:49:39Z",
        "is_reply": true
      },
      {
        "id": "UgzcTdLyxH7kSOvEiyx4AaABAg.AD5AqD9GjYNADCiKiA7O7x",
        "author": "@sherrisolomon8673",
        "text": "@makslargu5799  It doesn't matter if he's consciousness of it or not it's a part of who he is and might of been by birth.",
        "like_count": 1,
        "published_at": "2025-01-12T19:42:14Z",
        "is_reply": true
      },
      {
        "id": "UgzcTdLyxH7kSOvEiyx4AaABAg.AD5AqD9GjYNADDOjyu81fb",
        "author": "@tuck295q",
        "text": "Equal or not in people’s view. They do exist and the main point is….they are such a convenient tool for the people up top to use.",
        "like_count": 0,
        "published_at": "2025-01-13T02:01:34Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugyl30xgtWqWZ-ivb514AaABAg",
    "author": "@newyorkchickenwing",
    "author_channel_id": "UCNid8mY3lLduTj5U7n3MRow",
    "text": "I am extremely heartened to hear you touch on how we talk about homeless people. And about why women might opt for the street vs the shelter.",
    "like_count": 89,
    "published_at": "2025-01-10T11:17:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwQxbvbxzWH57eV6AN4AaABAg",
    "author": "@watergawd2605",
    "author_channel_id": "UCbpjIM6lv5dwwPnYLvsn2sA",
    "text": "if he was black..\"oh he was just trying to rob em he didnt even know he was the CEO of anything\"",
    "like_count": 923,
    "published_at": "2025-01-09T19:50:14Z",
    "is_reply": false,
    "reply_count": 25,
    "replies": [
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD5Ej7rDQNC",
        "author": "@Pamel3216",
        "text": "Bro what if he was black they would’ve given him the death penalty by now",
        "like_count": 185,
        "published_at": "2025-01-09T22:00:09Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD5F7FeDHgD",
        "author": "@verdadsin8954",
        "text": "If he was Black he would have been questioned for loitering around suspiciously.",
        "like_count": 129,
        "published_at": "2025-01-09T22:03:34Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD5pjszAq85",
        "author": "@MM-qp4pd",
        "text": "Technically he's Sicilian. Do you know the history of how Sicilians were treated?",
        "like_count": 14,
        "published_at": "2025-01-10T03:32:18Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD64y1b77Zb",
        "author": "@nyasialang",
        "text": "@Pamel3216 literally… wtf is that person talking about?",
        "like_count": 6,
        "published_at": "2025-01-10T05:54:02Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD6kfPuggDz",
        "author": "@Marvin-ut4xs",
        "text": "@MM-qp4pd that was a long time ago, they've been accepted under the flag for a long time. Stop it",
        "like_count": 85,
        "published_at": "2025-01-10T12:07:14Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD6rWDKCqk_",
        "author": "@SouIife",
        "text": "What do you mean, he was light skinned 😂😐",
        "like_count": 8,
        "published_at": "2025-01-10T13:07:00Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD6uYrZfZmu",
        "author": "@MM-qp4pd",
        "text": "May have been a long time ago but generational trauma is real. They are still stigmatized in Italy . Sure Luigi can pass as white but he isn't blonde blue eyed fair skinned. Even his hair can look like it can grow into a fro",
        "like_count": 4,
        "published_at": "2025-01-10T13:33:35Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD7-GIL-1CH",
        "author": "@niyah7139",
        "text": "@watergawd2605 Luigi was the perfect person to do this because not only does he come from the Elite Class he also has a perfect track record. He doesn't have any mental issues that we know of or any reason to discard him.",
        "like_count": 40,
        "published_at": "2025-01-10T14:23:29Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD74TQhxB9r",
        "author": "@immkk1125",
        "text": "@niyah7139exactly! even his own political views are unclear so they can’t even say he’s a leftist terrorist or whatever",
        "like_count": 15,
        "published_at": "2025-01-10T15:08:58Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD7ExaQLdnt",
        "author": "@MM-qp4pd",
        "text": "Correct. And he isn't completely white or Italian. He's Sicilian. He's not trailer trash white",
        "like_count": 13,
        "published_at": "2025-01-10T16:40:36Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD7V0ovXJO4",
        "author": "@thewholetruth4192",
        "text": "Obviously!",
        "like_count": 1,
        "published_at": "2025-01-10T19:00:59Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD7_xHBRyLx",
        "author": "@the_om_project",
        "text": "Respectfully disagree. I think especially with writing on the bullets the message of why is electrified and understood. I’m “white” and would have been equally happy to hear the news no matter the race without question. Also as a Sicilian “white” I can tell you we deal with a shocking amount of racism from those kinds of white people. Someone named Luigi is treated very differently from someone named Chad in a way you may not have seen before. I’m not saying you’re wrong about everything in general but in this instance I don’t think if he was dark we’d think it’s a mugging.",
        "like_count": 5,
        "published_at": "2025-01-10T19:52:48Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD7pDoTbFYG",
        "author": "@125loopy",
        "text": "@MM-qp4pd You're being silly",
        "like_count": 12,
        "published_at": "2025-01-10T22:06:16Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD8H_g2KP6k",
        "author": "@lungi8424",
        "text": "​@the_om_project I don't think you would've seen it differently, I think the masses more right of the political spectrum would've as they have, historically, and still do as substantiated in this video.",
        "like_count": 5,
        "published_at": "2025-01-11T02:22:47Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD8QYmeasH5",
        "author": "@MM-qp4pd",
        "text": "How am I being silly?One of the largest lynching on America was the lynching of Italians. Most of them were Sicilians",
        "like_count": 0,
        "published_at": "2025-01-11T03:41:10Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD8g5rE8SYg",
        "author": "@IsaiahMiguel",
        "text": "@Pamel3216 lmao ok 👍",
        "like_count": 0,
        "published_at": "2025-01-11T06:05:46Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGAD9L5MaTUSC",
        "author": "@SublimeThinker",
        "text": "😂yup!!",
        "like_count": 0,
        "published_at": "2025-01-11T12:12:42Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGADAw3cNrwIW",
        "author": "@majortom331",
        "text": "@MM-qp4pd stop the foolishness 😐 he is white, checks white on his census. Why are you avoiding facts ?",
        "like_count": 3,
        "published_at": "2025-01-12T03:03:45Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGADAwe1M8h2r",
        "author": "@mileygray7794",
        "text": "@Marvin-ut4xs so have black people. And it was equally as long ago",
        "like_count": 1,
        "published_at": "2025-01-12T03:08:52Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGADBvH35kTHs",
        "author": "@MM-qp4pd",
        "text": "I have friends who are bi racial and many pass as white, does that take away their heritage and history? Sure many Sicilians pass as white or are even white but I'm willing to bet that Luigi has a lot of Black, Arab, Greek relatives from his recent past that he is subconsciously in touch with. Do you even know how Sicilians were treated. And still are?",
        "like_count": 1,
        "published_at": "2025-01-12T12:16:06Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGADC6w9aNr2M",
        "author": "@therewdy4038",
        "text": "Even more reason to lock him up!",
        "like_count": 0,
        "published_at": "2025-01-12T14:06:42Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGADCJmXBx9RJ",
        "author": "@worldclasstraveler3530",
        "text": "@watergawd2605 SPOT ON!!!",
        "like_count": 0,
        "published_at": "2025-01-12T15:58:59Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGADCijWLxsdz",
        "author": "@sherrisolomon8673",
        "text": "​@MM-qp4pd Yes, but Italy 's anti Sicilian history  doesn't apply to the Sicilians in thr U.S.😮",
        "like_count": 4,
        "published_at": "2025-01-12T19:45:46Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGADCn5D2bfr-",
        "author": "@watergawd2605",
        "text": "@sherrisolomon8673 which was what i was trying to say. they joined forces once they realized black were \"competition\"",
        "like_count": 3,
        "published_at": "2025-01-12T20:23:49Z",
        "is_reply": true
      },
      {
        "id": "UgwQxbvbxzWH57eV6AN4AaABAg.AD5-rhbMYkGADENUqPWMOt",
        "author": "@MM-qp4pd",
        "text": "No kidding. Still doesn't take away what his ancestors went through. Generational trauma is real. I have bi racial friends who grew up feeling what their ancestors felt. And that's a good thing.",
        "like_count": 0,
        "published_at": "2025-01-13T11:09:52Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxajihdZ44ci3PbMnt4AaABAg",
    "author": "@Wanda_M_DS9",
    "author_channel_id": "UCIS5PTFnqGHwevRgPAn_iZg",
    "text": "I grew up in Brooklyn but have lived in another state for decades. A few years ago when I went to NYC , I was shocked to see so many homeless women living in the subway . 😞. Hopefully, Adams will be in jail and NYC will get a new mayor",
    "like_count": 549,
    "published_at": "2025-01-09T19:21:31Z",
    "is_reply": false,
    "reply_count": 12,
    "replies": [
      {
        "id": "UgxajihdZ44ci3PbMnt4AaABAg.AD4x_H2chXxAD51IfvMRdy",
        "author": "@nate6045",
        "text": "Covid really screwed over big cities. Not just the unemployment but venture capitalists and slumlords ruining the already high rent prices. We should have elected Jimmy McMillan. He was so ahead of his time...",
        "like_count": 0,
        "published_at": "2025-01-09T20:02:48Z",
        "is_reply": true
      },
      {
        "id": "UgxajihdZ44ci3PbMnt4AaABAg.AD4x_H2chXxAD5rQ1FFclt",
        "author": "@Phillyb2387",
        "text": "Mayor Adams being in prison won't change NYC's problems. \nHe's not the cause, he's the effect of it. NYC has been this way for a long time. It's gotten better since the 80's and 90's, but this city historically has systemic inequality issues, plus it's more expensive than it's ever been to live; agitating that innate cutthroat atmosphere associated with this City. \n\nStay safe",
        "like_count": 64,
        "published_at": "2025-01-10T03:46:55Z",
        "is_reply": true
      },
      {
        "id": "UgxajihdZ44ci3PbMnt4AaABAg.AD4x_H2chXxAD6CBTOzdqX",
        "author": "@izzyincognito8660",
        "text": "@Wanda_M_DS9 this is definitely not Eric Adam’s fault definitely has a lot to do with coming out of the pandemic and a lot of systemic issues",
        "like_count": 15,
        "published_at": "2025-01-10T06:57:10Z",
        "is_reply": true
      },
      {
        "id": "UgxajihdZ44ci3PbMnt4AaABAg.AD4x_H2chXxAD6Pf5nylUu",
        "author": "@Mina-vi5le",
        "text": "@izzyincognito8660 The extra 'sensation' is NOT HELPING. ESSENTIAL AGENCIES appear to be shut down. They may be understaffed or not everyone is back in the office, but NO ONE is present or accountable. AS the Chief Officer that IS on him, he hires people who are supposed to get the job done, they're too busy serving themselves, that IS on him. We can all agree politics ain't the straightest of paths, but someone competent at least makes sure people are assigned to keep things running, Mayor can't do it all...but day after day, headline after headline...EVERYONE KNEW guy before him was doing it while on the peace pipe...and I wasn't a fan...but there was some level of accountability. I don't care what the 'accusations' are, I could care less, if my city were working dude could do  WHATEVER and have my support, thing is we're drowning while he tells us our water filled lungs are all an illusion...",
        "like_count": 0,
        "published_at": "2025-01-10T08:54:57Z",
        "is_reply": true
      },
      {
        "id": "UgxajihdZ44ci3PbMnt4AaABAg.AD4x_H2chXxAD6XnmKIiUM",
        "author": "@robert4123",
        "text": "Poor Treatment of the homeless started with Giuliani,  and the hate is fanned by people like Trump also. No Adams is not the cause but we hired him to fix it not double down.",
        "like_count": 27,
        "published_at": "2025-01-10T10:06:02Z",
        "is_reply": true
      },
      {
        "id": "UgxajihdZ44ci3PbMnt4AaABAg.AD4x_H2chXxAD6xkBWJ1cf",
        "author": "@AmberBrooklyn24",
        "text": "I’m from Brooklyn but live in manhattan now. The train station by me looks like a homeless shelter/rehab smh it’s crazy",
        "like_count": 10,
        "published_at": "2025-01-10T14:01:29Z",
        "is_reply": true
      },
      {
        "id": "UgxajihdZ44ci3PbMnt4AaABAg.AD4x_H2chXxAD7YlBAJNsN",
        "author": "@Bigdookie-z9w",
        "text": "@Phillyb2387exactly he’s just a symptom and all they will do is swap him out for someone way worse with a better delivery",
        "like_count": 5,
        "published_at": "2025-01-10T19:33:40Z",
        "is_reply": true
      },
      {
        "id": "UgxajihdZ44ci3PbMnt4AaABAg.AD4x_H2chXxADATBoWeZ46",
        "author": "@Bob-fj7lr",
        "text": "Trump will pardon him",
        "like_count": 2,
        "published_at": "2025-01-11T22:42:44Z",
        "is_reply": true
      },
      {
        "id": "UgxajihdZ44ci3PbMnt4AaABAg.AD4x_H2chXxADCFJ7jb9Ad",
        "author": "@pedrodecosta8794",
        "text": "Why do Americans, believe everything that is reported from the media?",
        "like_count": 0,
        "published_at": "2025-01-12T15:19:53Z",
        "is_reply": true
      },
      {
        "id": "UgxajihdZ44ci3PbMnt4AaABAg.AD4x_H2chXxADKWXFZ4qNW",
        "author": "@Coffee_With_Karla",
        "text": "@Phillyb2387 Yeah I agree. Been living in NYC my whole life since the 90s and still do. Subways always look like a shithole",
        "like_count": 3,
        "published_at": "2025-01-15T20:24:17Z",
        "is_reply": true
      },
      {
        "id": "UgxajihdZ44ci3PbMnt4AaABAg.AD4x_H2chXxAEbNmO-OLbn",
        "author": "@DivinityNae",
        "text": "@Bob-fj7lr& did",
        "like_count": 0,
        "published_at": "2025-02-16T15:25:33Z",
        "is_reply": true
      },
      {
        "id": "UgxajihdZ44ci3PbMnt4AaABAg.AD4x_H2chXxAFn_YXOqvBn",
        "author": "@kenyafromcali",
        "text": "@robert4123 😂😂😂😂😂",
        "like_count": 0,
        "published_at": "2025-03-18T05:39:24Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzkOL7ywolEheICvJF4AaABAg",
    "author": "@arich20",
    "author_channel_id": "UC92sjnL8Bj4Hk8KWBoP3mgA",
    "text": "I so appreciate your channel. Thank you for being here",
    "like_count": 132,
    "published_at": "2025-01-09T19:32:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwKZSDLVXiOf0ztQv54AaABAg",
    "author": "@HattieLankford-24",
    "author_channel_id": "UCRpPURKRTA5TfiDlxoG5NiQ",
    "text": "It would be NICE if it indicated class solidarity.",
    "like_count": 215,
    "published_at": "2025-01-09T19:12:23Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgwKZSDLVXiOf0ztQv54AaABAg.AD4wXUVUxchAD4wzfuKMK3",
        "author": "@Praisethesunson",
        "text": "Adventurism is so back",
        "like_count": 10,
        "published_at": "2025-01-09T19:16:22Z",
        "is_reply": true
      },
      {
        "id": "UgwKZSDLVXiOf0ztQv54AaABAg.AD4wXUVUxchAD5J1VL4ANT",
        "author": "@wrestlinganime4life288",
        "text": "Well the election proved that there's no class solidarity solidarity yet",
        "like_count": 0,
        "published_at": "2025-01-09T22:37:44Z",
        "is_reply": true
      },
      {
        "id": "UgwKZSDLVXiOf0ztQv54AaABAg.AD4wXUVUxchAD5Rg_OkNi6",
        "author": "@potatopotatow",
        "text": "Hey at least it brought the term back into the conversation",
        "like_count": 21,
        "published_at": "2025-01-09T23:53:23Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzR3i4zQjjKfUjcOJB4AaABAg",
    "author": "@Dahlia_Brown",
    "author_channel_id": "UCxdJfe-g-LPSuy_p-8mtDFw",
    "text": "Yes!!! I’m so ready for the unvarnished and unfiltered facts",
    "like_count": 100,
    "published_at": "2025-01-09T19:08:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx_snAD4g2yE7zDd714AaABAg",
    "author": "@monster3339",
    "author_channel_id": "UCHihnfMA0goShSjOCBsgcbQ",
    "text": "man, as a white long islander, im eternally grateful for your perspective. thank you for all you do!",
    "like_count": 227,
    "published_at": "2025-01-09T20:11:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy5j5k97onGY393v6F4AaABAg",
    "author": "@korypedersen9768",
    "author_channel_id": "UCZD0f1u8lBvAds3QoHy5RNg",
    "text": "Damn Oli, your channel is where bullshit goes to DIE.  Keep up the good work.",
    "like_count": 122,
    "published_at": "2025-01-09T21:53:05Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugy5j5k97onGY393v6F4AaABAg.AD5DvUiVvgsADAveIJBLzY",
        "author": "@pearlosibu",
        "text": "Word",
        "like_count": 6,
        "published_at": "2025-01-12T03:00:10Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugz-lb3B6PvlQy3OJcZ4AaABAg",
    "author": "@renaissanceinblack",
    "author_channel_id": "UC7OSwWi8sSUI-LNO9WFVGpQ",
    "text": "Luigi Mangione vs. Daniel Penny. Theres is a vigilante comparison conversation to be had in there.  I just haven't worked it out.",
    "like_count": 153,
    "published_at": "2025-01-09T19:17:51Z",
    "is_reply": false,
    "reply_count": 6,
    "replies": [
      {
        "id": "Ugz-lb3B6PvlQy3OJcZ4AaABAg.AD4x9PztyfxAD501plq0Cu",
        "author": "@myakay1",
        "text": "Please expand on this! Such a good convo here. They wanna be Peter Parker but its really giving Homelander",
        "like_count": 38,
        "published_at": "2025-01-09T19:51:46Z",
        "is_reply": true
      },
      {
        "id": "Ugz-lb3B6PvlQy3OJcZ4AaABAg.AD4x9PztyfxAD50FCvglQn",
        "author": "@XujeneSmith-qz9xt",
        "text": "Id like to add that when the woman who was burned alive on the subway I saw comments saying “I wish Daniel penny was there” I thought that was interesting bc 1st wtf but also why is he being glorified?",
        "like_count": 40,
        "published_at": "2025-01-09T19:53:35Z",
        "is_reply": true
      },
      {
        "id": "Ugz-lb3B6PvlQy3OJcZ4AaABAg.AD4x9PztyfxAD5EUvr1e_4",
        "author": "@verdadsin8954",
        "text": "You can compare their victims",
        "like_count": 22,
        "published_at": "2025-01-09T21:58:04Z",
        "is_reply": true
      },
      {
        "id": "Ugz-lb3B6PvlQy3OJcZ4AaABAg.AD4x9PztyfxAD5LE6z9LB3",
        "author": "@orangemoon96",
        "text": "YouTuber Leeja Miller did a great video about this",
        "like_count": 14,
        "published_at": "2025-01-09T22:56:56Z",
        "is_reply": true
      },
      {
        "id": "Ugz-lb3B6PvlQy3OJcZ4AaABAg.AD4x9PztyfxAD5WW1G-eba",
        "author": "@brandnewtiramisu",
        "text": "Maybe Rittenhouse should also be considered in this conversation. What consequences did each of these men face? What did they gain? How will they be remembered 20+ years from now? How are their stories used to move the goal post or change policy? The push back to Mangione may be increased surveillance, decreased transparency by corporations.",
        "like_count": 27,
        "published_at": "2025-01-10T00:35:30Z",
        "is_reply": true
      },
      {
        "id": "Ugz-lb3B6PvlQy3OJcZ4AaABAg.AD4x9PztyfxADCvo_DD315",
        "author": "@changeoffocus1074",
        "text": "@renaissanceinblack  Daniel Penny A Trained Military Member …. Could perhaps be a psychopath. Trained on how long to hold someone to put them to sleep or kil them. As a result… He purposely killed the guy on the train .",
        "like_count": 1,
        "published_at": "2025-01-12T21:40:03Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgydHvHPPgkqtoQjZZ54AaABAg",
    "author": "@SuperSick57",
    "author_channel_id": "UClJTz_EazmkQ7N3w7Ud7jPA",
    "text": "Keep preaching. You might not reach everyone but you’ll reach the ready.",
    "like_count": 35,
    "published_at": "2025-01-09T20:39:25Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxLFAd7eZdar_EXZqN4AaABAg",
    "author": "@Obsidianconcubine",
    "author_channel_id": "UCCBO3KIsVdtd1xQFqWMlu6A",
    "text": "The algorithms brought me here I'm shocked but I'm happy truly happy that I found this channel",
    "like_count": 35,
    "published_at": "2025-01-09T23:52:25Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzB47g0V1TNaGdZZP54AaABAg",
    "author": "@ShimmerBodyCream",
    "author_channel_id": "UCTpy8JZdoo4zslELVQVW_dw",
    "text": "Good analysis. Fundamentally, I see this as a slow restructuring of Us vs Them. The oligarchy weaponizes brown people to create an Us VS Them conflict within the underclass, and this detracts from the underclass holding the ruling class responsible. If we start to see the oligarchy as the problem, it will be harder to fall for the Us VS Them Poor People edition once you know the game.",
    "like_count": 53,
    "published_at": "2025-01-09T19:56:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz-RbOatKRuYSZ7fZB4AaABAg",
    "author": "@CliffybTV",
    "author_channel_id": "UCkHPmg1Aj_tkMDwqOmy3yoQ",
    "text": "Preach sis. New York gotta do better , America gotta do better",
    "like_count": 23,
    "published_at": "2025-01-10T04:11:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwGr0dEUN8sLN-O5DR4AaABAg",
    "author": "@gemrae",
    "author_channel_id": "UCXDJMfd5P6t9zC11NarURag",
    "text": "thank you for all of this. everyone around me seems convinced that NYC will be safer than other parts of the country in the next few years. it's really hard for me to believe that given all the things you highlighted. plus Hochul and Adams love to villify people with mental health issues, and threaten us with involuntary commitment if the cops decide we're acting too mentally ill at any moment",
    "like_count": 46,
    "published_at": "2025-01-09T20:33:20Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "UgwGr0dEUN8sLN-O5DR4AaABAg.AD54nLJPHSWAD588lK96Ep",
        "author": "@tily5939",
        "text": "right now they're not doing anything about it as far as I can see. They're increasing the fair prices and putting police in the subway and it's not doing anything to address the problem so it will just keep happening. it's madness.",
        "like_count": 5,
        "published_at": "2025-01-09T21:02:37Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugxi6fwiNAkftfoDGMV4AaABAg",
    "author": "@mediacavernmc",
    "author_channel_id": "UCS7GHnzBG7xP5hBtVmyc0gA",
    "text": "It is pretty crazy how fast the dissolution of class solidarity happened as soon as people threw out the women being burnt on the subway.",
    "like_count": 126,
    "published_at": "2025-01-10T01:26:07Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "Ugxi6fwiNAkftfoDGMV4AaABAg.AD5bIjZSFtvAD62U2OwBEP",
        "author": "@DrumsOfRollingThunder",
        "text": "@mediacavernmc yer it was disgusting to see, immediately it turned to Xenophobia",
        "like_count": 34,
        "published_at": "2025-01-10T05:32:20Z",
        "is_reply": true
      },
      {
        "id": "Ugxi6fwiNAkftfoDGMV4AaABAg.AD5bIjZSFtvAD6QByAEfC9",
        "author": "@Mina-vi5le",
        "text": "and congestion pricing was up and running like a week later.",
        "like_count": 9,
        "published_at": "2025-01-10T08:59:35Z",
        "is_reply": true
      },
      {
        "id": "Ugxi6fwiNAkftfoDGMV4AaABAg.AD5bIjZSFtvADHEnzA2-rC",
        "author": "@Violette2102",
        "text": "Wait WHAT",
        "like_count": 0,
        "published_at": "2025-01-14T13:51:41Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxDdKHQc9HHvuWqJsZ4AaABAg",
    "author": "@animerage1862",
    "author_channel_id": "UCLk1BsxYs8H8HSBSNAxpnSw",
    "text": "when i was falling into homelessness in the city, I was looking online to find potential shelters to stay at and every forum online said something along the lines of \"if you are a woman, don't even try, you will get sexually assaulted,\" and that was terrifying to know that my only option would be the streets then.  Thankfully I had a friend that I told my situation to that let me stay with her until I could find something, but that really opened my eyes to some of the horrors of homelessness and it hurts to hear when people talk so poorly about them.  I'm grateful everyday for the support I do have.",
    "like_count": 12,
    "published_at": "2025-03-25T21:15:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwKxyHWGs4aHE3ufnJ4AaABAg",
    "author": "@Praisethesunson",
    "author_channel_id": "UCdU4hcjOezTfmlCduOkNRtw",
    "text": "The NYPD is the largest para military force on the planet. Yet they did absolutely nothing to stop or catch our favorite Italian plumber.",
    "like_count": 233,
    "published_at": "2025-01-09T19:17:15Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgwKxyHWGs4aHE3ufnJ4AaABAg.AD4x537BPlXAD51xjjAg55",
        "author": "@crazystupidlovething",
        "text": "Well police legally don’t have to help us..  which has been ruled by the Supreme Court multiple times, also started as sl@ve patrol. They’d rather get money than help people",
        "like_count": 0,
        "published_at": "2025-01-09T20:08:32Z",
        "is_reply": true
      },
      {
        "id": "UgwKxyHWGs4aHE3ufnJ4AaABAg.AD4x537BPlXAD594Ytfu0K",
        "author": "@abraxasjinx5207",
        "text": "The person that dimed him out at the McDonald's was an employee. She was not commended. McDonald's fired her for calling the police on company time. 😂",
        "like_count": 63,
        "published_at": "2025-01-09T21:10:46Z",
        "is_reply": true
      },
      {
        "id": "UgwKxyHWGs4aHE3ufnJ4AaABAg.AD4x537BPlXAD59kvhp_sO",
        "author": "@Darth_Bateman",
        "text": "@abraxasjinx5207tbh this Luigi stuff isn’t for us black folk, but I do hope that rat does not get paid.",
        "like_count": 32,
        "published_at": "2025-01-09T21:16:42Z",
        "is_reply": true
      },
      {
        "id": "UgwKxyHWGs4aHE3ufnJ4AaABAg.AD4x537BPlXADCcnsvDSpV",
        "author": "@maxzomick8733",
        "text": "Mario will save him with peach and toad helping the plan.\n\nFight the koopa!",
        "like_count": 1,
        "published_at": "2025-01-12T18:53:56Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzNokpMdc1L89bQe-V4AaABAg",
    "author": "@DannyDeee",
    "author_channel_id": "UC4M0szTJZSqyiqsDPSqHWFw",
    "text": "So... Luigi was appearantly a fan of Elon Musk and Peter Thiel. Did he view the CEO as a \"rotten apple\" within a system he actually approves of? Is this a case of knowing the system is rigged, but only reacting when it affects you directly?",
    "like_count": 59,
    "published_at": "2025-01-09T21:09:37Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgzNokpMdc1L89bQe-V4AaABAg.AD58x3u3ycvAD7jkrieg5N",
        "author": "@aerynsunx",
        "text": "@DannyDeee  He wasn't a fan. He liked some of their tweets, here and there. He also followed AOC on social media, was a fan of \"The Lorax\", and was exploring eastern and southeastern Asian philosophies. But he also liked the Unabomber's manifesto. In other words, his interests were all over the place, like a lot of young people. Better yet, like many people in general who are looking for answers in life beyond \"eat, work, and die\". Yeah, he sounds confused. Or maybe he's looking for real answers in a confusing, nonsensical, unjust world. But in that, he's not alone.",
        "like_count": 28,
        "published_at": "2025-01-10T21:18:29Z",
        "is_reply": true
      },
      {
        "id": "UgzNokpMdc1L89bQe-V4AaABAg.AD58x3u3ycvAD9Wzg7ll87",
        "author": "@hannahmoe1367",
        "text": "@aerynsunxI mean he was a tech bro and did support the right wing side until the system failed him then that’s when he dwelled into looking at other sides and ideologies \n\nI understand your ideas being all over the place at that age but that didn’t seem to happen until he was dealing with his health related issues plus I don’t trust anyone who remotely considers the idea of Elon and Peter esp Elon",
        "like_count": 12,
        "published_at": "2025-01-11T13:56:39Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugzg3iDIuFQ2vhb-F7R4AaABAg",
    "author": "@niyah7139",
    "author_channel_id": "UCo43EwL9N6TFxRlAXzANfUw",
    "text": "I honestly hope they free him. mayor Adams is a corrupt weirdo who's trying to use this Scandal to hide the fact that he is a monster. Him meeting Luigi during his perp walk was absolutely disgusting.",
    "like_count": 350,
    "published_at": "2025-01-09T19:10:38Z",
    "is_reply": false,
    "reply_count": 9,
    "replies": [
      {
        "id": "Ugzg3iDIuFQ2vhb-F7R4AaABAg.AD4wKb_Jr4rAD5auD3FIRR",
        "author": "@coldblooded568",
        "text": "How is he a monster",
        "like_count": 1,
        "published_at": "2025-01-10T01:22:38Z",
        "is_reply": true
      },
      {
        "id": "Ugzg3iDIuFQ2vhb-F7R4AaABAg.AD4wKb_Jr4rAD5x7qYBM3P",
        "author": "@JRDN22",
        "text": "They won't free him. He is no hero. And while I'm no fan of Eric Adams. He should be the least of your worries. Those wht men writing these laws for this corrupt country should be where your concern lies. Not an employee that works for the system.",
        "like_count": 16,
        "published_at": "2025-01-10T04:36:52Z",
        "is_reply": true
      },
      {
        "id": "Ugzg3iDIuFQ2vhb-F7R4AaABAg.AD4wKb_Jr4rAD6zCIlrNpS",
        "author": "@niyah7139",
        "text": "@JRDN22 the media already tried to slander him and we don't even know if he did it or not because the trial hasn't even taken place yet but we already have all these think pieces and documentaries coming out about Luigi.  Before he has even been convicted of a crime .When you look at the two photos he doesn't even look like the Killer. The propaganda that is being taken place honestly is extremely disturbing and I hope he gets Justice. The media is not even saying allegedly they are just saying that he's the Killer. They are trying to destroy His Image in the mind of the public.",
        "like_count": 1,
        "published_at": "2025-01-10T14:14:12Z",
        "is_reply": true
      },
      {
        "id": "Ugzg3iDIuFQ2vhb-F7R4AaABAg.AD4wKb_Jr4rAD7RJgNNIbP",
        "author": "@dayshawna",
        "text": "@coldblooded568id assume you watched the video and still thought to ask that question…",
        "like_count": 4,
        "published_at": "2025-01-10T18:28:36Z",
        "is_reply": true
      },
      {
        "id": "Ugzg3iDIuFQ2vhb-F7R4AaABAg.AD4wKb_Jr4rAD7RgclYvpA",
        "author": "@elleanna5869",
        "text": "@JRDN22 nope. Don't call it \"an employee\" unless you  want the free pass to make his same choices and get social praise . Ceos take the job like hitmen do. They know what they work for and decide how to get the job done. They aren't just employees, and health is no neutral business. He was willing to break the necessary eggs to have his privilege omelette not caring they were , well, people. And mainly  from his former class, too.\nAbsolutely part of the system legally and illegally (insider trading too). Right \"target\" to address responsability, morally wrong to gun down like any other human. But not neutral neither innocent.\n\nAs for the young white handsome gentleman from the Ivy League, he's really too controversial for being some kind of political figure, but people should care about him having a fair trial, and the disproportionate show of n.1 public enemy, not to protect him, because it's just unfortunate for the US",
        "like_count": 9,
        "published_at": "2025-01-10T18:31:53Z",
        "is_reply": true
      },
      {
        "id": "Ugzg3iDIuFQ2vhb-F7R4AaABAg.AD4wKb_Jr4rAD9s6i2IR-J",
        "author": "@anonymous_5016",
        "text": "@JRDN22  Are you not aware of the many non-white people at each level of legislative government?",
        "like_count": 3,
        "published_at": "2025-01-11T17:09:59Z",
        "is_reply": true
      },
      {
        "id": "Ugzg3iDIuFQ2vhb-F7R4AaABAg.AD4wKb_Jr4rADCDO8N-skB",
        "author": "@pedrodecosta8794",
        "text": "@JRDN22 FACTS!!!",
        "like_count": 1,
        "published_at": "2025-01-12T15:03:05Z",
        "is_reply": true
      },
      {
        "id": "Ugzg3iDIuFQ2vhb-F7R4AaABAg.AD4wKb_Jr4rADCDmkTnBfL",
        "author": "@pedrodecosta8794",
        "text": "Self hatred is a hell of a drug.",
        "like_count": 0,
        "published_at": "2025-01-12T15:06:35Z",
        "is_reply": true
      },
      {
        "id": "Ugzg3iDIuFQ2vhb-F7R4AaABAg.AD4wKb_Jr4rADCVfZhPu0J",
        "author": "@niyah7139",
        "text": "@pedrodecosta8794  No I'm a proud dark skinned black woman. lol not supporting someone does not automatically equate to self-hatred. It simply means you disagree with their actions or beliefs . What you said is extremely ignorant.",
        "like_count": 0,
        "published_at": "2025-01-12T17:42:53Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugw443zxwPG0N361lMZ4AaABAg",
    "author": "@georgesteffey8375",
    "author_channel_id": "UCvvJ1DY8d30dG809ToDGOXQ",
    "text": "Thank you for making this video. I am white, and didn't even think about how our society would view the situation if Luigi was black. I think you are exactly right about how it would have been received. I am also frustrated by how media covers homeless people. Never any acknowledgement of the systems that put homeless people where they are and how (like you said) they are not a separate group. So many Americans are close to homelessness themselves.",
    "like_count": 57,
    "published_at": "2025-01-10T22:33:26Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyQfxK6CHOwM55Jjcd4AaABAg",
    "author": "@CasualFox12495",
    "author_channel_id": "UC4VBoQF3uA53iktJMuMF33Q",
    "text": "Boost for the algorithm! Hang in there, Olay! I appreciate everything you do out here!",
    "like_count": 20,
    "published_at": "2025-01-09T20:00:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxIc0LdcURIX2u6FHZ4AaABAg",
    "author": "@Ninjacatmuffin",
    "author_channel_id": "UCR4CWjkZ-bTKPiGslZjY9yg",
    "text": "Your statement in the 10 minute mark is so true. Most people are one emergency away from being unhoused. Homeless rates have reached new highs in the past 2 years too. That is a systemic failing of the US, a very very awful one.\n\n(My neighboring city's mayor is also infamous for giving a lot of money to our corrupt police department and breaking down encampments. Mayors love to try sweeping the unhoused under the rug. This is an issue in many cities in the US)",
    "like_count": 11,
    "published_at": "2025-01-10T20:17:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyuX_ojzcYPScMG_-F4AaABAg",
    "author": "@djadelaney",
    "author_channel_id": "UCKkx5gQLG1Vm9cjnq14AnzA",
    "text": "I love your nuance, and the research into telling us more complete stories. I'm glad there is someone dedicated to telling the *whole* truth. You're awesome!",
    "like_count": 11,
    "published_at": "2025-01-09T20:57:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzrs40PrtGL6UkL74B4AaABAg",
    "author": "@beemerboyzzz",
    "author_channel_id": "UCWKhsjcq9isJQEXQDMqcZ5g",
    "text": "Preach sis ! Eric Adams continuously praise the police because those are his friends . Lock him up !",
    "like_count": 14,
    "published_at": "2025-01-09T21:01:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzYC_HsWRtwvXODC9B4AaABAg",
    "author": "@theagrome4592",
    "author_channel_id": "UCNmwx-RzPizMQZ8GtBxrmkA",
    "text": "I wish more people in media would refuse to get upset over people disagreeing with them. Thank you.",
    "like_count": 7,
    "published_at": "2025-01-12T17:25:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzzkJfOnj_IYsr0sTR4AaABAg",
    "author": "@mwashingto1666",
    "author_channel_id": "UCs9oyeyekQ8pppzm_lHc2Ag",
    "text": "Super happy to see you back, despite the weight of the communication",
    "like_count": 11,
    "published_at": "2025-01-09T20:32:45Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw9is38EfrHx62WvMd4AaABAg",
    "author": "@StolastheDemonOwl",
    "author_channel_id": "UC3kdf5oJaRdsn5_iqgj728g",
    "text": "This is so important to talk about, but so depressing. In our current society with how everything is right now... with the division between each other and so little support or time to be able to have a fighting chance against our government, with our representatives not representing us and making everyone's lives hell... what do we do? How can we fix this, and not at a snail's pace?",
    "like_count": 10,
    "published_at": "2025-01-09T23:46:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxa32kjsaE0pLo7ADR4AaABAg",
    "author": "@alexistheesiren",
    "author_channel_id": "UCp6XiVIiNpkZswbCJ8LD-YQ",
    "text": "I missed you so much! No one wants to have this conversation but thank you for, once again, taking it on. ❤",
    "like_count": 9,
    "published_at": "2025-01-09T21:02:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx7lJCT-SZf9HvCWhd4AaABAg",
    "author": "@ig_187",
    "author_channel_id": "UCCo05Xr0gMNN_3hWb2US9IQ",
    "text": "Damn. You really be doin it. Much obliged.",
    "like_count": 2,
    "published_at": "2025-02-26T16:07:48Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxVSm-ZzaMRNMMrePZ4AaABAg",
    "author": "@chantallorenzo411",
    "author_channel_id": "UCOo7FSQCLDWDnOSRltcJLZA",
    "text": "You always deliver! Great to see you back and speaking truth to power. You are loved! 🙏🏿❤️🥰👏🏿🔥",
    "like_count": 9,
    "published_at": "2025-01-09T21:19:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugww7uQF1Yizw8eZVWV4AaABAg",
    "author": "@Engineer_Herms",
    "author_channel_id": "UCtDhzU27hfpz-OORZmV7zTg",
    "text": "Showing some love.",
    "like_count": 12,
    "published_at": "2025-01-09T19:42:23Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzDCyK9k3Lwg31QDU14AaABAg",
    "author": "@neilmick7746",
    "author_channel_id": "UCNvV9QOsd56dZzTl87rQdnQ",
    "text": "Luigi Mangione doesn't represent \"class solidarity.\" But he DOES possibly represent an awakening of class solidarity--a first step, given time.",
    "like_count": 32,
    "published_at": "2025-01-11T18:49:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzr8oHzBXOXIuxYq2Z4AaABAg",
    "author": "@SirSpenace",
    "author_channel_id": "UCFnfcmQICi8M92tqVGDem3g",
    "text": "A wonderfully well-measured, logical, and fantastic response. Thanks for being a breath of fresh air in this 🙏",
    "like_count": 11,
    "published_at": "2025-01-09T20:17:25Z",
    "is_reply": false,
    "reply_count": 1,
    "replies": [
      {
        "id": "Ugzr8oHzBXOXIuxYq2Z4AaABAg.AD52ykwNbirAD543oSKJx2",
        "author": "@SirSpenace",
        "text": "@10:48 Steve Ahlquist wrote about this here in Rhode Island Today. Entirely relevant. (Google his name + Substack, YT won't let me link his story).\n\nHere's a quote:\n\"“Done. Easy and quick. And I had that unit re-rented in a week or two.\n\n“I didn’t think much more about it. I figured my former tenant had a place to go.\n\nI tried to justify my actions. A tenant didn’t pay his rent, so I followed the laws that allowed me to do this.\n\n“But someone had died, and I have to live with the realization that my actions - my completely legal actions – had this consequence.”\"\n\n- Former Landlord",
        "like_count": 0,
        "published_at": "2025-01-09T20:26:59Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgzICnAn006oZsZFqvF4AaABAg",
    "author": "@naijagal81",
    "author_channel_id": "UCAAV42JzOF70nPKtZy0DaMw",
    "text": "Lady, I appreciate you for sharing this vital information and perspective that's rarely shared outside of dinner conversations with friends or loved ones.",
    "like_count": 7,
    "published_at": "2025-01-10T00:03:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyPLwZZaUKyMUvtlYV4AaABAg",
    "author": "@lisamurray2662",
    "author_channel_id": "UChVmtymovvw9XKhI8Bpi7uA",
    "text": "It’s an indictment on the extreme filth of them as well! Her prefer to sit on the bench instead tells you everything you need to know",
    "like_count": 8,
    "published_at": "2025-01-09T23:34:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwEP7LkhCvcqi1RLB14AaABAg",
    "author": "@darliqo",
    "author_channel_id": "UCIbpwf1XcYxbs8bvpX-nMzA",
    "text": "This video really highlights how broken the system is. Honestly, it reminds me of what I learned from Synfla’s book. It gave me such a clear perspective on how to recognize when something isn’t serving you and take meaningful action. If you’re feeling stuck or overwhelmed, I can’t recommend this book enough. ❤",
    "like_count": 579,
    "published_at": "2025-01-10T11:49:16Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "UgwEP7LkhCvcqi1RLB14AaABAg.AD6ibozkE2GADAHneCCfB_",
        "author": "@JasonBeiler",
        "text": "@darliqo There are some who believe that he is the anti-trump who has been prophesized to come...",
        "like_count": 0,
        "published_at": "2025-01-11T21:03:10Z",
        "is_reply": true
      },
      {
        "id": "UgwEP7LkhCvcqi1RLB14AaABAg.AD6ibozkE2GADAPbD12UQt",
        "author": "@ayasvoid",
        "text": "@darliqo what’s the title of the book?",
        "like_count": 0,
        "published_at": "2025-01-11T22:11:23Z",
        "is_reply": true
      },
      {
        "id": "UgwEP7LkhCvcqi1RLB14AaABAg.AD6ibozkE2GADAQoN1RGRk",
        "author": "@darliqo",
        "text": "@ayasvoid mysteries to getting a man.",
        "like_count": 0,
        "published_at": "2025-01-11T22:21:55Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgwWyCJZyPtr94cGoGl4AaABAg",
    "author": "@rinab945",
    "author_channel_id": "UC1AwCPbYLNiTQFHWag_Le7A",
    "text": "Such a great explanation. This touched me. Subscribed!!!! Continue bringing awareness to the issues we are facing in NYC.",
    "like_count": 9,
    "published_at": "2025-01-09T23:41:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzaWepHQZkKESfmY1R4AaABAg",
    "author": "@Boahemaa",
    "author_channel_id": "UCJ_5n8PpmU0_8nwoApWJWGA",
    "text": "I knew you would bring common sense to the Luigi discussion! Always worth the wait!!!",
    "like_count": 9,
    "published_at": "2025-01-10T05:52:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyh7pV_oXXKd8BJ2Mh4AaABAg",
    "author": "@indigobreeze2138",
    "author_channel_id": "UC2a2r70EzHx08xqiy6dKT5w",
    "text": "Thank you for thoughtfully addressing these issues. We need to have more conversations around our systemic issues.",
    "like_count": 3,
    "published_at": "2025-01-13T12:54:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzDOQvfXyKBmLyijPx4AaABAg",
    "author": "@Elloreetom",
    "author_channel_id": "UCp0bptuuH9F37phVs-GcPIQ",
    "text": "I am so grateful that the algorithm directed me to you! Great work!",
    "like_count": 4,
    "published_at": "2025-01-13T04:38:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyvWIuz1KrYaSBHh4F4AaABAg",
    "author": "@TihetrisWeathersby",
    "author_channel_id": "UCl2-pP9RUcgejc5FcZIVPZQ",
    "text": "I don't get the thirsting over him lol, It's a distraction from the real issue of the Health insurance industry",
    "like_count": 57,
    "published_at": "2025-01-09T19:18:23Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgyvWIuz1KrYaSBHh4F4AaABAg.AD4xDPjjT7CAD5Zez_3FEx",
        "author": "@edwardlegend1564",
        "text": "This is not a necessary dichotomy to make. First of all he is hot.Second, it’s a very good opportunity to educate and direct discussions about health insurance industry. it isn’t a distraction, it’s a motivation and entry for some people to actually deep dive into these issues.",
        "like_count": 10,
        "published_at": "2025-01-10T01:03:05Z",
        "is_reply": true
      },
      {
        "id": "UgyvWIuz1KrYaSBHh4F4AaABAg.AD4xDPjjT7CAD5rLCFHzi3",
        "author": "@MM-qp4pd",
        "text": "I heard his first target was the fossil fuel industry but changed his mind for some reason.He's against greed not just a specific industry",
        "like_count": 6,
        "published_at": "2025-01-10T03:46:16Z",
        "is_reply": true
      },
      {
        "id": "UgyvWIuz1KrYaSBHh4F4AaABAg.AD4xDPjjT7CADCC24XTbiQ",
        "author": "@frealish",
        "text": "Two things can be true at once. Why do they have to be mutually exclusive",
        "like_count": 2,
        "published_at": "2025-01-12T14:51:20Z",
        "is_reply": true
      },
      {
        "id": "UgyvWIuz1KrYaSBHh4F4AaABAg.AD4xDPjjT7CADRcLzSpvju",
        "author": "@xvingar6318",
        "text": "Yup, they will lose the plot, not do anything and just talk about it like a school lunch table until something new happens. It's same thing every time, fake progressive.",
        "like_count": 0,
        "published_at": "2025-01-18T14:38:35Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxHlkIjSO7lHLlFWc94AaABAg",
    "author": "@BishopSuperior",
    "author_channel_id": "UCxkGsC0uJkqruhZx9XV-6hg",
    "text": "😂😂😂😂I literally be clapping from start to finish cause mama be dropping heavy bars so eloquently it’s insane!!!! I love when we our black people are so educated and forward thinking like you! I just need to know how to praise you more!!!❤❤❤",
    "like_count": 7,
    "published_at": "2025-02-01T00:53:20Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzeq5VxxsLN1fXFrhV4AaABAg",
    "author": "@D.Alexandria-ob1dd",
    "author_channel_id": "UCwFt5YOilHfMYPqzE7SMZxQ",
    "text": "Wow didn’t know about those other stories my condolences 💐 and to all the other people/stories we don’t know about 💔",
    "like_count": 5,
    "published_at": "2025-01-10T05:36:25Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyryJbx3uUqzuuolH14AaABAg",
    "author": "@KindnessKillsNONDO",
    "author_channel_id": "UCSwoUY8yrHfsu6nCwcfK72w",
    "text": "America is a whole beast. Love from South Africa...thank you for your work, you can imagine how tightly controlled the media is about the true American experience the further away from the USA. This is my window channel",
    "like_count": 87,
    "published_at": "2025-01-09T22:47:02Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "UgyryJbx3uUqzuuolH14AaABAg.AD5K5ZyucZmAD6V23bBqVN",
        "author": "@zeobide",
        "text": "That is a very interesting point. Any sources you could recommend on the media provided American experience in South Africa? Just non American in general. I would love to see what they feed people outside the US.",
        "like_count": 0,
        "published_at": "2025-01-10T09:41:55Z",
        "is_reply": true
      },
      {
        "id": "UgyryJbx3uUqzuuolH14AaABAg.AD5K5ZyucZmAD6Y-_dgPGb",
        "author": "@KindnessKillsNONDO",
        "text": "@zeobide  I am observing the pop culture mainly and ofcourse the professional arena. It is not necessarily a radio station, or TV funnel. It's the common disillusionment that the grass is greener on the other side.",
        "like_count": 9,
        "published_at": "2025-01-10T10:07:47Z",
        "is_reply": true
      },
      {
        "id": "UgyryJbx3uUqzuuolH14AaABAg.AD5K5ZyucZmAD9QDQefBUc",
        "author": "@righteousmammon9011",
        "text": "@KindnessKillsNONDO South Africa? lol do you even have electricity these day?",
        "like_count": 0,
        "published_at": "2025-01-11T12:57:30Z",
        "is_reply": true
      },
      {
        "id": "UgyryJbx3uUqzuuolH14AaABAg.AD5K5ZyucZmAD9R8rflvbr",
        "author": "@KindnessKillsNONDO",
        "text": "@righteousmammon9011  We do...thanks for asking. Turns out population empowerment plays strongly into who they hire to run things.",
        "like_count": 4,
        "published_at": "2025-01-11T13:05:37Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgyEdOG3ttg2bPxBnJx4AaABAg",
    "author": "@sophilozophy",
    "author_channel_id": "UCjOVXOYegOAvhf7yd88jN1Q",
    "text": "How you connect everything, point out the hypocrisy with facts, highlight things unknown that adds more context to show how nefarious their actions really are on so many important issues and keep it short and sweet. 🎤⬇️👏🏽",
    "like_count": 7,
    "published_at": "2025-01-09T20:25:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwE0tEkc1LA9o1FqHZ4AaABAg",
    "author": "@jejasf8203",
    "author_channel_id": "UC19Qgn414-VFV5rIoVE2vEg",
    "text": "thank you for what u do...makes me feel less alone. We carry the burden together.",
    "like_count": 6,
    "published_at": "2025-01-10T08:05:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzjXxax7HPBHms-YPd4AaABAg",
    "author": "@andreyamatthew2006",
    "author_channel_id": "UCwJFh2jSUarJ3a78mpmUeWQ",
    "text": "Thank you for hitting on these topics!",
    "like_count": 5,
    "published_at": "2025-01-10T05:24:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgynRmdXBnslujahKox4AaABAg",
    "author": "@Cafethinks",
    "author_channel_id": "UCaoS8ngG7M5SnjpgkHaJwKA",
    "text": "A word. Thank you for operating from the heart & being a light in a world full of darkness.",
    "like_count": 3,
    "published_at": "2025-01-19T00:42:20Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw3kfvn1DQfpRVinYV4AaABAg",
    "author": "@leynan-ev6rz",
    "author_channel_id": "UCvsCQoIdT_oOew8pIyRKo8A",
    "text": "I'm so glad you're saying ALL THE THINGS! The video of that poor woman burning to death on the train took me out. But something that bothers me is the disingenuous nature of the narratives being extrapolated from this tragedy. So many comments have blamed illegal immigration and the supposed \"Daniel Penny effect.\" Not homelessness, and certainly not capitalism.",
    "like_count": 44,
    "published_at": "2025-01-10T00:24:38Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxZRN-mRMX28YJK6c54AaABAg",
    "author": "@Autistic_Goblin",
    "author_channel_id": "UCm24nWUFZQB8aXbUmzXDivg",
    "text": "Another banger, as always. \n\nRegarding homelessness, I highly recommend Elliot Sang's latest video about the topic (uploaded earlier today, actually). Super insightful and interesting.",
    "like_count": 37,
    "published_at": "2025-01-09T20:12:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwJlGYYrjRaZm-JHgB4AaABAg",
    "author": "@codedSassyCat",
    "author_channel_id": "UCMj2FmDNRwZmXh2chpynjxw",
    "text": "God I wish this level of discourse was mainstream. But then again it would be too threatening to the powers that be. Thanks as always for this articulate take",
    "like_count": 7,
    "published_at": "2025-01-10T01:29:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyUGnTHo6CBW1YmPaV4AaABAg",
    "author": "@denisewade2638",
    "author_channel_id": "UC09Rgtu3lk9g6vLqKWYh44g",
    "text": "Thank you for sharing this video. Everything you said is 100% facts.  They continue to pit us against each other so we won't focus on the truth.",
    "like_count": 3,
    "published_at": "2025-01-12T16:31:34Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz7euBnWbSGA167gPF4AaABAg",
    "author": "@86soup",
    "author_channel_id": "UCIU1oSvRJoO1mUfUioMSuvw",
    "text": "I appreciate how thoroughly you cut through the bullshit. It's easy to be swept up in the theater of how events are presented to us, but your analysis is like being brought back down to earth.",
    "like_count": 25,
    "published_at": "2025-01-10T21:52:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwYliN17hLNqGE4PCB4AaABAg",
    "author": "@Leslie-es5ij",
    "author_channel_id": "UCmx7yAYaPT33dSVGLx3-K9Q",
    "text": "The system is  never  afraid of  criminals,  but when  otherwise  law abiding citizens  turn criminal  they take notice,  and  try to quell any rebellion  before  it starts  !",
    "like_count": 4,
    "published_at": "2025-01-12T19:47:53Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugznj0nluDJSz4sutdt4AaABAg",
    "author": "@Ashleyyy414",
    "author_channel_id": "UCiyVX0niR2x6bn8ylTr_C6w",
    "text": "Girl you're so right about all of this. Keep saying what needs to be said. 💚",
    "like_count": 3,
    "published_at": "2025-01-13T13:09:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxDpl103rfwVaLs2yx4AaABAg",
    "author": "@that__girl_from",
    "author_channel_id": "UC5QhQoAbrFtgZJlloyYR84Q",
    "text": "Thankyou for keeping us informed 👍🏿",
    "like_count": 3,
    "published_at": "2025-01-10T02:43:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwJicGoHbP1wDMCuX94AaABAg",
    "author": "@Ayemik",
    "author_channel_id": "UCJ8tcG2ZnexIGknpLBVy0Og",
    "text": "I just subscribed.\nI love this video, your insightful take, how you paced this, and didn't waste or mince words.\nAs well as your voice. \nYour urgency over this matter is apparent and refreshing. \nThank you for highlighting it(further).\nI look forward to more of your content.",
    "like_count": 5,
    "published_at": "2025-01-09T23:58:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyhLZXdmudPBm7gf9B4AaABAg",
    "author": "@MissEliza99",
    "author_channel_id": "UCikewnIsJ-HPinfNVK5NJVQ",
    "text": "You can always count on Ms. Olurin to get to the heart of the matter.",
    "like_count": 4,
    "published_at": "2025-01-10T12:16:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz3AY0FNybCu_L-JoB4AaABAg",
    "author": "@billyiswaiting",
    "author_channel_id": "UC6uoDPs3z67zHiqnrNlveEg",
    "text": "I am so grateful for people like you. I wish I had whatever was in you that makes you keep pushing",
    "like_count": 2,
    "published_at": "2025-01-10T01:42:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxRwUZl6wT5DuVWFK94AaABAg",
    "author": "@Kim7-77",
    "author_channel_id": "UCfT7-0Yjg_GTy3gi72-7tSg",
    "text": "I just found your channel & you are awesome,  just subscribed!!!  Thank you, perfectly stated...I live here in NYC (Manhattan) & I agree that if Luigi was black, it would be quite different. Adams & Hochel are disgraceful. Adams should have been removed from office due to his corruption. I'm so disgusted by all the cases & how the NYPD did nothing for that poor woman who was lit on fire! Hochel & Adams are in the pockets of conservative real estate developers & Adams receives money from the biggest slumlo*d in NYC...big $ is all they care about...no affordable housing,  living wages, heslthcare, etc to help the crisis here in the city.",
    "like_count": 9,
    "published_at": "2025-01-09T21:25:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxnFTeOFQsdxve0KM54AaABAg",
    "author": "@dmitrikalashnikov4754",
    "author_channel_id": "UCyl0IaaYhXal7QOsEr7aPPg",
    "text": "9:10 We got to see in a subsequent case a variation on a theme of how acts of violence between homeless people are reported if the alleged perpetrators have migrant backgrounds. On one hand, the victim's status as homeless can be quietly reported. On the other, the perpetrators' status as homeless can be quietly reported. Either way, the message is migrants are dangerous, and share nothing in common with us \"natives.\" Reporting on both cases serve to obfuscate how homeless folks are marginalized. \n\nIn Kawam's case, her status as homeless victim was quietly reported. In the case that followed, wherein a homeless guy stabbed two of five people trying to rob him, it was the the alleged robbery perpetrators' statuses of being homeless that was buried in the reporting. Both cases were reported in ways that portrayed migrants as criminals, but because everyone involved were homeless, they chose to ignore that in different ways to emphasize difference between perp and victim. In reality, less separated them than as portrayed.  \n\nSorry for the ramble, especially if it read as incoherent. I am just jittery and felt compelled to share what I perceive as the contrasts and parallels of these two cases.",
    "like_count": 11,
    "published_at": "2025-01-09T23:17:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxBZSfvxCQEePpmFXd4AaABAg",
    "author": "@mfcolston",
    "author_channel_id": "UCn7cF-Q-vywJVLVdpxG1wDQ",
    "text": "In my town up in WA state, everyone always will be like most the homeless people are not from here. EVEN THOUGH 90% ARE FROM HERE! Its so easy to other people that \"dont matter\".",
    "like_count": 7,
    "published_at": "2025-01-09T20:29:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwBR37w7uSWpuSrfvJ4AaABAg",
    "author": "@KAVIARDREAMZ",
    "author_channel_id": "UCL5X0VkZZBZOfSWbuwzb1Jg",
    "text": "This was EXCELLENTLY thought out and 1000% accurate!!!!",
    "like_count": 3,
    "published_at": "2025-01-10T15:26:55Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyYdrGsDc_wByPpuXB4AaABAg",
    "author": "@Kclark495",
    "author_channel_id": "UCES2wt3Hlh0ySZalV9Qvbqw",
    "text": "Thank you so much for giving us the real of the real! You are so loved and appreciated, Olay! I always feel bad when I find out about these crimes cops commit waaay after it's happened, how do yall stay woke on that front?",
    "like_count": 7,
    "published_at": "2025-01-09T20:50:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzQ99-PZD5xcI2R-S94AaABAg",
    "author": "@philipgcollier",
    "author_channel_id": "UCxHwl6aGX0jnmyNpTQZ48jg",
    "text": "09:18  The unhoused didn't fail at capitalism; capitalism failed them.",
    "like_count": 12,
    "published_at": "2025-01-10T06:25:36Z",
    "is_reply": false,
    "reply_count": 2,
    "replies": [
      {
        "id": "UgzQ99-PZD5xcI2R-S94AaABAg.AD68_DnrHQIADIYrqUBwJm",
        "author": "@LoveK1",
        "text": "It’s failing majority of the population.",
        "like_count": 0,
        "published_at": "2025-01-15T02:06:13Z",
        "is_reply": true
      },
      {
        "id": "UgzQ99-PZD5xcI2R-S94AaABAg.AD68_DnrHQIAG050baSpJD",
        "author": "@sandyyy8883",
        "text": "Actually it's working exactly as intended unfortunately",
        "like_count": 0,
        "published_at": "2025-03-23T11:33:16Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugz03Ofy3uY-o8dpiml4AaABAg",
    "author": "@stephanhenry9205",
    "author_channel_id": "UCBMKigCHOcxwyhICUNBwj8Q",
    "text": "Thank you for continually providing context. Especially in a time when it seems often ignored",
    "like_count": 2,
    "published_at": "2025-01-09T20:36:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy6fRZ3g3xYQ00XBVR4AaABAg",
    "author": "@virgogodddess",
    "author_channel_id": "UCDyXPj3a5LyDlzAX_IHOoJA",
    "text": "Thank you for this video. I live in Brooklyn, so I really appreciate your focus on NYC",
    "like_count": 3,
    "published_at": "2025-01-09T20:41:31Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxdYS4aKGg8Bvf9DVF4AaABAg",
    "author": "@inferior-penguin8661",
    "author_channel_id": "UCmT-DKWuJrjEINjGSO5O6Gg",
    "text": "I ❤️ you Olay!! I don't want to yuck anyone's yum..........yoink(that's me stealing that saying to use in my real life) I very much enjoy your level headed realistic approach to the goings on in your surroundings. I also do not see it as you being \"pessimistic\" or full of gloom, it is a perspective from someone who is and has been in the trenches fighting for everyone's lives to get better no matter where or who they are and that is why I respect the hell out of you. I do not know how but I hope to enact change like you do, so thanks for inspiring people like me everyday!",
    "like_count": 8,
    "published_at": "2025-01-09T21:56:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxygrZBvDmnyeWBSQR4AaABAg",
    "author": "@MrsNolastname",
    "author_channel_id": "UC_wKe5cxzJ2e_p3BPfVt05A",
    "text": "I’ve been saying this for years thank you for shedding light on",
    "like_count": 1,
    "published_at": "2025-01-12T19:55:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxhVi5MKbXLougJCdl4AaABAg",
    "author": "@Astro2024",
    "author_channel_id": "UCB_Bu90DpDApER29PchzxxQ",
    "text": "When's your collab with Intelexual Media happening?",
    "like_count": 14,
    "published_at": "2025-01-09T19:30:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxZY7YD9OKmtqGB9qx4AaABAg",
    "author": "@KimSmithReports",
    "author_channel_id": "UCKJkGKAoD7y9GVXOsJkCawQ",
    "text": "Your commentary is AMAZING! Please keep up the great work. 😊",
    "like_count": 4,
    "published_at": "2025-01-14T19:47:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxW7Q70qDJMFsABKPJ4AaABAg",
    "author": "@lenickens3548",
    "author_channel_id": "UCkaIE2S26aFPGIQPdrNvzPw",
    "text": "I agree. It's truly sad.",
    "like_count": 1,
    "published_at": "2025-01-12T21:01:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw8u8ll6gvfPCalgyh4AaABAg",
    "author": "@sameenj6095",
    "author_channel_id": "UCBv9n_nfJSll5nvVmY2lmIg",
    "text": "Thank you for your content. ❤",
    "like_count": 4,
    "published_at": "2025-01-09T19:50:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyOfkU2u_L2W6LMB_t4AaABAg",
    "author": "@Cash7times",
    "author_channel_id": "UCaWoHXqhROLVsPiaCB37zQw",
    "text": "Thank you for all you do",
    "like_count": 4,
    "published_at": "2025-01-09T23:30:32Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy1YEkavnNSQYU5McN4AaABAg",
    "author": "@Sibelius101",
    "author_channel_id": "UCw-Ra7vawhA3RFoEb23Hp_Q",
    "text": "Just came across your channel. Love your intelligence, energy, and passion. The world is a mess. We need more honest conversations on why people are suffering. Thank you for your video and channel.  Sincerely, a new subscriber. ❤️",
    "like_count": 3,
    "published_at": "2025-01-13T12:34:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyieM3XRGiZUpbL_QZ4AaABAg",
    "author": "@burneveryabc",
    "author_channel_id": "UCpwh5R2YsydytmhArSXHFGg",
    "text": "I am so happy for this video\nYou put so much to digest but I'm commenting early to promote engagement\nI'd love for your channel to get the even more eyes on it and help open other people's minds and eyes",
    "like_count": 4,
    "published_at": "2025-01-09T19:26:36Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyEllvvqt4cjhOul054AaABAg",
    "author": "@Octoberfurst",
    "author_channel_id": "UClt-j-Fx2qpEn2PxhpYS-tw",
    "text": "Your commentary is BRILLIANT!  Thanks for being a voice of reason!",
    "like_count": 2,
    "published_at": "2025-01-10T02:27:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgziaQ_zhDe6LXXG9l54AaABAg",
    "author": "@AprileB-t1t",
    "author_channel_id": "UCy722K6inUFWYMs2q4MxZGA",
    "text": "Well done! Thank you for being a voice for some of us who are treated like we’re invisible. ❤❤❤",
    "like_count": 1,
    "published_at": "2025-01-16T00:08:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzC57Bs22yW-GHq3vJ4AaABAg",
    "author": "@chinazorokeke5248",
    "author_channel_id": "UCCXHAs0PYvLptdr0JcxPnMw",
    "text": "Thank you! Thank you! And yes to everything in this video 💯",
    "like_count": 0,
    "published_at": "2025-01-11T10:52:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyZipTzRBT0rQPJ7lN4AaABAg",
    "author": "@Cormac_Bowman",
    "author_channel_id": "UCh-fU18KEm2KVJA9G1MYFeQ",
    "text": "Thank you Olay for your reporting. That was very informative",
    "like_count": 2,
    "published_at": "2025-01-12T01:53:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyZ4TzxdK-lkLhUUXh4AaABAg",
    "author": "@cherronmurray5588",
    "author_channel_id": "UC1tZ8fcFuxr43s_jrfTM0Gw",
    "text": "You are hitting all the unsaid root causes… love the perspective!",
    "like_count": 2,
    "published_at": "2025-01-13T00:15:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyambxdQLD1yF1FqMl4AaABAg",
    "author": "@oj3730",
    "author_channel_id": "UCcmkXnGNBwVVVkeoh9pB7sQ",
    "text": "Amazing video! Since the subjects were sensitive ones I came expecting to disagree at some point but how come I just heard 15-ish minutes of well spoken truths. I know it's been a month since you uploaded this video but it has one of the best takes overall into the luigi thing. Best and complete too since, when it comes to nyc, it meant so much more and we can learn from (or not be surprised at all by) it. You're very based  thank you! ❤",
    "like_count": 2,
    "published_at": "2025-02-27T09:25:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgywIRmt4TihB_NclAZ4AaABAg",
    "author": "@ishuboshi",
    "author_channel_id": "UC1RGxDyIMH9wAyC9bJ8PMhg",
    "text": "Thank you thank you thank you",
    "like_count": 3,
    "published_at": "2025-01-10T00:10:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyfn9tXQAXk6hHsTrF4AaABAg",
    "author": "@driarich1931",
    "author_channel_id": "UCp5TF2IT4d4NylnUAC6HLig",
    "text": "As usual, your commentary is nothing but the truth - straight fire 🔥🔥. I loved everything, with great appreciation for you humanizing Debrena because I had no idea who she was, which I know is part of your point.",
    "like_count": 4,
    "published_at": "2025-01-13T14:04:08Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy4gKlBua6fdh6gI994AaABAg",
    "author": "@BRegan-sx7sl",
    "author_channel_id": "UCyFwHRjmHjC3MtDzh_zTriw",
    "text": "UNITE BEHIND MANGIONE !!! \nIt’s great to unite and not divide.",
    "like_count": 1,
    "published_at": "2025-01-13T07:32:28Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwprZF8U7nr_HpIa5p4AaABAg",
    "author": "@greatemeraldgoat5029",
    "author_channel_id": "UCTR9XdF57ZzZ8nUlN-DDCIA",
    "text": "Your communication skills are incredibly sharp. I enjoy your well-structured rhetoric and delivery. You are speaking truth to power in a way I should listen and learn from.",
    "like_count": 2,
    "published_at": "2025-01-17T20:13:58Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzs_DGc9iQ79m8vf2p4AaABAg",
    "author": "@ScReEmZ75",
    "author_channel_id": "UCNwdB0bxnFp6ThczikcCMJA",
    "text": "You need at least 10x the followers you have! More people need to hear this!",
    "like_count": 3,
    "published_at": "2025-01-10T02:11:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw-zFGnHOck6xq1W5J4AaABAg",
    "author": "@polly8844",
    "author_channel_id": "UCooXDV3WuCHx9P13UGCT6ZA",
    "text": "You are so correct!!!",
    "like_count": 1,
    "published_at": "2025-01-12T19:33:26Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxXnorYDevgsK9z5Qt4AaABAg",
    "author": "@weirdastela2175",
    "author_channel_id": "UCo57YXXVisodQr33MWPk99w",
    "text": "Working at a city hospital, there has been an increase in the amount of homeless who are dropped off at the hospital… with no medical complaints…",
    "like_count": 3,
    "published_at": "2025-01-10T23:33:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwNAN7ckPaw9cSbdO94AaABAg",
    "author": "@HausOfAdonis",
    "author_channel_id": "UC45MAkb_sJPoTIFG0SUGh5w",
    "text": "You explained this FABULOUSLY",
    "like_count": 1,
    "published_at": "2025-01-13T04:40:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyv3vjg7lvt24pqpRR4AaABAg",
    "author": "@alekseiaminev4751",
    "author_channel_id": "UC2yqR8SRK596XM0HwQsLQAA",
    "text": "Very powerful words, thank you for spreading your words and perspective!",
    "like_count": 0,
    "published_at": "2025-01-16T16:56:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxpvWY0hyAfp_kdjGR4AaABAg",
    "author": "@MJalil11",
    "author_channel_id": "UCqKoKAxcIbSdKpeZeWXzxIw",
    "text": "We stand with you Sister",
    "like_count": 1,
    "published_at": "2025-01-10T14:42:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwT2y_ecxE5gPKflg14AaABAg",
    "author": "@blackglitteremoji3054",
    "author_channel_id": "UCEcrjiewXobXJhNqpgDVdrw",
    "text": "Thank you for speaking on this. As a person who experienced being displaced in NY, ppl do not know how to practice empathy. The shelters are awful. Women are at risk of abuse and violence in that environment. It’s ran like a prison and ppl tell you to just go there like it’s better. I can see why they would risk being on the street. There were times I pulled all nighters and stayed up outside. It’s scary. I was fortunate that someone opened their home to me and I was able to finish my residency and find a job. This system is flawed so thank you for addressing this!!",
    "like_count": 3,
    "published_at": "2025-01-12T16:26:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz36DL7TbO5cIDhhy54AaABAg",
    "author": "@nardazzy",
    "author_channel_id": "UCyztSMsKfVGpuJpHyeKZt4A",
    "text": "Thank you for this video",
    "like_count": 1,
    "published_at": "2025-01-19T20:30:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz8Qu-Nz7RWW8OP9dd4AaABAg",
    "author": "@MrTaib17",
    "author_channel_id": "UCHa5HacfjygblH45I56iKIA",
    "text": "Thank you for continuing to inform us",
    "like_count": 1,
    "published_at": "2025-01-12T17:05:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx2wwIzVjn8e36xa4Z4AaABAg",
    "author": "@Mathue360",
    "author_channel_id": "UCHqVvOZ1jb7na0WYNcAdfag",
    "text": "I always appreciate these videos for reminding us to think past the surface!",
    "like_count": 0,
    "published_at": "2025-01-10T16:54:38Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxdrhdfYmDfc5gBnEN4AaABAg",
    "author": "@hopesdaughter5947",
    "author_channel_id": "UC39p4Ce99MMV8hP5BkllMyg",
    "text": "📣 I've left remarks on your old video about the Mayor. I was born and raised in Queens. I'm a former doctoral candidate for a PhD in Public Policy and Administration and a divorced Mom, unhoused with my 4 children. As soon as I went to that Bronx city facility for unhoused families and then went to and saw the shelter they were trying to send us to, also in the Bronx, I walked out. My children refused to go inside. \n\nI used to own 2 houses and a math tutoring business on Long Island while working in youth development in Harlem. Soooo, 🙂 we slept in a White Castles restaurant parking lot on Long Island, since it's 24 hours, and in the morning we went to the DSS building and was given much better temporary emergency housing support. \n\nRight now though since I've done so much previous DEI type work I believe I'm being marginalized and can't seem to get hired... and not a minimum wage job either. I was actually screened twice by the Manhattan District Attorney's Office but not moved forward and the person screening me had less experience with youth than me. I've applied to eveything you can think of, state, city, nonprofits and business. Nepotism along with racism, sexism and ageism is another big intersecting issue. ☮️",
    "like_count": 5,
    "published_at": "2025-01-10T03:45:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgymOxULgKc-nLTU3K94AaABAg",
    "author": "@mhb4x",
    "author_channel_id": "UCHySE6jRc7EVmNgkpDyPvPA",
    "text": "You are killing it. I am subscribed and keep going. Onlookers and police indeed.",
    "like_count": 2,
    "published_at": "2025-01-12T09:06:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxXgycIMyD5KjdjzBd4AaABAg",
    "author": "@Phostings1",
    "author_channel_id": "UC7VltmYdbzfjitEBbuCOz_Q",
    "text": "Thank you for educating us and opening our eyes.",
    "like_count": 0,
    "published_at": "2025-01-10T00:31:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwcV_XKximEZ04UCI54AaABAg",
    "author": "@high-bi-password",
    "author_channel_id": "UCoJdmOOfL4SjUBT-CBXg-5Q",
    "text": "This woman is a queen among queens, I am so happy to have found her channel!",
    "like_count": 2,
    "published_at": "2025-01-15T01:15:18Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzKmQoJw06PX-IHELh4AaABAg",
    "author": "@thesebridgesareburnt",
    "author_channel_id": "UC5DkH2rx44PKwtogsn9cg8A",
    "text": "thank you for helping my brain get wrinkles. me smarter now. for real though, your videos always have some points that i love listening to. especially as a white Appalachian guy who gay as hell. there are lot of things in your videos that always changes my perspective, mainly in terms of privilege that white people have. when this happened it was the first thing i thought of when i saw he was white, that the cops aren't gonna be too harsh to him. i could keep going on but i have weed to smoke. thanks for all your work, olay!",
    "like_count": 5,
    "published_at": "2025-01-10T03:52:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzGiQAQyXA5zp8iwf14AaABAg",
    "author": "@eddielopez5708",
    "author_channel_id": "UCUdFM1p1cMv2Dy5F5f_1WwQ",
    "text": "You damn right, girl.\nQuadrillion thumbs 👍🏼 up.",
    "like_count": 0,
    "published_at": "2025-01-12T01:32:05Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyzssPReBSiFN_Y9bV4AaABAg",
    "author": "@KawaiiSteez",
    "author_channel_id": "UC6TojUVdmqCo6tlNXfdyx1Q",
    "text": "Making great points as always",
    "like_count": 4,
    "published_at": "2025-01-14T20:27:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzb-VVUCdwJa7FhcTR4AaABAg",
    "author": "@MS-wg6xs",
    "author_channel_id": "UCO1ZLhjB6foq5_0V3EjAniQ",
    "text": "A very honest, nuanced perspective - thank you",
    "like_count": 0,
    "published_at": "2025-01-09T19:20:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzZ4Lwt2IX6-AbEvRx4AaABAg",
    "author": "@TheAubreyLynch",
    "author_channel_id": "UC-J75GuXBa8JMNoD5BafhOQ",
    "text": "Damn. Your raw truth is as depressing as it is inspiring. Thank you for your courage. You are appreciated ✊🏽✊🏽✊🏽",
    "like_count": 2,
    "published_at": "2025-01-11T16:21:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyCozs4b-8fi-zCCY14AaABAg",
    "author": "@in.vis1x1",
    "author_channel_id": "UCwEHwGqqHITBlfbfFwYx3gw",
    "text": "Wow, lady! I love your analyses, perspective, and ability to stick with facts and disect the situation without injecting emotion into the narrative. I'm subscribing right now. 😶‍🌫️",
    "like_count": 2,
    "published_at": "2025-01-13T18:45:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyloenkM9EI__3kB3Z4AaABAg",
    "author": "@myakay1",
    "author_channel_id": "UC8LZ-qzeLTgFatkPrsfLJaw",
    "text": "Thank you Olu! Deeply appreciate your content.",
    "like_count": 0,
    "published_at": "2025-01-09T19:43:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyR7JE8BVp23dqJQ7h4AaABAg",
    "author": "@destined2bebossy",
    "author_channel_id": "UCJ_rfUoElxFlU7uG_QNEMEQ",
    "text": "This video is AMAZING. You always think outside the box",
    "like_count": 1,
    "published_at": "2025-01-10T15:12:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxn2ZO6sUee8pXxn2Z4AaABAg",
    "author": "@LamarFrancis",
    "author_channel_id": "UCoeU2GuiIibcpSHEbXxCzUw",
    "text": "Another great video",
    "like_count": 5,
    "published_at": "2025-01-09T19:34:42Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx51TjiXYmX6u4WVMV4AaABAg",
    "author": "@Buckshott_54",
    "author_channel_id": "UCaHAT_Svpeo8lBCQDLfFVdA",
    "text": "FACTS! You’re on point on everything…l",
    "like_count": 0,
    "published_at": "2025-01-11T20:21:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwn57sng2xYnUjljlF4AaABAg",
    "author": "@habib670",
    "author_channel_id": "UC_uiQxjgLOcFxb9Eq18BMEQ",
    "text": "As to the beginning point of your video, i wonder how much we think about the lack of surveillance and monitoring of Luigi in the months before his alleged killing, either by federal or municipal authorities. Prolly little to none. \n\nCompare that to the hard nosed surveillance of the FBI operates on black revolutionaries and black movement politics leaders from the peak of the civil rights era to TODAY. \n\nAnd then we add to it Luigi’s upper middle class position via his upbringing and lifestyle. \n\nIt’s with this in my mind that i wonder whether a black person would even get to that morning before some kind of municipal intervention and arrest.",
    "like_count": 27,
    "published_at": "2025-01-09T19:29:36Z",
    "is_reply": false,
    "reply_count": 3,
    "replies": [
      {
        "id": "Ugwn57sng2xYnUjljlF4AaABAg.AD4yVTppwaFADCQCKTrORB",
        "author": "@lordfreerealestate8302",
        "text": "\"upper middle class\" He comes from a family of millionaires. That's upperclass.",
        "like_count": 1,
        "published_at": "2025-01-12T16:55:04Z",
        "is_reply": true
      },
      {
        "id": "Ugwn57sng2xYnUjljlF4AaABAg.AD4yVTppwaFADEs3A0vuHr",
        "author": "@elleanna5869",
        "text": "Lol why would he need surveillance? He had no records of violence, never had or gave troubles, was a young adult free to detatch from his family. Unless you advocate for being vocal about US healthcare and praising British NHS as an alarming trait (this was known since  always and was reported as \"Luigi had a calm, intellectual criticism about social issues, he was never angry , never upset\" - so why preventing surveillance for calm expression of critical thinking against social abuse? Inception scie-fi? Former USSR? Chile in Pinochet times? )\n\nPeople forcing the black vs white and rich vs poor on this have a hard time with reality (edit It would be quicker to admit you aren't interested in class conversation, it's legit - no need for further surreal arguments)",
        "like_count": 1,
        "published_at": "2025-01-13T15:45:42Z",
        "is_reply": true
      },
      {
        "id": "Ugwn57sng2xYnUjljlF4AaABAg.AD4yVTppwaFADF2hMyucBy",
        "author": "@habib670",
        "text": "@elleanna5869 the point i was trying to make: its hard for me to believe that this could have been achieved by someone of a different class and racial background as Luigi. that assumption is based on my understanding of american history of surveillance.",
        "like_count": 1,
        "published_at": "2025-01-13T17:27:27Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "Ugz87oCnpxMedvDQcip4AaABAg",
    "author": "@LyonBrave",
    "author_channel_id": "UC2f9Z59lDR0xOdyaqN6NoRQ",
    "text": "Our heart is with you. ❤",
    "like_count": 2,
    "published_at": "2025-01-14T23:05:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzjt45Hsw4N8lZeQOJ4AaABAg",
    "author": "@thehappyshow9783",
    "author_channel_id": "UCMZdk5P2GOPxjr40CDlV66w",
    "text": "People don’t know Luigi’s family owns Turf Valley in MD. He comes from extreme privilege&wealth. Thank you for this take because they keep trying to paint him as this middle class hero and he isn’t.",
    "like_count": 9,
    "published_at": "2025-01-11T13:13:52Z",
    "is_reply": false,
    "reply_count": 4,
    "replies": [
      {
        "id": "Ugzjt45Hsw4N8lZeQOJ4AaABAg.AD9S5IeB7vHAD9saFq1NXV",
        "author": "@1warmsummrnite",
        "text": "Does it matter what class he comes from? Isn’t that what the people in power want to keep you arguing over?",
        "like_count": 5,
        "published_at": "2025-01-11T17:14:09Z",
        "is_reply": true
      },
      {
        "id": "Ugzjt45Hsw4N8lZeQOJ4AaABAg.AD9S5IeB7vHADCQdkVNCco",
        "author": "@lordfreerealestate8302",
        "text": "@1warmsummrnite Yes, it still does. A lot of people gloss over the fact he's wealthy too. \"Eat all the rich\" until it was him.",
        "like_count": 1,
        "published_at": "2025-01-12T16:58:57Z",
        "is_reply": true
      },
      {
        "id": "Ugzjt45Hsw4N8lZeQOJ4AaABAg.AD9S5IeB7vHADRdsTwGRDX",
        "author": "@xvingar6318",
        "text": "@1warmsummrniteyes it does😂 he did not give af until he needed surgery",
        "like_count": 0,
        "published_at": "2025-01-18T14:51:54Z",
        "is_reply": true
      },
      {
        "id": "Ugzjt45Hsw4N8lZeQOJ4AaABAg.AD9S5IeB7vHADXuz3eMDws",
        "author": "@boredagainpiston",
        "text": "@xvingar6318 wouldn't your time be better spent focusing on concrete structural racism? you know, an obscene healthcare system that uses armies of lawyers to deprive the sick of needed treatment while jacking up the costs of healthcare and leaving us with the bill? or is the point to sew division and protect the status quo?",
        "like_count": 0,
        "published_at": "2025-01-21T01:16:47Z",
        "is_reply": true
      }
    ]
  },
  {
    "id": "UgxLbgvMytNhcQ5abv94AaABAg",
    "author": "@AmyMSantos",
    "author_channel_id": "UCjwY_zwvw5r2aUOEgLe0jlw",
    "text": "\"executed instead of arrested\" - thank you for pointing that out",
    "like_count": 2,
    "published_at": "2025-01-10T13:57:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxPjp8noJgxflXTPOV4AaABAg",
    "author": "@fearsomefawkes6724",
    "author_channel_id": "UC_4_sKHLwJNC2GwqldAErkA",
    "text": "Glad the algorithm graced my homepage with this video. It's refreshing to find someone calling things out as they are. Thank you for your labour. You've got a new sub.",
    "like_count": 1,
    "published_at": "2025-01-11T21:04:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwSAKTqaOPW2EvSUPt4AaABAg",
    "author": "@kittykattastegood",
    "author_channel_id": "UCl0-lyzOqdFkYQumkhF0JLA",
    "text": "Happy new year, thank you for all you do 🎉",
    "like_count": 1,
    "published_at": "2025-01-10T19:26:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxKCAbH5mX5hfwJhjx4AaABAg",
    "author": "@vegahimsa",
    "author_channel_id": "UCQI7XbVpxlmsxfdcHvGWlTQ",
    "text": "Invaluable content as always 💜",
    "like_count": 1,
    "published_at": "2025-01-11T18:37:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgykOaQn_IIaz21fyK14AaABAg",
    "author": "@TheKAgenda",
    "author_channel_id": "UCEI17w2p7cXYn112cByeeFQ",
    "text": "I appreciate this so much",
    "like_count": 1,
    "published_at": "2025-01-09T19:41:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwFNeA0cYV6ri7Wk2B4AaABAg",
    "author": "@podpoe",
    "author_channel_id": "UCG1eTniOkQEArYVLcNVWmpQ",
    "text": "another great video. thank you Olay",
    "like_count": 1,
    "published_at": "2025-01-10T04:29:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx7SbUQezYdsM5RLWp4AaABAg",
    "author": "@lattermind",
    "author_channel_id": "UCV-QWpmgxdfJW149jDgNpWg",
    "text": "So many salient points raised in this video. This was a great, concise overview of a problematic system. I hope more people see this.",
    "like_count": 8,
    "published_at": "2025-01-10T09:18:17Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxRM1qLvU56cJHU2yl4AaABAg",
    "author": "@Babalugu",
    "author_channel_id": "UCtKoRtZYnrqXGPYLjGmQJsg",
    "text": "This really opened my eyes on a few things. Very great points, subscribed!",
    "like_count": 2,
    "published_at": "2025-01-14T10:43:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyid3vkuhV49biwqGl4AaABAg",
    "author": "@Skotbot",
    "author_channel_id": "UClxhuut827w3Z4BmyOCGPsg",
    "text": "hI just recently disocvered your channel and I am so grateful. You are an incredibly talented communicator and all of your takes are so on point that I find listening to you cathartic. Thank you!",
    "like_count": 0,
    "published_at": "2025-01-11T20:28:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwNhpVcUG8cbpMzHYF4AaABAg",
    "author": "@andersontaylor3777",
    "author_channel_id": "UChDAFRcu_5CJpqdQJEbm1ug",
    "text": "so so happy you posted this",
    "like_count": 0,
    "published_at": "2025-01-13T03:36:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzvOJRzs8zXKVD4Mrt4AaABAg",
    "author": "@TFSXForesight",
    "author_channel_id": "UCGlDq_wFJ958mqGadhZ-3Kg",
    "text": "You are incredibly brilliant, this video is so important.",
    "like_count": 1,
    "published_at": "2025-01-10T02:48:11Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzezB7y114mbGTRcnR4AaABAg",
    "author": "@AussieGriffin",
    "author_channel_id": "UCuSfE6jSu0wm6CVt1e3k5OA",
    "text": "Thanks for shining a light on the people that have died. Most people charge money for that.\nA.G.",
    "like_count": 0,
    "published_at": "2025-01-10T17:30:38Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyNWk6JCp1-Ou400wl4AaABAg",
    "author": "@thepinkjournalrehearsalpro5390",
    "author_channel_id": "UC7H5ZsG7Zamo4rw_BYgX7Mw",
    "text": "Your voice is so powerful.  Thank you for laying down the facts.",
    "like_count": 0,
    "published_at": "2025-01-09T20:42:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxtPUrKcqt7VQZw7yh4AaABAg",
    "author": "@MakesNoSense86",
    "author_channel_id": "UCScvEMC0J29tTs1msEf9V4g",
    "text": "❤Amazing reporting. Much appreciated",
    "like_count": 0,
    "published_at": "2025-01-11T16:53:57Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgymFUQmRjEwAVu4fox4AaABAg",
    "author": "@MsTinaSnow",
    "author_channel_id": "UCiEv9yexxHTQl3AvR4B-s4w",
    "text": "The best most thoughtful analysis of this situation!",
    "like_count": 0,
    "published_at": "2025-01-09T20:41:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzKbREIsi7xElwbVSR4AaABAg",
    "author": "@RaulitosWay1969",
    "author_channel_id": "UCEUjkMR4fyqy2t4kZLE8LGw",
    "text": "God bless, this lovely young lady.  She's highly intelligent, caring with some activism in her. At times seems to be twisting into a pretzel as to not offend and side.\nAll the while, She's just being fair.",
    "like_count": 4,
    "published_at": "2025-01-11T16:01:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwLft4dTj3WA39Q74F4AaABAg",
    "author": "@SoLady412",
    "author_channel_id": "UCcQFiok-fXsj8F0btP-DNfA",
    "text": "All Facts! Well said and communicated!",
    "like_count": 0,
    "published_at": "2025-01-11T14:52:20Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzKx8h-YVX4H118Ffl4AaABAg",
    "author": "@BrieSophie",
    "author_channel_id": "UCLK_J1HA4zxzqpn41ogJ7Rw",
    "text": "this is such a great video! you touched on topics that much people don’t hear about✨🫶🏽 much love to u, stay safe",
    "like_count": 1,
    "published_at": "2025-01-10T16:32:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzdWopO3YqZ5DTl2C54AaABAg",
    "author": "@TheEscapeDiary9th",
    "author_channel_id": "UCOBSylSiqCKrV1b5U4UL07Q",
    "text": "Takes I hadn’t considered. Thank you.",
    "like_count": 0,
    "published_at": "2025-01-10T18:45:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzw12OuwssIbwLcaFF4AaABAg",
    "author": "@DarknessUnresolved",
    "author_channel_id": "UCV9TX5a19O3P16S7NBMI7nQ",
    "text": "Great takes! WONDERFUL takes, thank you!!!",
    "like_count": 0,
    "published_at": "2025-01-10T15:44:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxHp3MBQInFliyQz3x4AaABAg",
    "author": "@nathaniel4104",
    "author_channel_id": "UCEYkQAMDrtSePSyIUTiWRIQ",
    "text": "I'm here because of FD Signifier and THANK YOU. I'm all about it. So informative and really well put together. If you need help with marketing, video editing, or any creative wizardry, I'd be happy to help--help the movement! Lemme know! Salud.",
    "like_count": 3,
    "published_at": "2025-01-12T00:26:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx21x4ua1rh6kgv_cV4AaABAg",
    "author": "@gamewrit0058",
    "author_channel_id": "UCfh4Qxy-02u54ewwVdctt7A",
    "text": "Thank you, Olay and friends.  ❤",
    "like_count": 0,
    "published_at": "2025-01-10T22:24:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxblxic8gxRpvnQmB54AaABAg",
    "author": "@Bawdybybee",
    "author_channel_id": "UC1reIiltlYoddg1EirpFW2A",
    "text": "I learn so much from you!",
    "like_count": 2,
    "published_at": "2025-01-09T23:02:01Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwY6ikLIf4G4aIQmxt4AaABAg",
    "author": "@yes_anotherone3260",
    "author_channel_id": "UCH_9EkyiUshcIJuqcJ_GUhA",
    "text": "Thank you for making it plain! Our collective, selective empathy is a disgrace. Our media, our local administrations need to do better.",
    "like_count": 1,
    "published_at": "2025-01-11T03:05:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxhIKRI5xkST3NXPdB4AaABAg",
    "author": "@filmgeek1711",
    "author_channel_id": "UC1XN9T95ysHKgDB9l0gHtZw",
    "text": "Thank you for making this video.",
    "like_count": 0,
    "published_at": "2025-01-11T14:48:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyx2vSWmn5ebU28XV94AaABAg",
    "author": "@ma-ri-ko",
    "author_channel_id": "UCQ0xoB3TfwHyCX6uMdg04rw",
    "text": "thank you for the reality check. this period in between the election and the inauguration has just felt... displaced and dissociated. i know we're all tired. i feel like the UHC murder was one of the few things to pierce that collective bubble, but it hasn't collapsed yet. it kinda feels like people are going thru the motions and plugging mangione into an internet trend cycle as an outlet for all this dissatisfaction bubbling away in the background but not many are stopping to look at the context you have provided here. thank you for bringing more attention to the circumstances of debrina kawam's murder and talking about the criminalization of homeless people, and really, whole communities, as well. been working in harm reduction and with self-governing encampments for a while and folks living on the street are way more likely to be victims of crime than perpetrators. we get a lot of attacks by people who know that the only reason police come out for homeless folks is to do sweeps.",
    "like_count": 3,
    "published_at": "2025-01-10T07:36:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw7jPTkC6ADlOfiT6t4AaABAg",
    "author": "@gevdarg",
    "author_channel_id": "UC2uyUJaPOwnKcN5lEiRpEPQ",
    "text": "Points for that class solidarity argument. Make it myself all the time.",
    "like_count": 1,
    "published_at": "2025-01-10T05:41:25Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx_nL4AbUGhGUnxxbR4AaABAg",
    "author": "@robinmcdonald2593",
    "author_channel_id": "UC5Akadzf7JYdOAT3HKm2Yuw",
    "text": "Well put thank you ❤",
    "like_count": 0,
    "published_at": "2025-01-11T09:18:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwZrQAIEoOFUFK6B2J4AaABAg",
    "author": "@bwillustrate",
    "author_channel_id": "UC3wQDYojoEiXLBcbIw-Ir9g",
    "text": "Wow! Excellent perspective",
    "like_count": 0,
    "published_at": "2025-01-10T17:36:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzs5ksWgKvREkcDg2Z4AaABAg",
    "author": "@ahmetyegenaga",
    "author_channel_id": "UCcFUmCFhXYWf63lO7sDnS_A",
    "text": "the luigi case is gonna be insane",
    "like_count": 2,
    "published_at": "2025-01-09T20:00:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw6GFLq5bHjeysHabx4AaABAg",
    "author": "@100problemsnot99",
    "author_channel_id": "UC0ZBc6istG7WWmI5q6s_csw",
    "text": "BTW GUYS, they’re still stopping & frisking out here! Be aware & be safe",
    "like_count": 3,
    "published_at": "2025-01-09T20:50:31Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxfTz5FVh-_eAWxeRp4AaABAg",
    "author": "@RacquelTBrooks",
    "author_channel_id": "UC2Z3Nui-JU0LVYSxfjY2s4g",
    "text": "I truly appreciate your discussion",
    "like_count": 0,
    "published_at": "2025-01-10T19:38:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzrHKhP81fh1RWEUuR4AaABAg",
    "author": "@DavidB75311",
    "author_channel_id": "UCO1icTnXpcje_OrzWe-h2kA",
    "text": "Thank you for the sobering reality check",
    "like_count": 0,
    "published_at": "2025-01-12T17:23:41Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzS0bk_ZnsgIxL_sJx4AaABAg",
    "author": "@blueblack3591",
    "author_channel_id": "UCIrJOowHxQZutUY30HHMFLg",
    "text": "So interesting. I never thaught about it. Thanks for educating me",
    "like_count": 0,
    "published_at": "2025-01-11T12:22:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwepibul50yQvAQvl14AaABAg",
    "author": "@DrustZapat",
    "author_channel_id": "UCuuUJTp8kl6At4rIJDmJVHQ",
    "text": "Great video! Thanks for making it.",
    "like_count": 0,
    "published_at": "2025-01-09T21:54:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyMUPw1MPz2EVAnDpR4AaABAg",
    "author": "@rmmccarthy1240",
    "author_channel_id": "UCUy0o7SKv06KF8o8zfC6y4w",
    "text": "Thanks for a powerful and insightful op ed.",
    "like_count": 0,
    "published_at": "2025-01-12T11:24:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxknYkVrxQZkICm0154AaABAg",
    "author": "@The_Mighty_Red",
    "author_channel_id": "UC0uig_vafqEVdAU3MWSDZig",
    "text": "We needed your input. Thank you",
    "like_count": 0,
    "published_at": "2025-01-10T02:23:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx6z1La6kdPCipFoz94AaABAg",
    "author": "@Realiz333",
    "author_channel_id": "UCCRdZ4JRFWVGVCOOB4Z0maQ",
    "text": "so many great points",
    "like_count": 0,
    "published_at": "2025-01-11T20:27:36Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw5ynEj-5LB_S_bKu14AaABAg",
    "author": "@kbai12",
    "author_channel_id": "UCyz1Q1WhV40DVGkNlTnuicA",
    "text": "Spot on, subscribed",
    "like_count": 0,
    "published_at": "2025-01-11T22:22:52Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyV6Cslu5qToQv-BAR4AaABAg",
    "author": "@Hena11",
    "author_channel_id": "UCyoeGXJVntpT5Uj1QvM3lCA",
    "text": "Had to listen 2 times. ❤️",
    "like_count": 1,
    "published_at": "2025-01-10T15:54:09Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxxvXnZxC3Ju4dYymJ4AaABAg",
    "author": "@oseki7168",
    "author_channel_id": "UCGG5ssY2qmORyABR7lTeMCA",
    "text": "Adore the outro—it’s always nice to hear your perspective on current events, keep your head up girl! 🩶",
    "like_count": 0,
    "published_at": "2025-01-09T20:04:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwGTh69Tlr7cHhkQpx4AaABAg",
    "author": "@pamelashehu",
    "author_channel_id": "UC-hWW5Djt9aaRZPP3XnNCKQ",
    "text": "I love the way your brain works!",
    "like_count": 1,
    "published_at": "2025-01-10T03:54:51Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwDrNnr5XHD-dZ2mIN4AaABAg",
    "author": "@FilmsIMet",
    "author_channel_id": "UCWQrJwAndcn5v6JCf7_UrBw",
    "text": "This writing of this video is so good!",
    "like_count": 0,
    "published_at": "2025-01-12T05:42:38Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxU2lExY3X_mMJUabR4AaABAg",
    "author": "@Svartalf27",
    "author_channel_id": "UCsmrPxTvQ0glA4XZVavUssA",
    "text": "that was so well done",
    "like_count": 0,
    "published_at": "2025-01-13T19:52:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx2bJQHwSRRwLEWzqJ4AaABAg",
    "author": "@Nick-ic1hm",
    "author_channel_id": "UCZB_OP4thFsSTzK96vpFgeQ",
    "text": "Side note: this color is stunning on you!",
    "like_count": 3,
    "published_at": "2025-01-10T04:10:03Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyAYWGIvdAe-4fMck54AaABAg",
    "author": "@lilorih6304",
    "author_channel_id": "UCW8xz48a2EqtgvegIDKDhWA",
    "text": "Wonderfully done",
    "like_count": 0,
    "published_at": "2025-01-11T15:59:25Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz35B8-6rc4AxEqiYx4AaABAg",
    "author": "@seeleunit2000",
    "author_channel_id": "UCqiag4Yw4fMDWkX_eJfyM2A",
    "text": "This was very informative.\nThank you very much",
    "like_count": 0,
    "published_at": "2025-01-09T22:56:10Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugx4FJnJBPTdhmCg1wR4AaABAg",
    "author": "@patience_zerooo",
    "author_channel_id": "UCUCKgquqc8jUbNUwEzshlUA",
    "text": "Woman, you speak the truth! It's also super fast for a non American/native-english speaker but it was really interesting. Thank you for doing this.",
    "like_count": 1,
    "published_at": "2025-01-19T21:18:26Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz-G6TF-OsPnAyid5J4AaABAg",
    "author": "@JJ18_",
    "author_channel_id": "UCAj97YyUBoKnRpjwvbR0tLw",
    "text": "I appreciate you and your platform.",
    "like_count": 0,
    "published_at": "2025-01-09T23:55:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwgkAW5mZvVyhJ4jQ14AaABAg",
    "author": "@anonymousanonymous_000",
    "author_channel_id": "UCSBx1nuEJg6ESalP2gl7q5Q",
    "text": "Speak Sis ! Just came across your channel today. Had to subscribe",
    "like_count": 1,
    "published_at": "2025-01-11T19:56:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzqnkUlyBQohgTBPJ54AaABAg",
    "author": "@AyyeeIysMe",
    "author_channel_id": "UCU0Nz75GlEHLl3vQt7YNu-Q",
    "text": "You are so informative & the videos are always so well thought out ❤ thank you for sharing",
    "like_count": 0,
    "published_at": "2025-01-10T11:56:00Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyqZ5RKE34R66SktOF4AaABAg",
    "author": "@NotThatGuy_YepThatGuy",
    "author_channel_id": "UCQNahevlAcslbJPDgxgrPmA",
    "text": "This was potent and powerful.",
    "like_count": 0,
    "published_at": "2025-01-10T18:39:21Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyFqqe49oSsdS3zzRR4AaABAg",
    "author": "@GamingSkeptic",
    "author_channel_id": "UCgiO48yAKjeN9BX6UT4Maeg",
    "text": "Eric Adams is proof that there are 🦝🦝🦝 on both the republican and democratic side of the political spectrum.",
    "like_count": 14,
    "published_at": "2025-01-10T14:06:06Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxAgtu3NpdxVx7ptBF4AaABAg",
    "author": "@devantej7508",
    "author_channel_id": "UCe8DjISJfhJ0nAE8p9-vj0g",
    "text": "You are very informative and have made me look at everything with different eyes.",
    "like_count": 0,
    "published_at": "2025-01-10T17:20:39Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxFJsEEPp7DzdVmWjp4AaABAg",
    "author": "@KEMETE101",
    "author_channel_id": "UClYYD3dtFUKhY22yLM1u6KA",
    "text": "Applause 👏 ✌️  👏",
    "like_count": 0,
    "published_at": "2025-01-11T21:47:20Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzeEQ240JPzR3ShbIB4AaABAg",
    "author": "@AlexKink-k2j",
    "author_channel_id": "UCIhL7WVhU2_JnMWpSxjB0Nw",
    "text": "I love so much your content and perspective. Thank you for your work and dedication :)",
    "like_count": 0,
    "published_at": "2025-01-09T20:23:15Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwCoe2ArnPqaR2O8lh4AaABAg",
    "author": "@PrivateDncr86",
    "author_channel_id": "UCRNj3ZsoCS01XfBwR4cU9kw",
    "text": "Well done video, thank you!",
    "like_count": 0,
    "published_at": "2025-01-09T20:38:12Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwaz3DksJ40WAztM8F4AaABAg",
    "author": "@georgetobey8400",
    "author_channel_id": "UCTFvwGeLZzmjXkUIlaSeabg",
    "text": "It all needed to be said 👏🏾👏🏾",
    "like_count": 0,
    "published_at": "2025-01-10T01:06:24Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugz9oEtJRhQFcj5ZRO54AaABAg",
    "author": "@ellieboddie8680",
    "author_channel_id": "UCtHKIzPt4WWYY09UzjBgCnQ",
    "text": "Well said!",
    "like_count": 0,
    "published_at": "2025-01-11T14:45:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwhNPFjkVjf7-Rs4JR4AaABAg",
    "author": "@eddielopez5708",
    "author_channel_id": "UCUdFM1p1cMv2Dy5F5f_1WwQ",
    "text": "There's lots of empty offices, empty warehouses, other buildings in New York City.\nThese can be used for affordable housing.",
    "like_count": 1,
    "published_at": "2025-01-12T01:37:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzecd3PhMbvWgZCWfh4AaABAg",
    "author": "@TheTroutyness",
    "author_channel_id": "UCVesJirAI-xN5kX9qKE-u2A",
    "text": "Thank you for your hard work, ma’am.",
    "like_count": 0,
    "published_at": "2025-01-10T15:44:47Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugyh9WMlL33u375kLKt4AaABAg",
    "author": "@writinghappyhour6945",
    "author_channel_id": "UCb84ejaH4jW_ceEdAcWnBlw",
    "text": "I'm so glad this showed up in my feed. I feel like this is the kind of perspective the people running sm platforms would try to bury.\nExcited to explore your content!",
    "like_count": 0,
    "published_at": "2025-01-12T04:29:49Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxA_2I0FqAeFZAqbK14AaABAg",
    "author": "@scene247",
    "author_channel_id": "UC43UzUTIMKuLDGxHqZisJTw",
    "text": "You're on to something...yet there may be opportunities for those who can lateral think on a problem. \"Every attack leaves an opening somewhere.\"",
    "like_count": 1,
    "published_at": "2025-01-10T08:46:19Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugzq48jCNY5OPjBovwt4AaABAg",
    "author": "@dris0O9",
    "author_channel_id": "UC6itR0DSn4LnXxvMUCqEM_g",
    "text": "This video actually gave me chills, you just got a new subscriber❤",
    "like_count": 0,
    "published_at": "2025-01-12T02:31:07Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy8Wl7fZbrQsZ9asLh4AaABAg",
    "author": "@brooklynsista",
    "author_channel_id": "UC6MvokNcHxzH2x-nj2A8_lg",
    "text": "Beautifully argued!!!👍🏾",
    "like_count": 0,
    "published_at": "2025-01-10T03:07:40Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzkxuHDGZVF3VaQ_MZ4AaABAg",
    "author": "@ScotteeeeeeeGeeee",
    "author_channel_id": "UCOinh8bgGMsbMaL1R07h71Q",
    "text": "Glad I found this video.",
    "like_count": 1,
    "published_at": "2025-01-09T23:17:50Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgyYxFcHXuTuw5yZNZ94AaABAg",
    "author": "@alex-k9t8k",
    "author_channel_id": "UCypU10LpoqhB_0cm-CxD1Ag",
    "text": "So well spoken and well researched as always",
    "like_count": 0,
    "published_at": "2025-01-09T22:40:54Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugwtb_pNRg0CREANn5Z4AaABAg",
    "author": "@recovery_rider",
    "author_channel_id": "UCPyUGdkdABI0YoXL3zRRelA",
    "text": "Thank you so much for doing this video, I very much needed this, who is suppressing all these news ?",
    "like_count": 1,
    "published_at": "2025-01-15T02:40:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxg7rpNkJUoUFotKyJ4AaABAg",
    "author": "@naijagal81",
    "author_channel_id": "UCAAV42JzOF70nPKtZy0DaMw",
    "text": "I never hit subscribe so fast! This woman is paying attention.",
    "like_count": 1,
    "published_at": "2025-01-10T00:04:13Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw00jHna2wF7GN3oqN4AaABAg",
    "author": "@bigaliceenergy7578",
    "author_channel_id": "UCVbdURuOa9fQa3c24gSWrnQ",
    "text": "I've been seeing so many articles about the immolation on the subway and I thought it was weird that were so few details about her. Fucking tragic.",
    "like_count": 0,
    "published_at": "2025-01-11T21:24:14Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwHXgcDssAEp3SyGtZ4AaABAg",
    "author": "@grandpafalkenrath2988",
    "author_channel_id": "UC3DgpSXlbOjYsl4QB8JjTqA",
    "text": "Great job,  Olay,  Love you ❤",
    "like_count": 0,
    "published_at": "2025-01-11T21:24:30Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxjqi1mSuPjQb3zUtp4AaABAg",
    "author": "@Desaved",
    "author_channel_id": "UCB13BXjgjSYAAaOggyVvxaQ",
    "text": "You are brilliant!",
    "like_count": 0,
    "published_at": "2025-01-10T03:33:37Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgwYxB1zq5wG7UtktZ54AaABAg",
    "author": "@MaviRB",
    "author_channel_id": "UClqjoCk04wHronzQL2aPCnw",
    "text": "Thank you for also making us aware of the awful situations that black and immigrant people are suffering in the hands of the police",
    "like_count": 0,
    "published_at": "2025-01-22T22:09:02Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxChLLL-YXZfOUOPlt4AaABAg",
    "author": "@RubyMelodyMusic",
    "author_channel_id": "UCTNs4NlgqwrxyoVzN9h16vw",
    "text": "Unrelatable is exactly how I felt by his actions if this really came from his pain. Privileged white guy radicalized into murdering someone because of his own pain? Unrelatable and unsettling.",
    "like_count": 3,
    "published_at": "2025-01-12T05:10:22Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugxw6vYe6y1dPf6kcox4AaABAg",
    "author": "@SamMann-t4i",
    "author_channel_id": "UCUlyrUSQ0P8-Lo7K0OH3WMA",
    "text": "What 😲!! What is this platform, sis you are on fire 😳?? And speak the issues no one gives a damn about, thanks for keeping it real! I'm impressed, interesting 🔥💯🤔...",
    "like_count": 1,
    "published_at": "2025-01-13T12:43:43Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzAYAxPEjsg9ViFr114AaABAg",
    "author": "@andrewjolson8881",
    "author_channel_id": "UCbQo-xM-PevF3iLcxw109fA",
    "text": "Great analysis, subbed.",
    "like_count": 0,
    "published_at": "2025-01-12T20:48:29Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgzOn9cS8PUMVasEE7l4AaABAg",
    "author": "@AfroRedMusic",
    "author_channel_id": "UCTL6M1JIiLVW1Mv43nGqSAg",
    "text": "THANK YOU!",
    "like_count": 0,
    "published_at": "2025-01-09T21:02:44Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxSUasc-CnfTCD9FU54AaABAg",
    "author": "@realtrader9166",
    "author_channel_id": "UCUEczEQsANEvcV1bVb8LtnQ",
    "text": "Thanks for stating up to state the truth.",
    "like_count": 0,
    "published_at": "2025-01-10T16:24:16Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugw8s_bmVJPdXJWRBRt4AaABAg",
    "author": "@superp25",
    "author_channel_id": "UCXxJS3eqYiTLAvwPUx4XPwQ",
    "text": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾",
    "like_count": 1,
    "published_at": "2025-01-14T02:47:09Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "Ugy_dq3m2jF7qpEALhl4AaABAg",
    "author": "@strawberry0gurt.",
    "author_channel_id": "UCHya5pQxhA2iCW_kc1KQUNA",
    "text": "thank you for your insightful input! new follower here 🫶🏻",
    "like_count": 0,
    "published_at": "2025-01-11T19:30:56Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  },
  {
    "id": "UgxXmN1sOvLyaK9MHFV4AaABAg",
    "author": "@nearestivo6823",
    "author_channel_id": "UCw8BNjFUJaDrXVosv3VlPAQ",
    "text": "I like how you think and speak 🗣️🫶🏽 subbed",
    "like_count": 1,
    "published_at": "2025-01-13T17:40:34Z",
    "is_reply": false,
    "reply_count": 0,
    "replies": []
  }
]